["A reminder that we have a crappy discord and you should join.","Everything about this. No right click, A scroll wheel that is impossible to use, and terrible ergonomic design just to match their computers","“Let’s put this light here just in case they make it past the faucet”","My eyes are bleeding","It's neat, except for one flavor. Pay attention","Share the road sign blocking the bike lane","you go, girl!","For those who want something more special...","Crappy Idea","Not sure if this is real 🤔","Just like my grandma use to say","This barrier in macedonia.","These crushed red (hot) pepper flakes with a bell pepper on the bottle","My sisters is a he too","2 Letters needed to complete the word Downloading. YouTube Why.","this elevator's buttons","Corrected - Everything about this. No right click, A scroll wheel that is impossible to use, and terrible ergonomic design just to match their computers.","Seen at McMaster campus. Just a touch insensitive eh?","Moose goes “Rawr” ?","This Song name + Album title displayed on Spotify","This bike path (red) in my neighbourhood which just....stops.","Wait, Boss, what measurement is bigger again?","I think the architect made this high school using The Sims","This wheelchair ramp in Pakistan","Not creapy at all","Choose ethnicity: Hispanic, Non-Hispanic... *Danish* ???","No thank you","Bath bomb is too far forward for the box to stand the way it’s supposed to","This brand name","Those ear bones","Just great","\"Should we make the offer attractive or profitable?\" \"Yes.\"","I thought it said ret ink everything.","A minion things wrong with this.","“Yeah guys! Let’s dive onto the ground head first!”","The way this Chevy emblem on the steering wheel directs sunlight right into my eyes","These Cupboards..","Glass door to bathroom","We've got a floater...","Gee thanks Microsoft, way to make me look through 100's of country codes listed in probably alphabetical order...","Uhh yeah I’ll see you at 9 10 9 9 10 o clock","did you try looking behind you","Ouch that hurts my soul","Who fucking cares","What's this new speaking bill they're talking abou-","Seziure inducing jacket","“40 % puncture resistant”","A staircase to nothing","This window","The Canadian Citizenship Application form wont let you type your date of birth","I didn’t know I was in the Anatomy section..","You are in a room. Hallways lead right and left. [Right] You are at the end of a hallway...","Who cares?","A little suggestive","How to exit a parking lot in Tillamook, Oregon","We all party down here","Soap dispenser at school is a little higher up than normal","Staircase to my hopes and dreams","The guy with his 'cold' drink","You know what this view could use? A big cement...thing","The plus sign to add a word to the dictionary on Gboard is in the upper right hand corner","Terrible wording makes it look like the law office harasses.","How exactly am I supposed to put my bike there?","This friendly face lurking around the water cooler...","This happening every 30 minutes when internet is working just fine","how does this happen","There's something wrong here.","But Y?","This flyer with tear-off tabs inside a locked glass case","I know I'm about 3 years late, but this Avengers: Age of Ultron poster...","This cat looks high as heck. Also sorry for potato quality","How do you spell leggings wrong","Encouraging peer pressure, from PDQ","mY fAvOrItE dInOsAuR","The back of my textbook","This counts too right ?","An article about the extinction of Bees with this advert.","Cute, but it’s just gonna make your house look mouldy","If you base a toy off a PlayStation vita, put the buttons in the right orientation.","Only one of these is actually a button","Thanks to Singapore Airlines, for my first ever interplanetary flight! I'm so excited!","Everything about this is wrong.","Our num ber edd ays","Dog skeleton at value village with bone ears...","For some reason I feel like the Kirby leggings just don’t work out","They had to disconnect the hand dryer as it \"was impractical\". I.e it turned on when you went number 2 and blew away all the loo roll!","Saw this at the library","Didn't know WordArt was still a thing","Fox Fox is still my favourite actor","More Braille that is just printed on","Why, Android, why?","The back cover of this children's book.","Doesn’t tell you how many wings it comes with..","This isn’t that crappy, but I thought it was pretty funny","At a hotel in Ohio...","Not only are my bedroom and bathroom door not centered they are both different sizes too.","The holder almost perfectly covers the headphone jack","small sidewalk with a pole in the middle = obstacle course runs","ooooh ahhhh pizza","Was watching How I Met Your Mother and saw this clock in the background... Wtf","The Sky Cinema logo disappears when you scroll and pops up when you stop. Annoying once you notice it...","Found this in a thrift shop","totally croatian flag","\"Hey, what colour text should we put on this white background?\" - \"Hey, how about white text on a white background?\" \"I love it!\"","Lets put a wall in the middle of a light switch","British Week at Lidl in Poland..","Yellow font on a black and white print","Amazon's Fire TV Stick","There are x2 of them but non of them work properly... most of the water stays around them...","Advert for a TIGGO2 below a video of something being hit by a TRIGGO2","An application for a group of psychology uses the infamous font","Staircase 9 and 3/4","IN BABY CAR","To spell your hometown's name on your brand new basketball court...","X is for Netflix","This wheelchair accessible bathroom mirror","Pillow came with a free blanket","The Richmond Times ran an ad right over John McCain's face on their memorial to him.","Oracle's \"cookie banner\" is the worst. It takes literally minutes to \"process\" your cookie preferences","Sidewalks in São Paulo, Brazil.","Peak performance school design","He need's a little bit more of a mustache","🤔","So which is it? (Crappy photo included free of charge)","Something is wrong here...","I initially thought the red text displays an error","Blue on black?","Cost varies, nothing is meaningful anymore, I just want a haircut","Crackers in packs of 3","Only £19.99² (also chicken strippers wtf)","Apparently the first floor in English is the seconst floor","The software vendor helpfully provided a link in the printed QuickStart guide.","I can guarantee I will not be sniffing anywhere near that bag.","I wonder how strong the signal is","Just had to beat off three other guys","Well, it's memorable. That's for sure.","I still don't know what this says","Statue Freedom of Capital Dom?","Ford Math","Sure they could have used something better...","While browsing twitter looking at tweets about Mcskillets recent death I got this advertisement...","\"Full\" service HVAC company","Are you sure those are nachos?","(After That...)","Yes truly back to school items","Which is it, eBay?","Can't select none.","Laundy Room","If you don't vote, you can't vote. Complain!","TU DU DU DU DU PENGUIN MAN","This website I’ve seen...","NLLA","So which is it Google news?","Bad timing in ad placement","My phone's contact list caps names at 16 characters for no good reason","How to spell Serbia?","This logo basically screams professional medical journal with Comic Sans, wordwrap in the middle of a word and uneven line spacing","LaNoMADe?","Just everything about this Wish ad and its terrible photoshop","..Yes *sarcasm*","A slight design error","That's really helpful.","Perfect shirt for the kids","Da pizza maker and flacvors of london","This 6 minute unskippable ad","This staircase window... Why?!","Hey, don't look at my toilet. No you can look at my penis, just not the toilet.","They really thought out the length of this headset mic","Hmmm, Sounds like a good deal.","Because cows apparently poop milk....","Wish giving me a wholesome pat-on-the-back when looking for toys for my cat (Not really crappy design but just strange/slightly uplifting)","Couldn’t use a different color?","Bob, you did good. Nobody is going to steal that again with that lock.","Tip banana","Why would you do this?","This advertisement","Perfect Gift Idea","Can’t press the url because it’s not fully linked","Give me that plug now!","I was watching YouTube and an ad for this came up...","Lisa Simpson is a Canadian museum","Yes","Newly discovered cat species already featured on socks","This store is apparently called \"tizzy's\"","The tables at MC Donald's look always dirty","These Cupboards","The Asshole Plugs: Plugs like these that end up being too big for an extension cord and force the multiple spaces next to it to become unusable.","something got lost in the execution..","See the World","January, February, Tuesday... what?","Bleeding Tower / the roof of this tower was painted red, but the paint came through the gaps and looks like blood now.","Person of Interest Blu-ray Box Set.... Why?","Notice the sun in this RE textbook doesn’t match any of the shadows.","A Christmas tree bottle stopper","SHA THE FUR. PE TUE","Tuna can","The 1800 Contacts Site","I don't know who thought that it might be a good idea to make those two buttons side by side without a gap, but at least every last character on a line I write is a \"#\" now.","Crappy... or just plain stupid. Not even sure what the word is supposed to be short for here!","Taking a survey and... This happened.","This corner can't fit 2 mid-sized vehicles","This is one of life’s real questions.","Repost kinda: this is the original I posted earlier","The longer you look at it...","Didn't know hair brushes could work as farmers.","To many information in this logo","Eh...?","I bought a fancy new alarm clock, but the app doesn’t allow me to set an alarm for midnight!","My school's bathrooms","Designed to look moldy, filthy and stained for only $7 each.","The placement of this beer add.","this is how i become a man.","I dont think thats quite right 🤔","Hopefully there isn’t a fire anytime soon","Went to refill a salt grinder to find it's literally glued shut. A product of France should be more sophisticated.","\"Yield here to pedestrians\" yeah thats super clear","\"What is Russian Bias?\"","What the hell is this?","Just why","One of them always gets stuck because they are too close to each other.","Turn your rottweiler into a doberman!!!","Someone thought it would be a good idea to put on this side of this card explanations for why the questions on the other side of the card are false. But instead, it just looks like they are saying that these statements are false, which becomes increasingly disturbing with each question.","The after image only has the bags and no clothing.","Why do people think that this is okay?","The fire escape for a roof I was on","It’s a solid state drive it doesn’t have a battery.","hah","The new YouTube update on Android makes the home button pop up when you touch the screen, covering the time in the video if you want to see how far into it you are","So good, the 'artist' signed his work.","My local locksmith clits keys.","Why are they different.","The utility room at my parents’ house","This crosswalk","Thanks Pringels. Ketchup is gonna be Red next right?","Bive baugh bove","Crappy crosswalk","great mirror positioning","D#ckside?","Should someone tell them?","(Don’t know if this counts) The ad right after the article is for mc d’s","Looks like we have another victim.","Walk the talk","EB Games have the best pricing system!","Found at an arts &amp; crafts store.","Toilet with the door lock on the outside","Gmail lending a helping hand.","Maybe “Stop Existing and Start Living” wasn’t the best slogan...","“Code Blue” (Emergency) button directly above the (unmarked) Call Elevator button at my local hospital.","Girls Can’t Be Scientists","There are alot of things I'd like to saym","\"Shit! I can't think of a third thing!\"","Did not find red-eye to correct.","Found this absolute gem on facebook","DiStRaCtEd DrIvInG iS LeThAl","Do we need to rotate the page? Nah, just swap the numbers.","Yeah.. Thanks","This chair (from the Queles National Palace near Lisbon) just about has leg room for 1 despite having butt space for 2...","Basically, anytime the suns out, you can’t see the screen.","A spoonful of sugar helps the casualties go down!","Honestly I love this Etsy shop but, um, I can't wear this shirt","So Im done then ...","1/5 of pizza","6 can pile up in a vending machine.","This unevenly made towel from Pioneer Woman. And yes I have tried folding it the other way...","Ewwww college","Ummmmmmmmmm...Ok","Bad timing","Uh, no thanks","This birthday card. The middle one is how I feel whenever it's my birthday, naturally.","Resealable packages that do this","I guess I’m pissing with the seat down this week....","I just want to know when my bus will arrive","Bellator's cringeworthy official poster for Fedor vs. Sonnen","Ok... I guess I won’t plug in my laptop... Thanks wall decor! (found in hotel while on business travel).","Push-up leggings","A link in a physical book.","Only one child in this elevator at a time!","They look like they are bleeding","\"I want the garage there\" \"but there's a power box...\" \"I want the garage there!!!\"","it's hard to parse what i'm seeing here","How many years of Java Experience do you have?","Picture is round, content is square.","Google Playstore likes it's ads naughty","Thanks Autisto","Bike lane in Chicago leads right into a curb.","If by \"layered\" your mean rows, then yeah, I guess it's \"layered\"","I wonder what he says","The new AI in Android Pie is amazing","It will works when we have flash flood I gues","Guess I'll wait an hour to read it?","E P R O M O I A M N R A I","Double Scrollbar","Someone thought the lock will keep the key from being stolen again","NO CHANGE TABLE FOR YOU","This McDonald’s sign over the trash can tells you what not to throw away","This logo for a coffee shop, but you cant even read it....spotted at toronto CNE","The legendary...","Best place to put a power point.","Space saving design.","Shoes are soo tasty 😋","Intriguing description!","Making a dance classroom near a library","\"Let's put a picture of the product on the box\" ...","Bus company","Why?","Why","Marvel is getting kind of creepy.","My school force us to wear this on sports day. Not DontDeadOpenInside because no matter how you read, it is crappydesign.","I love a blazer with p..ched l.., wait, WTF does that say?","Taps for ants","My girlfriend was in charge of getting our neices christening present.","Overwatch’s important message (behind the yellow text)","Lets just say to censor it instead of actually censoring it","This font *facepalm*","This thing","So which one’s worse?","Indonesian way to make the tap fit","The website for a local airport near me","Not one but three.","Dafuq is this mode???","The text is barely visible","Reddit’s good at picking ads","thoughts?","Get in my mouth kid...hold on tight","Coffee","I love my 220V!","The intruder alert system at my office...","How am i supposed to read the event objective ?","I may be little but I'm going big to be a brother","The password in the top row is censored, contradictory to there being a visual on the entered password directly below it.","It would be so easy to fix this.","“Our beer to you very condition”.... hmmm","This sprinkler sprinkles water on the floor","My dorm thought it was a good idea to make the clear EXIT sign double sided... (X-post r/WCGW)","New Political Ad!","We know you want to reset your password, so here’s an email with a link to send an email with a link to send an email about your forgotten password.","This bench in a mall in Norway","Best t-shirt ever","Very squishable paintballs in a very squishable bag","Please rank your possible opinions","This is a snus (a tobacco product) brand i Sweden...","Cool challenge, glad I can read the description!","The only way you can see which ear to put these in are when they are on the wrong side.","Fans will understand.","The handle on the door of my college's bathroom","I mean yeah... the game can get pretty violent some times","Going up?","Trippy.","Just...why","It’s too bad there isn’t enough room on the screen to display all the text horizontally...","So deep. So crunk.","Kick your crotch while other person shoved his head in my bottom!","I haven’t heard of any of these","Sure hope I’m a winner!","Chosing a good font is very important","I don’t think this James Bond-themed fairground casino was approved by the studio","Whats the best way to ensure that someone will push the alarm button by accident","Yeek","When 1 shitty ad isn’t enough.","The solar panel faces is fixed and the building all day","The entire symbol interface in Microsoft Word is an atrocity","When you try to x out you click on the ad","Watch for slow children.","Seems legit","When McDonald’s advertisers mess up the Big Mac jingle. Onion[s] and they put a plaque of Ray Croc on it.","I'm always pressing the alarm button with my palm","This terrifying helium balloon","Awkward timing at a Brewers game","From the same company as my last post, but i wouldn't say it is as bad as the algebra book, because it has bigger words.","It took me a moment to realize that the eye was an O","Watch maker \"Paneri\" used this photo on their website for a watch that costs $7,700","I’ll take the six rape flavor please","Why would you want to turn it off?","Thanks for the mini heart attack, Reddit","Noice","These weren't the best two things to put on the same card...","The fuck is this new logo","My parents car only has speakers in the back","You have 15 or he will be in seconds to your bed follow liftedmemer tonight!","Made for music anus","This fan has a bright white light that only comes on when you are using the 'silent night' setting.","Please don't.","This screen which I always end up fiddling with to turn off after I’ve started moving...","Sorry, what?","I was reading an article and they kept on putting these quotes","This service","Amazon, not the right time to be making jokes.","APPY HIRTH BDAY","Thameslink, what kind of phone is this?!","Huh?","If only you had a Minecraft zombie you could’ve used instead :(","Do not stand above this step.","it said \"designer\" on top of this","Current hotel bathroom. Can’t wash hands without splashing all over the counter or fondling the side of the sink","Let’s put the sticker in the bottom of the bowl! That’ll be easy to take out","Found this in the grocery store..","Revision and reprints? We don't do that here","The header and the ad takes more space than the text you want to read","Teach Kids Crayons Are Candy!","Irony with Guy Raz","Poster I noticed at my school","This autoplay video that flies across your screen on AccuWeather's website","Introducing the new Wireless Bidet.","Is this the [pixelated] face of the Koh Tao Rapist?","What the fuck...","You can actually just reach inside and open the door","This fishy packaging","I dunno, I've always been more of an Apple guy","Sht, my cake had sht","It even shows the slime in a bowl. It's like they want me to eat it.","These sunglasses have an unremovable solid logo on the front.","CAROL","Because blind people use stairs anyway.","Got it ! It's for bycicle !","I wonder what you get in this café","Great photo there, ABC news","What am I supposed to do now?","Found this on the App Store","For English press the hindi button","Triple negative?","Mmmmm baby flavored Goldfish","All I am is \"Before\"","Whaddya mean blue is supposed to be the color for cold?","A very un-organic fridge","These stairs leading to a wall, handrail and all.","Disposable reusable chopsticks","Stairway to heav- wait?","Yeah.... LAPTOP","Electrical box on my machine. I dont trust it.","Hot pretzels, candy, soda... what?","Maximum burns minimum accessiblity","This ad is crappy on so many levels","ironic","This lock","Chewbacca be trippin' on acid","This supposed to be a gingerbread cat.","My school given assignment notebook says “F Yourself”","This was overlooked on the school map","Uphill and partially on the sidewalk.","Trying to report a bug on Google's Ad settings... Drawing was removed from feedback tools, so I made every letter with little highlight boxes.","at my local church","This shower in Palenque, Mexico","This can’t be accidental, surely.","Need a drink? Just break your controller!","Let's go to the Dog Park!?","174% Plane","Sugarr","A political party from Brazil put Selena gomez in it's advertising","Cyan","The derpy-est dragon in the world","Which one is it?","Thanks for the indicators, very helpful","This USB adapter logo...","Well, who is it for?!, On the left is a half cut off person and the right, a Paralympic athlete?!","This website for a cinema in my city has a slider for the selection of the day you want to book your ticket. Today its the 28/08, the first day shown its the 1/09, then it goes down chronologically, then it goes back to the 28/08, then it starts again chronologically. What the fuck.","My hotel misplaced a toilet","I’m not sure that’s how you use a fire extinguisher...","of course i can park here","Hostess or horse’s head?","What cooler do thay use?","Whats up with the milk cartons in Norway?","Way to go Verizon","Excuse me sir, please hold your fire while I consult my automatic weapon field guide","I never knew peeing in the shower could cause epic facts","Can't wait to expand this list!","Goodbye to the crappy design that is Kelley Square!","Uhh , can I?","Land O Lakes Butter Milk","Netflix put the white description text on white and I can't even read what's about. Nice job Netflix.","10/10 landrover","Really Steam?!?","1, 2, 3, Four, Five, 6...","You're Not Helping!","Harry Pottetter","Huffington Post tries out the Venn diagram","This sink","[OC]This toilet door in Italy.","In my electrical class","New Smiley!","The ice cream brand that everyone loves!","instagram didn’t think this one through","This see through EXIT sign","Ope, sorry bro","This black text on a bottle of black nail polish","HOPE for Domestic Violence","Apparently we don't need type B though (why not just use \"somebody\" instead?)","They... didn't think this through (sorry for potato quality)","Why... I still bought it","The amazing use of space in this bus route sign!","Honbay has high standards.","Uhh, I don't think he's Freddie Mercury, Google...","Mcdonalds order kiosks put coffee sizes in this order","You have to poke this guys Eyes out in order to sharpen your pencil","This is the worst sale ever.","This bookmark from my school's library got removed from r/dontdeadopeninside, I figured you guys would appreciate it.","Nice job, Blizzard","ass toys","doea stupid as is stupid","I've always wanted to make my pool a giant toilet","Hell in jamba juice","This Chili’s schedule","This pool float is painted like a clown fish but has the shape of a shark.","Staying in a boutique hotel where they give you a kettle which doesn’t reach the table or the floor and this is the only socket","You have to answer them all.. this makes no damn sense. It should be radio buttons.","Is it voluntary or mandatory???","I don't want to find Dory anymore.","The lady in the middle. This was in my German textbook","Saw this smut in NPR website today.","I’m Contemplating Transferring","Uhhh... yeah sure","I 🚌 BUS","Just giving my SO's Chevy HHR a jump","Stay... Hard?","A dictionary definition that doesn't say what it means.","Marilyn Monroe","Marked on my calendar for September 21, 2223","Dish soap!","This pharmaceutical ad that never tells you what condition the medicine treats","Why do the stripes line up perfectly","Never Liam Underestimate","Guess I have to call customer service...","At least they're honest","New label for sugar free Coke where I live","“PREMIUM”","What is the purpose of this ad?!","I didn't know 68 was less than 17 @Buzzfeed","If only Louisiana looked like a letter of the alphabet...","Uhhh The config file is there","Why does this duck have paws for feet?","Most creative title 2018","Anarchy Orthodontics","Enter your email consisting of only these 7 letters to receive your photo booth images.","Ahhh... what a loveley night, hey Bill can you pass the soap?","This *leg*","This weird way of using a hand towel","At least it’s easier to clean the floor now","This in my math book","My wife's diaper bag doesn't close all the way so the boy just reaches in and grabs whatever.","I forgot how to math","Drop Down Menu That's Advertised as a Waffle Menu","Works well with this sub","Had this in my hotel room in Georgia (country)","My coworker’s confused bottle.","This is not what I wanted","Look at these crappy arrows (downvotes/upvotes)","Motivational 👏🏼","The stairs that lead to nowhere...","Café has separate menu paper. Doesn't list prices.","ouef","Dont think thats how that works","here's some incredible hq album art I found on spotify","Was shopping online for a new car when noticed this. Sorry for the potato quality","Just some five dimensional clay","A milk carton spotted in Norway","That girl doesn’t seem to be in the world of excitement...","Collegiate level design skills","This was at a student journalism convention, where we had seminars on *design*","The text on this statue.","Silent Poo","The placement of the tabs on these binder dividers","Stop putting pictures on not flat surfaces, they never end well.....","Mini Golf Tiger","The way this cabinet opens","So much space!","Rip","This is why some people don't come back from their smoke break.","Nothing better than coming back to your hoe","A buses stop button","Seems so natural, didn't even notice it","Who needs a computer screen?","Power socket at my university","Google categories organization","Helys Bar. No, it’s Hely‘s Bar. No it‘s ...","These guitar socks have six tuners, but four strings.","My Washer's Size Settings","The assembly instructions for this shop stool.","I don't think that's how bullet lists work","A staircase at my uni","Schobl? Really Beall’s?","How bout I put black text over a black background, that’ll be fine","One is dish soap the other is apple lemonade","Roswell’s baby bed","DISGUSTING","Future doesn't look good for this guy","This is relatively new","Do not stop, robo-cop!","This picture on my crossword","Saw this today (does this classify)","\"Good Times\"","For when your stream splits 90°","This grade school’s annual festival","WTF","Great poster that supports love. Don't mind the ⚠️","This sign...","Sign on the left points you to the right line, sign on the right points you to the left line. Who thought this was the best way to direct the lines??","The only way to disabled toliets.","The \" dark lightbulb\" increases brightness and the \"lit lightbulb\" decreases brightness","Welcome to Asia","Yeah totally","This lamp post in front of a garage","Asks for how many seconds old she is, then answer box says years","Only people with six fingers allowed.","Greatest game of all time (bad sticker placements)!!!!!!????","These hair dye","German travel guide: I wonder what the people from the ElsASS (Alsace) think about the design","This Length...","X X X X X X","Hmmm","clearly graphic design is her passion","Found the 1/12\" socket. You know, between 7/16\" and 9/16\".","My favorite color is Spanish","Facebook shamelessly pushing constant NYT articles as \"breaking news\" when I don't log in for a while","Cotton what?","Why even keep it","Found at a thrift store","This isn’t an emergency exit chair. It’s just like that.","Cuz fuck the disabled am i rite","Uhh...","I think there's a better way to say this...","This guy offers to build websites for money, but his examples look like they are from 1994. Note the reference to Facebook and Twitter in one of his examples. :-)","This first question related to Chemistry.","This thing that should reclose this pack of flour","Go fing","Tampa bay aquarium Florida airport baggage claim.","The placement of this hand drier","Unfortunate font choice","Single solar panel in the only shadow around","Pikachu Horse","I feel like a close-up of a smoking handgun with bullet holes in the background may not be the best choice for the image-graphic on a story about a mass shooting that happened like an hour ago.","Maybe they should rethink the name for this attraction...","X-Axis does my head in","How do you clean the mirror? Let alone they are at my face level","Seems like very little thought was put into this.","Ma’am, why do you keep asking for proof of my medical training?","Forty-rty","This painting that looks like fire","\"Sorry to inform you, ma'am, but your husband has Carla Cancer.\"","Just a soft white on eggshell white.... nice Netflix.","Hmm I'm Not Sure What Size I Am S/M or L/XL (they just look the same to me)","2 tablet dosage, only perforated to split 6 into two sets of 3","Nice mouth claw","I bought some new underwear recently.. my fiance pointed this out to me.","Is this what nightmares are made of?","With who?","Found on children's carpet","Hard pass.","She looks quite happy considering she’s being crucified.","But... Why","Thanks iOS for making my lock-screen clock almost unreadable at a glance","Dat Handle....","Imagine being the guy in the furthest urnial","Because I'll remember the number","This","The handle on this mug.","This is really empowering","This jewelry box found at a hospital gift shop...","You literally have to hide in the corner on the piss dribble to leave","You can buy Candy At A Restroom....O...K","The ear hole is the enemy","NOWILAY","You love what..","\"Hey boss we are almost out of drywall, what should we do?\"","... no thank you","Hmm","Mmm yes put a beam right in the door","Bad Roads Should happen to Good P","Why My Utilities are Always Late","How many??","stairs that lead to nowhere","My schools shirt","Because screw people in wheelchairs, right?","I Better In Ash","This trash can’s label","That’s a pretty large thumbprint on this thermal sensor phone case...","*EACH","75% informational, 35% confusing, 110% crappy design","Simply Plates","Whats the page image?","This \"duck\"","WHY","Using a different font for each letter doesn’t look as cool as you think it does...","This hotel room bed","Some bad placement.","Only one direction actually locks this door","Someone looked at the ads for The Snowman and thought it was a good idea for a PSA","Hmmmmmm","This romantic dual-bowl cubicle","LowG’s","Il manque quelque chose non?","Her eyes must have needed some disguising.","Game advertising that it will ruin your life...","Be We Conserve the We","Crappy design at my girlfriend's new apartment. Smh","Thank you for reminding me dollar tree I do need bleach for when I go back to campus","Do you see what global warming is doing to Antarctica?","This shirt with eight fingers.","Murder = funny fail","“Exit Message”","Not a clue..","Nice job parents","not the best letter to choose","Found this Batman Crazy Foam at Smith’s","S BACK T HOOL","Spend time with family and friends.","Data Cleab?","Since the R is capital, instead of Therapy is spells \"The Rapy\". No thank you.","Not sure how to feel about this Walmart ad...","All I can see is Turd","Too important for fine print","Do we have these???? Its a surprise!!!","This says \"Kalamazoo\"","Inpoopnito?","Who tf installed this?","GAAP","This baby scale…","I dont think that is a kids show....","Not the best place for a TV...","The buttons in this elevator at Dubrovnik's international Airport. Some departure gates are located on the second floor...it's up to you to figure out what to press.","Paper Towel Dispenser dispenses towels into the stream of water. (My camera has no image stabilization so it was shaky, sorry)","Red whi tea ndb lue","New No Down Closing","Whut? Only at AliExpress..","The local deli got a new sign","\"We buy Sega Genesis games\"","Instagram, what are you trying to tell me?","The Incredible Hole","Found at Mexico airport Cancun","Shouldn't one of the arrows go its own way?","I think the owner of this dont know how does a jigsaw puzzle work","Saw this trash can when delivering a package to someone's house.","Post","It’s so you can speak to people instead of playing your phone","You've seen supreme, now get ready for SUPER ME","This bottle...","But why","Why do they have a picture of a cat when it’s about making a child?","Google Analytics app icon on Android","Lines read as INVIN CIBLE","No","This mirror right above my friends toilet that showcases everything as you go","A goldmine or terrible design","iTunes says I need to unlock the phone before I can connect it to iTunes, but the phone won’t let me enter in the password!","The \"Contact Us\" page on this company's website","This soap with the seal IN the cap","How Google Play ruined this app's only purpose","Is slavery making a comeback?","This generic version of a PS3 controller has the words instead of the symbols","Top tier ad placement","what happens when you hardcode your site to call everything \"funny\"","The W hat","Dear brownie brittle, we want to fight to end cancer and not feed it cookies!","This group photo i saw at a concert","Oh... so that’s what happen to Elizabeth","lets put a window in the 5-8 grade gym bathroom","This cafe toilet door has a window for your convenience","Holiday Inn encouraging their guests to be fit and flexible in a rather savage way.","How is he holding it...","This Arvest cookie to celebrate fall","Her hand is bigger than her head","O2 UK has developed a downloadable app for the Apple Watch, the sole function of which is to tell you to open the app on your phone.","I came in 4st","People always forget that car windows can be opened too","Infinite pleasure!","Not a good idea...","Are you sure about that?","I too am enought","Pure the purity of simplicity view","Whyyyyyyyyyy?","Women’s washroom","This wall","That's Gotta Hurt","I got a ad blocker ad","Let's use *all* the clip art!","This LiveScience Logo","Black pinocchio","your whole body was WHAT?","My math ain’t so hot. Can someone help?","World Real Famous Deal","Between the freshly painted parking bay, the curb barring access to that parking bay, and the 'absolutely no parking' sign, there's a lot to unpack here","Love the course list ordering(not a student)","Local bakery had no picture for the apple turnover, so they decided a Microsoft paint version would do instead.","This well placed emergancy exit sign.","Just Ice","This ''wedding symbol'' looks like two kids standing next to a grave.","Let's link the upper option to the lower button","This Vegas hotel covering the Pool in shade","The inside of my nieces iPad case","This store's desk lamp section doesn't have the lamps plugged in so we can't see the way they light up before buying.","I will murder your family","This bag","Let me bring along my friend to swing while I pee :) (though admittedly this is better than all the double toilets we've been seeing recently..)","So what does the message mean?","Thats not how books work","This window placement","This for phone calls at my work.","The safest drinking fountain around","Why did they choose that color","The rest wasn’t inspiring enough I guess...","Peephole in hotel room","This Minion toy plush.","What are they advertising?!","Somebody is happy to see me","Internet's down? Let me just test my Wifi Anal...","really not sure what to say..","Just a strawberry...","You have to be online to play offline","Last week I almost walked into the ladies toilet at Tesco. When I came back I realised I clearly wasn't the only one making this mistake.","Crappy","Great ad with my bible quote...","Yes!","Austria's new postage stamp","“Use any font”","so how much is a fun card?","Great Britain here looking like a town, zoom out and it is still there until after Sheffield disappears, zoom in and there is very little.","Can't focus on what to read","Let me just... Yeah, so you can see it better...","From the outside, this bar is called 'OMG'. From the inside, however...","Enjoy the view.","Graph","Sushi restaurant with “sushi” sign pointing away from the front door","This Pikachu outfit","Sizzlingly fresh","This is a poster at a design school","Wheels? Where we're going, we don't need wheels.","Not sure if this belongs here, but this highway on-ramp in my city expects 3 lanes of traffic to suddenly merge together before finally merging into the highway.","I really hope this just got lost in translation....","This Tactile Paving for Blind People","I wonder how long it takes to find the book you’re looking for","Conserve the water but not the bottle.","Where is the “Not Interested” option Youtube?","This drawer won't open if the door is cracked","Good luck trying to order using this menu","Says to turn off water with paper towel, doesn’t have paper towels","Mercedes F1 wishes: Get well give soon it Niki A**eholes","The lack of colour for rating stars on the YouTube app makes it look like the app has 0 stars","Volkswagen decided to put an \"Econ\" button instead of an AC button in my rabbit.","Good for looking, bad for eating","The name of this battery","Oh? You don't?…","This is a either an example of really clever advertising, or an unfortunate coincidence.","Buzzfeed quiz bars","Who....thought this was a good idea?","Well, this is frustrating","I can't open the closet doors for numerous reasons","Free wireless charger?! Yea right, after you promote our product. Nope!","Le de Tour france","This canal...","\"Designer staircase\"","Rapunzel socks.","Why... does it have a nose?","Facebook Ad","They say the eyes are the windows to the soul...","Please enter a valid email address that is only numbers [x-post r/mildlyinfuriating]","I hate this decal on many, many levels.","Ye s!","Missing an S","The numbers' arrangement on this keypad","Winter in Miami is cold enough for snow.","Shirt makes me uncomfortable","This guest pass for my sisters dorm","The indicator is red when it's unlocked and white when it's locked","This is in my closest town!","God hath made a mistake","Rules are made to be broken. At a liquor store in Atlantic City, NJ.","The Louisville cardinals mascot has teeth","Not the best way to abbreviate \"Analytic Geometry\"..","Send the designer help.","This question......","FG Bakery","This printed braile on this lactation room","Dontist","This statistic","How do you place a screendoor upside is?","Everything's bigger in SAXET","Well I dunno..","Price was 20% off tho......","Oh","What a deal!!! (Seen in my local Tescos)","This is what happens when mathematicians are tasked with designing a poster","This bathrooms gender indication at a elementary school looks like it's holding guns.","This as campaign is to get people to vote in both primary and general elections, but instead sounds like it advocates voter fraud","Quantum mechanics at work.","This tabletcase with a placeholder text","The toilet paper dispenser at this restaurant","I guess it's true.","face aging app uses different pictures of real people instead of showing the effects of the app, and mistakenly uses a picture of a man with different colored eyes.","So does it come with a cable or not?","Looks like a semi dog semi human","Nice revolver you got there","This hat","Nice try","Stop. But, please, seriously stop!","This Labor Day party poster","This lolly mold","Whyy, just why..","The partner to this subs mascot has 4 and 5 fingers","So what age can wear this, then?","I had to climb up on the bed to plug in my phone charger","Its a price verifier, the sign tells everything"]