["New Sidebar Image and Snoo Contest","Youtube Spam Posts: What Are They and What Are The Mods Going to Do?","A true jedi","When you spend 12 hours writing a Schrödinger equation eigensolver that accepts pngs as a potential well specification, then plot the average of the first 300 eigenstates of a Senate-shaped potential well","Show the kid some love","No master indeed.","He is a bold one","You underestimate my power","[Insert clever lyric here]","Before the dark times, before the EAmpire","How the tables have turned","Begun the cone war has....","When you leave r/PrequelMemes for a while then are reminded of all its quality content and return","You're a treasonous one","Oh, I can't hardly wait!!........","So this is how Liberty lives... with thunderous applause","I just watched Infinity War and didn’t realize they put Darth Maul in the movie! This really was the most ambitious crossover event in history.","Coming soon","Thanos made it to the front page in 2 words. Can we make it there in less?","The REAL Dark Lord","You are doomed","Its treason then","It's unfair!","Logical choice","You're Welcome","I will deal with this offspring slime myself.","When you watch the prequels to find an unused quote but you don't find any","OC (I hope)","A surprise to be sure, but a welcome one.","Me except I flex about my expensive pens","Attack, Kenobi.","The first and only reality of r/PrequelMemes","Commander Cody the time has come, execute order 66","Take a seat","\"Thats why I'm here\"","When your obscure Rogue One quote didn’t get to the front page as intended","???","Spotted this morning on campus.","EA... that is why you fail","Star Wars, A Disney property","Hello there...","Another reason why r/prequel is better than r/sequel","It’s over Anakin....","This will make a fine addition to my collection","My face, when I chew a mint and then drink some cold water","If this has not been done before, then it will be a surprise to be sure, but a welcome one","My first post","I don't think they mind though.","Ironic","Take a seat, young Skywalker!","Yass Queen","When your friend tells you that you won’t find a Qui-Gon Jinn quote in The Flash","Excuse me what the fucc","Move Corporal we'll cover you.","star wars prequel meme compilation #22","Before Darth Vader we had:","And that's the story of how I quit D&amp;D","Star Wars &gt; Marvel Movies. Let the rage begin.","The true story of Jesus Christ","Woof!","Oh, I don't think so","Good, twice the pride...","Watching the prequels with the bros","He could save other from removal, but not himself","Don’t try it","The Senate","she can't wear that! shoot her or.. something.","When you break something in the house and when your mom finds it, you have to act like you’re seeing it for the first time","Negotiations were cut short","This is in my textbook and I laugh every time I see it","We all know...","He only speaks the truth.","Sequels lead to anger. Anger leads to hate. Hate leads to suffering.","It’s not the Jedi way!","Hello there","The most memorable battle of Star Wars","The shroud of the dark side has fallen, just begun, The Cone War has.","When the mods ban your low effort post","You are a bold one [loweffort]","Impossible perhaps the archives are incomplete","Guys we need more Clone Wars memes immediately!","A true Jedi breaks everything in the level","when she asks you to \"produce\" more clones with her","When you post risky new OC","When your friend asks who you have a crush on","GONK","The ability to repeat a quote does not make you a memer","When you want to fight back the bully","So love has left you scarred and deformed?","Wanna buy some Death Sticks?","When your comic fucks up such an iconic line","I shouldn’t have done that, it’s not the Jedi way","I love democracy","(Freeze Frame) Yup, That's me Qui Gon Jinn. You're probably wondering how I got here.","Star Wars the Gathering","A cheap copy...","When the girl you just met reveals she fights for the prequels","....then everyone died","When you are in German Class learning numbers, and they just finished #65","The high ground","Im drawn too","Me thinking about the girl I had chemistry with but never acted on","General KenOC","A true Jedi","So uncivilised....","So uncivilised...","not to me","r/prequelmemes guide for OC creators","When its your first time browsing r/SequelMemes","CRITICAL","So uncivilized","Another happy googling","When your friend can’t decide whether to put their OC in r/prequelmemes or another meme sub","Half naked girls and boys in blue can get thousands of likes, but how much for our blue half naked girl?","What about the hacker attack on windows?","My goodness!","The meme has potential..","This film is probably a miss","back from the dead","Two Jedi commenting on midget porn","Found General Grievious in the semaphore alphabet","Unlimited poweer","Me and my brain when I make a prequel joke, but nobody gets it, and they’re all confused","The 'R' in 'buzzfeed' stands for reliable","The time has come...","When the guy called Skywalker loses both his legs","Christopher, heffalumps are evil!","Sorting by New","Always two there are.","Some days /r/Prequelmemes be like........","Found these at my cousins house...","Petition for a law that requires American presidents not to look like this","once more the sith will rule the galaxy! ... and we shall have ... peas.","Learn to spell Anakin...","My friend just found the Clone Wars and is enjoying it, new clone for our ranks my friends.","The Archives Are Still Incomplete","When the mods decide that my shitpost absolutely must be removed","This is getting out of hand! Now they're two of them!","Shitposts are our speciality.","UNLIMITED POWER!","YOU WERE THE CHOSEN ONE","When your sibling punches you and your parents walk in the room so you gotta be cool","You underestimate my flashlight","To all current and former members of the meme alliance","When Someone Disrespects Clone Wars (2003)","When the enemy team keep running toward the capture point and you have the perfect sniping position","This is where the fun begins","When you find a VHS collectors edition of The Phantom Menace in mint condition","Thats a good trick!","O-H","Do it","Ah, Victory","A repost from facebook","When you have the perfect Diss thought up and your just waiting for someone to line you up to burn them","Oh I don’t think so!","This is outrageous. It’s unfair.","I would certainly like it to","Good choice my friend","Hello There","When you go on your YouTube channel and see this on one of your videos","Don't try it!","I can see through the lies of solid ground.","So uncivilized.","Now THIS is moonwalking!","Hello There!","It's a cross-over we cannot afford to lose","Some people never learn...","Petition for a law that requires American citizens to make their yard look like this","What about the droid attack on the wookies","It will be done my lord.","It's treason, then","You know I ha- GENERAL KENOBI","Oooo moy moy","Dissen berry berry baaaad","When you find out Clone Wars creator also made Star Wars Resistance","Saw this on Instagram. Felt like this is it’s proper home. Shoutout to this guy if he has a reddit account.","So uncivilised","Twice the patience, double the victory","This is getting out of hand!","It's over Anakin.","When the teacher says no sliding memes into your presentation...","Cone Wars","My ideal body","General Kenobi [OC]","It do be like that sometimes","[Yoda] We must destroy the Sith.","When you catch someone reposting","George Lucas did it before","I guess it wasn’t meant to be","Girls. Yep.","Here's my shitty meme. Google Docs and Windows Photos sucks :(","Luke Sanchez","When you move to the new school, and can’t find a bathroom.","Prequel meme compilation.","My name is Anakin Skywalker. A Jedi terrorist with the death penalty sliced off my limbs and tossed me into a volcano, where I was brutally burned and wound up in a life support suit for the rest of my life. The Jedi terrorist was never charged. THIS HAS TO STOP.","I n t r e s t i n g T i t l e","Oh I don’t think so","Clone Wars is Number One","This is so sad, Alexa play duel of the fates","we're fine , we're fine","He was a true Jedi Master","This is outrageous! It’s unfair!","Not. Yet.","Me when I watch all of The Clone Wars in four days for the eighth time","obi wan is god loo","the meme side is a pathway to many abilities some consider to be unnatural","Anakin isn't going to like this...","When you’re watching the Prequels and a meme is about to come up","When someone says BB8 is a better droid than R2-D2.","Count Dooku should have had better benefits.","When you're a pant","General Reposti you are a cone one","Rare Picture of Satan himself","This zone is now under military jurisdiction.","Prob a bit of sand there...","my favorite quote from the prequels","when one of your shitposts gets downvoted massively .","Instead of stealing a meme and reposting it I'll try posting a screenshot of a meme instead. That's a neat trick.","crossover","This is star wars. Not what you think","Ep III in a nutshell","I saw someone else do the MTG card meme so I decided to upload mine","MRW when a Lord of the Rings posts makes it to the top of the sub","Everyone knows who’s the real Obi-Wan. Oh and that other guy to I guess","It's Outrageous, It's Unfair!","Dewit","went to legoland california this weekend and it was","It’s outrageous, it’s unfair. I can see through the lies of thought catalog.","Our half naked blue girl can get thousands of likes, how many likes for our fully clothed green girl?","HOT FUCKING STARFIGHTER STRIPPING!!","Stay tuned....","Obi wan christobi","Disney actually corrected their mistake. A surprise to be sure, but a welcome one.","Oh no. Well at least he's off our backs. And you can cleary see its an iDubbz video.","It's fake then","What are you doing? Deploy the downvotes","Ah, victory.","From bringing balance to the force to bringing balance to the universe","When another repost makes it to the front page","When Your Mom Leaves You at the Checkout and It's About to Get to You","I spent way too much time on this","When its the day after your birthday.","Outrageous now there are two of them!","When you're on the Titanic while it's sinking and it breaks in half","My first post.","When a car goes to pull out infront of you!","Meta meme","Dog: ‘Oh, I don’t think so.’","You have become the very thing you swore to destroy!","This","I drew the 2003 Clone Wars General Grievous and thought I'd share it here.","Oh, how the tables have turned","Dont do it!","Since everyone’s going back to school","In programming class, my professor told us to write a traditional “Hello World” code as our first program. I had other ideas.","When Padmé isn’t around to check your internet history 🤷‍♂️","Padmé got a gun","Something i made for this sub. Hope you like it.","We did it","You underestimate the power of physics simulators!","he's not wrong","Use my knowledge","There are too many of them","When you and your friends accidentally put on a Logan Paul video!!","lost my mind , i have how embarrasing, how embarrising.","Is she legal?","Commander Coney Fighting with fellow cones in the cone wars","Wise words for all Star Wars fans","Lmao","darth maul seeing obi wan again after being chopped in half.","When you hang out with you best and friend and a new mate, so you decide to vote who will pay for the drinks","Completed this puzzle today","I did it!!","I should have known the Jedi were potting to take over!","We may have the high ground on Vermont, however...","Tables have turned...","When you're out trekking with your padawan and come across an active volcano in your way","General Suomi","Japanakin","A surprise to be sure.","Found this one at r/sequelmemes. We probably won.","Did you ever hear the Tragedy of Darth Strippus the Hot?","My coworker got fired and I could resist...","Light up the younglings as you had a tantrum","RIP General Grievous. I may not have agreed with all of his policies, but he was a war hero nonetheless, and he deserves all our respect.","When someone asks you if you think Star Wars can improve","when you've waited a long time to post a meme.","The cantina I frequent has these on its bathroom walls.","MRW I finish off a whole tub of hummus and see a second one in the fridge","What if I told you that the Mario Bros. were now under the control of a Dark Lord of the Sith?","Star Trek &lt; Star Wars","My school’s subliminal messages.","What about the Wookiee attack on the droids?","Nonsensical Garbage","🤤🤤🤤","General Kenobee","Whenever I wear my Prequel love as a badge of honor.","When you're high, ground","Every time","Crossover episode","This is where the fun begins.. now get in my belly !","I have to admit that without the clones, it would not have been a victory.","The Best Prequels Character Tournament: ROUND TWO","It is critcal we send an attack group there immediately","When you realize that Star Wars isn't the only movie series with a prequel trilogy","What are we going to do?","When u don't have any unused prequel quotes left so u start using the quotes from the bloopers.","This is sort of true...","You were my son! I loved you!","Quality content","Bullied kid who doesn’t fight back bullies says “It’s not the Jedi way”","I’m going to take up space on the thread by playing a +5 Pazaak card and ending my turn.","DeviantArt in a nutshell","Perfection.","What?","General Operating Systemi","An OC to be sure but a welcome one","When you’re brother swears he can handle “at least 2-3 more shots” when he’s already drunk off of power.","Plato meets Plagueis","Your bones are very impressive","Babies u so sexy","There's always a bigger meme","So what can I say, except, I repost!","Petition to give the upSenates higher resolution. (Thank you for them nonetheless)!","a surprise, to be sure, but a welcome one.","Rare image of the family tree of someone who dosent care about the droid attack on the wookies","Have you ever caught a good guy, like a real jedi said to bring balance to the force, not destroy it?","It’s not a gesture a Jedi would show you...","The Jedi mind is clear","Puns...","i acctually made the ultimate sacrifice and opened r/sequelmemes just for this meme ,this is wath i said:","In response to /u/Scottyb101","The back seats have the high ground","Her: Baby tell me a story","r/historymemes","Grievous and Gut-Sack","Weesa has a grand army","Ah","What I think about the people who dubbed the Chinese-to-English RotS","When you bout to nut but she wraps her legs around you and whispers, \"what should we name the kids,\" while trapping you","Hope this is the right sub, pretty sad you can't meme in r/starwars","Scum Bag Obi-Wan..........","Ive been looking forward to th....","A man is surprised to be sure..","\"Lightsaber sound effect\"","When you love him but you know that he has to die.","Helping my cousins move out and found these.","One would think he would realize sooner or later","When I hate people that call me selling things, and part of my new job is to do lead calls.","I have the high ground","When you find out you can emulate prequel games","when you post something and refresh 10 minutes later","I am a cold one","That ass tho","When your pizza rolls are burning","It's-a clear desa Sequelists made a pact wesa desa federation du trade. In response to this direct threat mesa propose an alliance with /r/Sabaton memes.","Does this count as a meme? I hope so","I'm proud of you.","Under construction","THIS IS WHAT SEQUEL FANS LOOK LIKE","RIP Mace","This is outrageous this is unfair!","Anakin helps the younglings learn the Jedi Way","Its the jedi's fault!","It's treason then","Hello There \"Clone Wars\"","Planet Down Under","Anakin really doesn't know how to impress Padme","i haz seen a star warz movie.","Place your bets","When someone says backstroke of the west has no meme potential","What the heck mom.","may the furce be with you.","No insurance required","You brought him here to kill me!","It's over Obi Wan I have the even ground!","It's over Toastakin, I have the high ground.","I hate them!","Faces","General Kenobi, you are a bold one","Jus do it","When you're about to run a race","A surprise to be sure","When you replay a video game and the voice actor sounds familiar","Vacation starts now","The government’s reaction when they can collect income tax from you","Meesa called Jar Jar Binks","People wouldnt have to put oc in the title if there werent so many reposts","OC","Rian Johnson behind the scenes","I HATE YOU.","When r/lotrmemes wants me to join their faction war but I still want to make prequel memes.","I see your first 300 Senate Eigenstates and raise you an Anakin shaped wavefunction in a Senate shaped potential over time.","Thank god it’s coming back","There are too many of them. What are we to do?","When someone points out that you have posted on r/SequelMemes before","This is where the hate begins","Failed I have into exile I must go","Cringe I found while cleaning my camera roll","My meme stealing abilities have doubled","Anakin is the father, isnt he?","When you still can get to the front page with an overused prequel quote, even with no captions.","Something the council must consider","Complete madlad","I need help","He cant do that...","When you say “Hello there” to your crush who you loved for years and she says “I always loved you” instead of “General Kenobi”","technically 2 halves...","When you lose a bunch of your mates at a festival and realise you’ll just have to make do and hopefully they’ll turn up in the morning","If anyone said you couldn't reach the front page with a low quality, snapchat crossover meme, you'd be right!","DeWitt","Amen","But this does put a smile on my face","Best crossover ever!","Don't Try it, I have the High ground","Imagine that Disney realizes how many memes the prequels have caused and includes them in the new CW Season.","Sending the 501st to the great #1 buzzfeed war (22bby colorized)","I had a match on Tinder","Another happy landing","We all have a weak spot","ANOSKIN","anakin thinks space is","Sorry I know that this is not a prequel meme but we can’t let them get away with it","*A wild John Wick appears*","Somewhat paraphrased, but it goes something like this...","r/trebuchetmemes got a trebuchet to r/all. We must get our boi Ewan there to show our might.","College courses started today, found this beauty in the textbook.","If you only knew the power of Science","The ultimate betrayal","Destroyer","Don’t look into the watermark that much","This book knows the important quotes.","A vergence, you say?","The Nathan Strikes Back","Has your professor told you the story about The Student Who Plagiarized?","An emotional scene for sure","School supplies are our speciality","Anakin could have looked up how important it is to get the high ground","Just like the simulations","Not a tale Disney would tell you","Did you ever hear the Tragedy of Darth Plagueis the Wise?","🔥🔥 Fire Playlist 🔥🔥","Sign the petition. Help us eradicate buzzfeed from the internet.","We are so uncivilized.","Reverse Psychology is another Jedi mind trick","It's treason then.","When somebody comments “General Reposti” but they ignored the General Reposti flair","When someone says the word “treason” in any ordinary sentence","So the HOT GIRL FUCKING STRIPPING was enough, but now people are post straight up porn without NSFW. Stop spamming this please","It’s a sitcom we cannot afford to lose","Didn’t bring my girl candy as she had requested","The women! And the children too!","Darkness I feel.","I see through the lies of the Jedi","Even sequel memers admit that the sequels are a cheap rip off","When you use the pressure from your piss to erase the skid marks from toilet.","I really just do not care","Remember the disney multiverse theory or whatever.","This is outrageous !","What if Dc make a Star Wars Movie.","KILL BUZZFEED","Reposti but its funny","A Jedi master and 2 council members search for Anakin Skywalker (32 BBC)","Anakin, r/Sequelmemes are evil!","I’ve done a bad deed","That’s when you know your not really friends","I have a bad feeling about this","The ability to speak does not make you intelligent... unless you do this","It’s over Anakin! I have the high ground!","From my point of view KSI is evil","Your clones are very impressive, you must be very proud","Can’t fix it with flex tape","Gotta keep those bones stronk! Drink ya milk! [OC]","From my point of view, Sportacus is evil!","A surprise to be sure, but a welcome one!","Bullied boy lands in ER after saying he wouldn't fight back because it's 'not the Jedi way","If jedi had suspicion about order 66","Simple OC","Oh, Mooie-Mooie! I Love You!","Dooku survived like Darth Maul.","IRONIC","[OC] When Star Wars gets carried away with bringing jedi back to life","Have you ever heard the tragedy of Darth Plagueis the Wise?","a suprise to be sure, but an unwelcomed one","This subreddit.","He sees through them","The ability to communicate doesn’t make you intelligen","When you watch Hercules and find a prequel meme","[OC] Awhhh masterpiece","How could Funko get such a simple thing so wrong?!","Grievous = Beevous","The Ultimate Move","When your meme gets reposted and makes the front page, but you are happy that people are enjoying it.","Your therapist be like","*Visible confusion*","When clone wars memes are popular but there is still no “That’s not right” memes","I had to downvote","An unexpected surprise, but a welcome one","What about the droid attack on the Audi’s?","When you make a meta meme about getting to the front page but don’t actually get there.","Guys, cleverbot is one of us!","Do we still downvote reposti even when they don't try to hide it","Viceroid","Tfw somebody tells you the senate will decide your fate but you are the senate","It’s over, Anakin.","When you don't grant him the rank of master, though he achieved 20x more than you.","Puberty hit Anakin hard","When someone already subbed to r/prequelmemes subs to r/sequelmemes","The happiest moment of my life","Plz no ban","A surprise to be sure, but a welcome one","The Butterfly Effect","Did you ever hear the tragedy of Darth Plagueis, the Wise?","I propose a temporary truce. Robbie needs us one last time.","kathleen is scary","It's over Andrew Ryan! I have the high ground!","Wanna buy some deathsticks?","This is where the pun begins","I take it General OC has been destroyed then?","I will make it legal.","The Wreckage","Gamertime","Time to abandon ship","When a sequel memer says they don't understand r/prequelmemes","I have brought peace and freedom to my new office","DJ Khaled meme with sexy formatting style","I'm a soldier, like you!","Which order?","r/prequelmemes: \"We're running out of memeable quotes\" James Arnold Taylor:","When you realize how many prequel quotes take inspiration from the original trilogy.","Did you ever hear the tragedy of Darth Life the Wise?","I'm a memer, you know, and someday I'm gonna meme away to the front page.","You are an old friend one","A surprise to be sure but an unwelcome one","How to OC","When you leave your electric razor charging overnight and use it the next day","Do I even need to put subtitles on this one?","Original Content please don’t hate lol but this is so true","When Reese’s found out Anakin wasn’t granted the rank of master","I'm just a simple pylon making my way in the universe","When you ask your friend if all lines from the prequels are memes.","RIP Sheev","You were supposed to destroy the Counter Terrorists, not join them!","Perhaps the archives are incomplete","this will make a fine addition to my conellection","We got Swolo, Viceroid, Palprotein, and Qui Gon the Gym owner.","When you’re taller than Ewan McGregor.","We should not have made this bargain.","Food for thought","An interesting title","This is outrageous","For a friend, an elf.","Now there are two of them!","Sorry for bad edit, my first upload...","XCOM 2 is the Sith simulator we've been looking for","What if Rian Johnson directed the Prequels. . .","Watching porn_irl","When, he has the high ground, but you're still gonna try it","We must fight for our lives fight for our love and our happiness","Bullied boy lands in ER after saying he wouldn't fight back because it's 'not the Jedi way'","How simple can it get?","Guide to prequel memes","So many memes in the future!","Darth Maul got cut in half even though he had the high ground.","I have made it legal","When you realize visible confusion isn’t actually in the closed caption","The real Anakin Skywalker","An Equel meme, to be sure, but a welcome one.","This is a happy moment","We've leaked again","When you find out 203 years of peace is broken","The Original Cones Origin","How to get banned at r/SequelMemes","As school starts, OC is on the rise.","Miss me with that gay shit.","Begun, the phone wars have","DeathSticks","I wish it didn't be like it was, but it do","!dnuorg hgiH","The Storyboard she tells you not to worry about Vs. You","A real man 💪","200000 gamers ready with a million more well on the way","DoN’t lEcTUrE mE, oBi-WAn","That’s a good Wan","When your little brother says he liked the phantom menace","The ability to comment does not make one intelligent","When someone posts “HOT GIRL FUCKING STRIPPING” but it turns out to be Ewan","You have this subs blessing doe","Oh my god, you killed Shaak Ti! You bastards!","\"Ironic, he could save other memes from death, but not himself\"","Not sure if you’ve all seen this, but that’s what the flair is for","Papa knows what's up","I don’t think they realize it’s not Jesus","Me when someone asks if I can really hit front page with just a zoomed in crop of a meme.","When your coasters get ring stains on them","Only a sith deals in absolutitties.","We all know it","Team 5 has the high ground...","Will Watto quotes work on this sub anymore?","When I start to see posts about cones","When you’re about to roast the teacher in an argument but you realize if you talk back you’ll get a detention","when someone doesn't accept rogue one as a prequel.","If you attack a meme sub, you shall be turned into a meme yourself","Take me home","General Kestonedi! You are a high(ground) one!","When Obi-Wan is on the sidebar and you know a General Kenobi snoo is coming","If it weren't for the fans we would've had it.","We must ready the troops .. OC also","The past, present, and future all walk in to a bar...","I pledge myself to your teachings!","When people say only Samuel L. Jackson as Mace Windu can be used as a prequel meme...","Ironic.","When you think of a cool subreddit idea but you need clout, so you go to a reputable memer you know","r/sequelmemes must have it oh so hard.","How could this happen? We’re smarter than this!","Remember that one shark guy from Clone Wars? don't do cocaine","Hearthstone gets it","A surprise to be sure but not a welcome one","If sidious executed the wrong order","He could save others from absolutes, but not himself.","When you're hiding in manhunt and the \"it\" kid starts running toward you","This is a happy moment.","Also found this on Facebook, so another repost I’m afraid... sorryyyyyy","This is getting out hand, now there are two of them.","You know it. I know it. They know it.","You have become the very thing you swore to destroy","Found on Ask Reddit","Your cones are very impressive","Is that legal","Did you ever hear the tragedy of Darth Rodgers the wise?","it was a bounty hunter called...","When she says that she’s home alone","One of my coworkers set alarms on the self checkout palm device.","Prequel memes are leaking again","If it works... ( ͡° ͜ʖ ͡°)","You underestimate my jazz!","My order number at a local restaurant","A True Jedi","My fish that just gave birth died of (I'm guessing a broken heart) this is so sad","X-post from r/forhonor","A Meta Gif to be sure, but a welcome one.","When r/prequelmemes invades r/globaloffensive","The sequel memers have a fine addition to their collection.","Yoda is a pussy","A suprise to be sure, but a welcome one.","When your girlfriend is flirting","Was rereading Berserk; Miura knew the secret to winning fights before Obi Wan.","When you have to draw for an assignment and you're the only artist in the class","What if you don't just pick up random desert boys?","Just wanted to share that at the mall I overheard a woman call her two boys Anakin and Ken","Wait a minute how did this happen we're smarter than this!","I'm a bold one","Posted one of these a few days ago, here's another. Apparently the Ark crew are big prequel fans.","She can't do dat... shoo her or some sing","Me every time","In school every day","Unamerakin Skywalker","My Wife took her final exam today and was unsure how she did. This is our marriage lol","When she kicks you out for cheating.","Cyberpunk Meme","Magnificent aren’t they?","This party's over","When Obi-Wan tells Anakin the Jedi’s allegiance is to The Senate not to its leader but then calls Palpatine evil.","The Neimoidians from the Trade Federation are greedy and cowardly","The people at PC World looking at my broken laptop","For the jazzcats out there","When you go on r/Sequelmemes to see if the rumors are true and it turns out that they are and it actually is garbage","when it's winter and you're cold","General Kenoby!","“Yes, and the Pewdiepie fans will die. But r/PrequelMemes will survive. We always survive.”","Haven’t seen a clone wars post top trending trending on this sub for a couple days","Oof","When the noobies figure out how to crop out the pic collage watermark","Browsing r/PrequelMemes in the bathroom","Do what you want cause a bold one is free","Battlefront 2 EA received more content...oops","LOL I SAW THIS ON A DISCORD MEME AND I JUST HAD TO REPOST ITS PERFECT","The drone has exceptional skills.","Steps of Obi Wan’s path to the high ground. Join this discord to help him get to the highest ground. (The Cosmic Force) https://discord.gg/WWWXxXD","Hitler circa 1945","When she walks in and asks what you're doing.","Every time.","Wait... are you kidding me!","We must see through the lies of the Jedi!","I see my library has good taste","Good relations with the Wookiees I have","when someone says only the kenobi version of a meme will get good votes:","I content aware scaled and distorted Hayden Christensen and this was the result","No Words needed","When I get on reddit and see a bunch of cone wars memes...","When all of your teachers give you homework","I HATE YOU [ERAQUS]!!","My friends, this is a declaration of war.","Shaak Ti: The Sean Bean of Jedi Masters","You were the chosen one! *\"Annnnnnd you failed\" sound insert here*","My First Post","It's a channel we cannot afford to lose","Why Hello There, Bear, Hair, Scare?","When Obi-Wan has more important things to deal with than General Grievous","This is what I live for","When every other subreddit hates you, except /r/prequelmemes","Seems legit","True","Impossible. Perhaps the Archives Are Incomplete.","F","Now this is reposting!","I HATE YOU","Master Kenobi, I don't feel so good","This is where the fun begins!","MFW I’m out of ideas for a new template so I just tweak a little bit an old one","A surprise, to be sure, but a welcome one","The gaming community after watching the Cyberpunk 2077 gameplay demo.","When cones become the next prequel meme","Upvoting comments without reading them just because it’s the senates face","Dear Disney: Stop Wasting Your Time on this Trash and Give Us What We've Been Waiting For","Hot girls stripping can get thousands of views, but what about our boys in blue?","When you look at the CyberPunk 2077 gifs on r/gaming","What!?","This is where the food begins.","When they try to convert you to the faction wars...","When you’re an adult male on the Titanic waiting patiently for the women and children to board the life boats and the captain clears you for boarding but you arrive at the deck","Panakin","General Tojo!","when somebody opens r/sequelmemes on his phone:","Meesa wanna commit seppeku","An ideal movie night","The Best Prequels Character Tournament: ROUND ONE","[visible confusion]","Was in Scratch and added a palpatine gif and went to check how many costumes there were","My lord, is that legal?","When you say “do you know the way” in late August","what if the outskirts hadn't been that far:","An appropriate use of a black board in a lecture theatre","Found this on r/hearthstone","Surprised this hasn’t been done yet","multicoloritt","I Sense a plot to destroy the Jedi on my ticket.","You are a bold one.","When I want to make a meme but I'm too lazy for photoshop.","Teacher: I’m sure you all have found interesting and productive ways to use your new graphing calculators. Me:","i'm not very optimistic about their odds. (yipppeeee)","A welcome one...","Every HOI4 comment section at the moment","Dew it","I came up with a great name and password for the router at my apartment","Why am I like this","\"I have waited a long time for this moment, my little green friend.”","Your arms off!","I think I know what I need to execute.","Making Prequel references to kids born in 2006","Oh Disney","It’s treason then","Best friend works for UPS and I wasn’t home","Jar Jar's Long Lost Cousin","I have a bad feeling about this.","Part &amp; Parcel","The time has come... for me to have breakfast...","Oh my god","Truly wonderful, the mind of a child Is","I've been looking forward to this","When the teacher shows me my grade","Gets absolutely everywhere...","I blame the Jedi","Bad bot.","He did it the wrong way :(","I made my own trailer for RotS but in the style of the new Godzilla trailer.","When people say there are no memorable quotes from the prequels but they don’t realize who they’re talking to","I don’t think the system works.","You wanna play some media files? (credits to u/RanchRelaxo for original image)","Dave Filoni five years after Disney cancelled The Clone Wars","Thank you, Qui Gon","Upvoting and downvoting is now palpatine?","Another happy Lando","It's outrageous, it's unfair!","But does it have the high ground?","Now this is Podracing!!","When Disney says you have to pay for the new service to watch TCW","When I’m vague about whether I’m coming out tonight, mates start getting annoyed saying either you’re coming out or you’re not!","Ewan","Blast! This is why i hate flying.","This place has the high ground","Only a Disney employee deals in absolutes, I will do what I must.","When OT people try to tell you how cool Boba Fett is","A compatibility update can mean only one thing...","Doesn't this remind you of something","When you get a gf only using prequel quotes","A surprise to be sure but a wellcome one (AC loves the Prequels as much as we do)","When you want to watch a prequel but you're too lazy to get up and insert the disc.","Let’s sum up the lightsaber fights in one sentence!","What about the droid attack on the algorithm?","“WhAt ExAcTlY dId He MeAn By HiGh GrOuNd”","HOT WIZARDS FUCKING STRIPPING","Hes got the high ground guys what do I do","What about the EA attack on the fandom?","Oh anon","me When Anikan is 19 and Padme is 24 so it would be a legal relationship but the whole subreddit think otherwise.","D E W I T","It's not a story the dads would tell you.","Execute order 66","Can we make the sequels not canon please","Is there anyway we can have them fix this?","The bots are taking our jobs!","It's over, other companies! We have the higher ground!","Take a seat, Hearthstone player","When your parents sign you up for hard classes you don't want","Forgive us father for we have sinned (story in comments)","Found this on r/fakehistoryporn","You are on this council, but we do not grant you the rank of Butthead.","From r/Starwars","When you hear someone say Episode VII is the best Star Wars movie:","This is epic","Anakin does not want Hearthstone Fireside Gatherings at the beach","Not everyone can appreciate the politics, the world-building, or Jar Jar.","tuesday.png","When Palpatine Googles, \"who is the senate?\"","You better download this software","[OC] I made this last year but never realized how much of a masterpiece it is","Take a gif, young Skywalker.","HERESY!","When a post on r/prequelmemes doesn’t begin with „Hello There“","When your parents kick you out of the house at 18 years old...","I saw this on the Destiny 2 forsaken s trailer (R.I.P. Cayde)","Are you an angel?","So that's what Shu Mai was saying","Think about it both got separated their parent(s) at young age and had a shat with them when they died.","already done with “hot stripping girls”?","MRW I meet other fans","Found on Just Jedi Things on Facebook","Come on people","Pizza time","When someone says clone wars quotes will never be as memeable as the ones from the movies","Even a Bacteria can say it...","When you hear about some \"Hot stripping Girl\" but can't find the original posts anywhere.","A wild spinning sith. r/rainbow6","When rveryone is saying Solo is a prequel but there's no Senate or Obi-Wan in it.","HOT FUCKING JEDI STRIPPING","when someone says you make to many memes:","Lucas' original vision, but he couldn't get the rights","World Wars: Episode II","The perfect game","When your teacher gives you an assignment the first day of class","Starting out Freshman CS properly","Richard Nixon announcing the withdrawal of US troops from Vietnam, circa. 1973 (colorized)","This will make a fine addition to my collection...","Watch out Prequel Memers","When you want to make memes but you don't have photoshop","Bigshot gamer, putting together a ship","I Found the Perfect App","I had Chinese homework with power in it","UNLIMITED CONTENT!!!!","I suck at coming up with good titles","That's not exactly what I meant.","Ani? My goodness, you've grown!","spamming about spam lol","When I beat a kid at my school and my dad asks me the reason I beat him up and he agrees","I am brave enough for politics","I think we are leaking to r/cyberpunkthegame","I saw this on a Facebook feed, cannot find the maker sorry","He can’t do that! Shoot him... or something!","You're shorter than I expected","I believe this belongs here","Bored in U.S. Government","When someone reaches the front page with a misquoted meme.","General Tacobi!!","When you’re in your thirties, have no idea who Robbie Rotten is, but see the way the wind is blowing in the sub","WAC-47 was once the most devoted gaurdian of us all!","You're randomly browsing through the app store, when...","Southerners when they first talked about ending slavery","You've heard of Attack of the Cones, but what about...?","Very fun","When you're in the middle of a card game and your friend, Absolutes, wants to play","When you try to teach someone how to easily befriend another Star Wars fan but then your demonstration partner tells you they hate the prequels so your student gets cocky","When you see a hamster running around in a plastic ball.","A surprise to be sure but a welcome one.","When she secretly cut your rubber and you are about to nut:","When you make a subtle reference to the prequels on another sub but your people always come through.","How embarrassing *younglings laugh*","Prequel memers be like...","Remember this iconic scene ?","When the whiny kid you low key never liked, keeps bothering you about earning the rank of master","When quickly browsing Reddit on my phone","When L3-37 starts acting up","This war has been going on for too long now, but I do like memes....","He didn’t quite catch on","We have taken over r/Showerthoughts once more!","Look what I found","When you get clickbaited by the Hot girl fucking stripping spam","Um, what happened?","Oh I don't think so","When you put iron ore into a furnace","Google assistant knows whats better!","Unexpected Jedi mind trick (found on r/DankChristianMemes)","the dark side of the force is a pathway to many abilities some consider to be unnatural","Palpatine vs Mace Windu but its translated 100 times","Jedi have needs too","Me quoting Revenge of the Sith to my Google Assistant","The Ottomans","I get it isn’t a meme so tell me if it’s not allowed, but I saw it playing bingo and had to have it.","Into exile I must go","Credits are no good here, jedi.","TFW you accidentally stick a fork in the toaster.","“Oh I’m much too brave for politics”","It's treason","Now THIS is pod racing!","When the hot fucking girl stripping posts are all gone.","Meme: fixed","When you love bae, but she has her priorities straight","Me observing the state of this sub","There’s too many of them, what are we going to do?","A powerful Sith you will become. Henceforth, you shall be known as Dooku . . . Earl Dooku","Obviously","When you make a meme but it was your friend's idea and he wants credit for it.","Anakin with the sass","EVEN BETTER THAN HOT FUCKING GIRLS OR HOT FUCKING WIZARDS STRIPPING","I can't wait","HOT FUCKING DEATH STAR STRIPPING","It was impressive gameplay","He must be stopped!","When you hear kids in school talking about how they had a threesome","When a kid on youtube with only 16 subs tricked a subreddit of almost 700,000 members into making memes about him and his spam.","It's unfair, it's outrageous!","It's over","Deploy the garrison","The first thing I thought of when I saw my wristband.","I found the Palpatine grove at Sequoia National Park last weekend","This sub has yet again taken over another comment section.","Jedi: none","For the glory of the Republic!","Execute (get) 66 damage and WIN!","kill him,kill him now.","So if Anakin's nickname is Annie...","I don’t remember this in Toy Story"]