["/r/teenagers September Discover Monthly Playlist","Hero","It REalY dO Be LikE ThAT.","Let’s reminisce for a moment","My brother and I are gods at laser tag","Guess who has a class everyday with their Ex Girlfriend!","like seriously calm down","When you close all the tabs after finishing an essay.","Yeah grandma I’m doing great","Fuck her husband","stay calm","*being excited but tries to calm","Classic.","Top extreme sports","100% guaranteed to happen every time","Thanks a ton","This is probably the world record.","coming in hot","When you ask your classmates to actually help with the group project","Sorry y’all gotta scroll up now","Oww my back","YEET !","As a kid this was basically just gambling","D.va more like D.Friendzone","Ouchie","Since school started up I think it’s appropriate to post school related memes now","Aww","It's cool tho","Today feels incomplete🎂","This is what salt sees when you’re trying to pick some of it up","A girl said fuck you to me today.","So I was playing Mario Party and...","My school must not know what irony is...","When your parents find out you’re talking to a girl","a hero..","The only person who realised my true potential..","I’m in,","noooo","theres always that ONE guy that slacks off and does literally nothing","Mr. Zhou, all of the vsauce's are smarter than you, even vsauce 2!","mfw I realize there’s a possibility that someone in my school probably has seen my posts","Ka what?","I'm depressed again bois","Let’s see if it pays off for him","So a girl was pretending to be a cat...","A meeting of true intellectuals","Wanna see me do it again?","here's this","Not actually in, bois.","To Anyone Having a Bad Day, Here’s a Cake","No this is the world record (No Photoshop Totally legit)","\"i traveled outside the us this summer\"","Oh daddy","My school has been closed down bc of a power outage but we’re not allowed to leave. Guess I’m stuck here for the next 6 and a half hours.","My childhood was destroyed","Can we get an F for my man Z","When you post a picture of your food on your Instagram.","Is OUR child texting about COMMUNISM","Somebody needs to fucking chill.","When you see an I’m in Bois post and then realise that the other person is your twelve year old sister","Why the FUCK do people do this so often...?","Bois, im in.","How I think I look","Nahh, this right here has got to be the world record","I made this meme of my teacher and I’m very proud","Then she wants you to reload the dishwasher too","GIMMIE SUCC","You know what sucks?","A couple of days ago, I saw a post on here that reminded me of my friend Josh. This was his response when I sent it to him. He likes to browse Reddit so let's get this to the front page so he can discover it!","When you add your new friends on snapchat and the next day you look at their stories and they doin hard drugs","Weeks? Just need more coffee!","Today I spent 20 minutes trying to find an intersection point with two different x variables and then I realized there were two lines and I suck at math","Can we get a yikes in chat?","I'm out bois, had no Internet","Hot Take","I’m famous","when all the teacher does is go over the syllabus on the first day of school","Sometimes you need it","Ladies is this true?","Did someone say oof?","Memes","Can we talk about these ads tho","4.0 Gay Point Average","broke my finger when i tried to catch a football. how was your day?","A couple weeks ago, I told reddit about how I yeeted 1600 people on Instagram. I’ve now tweeted a total of 3,000 people. Dad are you proud","Stefán Karl is number 2","Stuck my hand into the bag... only to draw out 4 oranges because my sister refuses to eat orange things so she eats ALL OTHER FLAVORS and leaves these.","Fuck you that’s why","My meds look like a penis lmao","This is so deep. Alexa play Jocelyn Florez","I’m 18 and a half and I’m just discovering r/teenagers...","Lmao they made the car from pubg into a real thing","This picture of my dog looks so weeeeird","Im also lazy af","Howdy Howdy Howdy","Mom: so how was school today me:","I feel bad for my dog","iS ThIs lOsS?","My dogs gay","I need your guys’ opinions on something","An F for my freshman Instagram bio","THIS IS THE WORST DAY OF MY LIFE MY PERIOD JUST LEAKED ONTO MY SEAT IN MATH AND I MISSED A BUS OMG","S","I was cleaning my cousin's room today (don't ask) and found this handwritten note to him from a girl","Wait a minute","welcome back boys","Let's play a game called corrupt-a-wish... it goes like this:","This will be me in physics soon","*Good Title Asking for Help*","I try not to but it always ends up happening","Kinda stuck in a love triangle","Some one in my year has a youtube channel, him and his friends all in directed me. Two routes: fight them or act like i didn't see shit.","Why do I do this","I found this on a video I have to watch on my spanish class","I’m not sure if this is the right place but I needed to share my disappointment","Holy shit","Psst Psst","The only reason why I’m an optimist","Ackhyually","wassup","Pretty much every year","Do y’all smoke and should i smoke?","What makes a girl attractive? How to flirt?","this boy will be the death of me","I asked out my crush, we are going to meet on Friday in a park","We bouta have 720,000 subs lads","Old format but yeah","Life is going really well (this is a happy rant lol)!","first name thread","I'm in bois","Actually doing good in school?","About a girl...","The actual state of discord servers I’m in","“Just do pages 321-326”","feelsbadman","I finally understand why high schoolers hate freshmen","I really do waste my life on youtube","I feel better than I ever have","Just a lil shitty drawing I drew last year","Never make eye contact with the teacher","Interesting placement...","What a time to be alive","I Shouldn't Be Alive","Lemme fix your problems because I can’t fix mine","part two of “how do people make friends?” lol","The year 2018 has been the worst year in my life (yet)","When you don’t know how to make a meme","Toto Africa...","im a foool","Even though I’m a Teen, I am always described as having a “childlike- innocence” . My family usually thinks this.","im in school lmao","Just came out as BI to my mum.","Can we get #MattyBHasCrabs trending on twitter","Girls what are some signs/hints that you like us?","We go to school in style","Me hating myself for a few paragraphs","UPDATE: Okay i decided to message someone I fell out with","Please help","I am so fucking lazy","Recently on a sub I talked about some trippy videos I make, and how I’m embarrassed I was to post them. They encouraged me to so I’m seeing how fellow teens like my most recent one.","My sister left her edible gummies on the counter, should I eat one?","this is trueee!!","Make a wish and I’ll find fault in it","My fit for the first day","But mom????","At one point I was in bois","14 hours of summer homework","Power move","Girls, is an ice cream date a good idea?","Okay I decided to message the person who I fell out with","Is it weird for sophomores and freshmen to date?","Crush","warning!!!","I’m in boys! I was scared for a minute.","Embarrassing stories?","My best powermove so far.","What the hell??? It wasn't blocked last year.","Goodbye friends! I will truly miss you all.","My ex-crush mom...","Mom when you get home 5 minutes late","I feel scared for our future","my classmate said “fuck you”","Sad ni🅱️🅱️a hours whom tf up","How to cover a book","My dudes, I found it. Not to worry!","I had hope, unlike the rest.","Fuxing my social life","Back to this shit","i’m ugly and girls don’t like me","I’m kind of curious. Where does the average teenager fall, politics-wise?","The girl I asked out today said yes. I think YouTube is trying to tell me something","I girl I like just said I reminded her of Brendon Urie","I’m sad","The ugly truth (pun intended).","My school have been trying to get people to join the house choirs for ages and this is the best they’ve come up with","I called my crush cute and she said \"no u\"","Im so got dam","Any of yall play warframe?","Thanks reddit.","When you preorder Fallout 76 but have nobody to play with","Just got my drivers license","The final boss","Half a year on Reddit","When you laugh in front of your crush","Difference between “Baby cute” and fuckable?","Day two of school: this is no longer loss","I passed my driver’s test!","Is this subreddit always filled with dark and depressing stories or did i just join at a bad time?","Freshman of Bel Air - Parts 10, 11, 12, 13, 14, 15, 16: Cool Cids Club","Songs that give you chills?","Does anybody know what bug this is?","Banana man","Hi I wanna feel loved","I can't find my pencil I dropped in my bedroom today.","My life has improved so much during last year","When you get the OG seat in the back of the class and the teacher pulls out a pre-planned seating chart","Boys...","I'm in bois!","I don't know why but i relate to this image so much. big mood","My reputation on this sub?","OH NO!!!","What's the most embarrassing thing that has ever happened to you during school?","first day at school and i wanted to talk to this qt girl thats sits next to me but she just started sleeping","It really do be like that","What the heck are these","You already know it's happening","I don’t want to be alive","People with a super low view/upvote ratio be wishing that they were like me","Alright bois and grills I need some crush advice","There is no reason to be alive","been doing the same job for 30 years and it still happens every time","Me as a college freshman","I need to stop, but I can't.","is it just me","What kind of insomniac are y’all tonight","What were some \"obscure\" video games that you loved to play as a kid?","I miss the “Damn Daniel” meme","Aaaaaaa I regret being born","I have returned, the mods said that the Olive Oil meme wasn’t big enough to get its own flair! 😥","I just turned 15","Hate it when they do this","I can relate to this lmao","Different zones","When you copy off someone else but they're just as stupid as you","Our teacher is having us make memes in history class for a grade","I’m in boiz","Is a curfew for an 18 year old reasonable?","Can we agree that the Target back to school commercials are the most annoying shit ever?","we need more text posts","Apple music or Spotify?","I spent the whole summer memorizing the Lyrics of Yakko’s World.","They’re segregating our busses by gender now","2013-2015 childhood starterpack","Half the people on my snapchat","Not being lazy anymore :)","photoshop your pets","I don't know about you guys but if I acted half as bad as this kid growing up, I would be publicly executed","Can someone explain?","Contemplating on whether I should buy this wall tapestry or not. What do you guys think?","Paw patrol affect children and create furries","Crush just sent me \"good night💛\"","We In, Bois","I’m having an allergic reaction, entertain me please","How is it possible for posts to be coming in this slowly with 2400 users online","“Whats up cake?” said the muffin.","What clothes do I were in my first day in a new district (9th grade)!!","Need help w my friends","First day off school and i already have hw","what do","Yall deserve sum","Let’s share Spotify playlists","Does anyone recognize me?","Here’s an artist I’ve been listening to and a couple of there songs.","Egg","Who here used to play Paper Toss","Name that means snow drop?","Managed to stay happy all summer but lost it in the last week","I'll draw anything you want","Does anyone else say Oof when they're talking to someone about something serious because they can't find anything else to say?","I’m at freshman orientation","Yeah sex is cool but have you ever gotten a hug when you really needed it","Initiated a convo with someone I don't know","Is it normal to be overwhelmed about classes on the second day of classes in college?","Should I go play basketball ?","He is NOT!!! 100% goodboy! (I posted this but forgot a flair so here’s the repost)","made a simple app that combines all your messengers into 1","X-Post from r/thanosdidnothingwrong, related too heavily.","Anyone else kinda wish they were born in the late 70's so they'd be a teen in the mid 90's?","Guys and girls, I need you're help fam","So apparently something I wrote went viral??","What's your aesthetic?","Teenager Analyzes Diss Tracks on YouTube","When you get a seat in class next to your homie then the teacher wips out the seating chart","The only way","Music for when it’s not a phase, mom","You guys know me?","Telemarketer scam","so todays been a weird day for the sub","I faceplanted going down the stairs in front of my crush","Your dude got beef with a 30 year old","When she admits that during the whole 8-month relationship she never really loved you back","High School irl","I’m in that weird end of summer funk, any advice?","I know I’ve said it a lot but I really want a fucking girl to just be with and cuddle :c","Just wanted to hype you guys up if you are having a bad day :)","This is the answer you give teachers when you lie that you understand the question","Guess what bois","Does anyone recognize me","Hell Yeah","This is a thing that people do right..?","Can someone explain the whole chelsea/niamh story","Didn't even know what hit em","What's y'all favourite video games?","it's a new school year :)","Feelsgoodman","She really did it. She’s really gone.","If moral wasn't an issue","Made me smile 😊","Fml","anyone wanna make a homework deal?","Any good-natured Netflix shows you like ?","what app/software do you guys use for music?","Mr Jansen appreciation thread","How to Adblock IRL?","My math teacher agreed to let us play Kahoot tomorrow and I have a plugin that floods the game with bots, should I do it?","Final exams be like","Sad hours","remember this?","Practicing German","Are we allowed to recommend music to each other?","good ol days","[vent] i feel useless and crap","who sexually aroused hit the like button","New School = New People = Still Lonely","My parents pretty much take all of my electronics at night and the only thing i have is the smart tv remote (which is in the basement). There’s also a computer (in the basement) but they put a password on it that I don’t know.","So theres this girl....","found out that the girl i like has a crush on two guys...","Hate when i cant do karate in the house","Direct hit 🎯","UPDATE to my other post. The football players have to send this for the fundraiser","I just failed my driving test and I feel miserable","I fucking missed the first day of class","IDK if this was posted here yet. Thought everyone could relate","saw something interesting today","I’m so tired","Get ready bois","Who wants to chat?","im terrified of getting in bois","The story of my life...","Seething with anger","I wanna fix peoples problems","Anyone else miss Teletoon Retro?","Does anyone actually like fortnite and play it?","Why do most of my thoughts come out before sleeping?","who the fuck following me?","What do you do to relax?","i have a proposition for you guys","Wtf Reddit?","When your brother a artist and you ask him to draw you, 10 minutes later he sends you this...","I’m in bois!","We all do this","yikes","First day of school, dont know anyone in my class, not good at talking to new people, rip me","Homecoming is in 3 weeks rip","All my shorts are too small, about to go to an event","Me: Why don't I have any friends? Also me:","Eminem vs Kanye West","Old people shouldn't have dirvers licences","When some edgy kid tells you to listen to his “fire” mixtape on soundcloud","Gimme recommendations for movies to watch on Netflix","A couple of guys from my school did a presentation on reddit for my business class, thought I'd post here for 2 upvotes","What phone do you guys recommend for a teenager?","I need motivation I’m going to sleep and I want to ask out my crush tomorrow pls help Bois and Girls","HELP ME WRITE A SHITTY MYTH","How should I make money?","An audience of 7 billion+ people","Guess I’m dying soon lol","Woohooo its my cake day","This goes for like all of us right?","When the Reddit app just updated but it’s still buggy af and crashes","My girlfriend went to college and now I’m singing songs about it☹️","What are your thoughts on how many hours of video games a kid should be allowed to play a day Unlimited, an hour two?","What good apps are there? (Google play store)","Anyone feel like they’re wasting their best years?","This happened a while back and I want to do it again but I don’t think I can","Does anyone have a BookRags account?","when you find out...","Is there a pic which can arouse your combativeness?","What is the definition of your name on urban dictionary?","Best way to ask a girl to a dance without it being awkward?","We all have that one teacher that gets off topic easily so everyone tries to distract him without him/her realizing","Me when my crush says “why can’t i never find a boy like you” :(","Friendship goals","I just said the last thing in a group chat. Fuck.","About to give blood at school","Tips : Motivation to work","I don't know what to do","When your meat is begging for mercy because you’ve beat it 12 times today but you just popped a half chub at a mildly arousing image at 3 AM","Im fucked bois","Ah fuck I turned 20 and forgot to leave","When you procrastinated all of your summer assignments and realized you have 3 days before school starts","whats my reputation 'round these parts?","Ugh i just sent an apology message to people i fell out with in middle school","This boi","Period 6 of a Friday","My mom and her boyfriend are hosting a dinner party for the grandson of Isreal's first Prime Minister!","What's everyone up to today? Any plans?","My keyboard broke","What I don't get is how one of the most annoying and cringiest people in my school has a girlfriend","when your sex bot says \"you don't abuse her like the other guys\" but you have to return her since her anal port is congested af.","I’m in a rough situation","this is me","Can any of you actually see yourself sleeping in the same bed as your partner/future partner","Whats up with teenagers being insecure?","For anyone that knows Guitar, did you self-teach?","Is it a good idea to switch schools as a sophomore?","its a real worry","This girl","I just showed up for a class two hours early...","Bois, I’m in","One more week bois","I'M IN BOYS","Help me","Me","I missed my cake day by 9 days","that really how it be","Can I get an invite to a discord where I can talk about anything","Matchmaker Chronicles: Part 2","First day in 4 hours","I think I'm pergnant!","Some gay dude has a crush on me","Guys this site is so accurate","We Call You People Normies..","mmmmmmmmmmmmmmmmm","How do you get followers on Reddit?","I have 1000 karma why do I still get this","I don’t want to see them","I want to ask my crush out but there is nothing to do in city I live in","“How are you feeling after the break?”","A 30 minute unrehearsed video about the original six Bionicles and their iterations","I'm a 17 year old who's going into his senior year of highschool.","I wish i had ride or dies","Dang I just realized I'm having a lot of social issues","F","Dr Pepper Advice Corner ™","About Selfie Threads","What has given you guys the warm fuzzies?","i'm starting a cult","I'm confused","A friendly reminder","Goodbye, my friends. It's time for me to leave this","The most popular first pieces to move seem to be the pawn and knight.","Help me bois","Why does everyone hate me?","Make strawpolls so we can vote on stuff ill start","I have fallen, brothers","ok so this nigga talks mad shit about me and he acts so tough but when i confront him he pussies up and tries to ignore me. the fuck nigga?","I want to go to homecoming but all my female friends are taken, should I ask some random girl who I think is cute or just wait until next year?","Cribblin depression","First post on reddit","Does anyone else feel like they don’t have a right to be upset?","This girl is adorable","How do I make friends in college","I feel good","Yep that’s my parent. My super supportive and loving parent.","I have two main things that stress me out in life","Should I bring my backpack for the first day","So I just discovered Bring Me The Horizon","I just can’t :(","Lol, oh, ok, same, oof, yeah","Every single time","most relatable skateboarding video i have ever seen","Pictured: Dankmemes2016 describing other users of r/teenagers","Another drawing post. I'll draw anything as long as it's not extremely complex.","Who els is sad","The mitochondria is the power house of the cell","Homework is bringing me down","LPT: When your parents ask you what you learned in school reply with a Today I Learned post.","I've been corrupt by dead trends","wtf was i laughing at this?","me when i see anything anime related","Does anyone else wanna know what happens when we die?","100th day was yesterday and I didn’t even realize","Who is Niamh?","Hi I'm just going to rant for a bit before I sleep","Barely","Life Advice That I Learned","What is the guy/girl proportion around here?","IM IN BOIIISSSS","Tribute to Stefán Karl Stefánsson","give me advice on my first album!","I was excited to eat these Gobstoppers when I notice there is only 2/3 in the bag. This has been my life for the past 2 months.","One week ago today…","\"What do you want to be when you grow up?\"","anybody else never receive physical affection","Please Help With My Social Skills","what do u people think","Hey, as a male in his senior year in high school, I would like to ask my fellow teenagers for some serious answers to the following question:","Second date with my crush, she’s coming over to watch the sunset.","The yearbook people put this up","Thought this would fit in perfectly here","Shoutout to anyone born in 1997-2004","oof","[Repost cause i forgot to flair reeee] Something about school that I need to fucking get off my chest","To all of the teenagers with hard lives out there","just kill me guys","Do any of you hip teens know what this is...","I just spraypainted my hair in blue.","A wanna do a podcast as a hobby","Is it gay if I make out with a f2m dude","Question on a crush.","Selfie thread","I'm at my girlfriend's house and we're home alone, and you know what were gonna do?","My Math Level is literally on par with a 3rd Grader","it has good humor, good moral and a cameo from the \"mask off\" fedora dude","MEGA O O F","Hakuna Matata","It’s Going To Be A Rough Year.","Oof","Why my room","IM TRYING TO GO TO BED AND IM GETTING THESE UNCOMFORTABLE FEELINGS IN MY LEGS WHERE I HAVE TO MOVE THEM HELP WHAT IS THIS","Depresso Thread-o","Fortnite needs to stop","Its 4 a.m. and im bored","Hey","I'm definitely in, bois","The State of YouTube Trending","A bit too accurate","......","Uhhhhhhh...","this is what my dad wrote on those sheets to the teacher, im dead","keep ur 3rd brain open","Rude","Test","Buzzfeed is cancer","Anyone else watch Fantano?","Seriously?","There’s less than a week until school and I have mixed feelings (big rant)","Which is the best hiphop album to listen when the sad boi hours come?","OK THIS IS EPIC","Any teens do nofap?","Just wondering","I’m sure everyone knows why these are trending lmfao","F in chat for everybody that starts school today","Excuse me as I fucking nut","Oops","Help for a friend","petition to change pinocchio to elongated noseman","A girl came into work the other day with a t-shirt that said \"under the influence... of god\". I've been thinking about that a whole lot.","People always have the most to say as soon as you stop talking to them","ITS MY REDDIT CAKE DAY","rant abt life and “friends”","Earthquake","Guys help, I have a problem.","senior here, still struggling when it comes to meeting new people and generally socializing with people that i wouldn’t consider close friends. Help plz?","When you wake up actually feeling good, and you remember the homework you were assigned yesterday","Why is talking to people so hard","Are the camera men in surfs up penguins or people","Kermit doesn’t give a damn","IM IN BOIS!","Has anyone else felt like high school has taken the joy and happiness out of everything.","Low key like it when memes aren’t allowed, it feels like I can connect a lot more.","Miss me with that","I was put in AP gov and I did’t sign a form","Should I wear this thing to school on the first day?","I just drank 4 sodas and a monster","My friend was sad...","Anyone wanna join my PictoChat group?","Scored Goal for My Varsity Highschool team.","How do you suprise people?","OwO","Real Back to School Starter Pack","i just lost $11","so we can communicate with spaceships out in space but I can't find a signal in my fucking bathroom","Me everyday","mmm. toast","Just had my first day of school","Coming out of my cage","I'm in a bit of a pickle bois","Its 3am. Give me good vibes so o can fall asleep","Woke up at 6am with blood pouring from my nose","Why","The true sight that school is back...","MY EP IS OUT TODAY!!!","Let’s talk music: top 5 favorite songs and why","I wasn't stupid enough to put my main email down on my PSAT/SAT/ACT... but for those who did, this is for you.","I got a problem","Got my driving test today","For all of you struggling with math, i gotchu","What is your schools, or specific teachers, punishment for being caught with or doing drugs?","At the beginning of the summer I had 35 songs downloaded, and now I have a music taste.","School starts tomorrow(technically today) and I’m still awake","Views to UpVotes...later virgins","I want to make an online friend around my age.","School starts in 2hrs","When your mom asks if you’re ready to move into college in two days","Asking for an advice","Daily Selfie Thread!","Why I’m always late to school","I did it bois","Yo, the google assistant might have a crush in me🤔","Room thread","Deadly drugs according to my Grandma","i lost a friend again","Time to sleep bois! Love you all so much! ❤️(y’all mfs better be saying some nice ass shit)","I'm A freshman","Daily chat thread💕","My thought about buzzfeed","True storyish","My Spanish Class is Having me Learn Interesting words","Im never fucking happy anymore","I finally got rid of my Reddit reader and got the official app","Hey how are you","Good news! /Update on 2 old posts/","Parents","If you could give only three pieces of advice to an incoming high school freshman...","Asked out a girl and thought I was in until i got this text","Can I get an “Amen” for high metabolism?","Daily song recommendation (v2.0). Day 2","I am so stupid","When she has read receipts on but you got left on delivered","Anyone want to start doing a podcast with me","If you know,you know","walked into bathroom at a restuarant and man they got me good","When the teacher says that the class has to say quiet for a minute in order to leave but the annoying kid yells “EVERYONE SHUT UP” 10 seconds in","hi im making walnut brownies","Damn! Missed out on the best courses","Never realized how many strawberries I ate","Sooooooo my brother had this and never told me 😤","Whats stressing you out?","Current favourite band?","Somebody caption this.","It really be like that","Honey Boo-Boo's Family Celebrates Her 13th Birthday: You're 'a Wonderful Human Being' (Yep, HBB is now one of us!)","Talking to people period is just hard in general....","Teachers after taking attendance on the first day of school be like","I need help! I've procrastinated too much ;-;","The fuck is with people on imgur??","Ladies","Hell yea, recognition from an AI","What's your favourite comedian right now?","Petition to take Buzzfeed out of the internet","What is the most common illegal shit's in my age at your school ?","Guys I'm about to cry","howdy partner","I TALKED TO MY NEW CRUSH FOR OVER 5 SECONDS TODAY!!!!!!!!!!","Boycott pretty scale","Waste of everyone’s time","I have determined the life cycle of memes on reddit","What makes you unique/special?","I just realized that the difference between what i can calf raise and what I can squat is only 10 lbs","Buzfeed said that stefan karl stefanson is number two, sign now.","Help, what do I draw?","WhY aRe ThErE tOiLeTs In ThE JuUl RoOm","I saw the most beautiful dress today","How many good friends do you guys have?","Life’s a bitch, but you’re not life’s bitch.","I’m in boys?","when you have something in common &lt;3","15M looking for a real conversation","I’m a freak and I think others think I am as well.","Weird quirks","this just happened on the discord","Don’t think I’ve ever felt worse than I do rn ngl","This time I was trying to improve the body of my characters, a la domics, any pointers? (Sry I’ll try not to spam my drawings)","Have you guys seen the symbols under the cube? What do you think they mean?","Back to School Savings Special!","When you can’t say no...","OMG BOIS IM IN","do you think its time for another crusade","Do you snap and use finger guns?","Girl laugh at me don't know why","When my math teacher starts talking about the \"right\" way to do a math problem","I think this prettyscale.com BS is toxic","Well what do I say to her tomorrow","HEY","What does it mean when someone sends your a streak randomly.","oof it really do be like that sometimes","im probably gonna make a dope-ass merch brand","Everybody make a wish in the comments and I will find a fault in them","this is my sweetener appreciation thread","Am I considired in.. bois ?","“One kid once did this and broke his neck/cracked his head open”","has anyone else literally not taken a picture of themselves in over a year","are you winning, son?","How do you friend?","Does anyone have any advice or strategies for making money?","i didnt remember high school being this homophobic","When did/will school start for you?","Why you do this to my pidgin friend","How to start talking to a crush that I dont know anything about?","Quotes or memes?","How to avoid going out of town this weekend?","Pretty Bad Day","why","Me: I’m going to have a chill senior year Also me, someone with poor time management: Let’s take 5 classes this semester and 6 next semester!","What the frick is homecoming?","First day of school","My \"Friends\" Have Been Pressuring Me To Talk About Sex.","Old style meme i regret having laughed at","tumblr in a nutshell","Where are y’all from?","vent about shit","I feel like I’ve regressed in my ability to do schoolwork","I (17F) have mental health struggles and therapy?","Ya boi is getting a fresh cut tomorrow","Gifted people here, what has been your experience at school?","Am I screwed?","My legs don't work like they used to before","Pretty much sums up the start of school","WhO kNeW mY LiFe CouLd bE OC?","I swear some people in sports are so homophobic but the gayest shit happends in the locker room","Are we still posting these?","How do I tell if I’m close enough to someone to just initiate conversations out of no where (text)","Why do I find it so hard to ask my mates to hang out?","Can i set Reddit to automatically sort by new?","So the teacher said to work in groups and so I got excited to work with my friends","fuuucccckkkk","My Stupidity","Uncircumcised teenagers of Reddit, how old were you when you could first retract your foreskin?","Get him gold","Don't be a cocky little shit. It'll catch up to you.","turned 17 today bois","I’m in love with my best friend I need help","Who wants to PM about shit","My fucked up last 6 years.","How do I get to know someone that I don’t have any classes with? [15M]","The new Reddit Mobile logo is actually disgusting","Back to school everybody","Apparently this is pretty","Blue oyster cult is god-tier","screw you guys hehehee","Tahitian Treat advice thread?","Guys please help, my parents just got much more strict in a matter of 15 minutes.","Because of course","it just do be like that","My gf wants to go to the movies and see a movie I already saw. What do I do?","Hmmm what am I feeling today","back to school everybody","Music recommendation please","Why is it important for ice to melt in isopropyl alcohol faster that water?","Who’s the worst teacher you’ve ever had?","Is chew a big thing at anybody else’s school?","What are you bogles listening to right now?","I BOMBED MY APUSH QUIZ","Adults think AirPods are ugly? What are your thoughts (straw poll)","Im in bois","I’m back","We love you!","Honestly saying “no” to getting asked out by a cute girl is kinda like an alpha feeling.","Guys I fucked up","He’s beautiful on the inside...","i cant fucking do this","Does anyone else’s school have this?","I’m honestly starting to worry about u/mahalofam","When someone tells me that I need to make friends at the start of high school","How long do graphing calculators last before I have to charge it","What are are y’all doin?","Old logo looked better, change my mind","Does you school use StudentVue? Then check out Academus.","Dinner with guests","I got another question about MUSIC if you can believe that","new year new me","When you've got a long-ass packet of problems and find the answers online😍","Remember the days when you would think herobrine was real? Damn good times.","I'm a fly guy and I'm ready to die","yo quick question","Thread game","Former teenager desperately needs current teens to tell me how teens think about watches","Every damn time..","mrw when i look at random people’s post history and find some deep shit","Comment your favourite song/album below 👇","Later virgins","Did anyone else used to listen to \"Kiss Me\" by Sixpence none the richer on their ipod in the car and imagine dancing with their crush","MRW when I post to multiple threads and still have no notifications an hour later","Advice thread but I’ll only respond to you in emojis","Just finished my first XC meet","I’m in a group chat with over 300 people.","Why did so many people keep their HS Gf/Bf even though one of them went away for college?","Why don’t people wash their hands after they pee?","Fuck my school district","I want to get a part time job...","Why isnt there a r/teenagers chat room","In your experience, have people become more selective in responding to Snapchats?","Don’t give up guys","Basically the irl equivalent of downloading an app to give you free likes","The good ol' days (r/dankmemes x-post)","I got rejected today and I need someone to talk to","Even the hound felt inclined to post a first day of school photo online.","Dear mcdonald.","Fast food isn’t as bad as it seems","Ask me a question and I'll answer it. Then edit it to made me look like a creep","This is a pretty good song, thats all, have a good day :)","Back to school in 8.5 hours","Don't you dare feel emotions!","Ya boy just dropped physics","Anyone else stressing about homecoming?","Me when I see a \"We're in Boys\" post","I sexted a guy and now he’s lowkey avoiding me.","How are you? Y’all are great!","Why do I look good in a mirror and shit through a camera 🤔","OOF (I knew it would say this, TBH)","My close friend is mad at me","Crush rant","Im proud","I just went to my crush's house to study ( ͡° ͜ʖ ͡°)","I love this girl sm but we don't talk much anymore. Rip","Dancing Skulls","For those who want to see the new mobile logo","I'll take that","Can anyone explain how a crush feels?","Smart people, pls help with my mac","Ahhh i didnt win the giveaway","Little insulted but knew it was coming :)","I procrastinated on a book report until the very night before it was due","Day out with one of my girl friends","Me: Tells a joke to my parents","Anyone else get super nostalgic looking at this?","How do you get started on work?","Got 24% on my first go, but ya boi aint taking that for an answer","Just leaving this here...","pls to help","I've done it bois.","Lmao woops","Saw this headline and had to share","I don't want to grow up","I go to an all girls school","If u have reading every year and u know how to read and answer questions how long will they drag out reading/English class","Something just spooked me","This sub in a shellnut","Goteem, dead meme but still","sneaky bastard got me","Anybody play Overwatch?","It’s my 17th birthday today!","Guys im leaving.","Since we call Freshman frosh we should call French people fronch","Group chat","my sister managed to drop a guy and get a girlfriend in the same week","The pretty scale isn’t probably a healthy thing to do tbh","School has burned me out.","Who needs sleep anyways?","When you get 40 algebra questions, 20 history problems, two quizzes, a test, three essays and an oral presentation due the next day.","Can I wear this shirt to school?","I've never been more self reflective","You guys want to play some Club Penguin","Am I just boring?","McDonald’s WiFi","Ain’t that swell.","#prayforgray","How do I get an annoying fuck out of my life","Just a thought","nice.","Should I use Sparknotes or read my book","OMG SEE YOU MORTALS LATER IMA BOUT TO SEE MY BROTHER JESUS","Had this conversation with my friend on WhatsApp and am still confused","would u touch dog poo for 10 dollers","When is it appropriate to say","I mean no girl thinks it but at least this bot thinks im hot😂😂","Kahoot. Join","Wow thanks a lot.","HELP ME FIND A BOOK FROM MY CHILDHOOD PT. 2","Y’all like music?","Unironically listening to Harry styles","hey i’m trying not to self harm rn (tw)","Now I just gotta get an endearing personality then Im In Bois","I think I might be in, bois","Well that would be why images are broken","Music Recommendations?","You could day I'm something of an artist","Its my cake day!","Tbh this is my life rn","Imma leave this sub for a bit if any of you care","Every damn time.","What's your dream car?","OOF","Where are my XC boys at?","Can you guys speak german","Pretty much every day","i took my first college class today","Hola, espero perdonen el español, pero esperaba que me pudieran ayudar con esto...","When the teacher mentions college and how we all know what we want...","OTHER: BUZZFEED IS DISHONORING OUR NUMBER ONE AND IS TRYING TO STOP LAZYTOWN / STE&lt;F&gt;AN KARL MEMES LETS TAKE ACTION BOIS !","What’s your favourite activity when out with friends?","when i think i can get away with studying the night before","When a freshmen asks you for directions but you ate an edible before school and you don't know the way either","This girl stopped snapping me for a long time and just last week we started snapping again.","I’M DONE","Basically everyone on this sub","heH","PLZ HELP","Lyrics Thread","Who’s ready to go back to school?","Ask/Tell me anything part ELEVEN (sorry for abandoning yall on part 10)","new here 💯🔥😏✌what i do","Take a moment to admire this handsome mf. Yes ladies he’s single","It be like that though...","I remember the horrors","When your homie starts dating the girl you’ve been low key crushing on for the past week so you just gotta be happy for them.","I feel like I’m a burden when I send my writing to people","My friends talk risky","Jokes on you, my school doesn’t start until September!","im no artist but i make these","I'm becoming an alcoholic...","Headphones are dangerous","f","Midget_soup","I can't deal with math anymore","vaccines","What is the general rule for dating your friend's ex?","Starting school soon any advice?","Real Supple Root Hours #16","Grounded for several months... what now???","How to properly slide into a girl that idk’s dm’s.","How do I get girls to like me?","Sad days","I Have No Idea What To Do In This Situation","***","Seems accurate to me","Bruh this is how much they what me to study","i have a little calc and history shit. motivate me to do it. please?","Im out bois.","Fuck this shit","Alexa, this is so sad","I’m on the school bus and","well it's that time","I look exactly like a goblin","dont watch me mop up my sweaty pits in public","Good names for chickens.","GODDD why do I suck so bad???","Teen Truth","if you’re reading this","I know were a community and all but y'all never upvote even when u enjoyed something","Reddit teenagers chat room","How to be good at learning?","Re🅱ember?","I see everyone dying at college and shit and I'm here starting at january 8 😎","shhh dont tell him","Can’t decide which country to study abroad. Alright to mass snap this?","When you try your best but you don't succeed Compilation","Will someone help me find the dj khaled triggered meme","How do you convert anger to something non-negative?","Depresso Thread-o: Afternoon Special","I thought this thing was funny.","We're in boys","Goteem","Why my life gotta be like this every night","im in bois","That one person","Schools","Bout' to land on reddit😎 still, I need your help peeps","I’m in bois.","I turned 15 today!","What y'all listening to?","Best advice to make friends and be more outgoing?","Fucking f bois","I knew Niamh O’Sulllivan irl","Hotel? Travago.","This is so sad. Alexa play despacito","#OOF","Update: I didn’t need to wake up at 5:10 because practice is actually at 6:30, not 6","why does my peepee hurt when i pee","Based on a true story (reposted with flair)","Goodbye Losers","Spicy.","Rant.","The teenage hermit","&lt;0/ I tried to be original but I couldn't think of anything else that worked \\0&gt;","Extra week of summer","How many hours of sleep do you get everyday?","Man funnily enough I prefer my days with my AP classes","Click this post if you exist","My depression is sneaking back at me after starting at a new school","2% to 69","Issa gud day","When you finally work up the courage to confess to your crush of several years and she replies with:","Excuse me WTF","I have a 6 day weekend","Kahoot","Ha wow so update on last night's post","Smh these teachers😤","Can someone explain why my self esteem can just like cease to exist?","Pray for me"]