["[Official] General Discussion Thread - August 29, 2018","Regular Conor vs. Khabib &amp; UFC 229 Discussion Thread","Sergio Pettis looks pleasantly surprised to see his arm raised against Joseph Benavidez","[Image/GIF] Max Holloway switches stances and rips two hooks to the body of Cub Swanson","Francis Ngannou takes Alistair Overeem’s soul with a brutal uppercut at UFC 218","Colby Covington talks Tyron Woodley vs. Darren Till matchup at UFC 228: 'I don't know who's going to win but I do know who's going to lose, and that's the fans'","Kevin Lee says $100k jiu-jitsu match with Dillon Danis in works","Dan Henderson earns a free flight courtesy of DC Airlines","JRE MMA Show #39 with Donald \"Cowboy\" Cerrone","It looks like Woodley and Weidman are holding hands in this advertisement","Paulo Thiago knocks out Josh Koscheck","Chuck Liddell vs. Tito Ortiz 3 will take place Nov. 24 at The Forum in Inglewood, California, per Oscar De La Hoya. Includes comments from De La Hoya on why he's getting into MMA and why he feels this third fight should happen.","Darren Till would fight Kamaru Usman, but understands ‘safe champion’ Tyron Woodley’s logic","Less than 2 weeks until I am on national television at LFA 48 against a top ranked professional welterweight. Thanks for the support thus far!","Cowboy Cerrone on Jackson/Wink head wrestling coach.","Al Iaquinta with some comments towards Justin Gaethje. Ends it by saying \"and I'm fighting Kevin Lee.\"","Tito Ortiz admits he’s getting paid for Chuck Liddell trilogy","Antonio Carlos Jr vs Elias Theodorou rebooked for UFC 231","Tonya Evinger moved to UFC 229 to face Aspen Ladd","Cláudia Gadelha's 1st round finish of Karolina Kowalkiewicz","Desmond Green confirms he will still be fighting Mairbek Taisumov at UFC Moscow","Anthony Pettis with a filthy sweep against Dustin Poirier","Khalil Rountree vs Johnny Walker and Veronica Macedo vs Maryna Moroz in the works for UFC Argentina on November 17","Frank Mir teases fight announcement","Eryk Anders unsatisfied with 'C-minus, B-plus' performance at UFC Lincoln: 'I definitely took more damage in that fight than any other fight. I’m not too happy about that'","Gastelum drops Weidman with a clean left straight","November 17th, 2012: Georges St-Pierre defends the Welterweight title against Carlos Condit in a five-round classic at UFC 152.","Daniel Cormier still plans defending UFC Light Heavyweight title before fighting Brock Lesnar","Jason High misses weight for PFL 7 vs. Johnny Case, who qualifies for playoffs after cancellation","Nick Denis slams nick mamalis into the underworld, meets Hades.","Karolina Kowalkiewicz: \"I think this fight against Jessica Andrade will be a title eliminator\"","Bethe Correia eye surgery forced to turn down Toyna Evinger fight","Shogun Rua finishes Rampage Jackson via Soccer Kicks (Ref's point of view)","Jessica Eye vs. Sijara Eubanks is in the works for UFC 232 on 12/29 in Vegas.","365 DAYS #225: Ken Shamrock gets chewed up by Pedro Rizzo","Epic montage of Zabit in training 💪😤","The Korean Zombie sweeps Jose Aldo after missing a flying knee","Chael Sonnen: Tyron Woodley is the most misinterpreted fighter in the UFC...","Randy 'The Zohan' Costa's brutal 11 second head kick KO at New England Regional show","Bellator are reportedly returning to Dublin, Ireland in December","Joanna Jedrzejczyk teaches girls from the \"Ladies Fight Night\" organization","Report: Charles Oliveira vs. Christos Giagos added to UFC Sao Paulo","[Spoiler] Crimea Rush: Referee with good takedown defense","Do you guys think he 100% meant everything stated in this video?","Sinead Kavanagh vs. Janay Harding set for Bellator 207","Chase Sherman vs. Augusto Sakai Targeted For UFC FN 137: Sao Paulo","Throwback: Matt Serra wins the UFC title after finishing GSP","Rafael Lovato and Wanderlei helping each other prepare for their upcoming fights.","Lyoto Machida retires Vitor Belfort with a brutal front kick at UFC 224","MMA icons Liddell, Ortiz to fight again Nov. 24","UFC's 28th TUF season premiers tonight on FS1: Team Whittaker vs Team Gastelum","PFL takes aim at UFC","8 years ago today, Dana White made his phone # public and took calls from fans","4 reasons to watch PFL 7 with final chances to make playoffs","What's the dumbest MMA related idea/hype/theory that you've ever bought into (at some point)?","Don't Underestimate Anthony Pettis Changes vs. Tony Ferguson at UFC 229","Cousin Omar Nurmagomedov's Fancy Feet","Renato Moicano || Breakdown &amp; Skill Study (Brendan Dorman)","Perpetually busy Sean O’Connell ready for more multitasking at PFL 7","After surviving multiple knockdowns, Frankie Edgar smashes Gray Maynard at UFC 136, closing the door on one of the most epic trilogies in MMA history","UFC Lincoln medical suspensions: Five fighters potentially out six months","Reason why Ortiz Vs Liddell Shouldn't happen: Tito Ortiz explains training","Brian Foster and Ramsey Nijem are withdrawn from the PFL playoffs","After getting beaten up and brutalized by Melvin Manhoef, including taking some of the most vicious leg kicks I've ever seen, Robbie Lawler uncorks a brutal shot to turn Manhoef's lights out","Daily Debate results: Where should Rory MacDonald rank P4P if he beats Gegard Mousasi?","Gaethje vs Vick &amp; other lunacy in Lincoln (Heavy Hands #226)","Lineker wants some action","Diego Sanchez comments on Cowboy's comments about Jackson's","Conor McGregor: Fuck the Mayweathers, except Senior and Roger. There is no peace here kid. Step up or step down.","Brandon Davis vs. Zabit Magomedsharipov in the works for UFC 228","Podcast Interview with UFC's Marlon Moraes","Anthony Pettis wants UFC to respect his brother Sergio - ‘It’s offensive to see him on the undercard’","[Image/GIF] Douglas Lima just landing one of his many brutal leg kicks on Rory MacDonald","[Image/GIF] Edson Barboza scores arguably the most spectacular KO in UFC history over Terry Etim (this is my first time seeing the live sequence from this angle)","Thug Rose ends Joanna Jedrzejczyk reign as Strawweight Champion at UFC 217","Dan \"Hangman\" Hooker TKOs HW via Soccer Kick + tagteam fundraiser","Renato Moicano has a YouTube channel on which he documented his preparation for UFC 227. Definitely worth watching!","AKA is a crazy gym, DC taking wrestling class' while both Khabib and Rockhold drob by...","Should I go to university to simply pursue my mma career?","Anderson Silva invites Stephan Bonnar to give it another go","PFL help/explanation?","UFC bantamweight Cody Stamann here checking in before UFC 228. Ask me anything!","Bendo drops Nate Diaz in their rather one-sided title fight","Floyd Mayweather Invites Conor McGregor To Mayweather Gym Ahead Of Khabib Fight","Ranking The Top 10 Wrestlers In MMA: A FloCombat &amp; FloWrestling Collab","Javier Mendez: There’s ‘no way possible’ to ready Khabib Nurmagomedov for Conor McGregor’s striking","[Video] A study of Khabib's failed takedown attempts","\"Go get some Donald Cerrone!!\"","Anthony Johnson destroys Antonio Rogerio Nogueira with a series of uppercuts against the fence.","Geek for Technique: Best Moves at UFC Fight Night 135","Yair Rodriguez destroys Andre Fili","Nate Diaz's speed and striking vs Michael Johnson. Underrated speed.","Ahead of her UFC WFW title fight with Cyborg, here's Amanda Nunes flattening current Bellator WFW champion Julia Budd in Strikeforce.","With Ortega rebooked for UFC title fight, Moicano calls for Aldo","Kai Kara-France shows his skills with a 9 Second TKO","Rockhold has returned to AKA to help train the LW champ.","Why is Cain brought up so much in HW arguments?","Daniel Cormier still open to defending his title at LHW: \"For me to go back down, it's going to be difficult but I plan on doing it.\"","Strawweight Carla Esparza fights a powerlifter","RIZIN.13 [Discussion] Andy Nguyen vs Miyuu Yamamoto 49.0kg / 108.0lbs 5 minutes x 3 rounds","What makes a 'legitimate heavyweight'?","Antonio Carlos Jr. Injured and Out of UFC Sao Paulo","Khalil Rountree Has a Fight, Announcement Coming Soon.","In throes of weight cut, UFC 228's Darren Till plans a future at 185 pounds","After wobbling him with a jab, overhand right, Alhassan steps in with an uppercut that puts Homasi to sleep.","Featherweight Brandon Davis Says He is Fighting at UFC 228 (It's Probably Zabit)","Vagner Rocha mouth cover submission: what do you think of it?","365 DAYS #224: Hidehiko Yoshida's leg gets mauled by Mirko Cro Cop","Fights Gone By #96: Return to the Church of Gaethje","UFC 229 is No. 2 in-demand ticket in company history (behind only UFC 205)","Elias Theodorou:\"Eryk Anders \"Anyone, anytime and anywhere\" does not include Elias Theodorou, Sept 22nd in Sao Paulo, Brazil.\"","Mark Hunt punches through the skull of Antonio 'Bigfoot' Silva","Jake Ellenberger's Retirement Statement","ABC to donate $5K to foundation fighting extreme weight cutting","UFC FN Gaethje/Vick averaged 596k on FS1","Matt Hughes back in the gym after his accident. Heartwarming to see.","UFC signs deal with Channel 10 in Australia to broadcast TUF 28, the live Finale and Fight Night Adelaide","Un-Till The Belt- Episode 1- First Impressions.","Firas breaking down Khabib n Conor","Robert Whittaker: Fighters who miss weight, get title shots ‘not fair’","Megan Anderson reflects on Holly Holm loss, sizes up Cyborg-Nunes","MVP caves Cyborg Santos skull in with a devastating flying knee at Bellator 158","The Mind of Menace (Preview) | starring Michael Johnson - Anatomy of a Fighter","Anthony Pettis talks about UFC 181 incident with Tony Ferguson.","Justin Gaethje's anti-grappling against Luiz Firmino","Well spoken Fedor gives interview after 3 fight lose streak","Why Matt Mitrione is happy Ryan Bader 'feels so confident' for Bellator grand prix semifinal","Can you be a Power puncher and have Michael Bisping level Cardio?","[News] Joe Soto Released By UFC","Ulka Sasaki subs Jenel Lausa after a super slick back take","2000's champions vs current champions?","Brian 'T-City' Ortega becomes the first man to stop Frankie Edgar at UFC 222","Who do you think is going to headline UFC 230?","UFC 228: Woodley vs Till Odds | UFC ® - News","Justin Gaethje reversal vs Brian Cobb","Historical stats on the classic \"Striker v. Grappler\" match ups. Which side typically triumphs?","Justin Gaethje says he wants Kevin Lee and Aliquinta backed out.","Live Combat Sport Schedule: 8/29 – 9/2","Pride 8 and 11","What are your dream match-ups","VIDEO: UFC Lightweight John Makdessi - A Day In The Life","UFC 228: Darren Till UFC PI Open Workout Media Scrum - MMA Fighting - YouTube","Darren Till Media Workout &amp; Scrum","The best Russian wrestler can't make his UFC debut for 3 years. Why? (about Bilyal Makhov)","Chris Bungard @CowaBungard signs multi-fight deal with Bellator - first Scottish fighter to do so","Win or lose, Justin Gaethje is MMA’s Mr. Excitement","Promo for Cage Warriors this weekend.","Jared Gordon: 'job is on the line' in next UFC fight","Cage Warriors 96 Preview (Per: Craig Allen)","The California State Athletic Commission is in the final process of approving fighter licenses to Chuck Liddell (48) and Tito Ortiz (43). Could be wrapped up by today, I’m told. Clears the way for a third fight, promoted by Golden Boy.","Cub Swanson defeats The Korean Suberboy by unanimous decision in FOTY at UFC 206","The End of the UFC 1 Lineal Champion?","Tito’s been training a ton","Woodley affirms to @arielhelwani on #HelwaniShow that there is a 0% chance that he will fight Kamaru Usman if Till misses weight.","Ryan Bader lat dropped Linton Vassell at Penn State","This repost by Justin Gaethje after his last fight is everything!","My friend is interviewing Kelvin Gastelum tomorrow morning","Pettis, Khabib, and Ferguson interact at the UFC 181 Post-Fight Press Conference","New Darren Till promo for UFC 228 from BT Sports","Tyron Woodley drops Nate Marquardt in their war for the Strikeforce belt.","BJJ star Marcus Buchecha doesn’t rule out MMA move, but wants it ‘under the right conditions’","‪18 years ago today,‬ ‪Kazushi Sakuraba dislocated the arm of Renzo Gracie","Joanne Calderwood On Ariel Helwani’s MMA Show Post UFC Lincoln","UFC 228: Nicco Montano - Fighting Spirit Presented By Modelo","RIZIN.13 Yusaku Nakamura vs Manel Kape 57.0kg / 125.6lbs 5 minutes x 3 rounds Elbows allowed Action packed, high paced speedy fight with fun scrambles.","Conor McGregor throws front leg hook kicks, uppercuts and more against Max Holloway","Bryce Mitchell on his injury: \"I thought my dick was gone. I had to drive myself to the hospital. Some guy thought I was driving recklessly, and I had to show him what was up\"","Mirsad Bektic punches a hole in Godofredo Pepey's chest","[Image/GIF] Gilbert Melendez gets dropped by a leg kick from Edson Barboza, gets up, and gets dropped again","Eric Spicely transitions beautifully to upset Thiago Santos","Michael Chandler tells @arielhelwani on #HelwaniShow that if he could pick his next opponent that it would be Eddie Alvarez and he thinks that him coming to Bellator has legs.","[Official] Technique &amp; Training Tuesday - August 28, 2018","Ketlen Vieira injured, UFC seeks replacement foe for Tonya Evinger in Brazil","[Official] General Discussion Thread - August 28, 2018","Here's a proper upload of my fight from Saturday (Quick finish)","Morning Report: Tony Ferguson says he’s wanted to fight Anthony Pettis since UFC 181 incident","Cody Garbrandt finishes Thomas Almeida in devastating fashion","BJJ Scout - Conor Mcgregor Study Part 2: Cage Craft","ONE posted the rematch between Angela Lee and Mei Yamaguchi and have seemingly muted the crowd during the decision","Coulter vs. Yaozhong, Dobson vs. Yanan set for UFC Beijing in November","Sonny Brown- Abdulmanap Nurmagomedov (Khabib's Dad) MMA Seminar","M-1 Global’s lightweight champ Damir Ismagulov headed to the UFC (Per: Yaroslav Stepanov)","Blaydes vs Ngannou 2 set as main event for UFC Beijing","UFC 232: Ilir Latifi vs Corey Anderson","[ANNOUNCEMENT] UFC Bantamweight contender Cody \"Spartan\" Stamann will be joining us TOMORROW at 9pm ET for an AMA, before his fight at UFC 228 next week!","Dan Hooker and Israel Adesanya have a new podcast: Frenemies","Romero explodes out of nowhere and Whittaker still managed to dodge it","Rare ass submission in Combat Jiu Jitsu by Vagner Rocha","KO of the Week Beneil Dariush vs James Vick UFC reg - Media","Eight months after accident, Daniel Straus is coming back — and he’s redefining what is possible (Per: Chuck Mindenhall)","Anthony Pettis submits Giblert Melendez at UFC 181","Iuri Alcantara undergoes nose surgery after UFC Lincoln war","365 DAYS #223: Antoni Hardonk chops down an exhausted Sherman Pendergarst","Robson Gracie Jr. vs Peter Nascimiento Set for Bellator 208","Robert Whittaker TUF 28 Media Lunch Scrum - MMA Fighting","Nate Diaz responds: Bruce Buffer wtf get off the Ufc nuts your bowing down right now tellling me to bow down? fuck that u keep bowing down. I Bow down to no one ever for alll the money n the world...","GSP drops Michael Bisping, batters him with elbows and then chokes him unconscious to become the Middleweight Champion of the World","[Image/GIF] Brandon Thatch lands a beautiful trip on Benson Henderson and nearly eliminates him with a vicious ground strike","(old) The other side of Chael, after losing to Silva. Man I respect him.","Erik Koch vs Dwight Grant and Jared Gordon vs Joaquin Silva confirmed for December 15th in Milwaukee","Kid Yamamoto KO’s current UFC fighter Rani Yahya (Full Fight)","Erko Jun vs. 'Popek Monster' added to October's KSW 45","Trevor Whittman's reaction (lack of) to the main event last night","Pride Never Die: CroCop with the cemetery hooks vs Aliakbari ---&gt; Rizin 2016 Openweight Grand Prix finals","Gabriel Gonzaga KOs Mirko Crocop (April 21, 2007)","2 years ago today, Cynthia Calvillo made her pro debut.","UFC 35 on Fox. Rivera VS Almeida. Compilation of exchanges and knockdowns. (OK Quality)","UFC Middleweight Champion Robert Whittaker dismantles Derek Brunson after catching Brunson with a left while rushing in at UFC Fight Night 101","Dustin Poirier and Anthony Pettis swangin' and bangin' at the end of round 1 in their fight","Paul Felder looks at making ‘one more really strong run’ at 155 before moving up to 170","Kevin Lee eyes winner of Gaethje-Vick","Derek Brunson outwrestles Olympian Yoel Romero","2 years ago, Johnson KO'd Texeira so hard he decided to take-down Miragliotta","RIZIN.13 [Discussion] Daron Cruickshank vs Diego Brandao 70.0kg / 154.3lbs 5 minutes x 3 rounds Elbows allowed","Tai Tuivasa hinting a fight announcement","Rich Franklin's ONE Warrior Series | Season 2 | Episode 7 | Phuket","Paige VanZant vs. Rachael Ostovich in the works for UFC’s ESPN debut","Fighting Alliance 7 from Saint John, New Brunswick this Saturday. Tyler Wilson moves to 5-1 with a barrage of knees from the clinch in the third round","[Official] General Discussion Thread - August 27, 2018","Alexander The Mauler Gustafsson - “I’ll fight anyone. October 6th is a good card, Conor and Khabib. I would love to fight on that card.”","#HelwaniShow line up for tomorrow - Justin Gaethje, Tyron Woodley, Anthony Pettis, Joanne Calderwood, Michael Chandler, Eryk Anders, Mickey Gall and Bryce Mitchell","CM Punk willfully puts Mike Jackson against the cage and engages in a clinch","Jimmie Rivera stuns Marcus Brimage with a sharp right hook and wails on him with a barrage of punches to get the quick tko.","[SPOILER] Main Event loser statement after defeat","[Official] Moronic Monday","Right Score? Khabib v Tibau || Judging MMA","Bellator has a long history of their champions not actually defending their titles!","Coach Colin Heron Says Darren Till Will KO Tyron Woodley At UFC 228","[SPOILER] Justin Gaethje vs. James Vick","Michael Chandler fnishes Patricky Pitbull to the dismay of his brother Patricio","[SPOILERS]Co-main event loser shares his thoughts about the fight","[SPOILER] Justin Gaethje vs James Vick ( move of the night footage)","Bruce Buffer blasts Nate Diaz over under-promotion claims, says he should bow to Dana White","John Dodson lands a knee that shatters the nose of John Moraga, prompting a stoppage between rounds","[Image/GIF] Rafael dos Anjos lands a beautiful flying knee on Robbie Lawler","Kimbo Slice finishes Tank Abbott in his hometown of Miami, Florida","Robbie Lawler vs. Stephen Thompson targeted for January UFC event on ESPN","[Spoilers] UFC Fight Night: Gaethje vs Vick Predictions Results","Big Brown Breakdown - episode 95: UFC Gaethje vs Vick recap, Logan Paul vs KSI Massive Numbers, Ortega vs Holloway rebooking, disappointment over Chael vs Fedor poster","365 DAYS #222: Jose Aldo neaely decapitates Mario Bigola with a head kick","[Spoiler] Winner of Figueiredo/Moraga interview (watch this)","Norifumi \"Kid\" Yamamoto posts on Instagram that he is battling cancer","[SPOILER] Main event winner predicts the outcome","Link to watch today's Ariel Helwani Show from the beginning (incase you join the live broadcast late)","Ferguson vs. Pettis announced for UFC 229","UFC 228 Free Fight: Tyron Woodley vs Robbie Lawler","OLD BUT GREAT-Chael Sonnen Firing on All Cylinders (UFC 148 Pre-Fight Press Conference) HD","UFC Heavyweight prospect Tai Tuivasa folds Rashad Coulter with a flying knee right on the button at Fight Night 121","RIZIN 13: Tenshin vs Horiguchi sells 18,000 tickets at Saitama in one day","Full UFC 229 main card announced.","UFC is currently discussing Iaquinta vs. Kevin Lee for the 12/15 final big Fox card in Milwaukee. Not done yet, though.","Darren Till's reaction to Wonderboy's attempted spinning shit","[Spoilers] Main Event Winner Post-Fight Scrum","[SPOILER] Eryk Anders vs. Tim Williams","UFC 228: Montano vs Shevchenko - Championship Dreams","[SPOILER] Mickey Gall VS George Sullivan","José Landi Jons vs Mitch McElroy. Bodog Fight in Costa Rica. Awesome venue for fights.","[Spoiler] Main card loser retires","[SPOILER] Cory Sandhagen vs. Iuri Alcantara","[SPOILER] Joanne Calderwood VS Kalindra Faria","Heavyweight superstar Brock Lesnar pulled from WWE Raw to focus full-time on UFC","[SPOILER] Jake Ellenberger vs. Bryan Barberena","Ref from prelim pulled from remaining fights after questionable stoppage","Tony Ferguson to Anthony Pettis: \"I Told You I’d See You Soon Kid, Now Your Gonna Have To Answer To Me Toe-2-Toe Vato\"","Cris Cyborg vs. Amanda Nunes: Head-to-Toe Breakdown","[Spoiler] Cortney Casey vs. Angela Hill","[SPOILER] Warlley Alves vs. James Krause","[Spoiler] Main event winner Octagon interview","John McCain: How The Late Senator Helped Modernize The UFC By Nearly Getting It Banned","[SPOILER] John Moraga vs. Deiveson Figueiredo","Robert Whittaker Would Rather Do What Than Fight Yoel Romero Again?! | TMZ Sports","[SPOILER] Prelim winner about improving her ground game","UFC Lincoln Bonuses","UFC Moscow Hunt vs Aleksei Full Main Card Set","[SPOILER] Luke Sanders vs. Rani Yahya","Nico Price destroys Randy Brown from his back. Price returns September 8th to face Abdul Razak Alhassan","[Official] UFC Fight Night 135: Gaethje vs. Vick - Press Conference &amp; Post-Fight Discussion Thread","Conor McGregor \"A True Chechen would never assist on the attack of another Chechen. This is treason\"","Liverpool getting behind Darren Till","[Spoiler] Pros react to UFC Lincoln","[Spoiler] Jake Ellenberger vs. Bryan Barberena loser post fight thoughts","Updated UFC 228 Main Card - Alhassan vs Price added, Esparza vs Suarez moved to FS1 Prelims headliner","James Vick says Ali Abdelaziz donated $3000 for his sister's cancer fund","Can someone explain PFL's schedule?","Fedor inside traps Nogs lead hand and Lands a picture perfect overhand right. (Jack Slack :Breakdown)","Israel Adesanya launches a tornado of death against his opponent","GSP is labelled as \"Lightweight Contender\" by FOX SPORTS: UFC on twitter","[Official] UFC Fight Night 135: Gaethje vs. Vick - Live Discussion Thread","When James Irvin derailed Houston Alexander by knockout","Megan Anderson backstage interview at UFC Fight Night 135","One year ago today, Conor McGregor fought Floyd Mayweather.","First time I've ever seen this - fighter beats grounded opponent with leg kicks (Daniel Swain vs Viktor Kolesnik spoilers)","[News] laprise vs lima booked for ufc 231","Max Holloway vs. Brian Ortega title fight agreed to for UFC 231","[Spoiler]Russian Mario Yamasaki","[Official] General Discussion Thread - August 26, 2018","Brian \"T-City\" Ortega backstage interview at UFC Fight Night 135","[Official] Bare Knuckle Fighting Championship – A New ERA - Live Discussion Thread","From Kyoji Horiguchi requesting 1 x 15 minute round vs. Tenshin to Yusaku Nakamura and Jiri Prochazka already trying to pick fights for #RIZIN14 in December, check out the quotes from all 22 fighters announced for RIZIN 13 next month","UFC Dream Card","T City takes The Carpenters head clean off with a perfectly timed knee for he’s first KO in the UFC at UFC 199","Israel Adesanya knocks down Rob Thomas","The weights been made, now it's time to have fun. If any redditors in the crowd come say hi.","[Mod post] About these Conor/Khabib social media posts","Lineker willing to fight Petr Yan next","[Spoiler] Saenchai vs Nikita Surovezhin","Heath Herring wards of the ghosts of homosexual past after being smooched by an opponent","[Image/GIF] 'Suga' Rashad Evans shows off some swagger against Jon Jones","[Spoiler] M-1 Challenge 96: Daniel Swain vs Viktor Kolesnik","365 DAYS #221: Urijah Faber begins his MMA career with an airtight guillotine on Jay Valencia","Mike Zambidis with a beautiful flying knee knockout","Ayub Magomedov Clarifies about Sparring with Conor McGregor","RIZIN.13 CM: Horiguchi vs Tenshin","Bryan Barberena dropping Leon Edwards with an uppercut in his last fight","Pet U Tong's Finest Sweeps","Player Controlling Mike Jackson leaves the room and Warlley Alves pounces and spams 8 right hands","[Editorial] What does it take to be an MMA referee?","Heavyweight boxer Curtis Harper walks out of the ring at the opening bell for his fight against Efe Ajagba on live TV! Ajagba wins by DQ without a punch thrown","The finalized Bellator 206: Mousasi vs. MacDonald main card","[Image/GIF] Paul 'Semtex' Daley finishes top UFC WW Lorenz Larkin in brutal fashion","Fedor reminds the world he isn't done just yet","Lawrence Kenshin - Muay Thai vs. Kickboxing Breakdown: \"The Fight That Changed History\"","Justin Gaethje's vicious slams of Ben Deandan. Brutal...Rampage-on-Arona-esque [44 seconds]","[Serious] PFL pres Ray Sefo: '18 years to the day when myself @ernestohoost65 @SamGreco_K1 @PeterAertsK1 and a few others received a sad phone call from K-1 that Andy Hug had passed. Taken way to soon, RIP Champ !!'","UFC event disparity","No faking here, Justin Gaethje has no respect for James Vick","This day in Bellator history: Andrey Koreshkov","Joanne Calderwood &amp; Cynthia Calvillo are both throwing spinning shit now?","John Moraga smashes Magomed Bibulatov in 3 minutes at UFC 216","UFC 232 opening odds: Amanda Nunes closest Cris Cyborg challenger since Gina Carano","Official RIZIN 13 Promo","Ariel:\"John Lineker is not an option being considered for Zabit\"","Tito Ortiz Talks His Return To UFC and Fight with Chuck Liddell + More [Video]","With all fighters making weight today, this makes five consecutive UFC cards where all fighters have made weight","A moment of instant regret from McGregor Diaz II.","What fight were you the most emotionally invested in? How did you feel after the fight ended?","Aaron Pico hitting pads in 2010. That shovel hook looks familiar...","Anthony Pettis stops Cowboy Cerrone with brutal body kicks","[NEWS]Israel Adesanya says he’s UFC’s next ‘cash cow’, promises to ‘smoke’ Derek ‘Bumson’","‘Whoever wins this fight will win the championship’: Sonnen - stakes are high for Fedor bout","A wobbled Frankie Edgar times a double leg perfectly and attempts a guillotine on Jeremy Stephens","Mirko Cro Cop shared this picture of him after his knee surgery and thrombosis","Rapid Fire: Justin Gaethje and James Vick","Ayub Magomadov - black belt under Alexander Paiva. New sparring partner of Conor McGregor","[Official] General Discussion Thread - August 25, 2018","Curtis Razor Blaydes slices up Alistair Overeem with some vicious elbows at UFC 225","Petchpanomrung unleashes one of the best left kicks you will ever see against Zakaria Zouggary [Image/GIF][Kickboxing]","365 DAYS #220: Tank Abbott demolishes John Matua and mocks his corpse shortly after","Darren Till Training with BJJ Champ Andre Galvao for Title Fight vs. Woodley","[Official] Glory 57 Shenzhen and SuperFight Series - Live Discussion Thread","Nick Diaz submits Takanori Gomi with a gogoplata.","Tony Ferguson vs. Anthony Pettis booked for UFC 229","Anthony Smith not eyeing Daniel Cormier with win over Volkan Oezdemir: 'Jon Jones is probably next'","SATURDAY! r/mma Virtual Lightweight Champion James 'The Texecutioner' Vick puts his Virtual Belt on the line against Justin Gaethje...oh boy","Yves Edwards landing a massive kick on Josh Thomson","The Ultimate Fighter: Heavy Hitters - Debuts Wednesday (trailer)","UFC 230: Poirier vs Diaz Promo by BrattMamley","Saenchai makes Matt Embree bite hard from his feints before setting him up for THE 619","Rizin announces Tenshin vs Horiguchi and much more","Cat Zingano talking with Joe Rogan about her primal scream and the need to find out who \"gets the bone\" in a fight","Fedor immediately taking down Sem Schilt, marking the beginning and end of the fight.","[Spoiler] Contract winners of DWTNCS Brasil Ep. 1","Francis vs Ngannou","Brazilian DWTNCS Premieres Tonight in Combate, It is Tape Delayed no Info on When It Will Be Uploaded to FP","Official poster for RIZIN 13: Tenshin vs. Horiguchi released","Watch \"MMAjunkie's John Morgan previews UFC Fight Night 135\" on YouTube","Does any fighter, pro or amateur, actually fight at their natural weight?","A young Darren Till dominates his opponent in Muay Thai fighting from an orthodox stance","Fedor completes a smooth takedown under the guise of a missile right hand.","Mirko Cro Cop vs Roque Martinez at Rizin 13","[Official] UFC Fight Night 135: Gaethje vs. Vick - Weigh-In and Pre-Fight Discussion Thread","Tyron Woodley Shows He's Ready for Darren Till at UFC 228 [Video]","Cody Garbrandt opens up on near-suicide attempt as teen","How Senegalese wrestling developed into a mythical mashup of styles with Cain Velasquez","Michael \"Venom\" Page shows Youtube star KSI some fight skills...","Kevin Lee Interview in Morocco, talks Khabib vs. Conor","GSP Toughest opponent","BELLATOR MMA - AJ McKee vs Dominic Mazzotta - FULL FIGHT","What the top 5 of each division might look like if the UFC expanded weight classes.","Lineker Wants to Fight Zabit","Bellator announces more European signings","Statistical Analysis - Input Invited!","Obviously Fight talk - MMA Live Chat with MMA on Point","MMA Squared ep 29: UFC Lincoln: Gaethje vs. Vick has a bunch of heads on the chopping block","Rich Franklin finishes Chuck Liddell with a compact counter right hand","ONE Championship registered an average of 11 million viewers per event from core markets in 2018 so far","MAYWEATHER VS MCGREGOR: A RETROSPECTIVE - PART 1: ALL THE THREADS COME TOGETHER","Saenchai is having none of that","Yair Rodriguez out of fight with Zabit Magomedsharipov due to injury, UFC looking for replacement","Justin Gaethje times the right hand of Luis Palomino and lands his own for the finish.","Al Iaquinta on why he pulled out of Gaethje fight: I was injured and thought ‘f-ck this’","Khabib Nurmagomedov all 10 UFC fight highlights","[Zabit on Twitter] @panteraufc if you injured or not im fighting regardless so get your mind prepared for a battle. Im going to fight someone in September and I will fight you in November or December. No more running","This video hypes me up every time I attend a live UFC event.","[NEWS]Bare Knuckle FC 2: Bec Rawlings aims to go for ‘meatier parts’ in main event","Andre Fili puts shin to Artem Lobovs dome","Kevin Randleman gets crazy height before dropping knees on Kenichi Yamamoto","Vitaly Minakov is Back in Bellator According to the Coke","RIZIN CONFESSIONS episode 20 with English subtitles. More behind the scenes from RIZIN.11 and a teaser for today's announcement for RIZIN.13","[Official] General Discussion Thread - August 24, 2018","Ben Craggy knocks out Earl Brown as he is trying to get up at UCMMA13","Brock Lesnar drops Heath Herring before rushing at him","Paulo Costa now targets January date for Yoel Romero fight, says ‘Soldier of God’ is ‘buying more time to train’","UFC FightNight 135 Gaethje vs Vick FULL card breakdown","Bryan Caraway vs. Pedro Munhoz slated for the TUF 28 Finale in Las Vegas","Islam Makhachev with the \"Russian Tie Snap\" - DC likes what he sees","Suman Mokhtarian vs Tyler Diamond slated for UFC Adelaide, Dec 2","Looking for an opponent for my first fight.","Dong Hyun Kim goes for some spinning shit, Tyron Woodley counters","Fighter of Interest: Angela Hill (GIFs)","Josh Neer is shocked and disagrees with the judge that scored the fight for him against Nate Diaz.","Felony Charles Bennett interview before his bare knuckle fight","Found this neat clip of Bas Rutten demonstrating one of his kicks","GSP destroys Matt Serra with bone crushing knees","A highlight of Igor Vovchanchyn, MMA's first heavyweight king","Neil Magny vs. Santiago Ponzinibbio set to headline UFC Buenos Aires","The Tactical Guide to Justin Gaethje vs James Vick","UFC Lincoln Tickets for $25 at box office","365 DAYS #219: 19 year old Jon Jones makes his MMA debut, completely overwhelming Brad Bernard","Bam Bam Returns this Saturday in Lincoln Nebraska!!! Taking Questions all day for the Reddit fans🙌🏽","My boy Roeung Sophorn(Khmer) Highlight Clip","Fight Preview: Can Justin Gaethje Stop Being a Warrior to Become a Winner?","Jake Hager, aka Jack Swagger, expects Bellator MMA debut by end of 2018","Carlo Pedersoli In vs Cowboy Oliveira at UFC Sao Paulo","[News] Team Kaobon head coach Colin Heron on Darren Till Vegas Camp UFC 228","Ben Askren lay and prays against Karl Amoussou","DC ices Stipe Miocic to become the double champ at UFC 226","Hey guys, MMA simulator just posted another update, it looks like it'll be out next month on Steam","Mickey Gall aims for 'violent masterpiece' to prove he deserved UFC Lincoln main-card spot","Using +3 DVR figures, #Bellator204 on Paramount Network, averaged 413k viewers. Peaked during the Gallagher/Banejas fight with 699k","Michael Johnson cuts down Dustin Poirier with a blistering combination","August 23rd, 2014: Michael Bisping batters Cung Le","Stevie Ray vs Jessin Ayari set for UFC Moncton","[Official] Friday Flair Betting Thread","Iuri Alcantara hurt Brad Pickett with a spinning elbow before finishing with a triangle","Joe Rogan's reaction to DC becoming the HW Champ","The Baddest Man from West Linn, Oregon blasts the MMA media for lazy journalism.","Jon \"Bones\" Jones - Oblique Kicks and Elbows","Cris Cyborg vs. Amanda Nunes has officially been signed for UFC 232 on Dec. 29 in Las Vegas, according to multiple sources.","Confirmed: Cris Cyborg vs. Amanda Nunes champion-vs.-champion fight set for UFC 232","Can you recommend some of the best fights from the past decade for a noob please? (No spoilers!)","UFC 229 Khabib vs McGregor Official Poster Released","UFC Lincoln- Michael Johnson Full Media Day Scrum","Investigative journalist Mike Russell: 'Golden Boy Productions is reaching out to managers and fighters for its innaugural MMA event. Their only stipulation I am told is that they want no Dominance MMA fighters'","UFC Lincoln: Andre Fili Full Media Day Scrum","Rustam Kabilov vs. Kajan Johnson, Ramazan Emeev vs. Claudio Silva set for UFC Moscow","What's missing in the sport of MMA for the fan base?","UFC Lincoln- Justin Gaethje Full Media Day Scrum","Keri Melendez booked for Bellator 206 main card","Bare-knuckle fighting: What’s its place in 21st century sports?","Al Iaquinta happy with choice not to fight Justin Gaethje, says he’s ‘given up’ on UFC getting behind him (Per: Marc Raimondi)","Vlog number 2 is up! Andrew Duffy and I are really having a blast here in Lincoln Nebraska. As much fun as any city boys could have in the Midwest during fight week.","Wrestling Highlight Video - Thought Y'all Would Enjoy","Sergei Kharitonov knocks out Murilo \"Ninja\" Rua","Ariel Helwani Hands Chael Sonnen His First Career Loss","Jason High gets 3rd regular season fight at PFL 7 against Johnny Case","Randa Markos vs. Marina Rodriguez in the works for UFC FN 137: Sao Paulo","[Official] Photoshop and Goofy Thursday","The greatest and most decorated fighter ever will face Fedor Oct 13th","There will be some sort of UFC 229 press and fan event with Conor McGregor and Khabib Nurmagomedov in attendance in early September to promote the event per UFC Tonight.","Israel Adesanya Opens Up About Fame, Roasts Derek Brunson Ahead of UFC 230","Yoel Romero may not return until 2019, and Paulo Costa is okay with waiting","Fight Night Picks - UFC Lincoln Preview and Chat with Tim Johnson","Junior dos Santos believes he’s one win away from UFC title fight (Per: Guilherme Cruz)","Justin Gaethje tried to amputate Eddie Alvarez's lead leg","Buakaw drops Enriko Kehl with a well timed elbow","Invicta FC 31: Kay Hansen Interview","UFC pulls Neil Magny from his fight at UFC Sao Paulo against Alex Oliveira. The UFC is now working on Santiago Ponzinibbio vs. Neil Magny for UFC Argentina","Aussie &amp; Fancy are back with a breakdown of UFC: Lincoln!","Gilbert Burns will face Olivier Aubin-Mercier at UFC 231 in Toronto","Which veterans could become championship-level fighters with a coaching change?","RIZIN.13 Press conference August 24th (Fri) 6:30 pm Tokyo time","Patricio Freire isn't surprised 'one of the biggest PED users' Michael Chandler avoided UFC, USADA","UFC Lincoln: Joanne Calderwood excited to unveil 'JoJo 2.0'","Michael Chandler re-signs with Bellator","Angela Lee will move up a weight class to face the winner of Jingnan Xiong vs. Samara Marituba for the ONE's strawweight title in a super fight.","Coker with ultimate troll job","James Vick waiting for odds to change, will bet on himself to beat Justin Gaethje","Claudio Silva vs Ramazan Emeev Set for UFC Moscow Sep 15","Yoel Romero tested 2 times this months. Time to start charging rent for new housemates USADA","James Vick's last three finishes","R/MMA in a nutshell","Featherweight king Jose Aldo sends Chad Mendes to the sunken place.","GLORY 57 SHENZEN - ESPN TUNE IN TIMES","UFC Lincoln: Joanne Calderwood full pre-fight interview","Prime Mirko Crocop's complete destruction of Heath Herring","Addressing the bias against Fedor","Interview Paddy Pimblett ahead of CW96","Andrea Lee Releases Statement on Her Husband’s Domestic Violence Charge","Cage Warriors 96 Paddy Pimblett vs Soren Bak Full Fight Card","[Official] General Discussion Thread - August 23, 2018","Minatauro Nogueira goes sizzler on Brondan Schleb","Rico Verhoeven will defend his title against Guto Inocente on Glory 59 in Amsterdam.","[NEWS] After disappointing featherweight debut, Michael Johnson needs a win at UFC Lincoln for ‘sanity’ reasons","UFC Lincoln: Justin Gaethje full pre-fight interview","Robert Whittaker on Instagram: Training camp here in Colorado getting work done","Dana White: won't apologise for bashing his own UFC fighters 'Most of them deserved it'","Jason Knight tells Makwan Amirkhani his chin is weak, boy.","TALL vs BRAWL: Gaethje vs Vick preview (Heavy Hands #225)","Boxer Lucy Brown dies in hospital after sparring head injury","Greg Hardy KO's Tebaris Gordon in 17 seconds","Daiju Takase hands Anderson Silva his second professional loss via a beautiful triangle choke set up from side control","Yoni Sherbatov on Twitter: What do you need more @danawhite give me your fighters. @ufc ??? Top 30 in the world","How The Bellator Welterweight Tournament Could Change the Game","Jake Ellenberger says ‘it’s win or die’ against Bryan Barberena at UFC Lincoln","Iuri \"Marajo\" Alcantara knocks out Ricardo Lamas","Kevin Lee taunts Tony Ferguson and get elbowed in the face","Fight Night Lincoln: Gaethje vs Vick - Jimmy Smith Preview","Cindy Dandois makes Bellator Debut in isreal headlined by Pitbull vs Sanchez","Partnerships with brands proving important for fighters like TJ Dillashaw due to the UFC-Reebok deal","UFC Lincoln: James Vick full pre-fight interview","[Fight Discovery] UFC Fight Night - Gaethje vs Vick","Marijuana suspension bug bites DWTNCS","Cody Stamann \"Ready to Freaking Knock Aljamain Sterling Out\" at UFC 228","Karl Roberson vs. Jack Marshman Set for UFC 230","UFC Lincoln: James Krause full pre-fight interview","Who is your favourite MMA fighter that isn’t doing very good at the moment ?","UFC Fight Night: Gaethje vs Vick Predictions Form","The Most Entertaining Man in MMA is Finished Twice","Coach Fernand Lopez Says Dana White Was Telling The Truth About Francis Ngannou Having An Ego Problem","Live Combat Sport Schedule: 8/22 – 8/26","Tiequan Zhang catches Jason Reinhardt with a guillotine choke off of a takedown.","Roger Gracie bloodies and submits current UFC LHW contender Anthony Smith at the final ever Strikeforce event","Judo 2018. REKHVIASHVILI Zebeda (GEO) vs BRIAND Etienne (CAN) 81 kg. Final. Judo Minsk 2018","Every UFC Fight Change and Cancellation of 2017 - MMASucka.com","[ANNOUNCEMENT] UFC Middleweight contender and Ya Boi Eryk Anders will be joining us TODAY at 8pm EST for an AMA before his fight on Saturday!","365 DAYS #218: A young juicy Vitor Belfort puts the business on Jon Hess at Superbrawl 2 on October 11, 1996","Mike Chandler talks about his decision to resign with Bellator | Anatomy of a Fighter","Donald Cerrone on Instagram: \"Im going on @joerogan\"","[Official]Thursday Betting Discussion Thread","Ed Ruth teleports behind his opponent in a Division I match","[Image/GIF] Jon Jones hitting a Superduck on Dan Henderson","James Vick Says He's A \"Stylistic Nightmare\" For Justin Gaethje &amp; Talks Winning $$ On Henry Cejudo","PFL 7 finalized with Smealinho Rama vs. Jamie Abdallah headliner","[Spoiler] Plotforma S-70: Denis Goltsov vs Ednaldo Oliveira","Lights Out MMA Debuts in Michigan on Oct. 13","Fights Gone By #95: When Acting Tough GOES WRONG","Mike Perry on Cowboy | \"I'm fighting someone I look up to, but I gotta fucking kill this guy.\"","UFC Lincoln pre-event facts: Justin Gaethje’s UFC run so far unlike any other","UFC Lincoln Vlog #1 with Andrew Sanchez and Joe Duffy. Check it out! Like comment subscribe. There will be more all week.","Darren Till looking lean 2+ weeks out from UFC 228","Manuwa: 'I'm gonna bring Santos' head back to London'","UFC officially announces Manuwa vs Thiago Santos","The Dwyer Score- UFC Fight Night: Justin Gaethje vs. James Vick","Yoel Romero Unable To Face Paulo Costa At UFC 230 Due To Broken Orbital","AJ McKee jr throwing J.T. Donaldson right into side control.","Plotforma S-70 2018 Denis Goltsov vs Ednaldo Oliveira Free &amp; Live","Glory LW Champion Sitthichai finishes Davit Kiria with an incredible display of striking acumen [Image/GIF][Kickboxing]","Questions arise whether overseas Bellator events will stream live on DAZN or be simulcast w/Paramount (approx 3 minutes into show)","Fabian Edwards thinks BAMMA ‘mistake’ led to Bellator U.K. signings, sees ‘options’ on horizon","Bryce Mitchell ripped his nut sack open.","Ricky Bandejas describes 'corny' threats from James Gallagher in lead up to Bellator 204 matchup: 'I had eight weeks of this guy messaging me crap online, sending me videos of somebody shooting a guy named Ricky. He’s uploading guns and saying I’m going to kill you'","Max Holloway hints at his long awaited return.","Two weeks before the fatal crash, Desmond Green was cited for driving with a suspended license and no proof of insurance.","AJ McKee (11-0) talks to James Lynch about his Bellator 205 bout with John Teixeira (22-3-2), Gallagher's loss and the FW title chase","ONE Japan presser tomorrow feat: Aoki, Bibiano, Vera, Angela Lee, Tonon, Petrosyan, Renzo/Ralph Gracie and more","Ortega x Moicano","Cowboy Cerrone finishes Matt Brown via headkick KO","Referee who let the choke go for 90 seconds was a last-minute unlicensed replacement","Renato Moicano calls out Jose Aldo for n1 contender fight","[Video] King Mo nearly punches the beard off Brett McDermott's face with big right hands at RIZIN's debut show in 2015","365 DAYS #217: Alistair Overeem sinks in his signature guillotine on Ricardo Fyeet to begin his MMA career","Vicente Luque puts the hurt on Niko Price, slaps on a D'Arce","[Official] General Discussion Thread - August 22, 2018","Shoeface wants Paulo Costa... In NY. Isn't he awesome?","Garry Tonon ‘open’ to Dillon Danis MMA clash, but thinks it will come ‘later in our careers’","Jim Crute vs Paul Craig announced for UFC Adelaide December 2nd","James Gallagher in studio interview with Ariel Helwani following KO loss.","Rockhold conceives, believes, and achieves against our boy the Chris","Don Frye vs Yoshihiro Takayama : The original rockem sockem robots","Kelvin Gastelum's address to the MMA world.","With Cejudo now Champ, how's about a little rerun of this trash talking master class &amp; rivalry?","Blast from the past: When Kimbo was just blowing up and about to fight Tank Abbott, Mayhem Miller interviewed him and Bas during a casual lunch","Michael \"Mayday\" McDonald posts an update on his hand injury and next steps","Which specialist managed to round out their game the most?","According to Taisumov, fight with Greene still on after fatal crash","'Razor' Rob Wilkinson released from UFC contract after 2 fights","Every takedown by Kayla Harrison vs Jozette Cotton","Brendan Schaub Rips USADA for Testing Jon Jones Just Once In 2018","Lincoln Fight by Fight Preview | UFC ® - News","Alexander Gustafsson back in training, with Ilir, Manuwa and Hector Lombard","Ricco Rodriguez launching head kicks against Nestoras Batzelas","James Vick is eager to prove 'delusional' Justin Gaethje wrong at UFC Lincoln","Cezar Ferreira vs Tom Breese Set for UFC Argentina","Tuesday Night Contender winner Jim 'The Brute' Crute to make UFC debut in Adelaide","Renato Moicano Highlights - On The Rise ᴴᴰ (2018)","6'8\" HW Steve Mowry (4-0) to debut at Bellator 205 vs Ben Moa (4-0). Also: Jarod Trice (3-0) vs Sean Powers (9-6)","Co-Main Event Podcast Episode 319: Would the UFC really rebuff GSP’s superfight offer? Really?","MMA Pros Pick - Tyron Woodley vs. Darren Till (UFC 228)","[Image/GIF] Thomas Almeida returns the flying knee to finish Brad Pickett","Throwback Clip: Tito Ortiz on Jay Leno in 2003","Rafael Lovato jr (8-0) talks to James Lynch about rescheduled John Salter (15-3) fight at Bellator 205 and his hopes for a title shot with a win","Abel Cullum vs. Hideo Tokoro (DREAM 9). Excellent grappling-oriented fight with a lot of scrambles and submission attempts.","BJJ Scout: Conor McGregor Study Part 1: Left Hand","Lesnar looking a little different these days","The Strange Case of Justin Gaethje (Per: Craig Allen)","Interview with UFC veteran and #1 atomweight Seo Hee Ham. Plus, career/atomweight history info. In her first 7 fights her opponents had a combined record of 84-14.","EXCLUSIVE: Joe Joe Giannetti talks about not getting into the UFC after a great TUF run, possible matchup vs Nick Newell - Pure EVil MMA","ESPN Insider is merging with ESPN +","MMA Live Chat: The BIG MMA News Stories, UFC Fight Night 135 Predictions, Gallagher's Loss","Bellator 204: Logan Storley vs AJ Matthews - FULL FIGHT","Why do so many Military System's use of kicks (even those whose creators were unaware of savate) literally look like Savate kicks most of the time? To the point even blatantly different Asian styles like military Muay Thai and WW2 era Karate even Savate looking kicks?","DANA White's interview with Tony Robbins","Robert Whiteford goes more into detail about his contractual dispute with ACB and ACB make a statement.","Yoel Romero tells Ariel Helwani his new UFC contract is for 8 fights.","The Original UFC logo will be on the center of the canvas for UFC Colorado November 10th","Samart Payakaroon displays why he's the GOAT striker","GLORY 57: China 8 Man Tournament Preview","Gray Maynard set for lightweight return at UFC 229 vs Nik Lentz","Yoel Romero says that the doctors told him he wouldn’t be ready to fight against Paulo Costa in the timeframe that the UFC announced that fight. Says that he wants to fight at UFC 230 in MSG but doesn’t think it can happen.","Halfcast Podcast Ep #09 - ANDREW FIFITA AND JOSH DUGAN","Jacare giving Derek Brunson the work for the second time","Tony Ferguson says that he's fighting at UFC 229 and is waiting on his opponent to accept the fight","El Cucuy submits Lando Vanatta with a D’Arce choke after a 2 round war at Fight Night 91","Michael Chandler would love to finish trilogy with fellow free agent Eddie Alvarez","Declaration of Ali Abdelaziz(regarding the public disclosure of fighters contracts)","Bellator boss Scott Coker open to Darrion Caldwell's two-belt plans but still sees fights at 135","Shinya Aoki dislocates Keith Wisniewski’s elbow with a standing armbar. @ 1:52","Dana White says UFC now worth $7 billion after ESPN deal","Luis Pena vs Mike Trizano set for UFC Denver 👀👀👀","[Official] General Discussion Thread - August 21, 2018","Luke Rockhold full MMAjunkie interview at Seeds of Change fundraiser","Randy Costa Sent It. Headkick knockout from Saturday night.","Epic Mark Hunt KO compilation","UFC lightweight Desmond Green was involved in a deadly crash on Interstate 75 in Florida","Luke \"The Fuckin Samurai\" Rockhold reverses Weidman's takedown attempt","TUF27 finalist Joe Giannetti has been released by yhe UFC","Former UFC fighter Robert Whiteford struggling with MMA promotion Absolute Championship Berkut due to contractual issues","Walt Harris lands one of the most disrespectful combos in UFC history on Chase Sherman","[Official] Technique &amp; Training Tuesday - August 21, 2018","Leg kicks in MMA!","Tai Tuivasa’s next fight booked for UFC Fight Night on December 1st in Adelaide (via Instagram)","SOLDIER OF GOD: All of Yoel Romero's UFC stoppage victories","Bellator 204 Averaged 319k Viewers","Ilima-Lei MacFarlane Bellator Women's flyweight champion tells Ariel Helwani she has no interest in fighting in the UFC. Very happy at Bellator.","Ronda Rousey finishes Cat Zingano with an armbar within 14 seconds.","Vicious body shots by PJ Cajigas at M-1 Global USA","Tim Johnson excited to fight big names in Bellator after leaving UFC","Arrest warrant issued for Andrea Lee’s husband Donny Aaron for domestic violence charges","Joe Giannetti talks UFC release, next steps: 'I had a bad fight. It’s not a secret. But sleep on me. Forget who I was. Forget TUF. Pretend it never happened. You’re gonna find out, whoever gets locked in there with me, that I’m the same fighter'","Darren Till Walk &amp; Talk Los Angeles | UFC 228","A broken jaw'd John Lineker tries to headbutt the elbows of TJ Dillashaw.","Alexander Gustafsson was the first UFC fighter to score a takedown on Jon Jones","365 DAYS #216: 22 year old BJ Penn makes his professional debut at the expense of Joey Gilbert","All matchups of Dana White Contender Series Brazil","UFC - A House Divided","UFC Middleweight Prospect Paulo Costa KOs Uriah Hall at UFC 226","KSW is amazing again. Look at the KSW 45 London posters","Couture vs Gozali 2, Dandois vs Rubin set for Bellator’s return to Israel","[NSFW] Referee nearly kills fighter, who was unconscious for nearly 90 seconds","RDA batters Robbie Lawler with an incredible never-ending combo","Juan Adams: \"I’m looking to be like a Donald Cerrone of the heavyweight division. I want to fight as many times as I can for as long as I can because you only have so much time to be great and that’s what I want to be.\"","ACB announces subscription service \"ACB World\"; Events live now exclusively through the app","Matt Brown takes Diego Sanchez’s soul with a brutal hellbow at Fight Night 120","Khabib gets caught in a triangle by a black belt in grappling match in 2009. Remains in it for over a minute, escapes and proceeds to win the match","Ariel Helwani’s MMA Show LIVE: LukeRockhold,@StrabanimalMMA,@ilimanato &amp; @AaronCGShore IN STUDIO! Also @YoelRomeroMMA @volkan_oezdemir @rickybandejas @CPTdasAmericas","Daniel Cormier romances Brock Lesnar on Twitter","Fight Facts: Bellator 204","The MMA Hour with Luke Thomas - August 20, 2018","TJ Dillashaw wins the Bantamweight Title, finishing Renon Barao for the first time","Nicolas Dalby returns to action to face undefeated Italian Roberto Allegretti at CW96","The MMA Hour with Kayla Harrison, Mickey Gall, Paul Felder and More","Ovince Saint Preux gets taken down by Glover, and then just stands the fuck up.","Hyperbolic look for and against frequently mentioned GOAT candidates (Women’s MMA edition)","RIZIN CONFESSIONS episode 19 English subtitles This episode focuses on behind the scenes of RIZIN 11, Takanori Gomi, Kanna Asakura and RENA","UFC 229 became the second largest gate in UFC history","Johnny Hendricks incredible balance creates an odd looking takedown defense against GSP","Marlon Sandro uppercuts Masanori Kanehara face down to the canvas","Ex-UFC Fighter and Weed Connoisseur Matt Riddle has Joined the WWE","The combos of Japanese kickboxer Masaaki Noiri (From his fight at Krush 92 this weekend)","Things were going well until Daron Cruickshank ducked headfirst into James Vick's knee","Classic and Epic intro to a Pride FC event in 2006. Who remembers this one?","Jessica Eye Politely Called Out Sijara Eubanks for Dec Fight","Yoel Romero hurt and staggered in his only KO loss to Cavalcante","Stipe Miocic crumples Fabricio Werdum with a short right hand to start the greatest UFC Heavyweight championship reign to date","Guillard, Neer, TUF vet sign with World Bare Knuckle Fighting Federation","[Official] General Discussion Thread - August 20, 2018","NYT profile of Henry Cejudo from Aug. 19, 2008: \"U.S. Wrestler Completes a Journey From Poverty\"","Alexander Gustafsson boxing up Glover Teixeira","Upcoming matchups, your expected outcomes, and fights beyond?","0/300Khabib Nurmagomedov Takedown Technique Breakdown Highlights &amp;amp; Study","Vitor Belfort tko’d Wanderlei Silva with a chain straight blast blitz on his Light Heavyweight debut at UFC 17.5/UFC Ultimate Brazil.","Yan Xiaonan vs. Syuri Kondo in the works for UFC Beijing","Been seeing too much bullshit content like this recently. What good YouTube content would you suggest around MMA?","What are the best dirty tactics fighters use?","The Solider Of God Yoel Romero KOs Luke Rockhold with a nasty uppercut from out of he’s back pocket","Dude gets dropped with a headbutt in Myanmar Lethwei World Championship 3 (Tun Tun Min vs Lokuku)","Justin Gaethje Leg Kick Highlight","MMA Injury Report: Bellator champ Brett Primus ready to return; Paige VanZant targets next fight","Darren Till drops Stephen Thompson.","Emelianenko vs Johnson backstage. WFCA 50 (eng cc)","[Spoiler] Rousimar Palhares vs Craig Jones - Highlight of the match","What's it like to be an American fighter living in Japan? Brian McGrath tells his story","Chris Weidman has Signed the Contract to Fight Luke Rodckhold at UFC 230","Phil Davis vs. Vadim Nemkov headed to Bellator’s Israel return in November (Per: Nick Baldwin)","Monday's HelwaniShow lineup.","Gillian Robertson posted this to her facebook. The unseen grind.","Does Jon Jones fight in November? (Sonnen)","Wilder vs Fury OFFICIAL | UFC Gaethje vs Vick BREAKDOWN | Ep 94. Podcast | BELOW THE BELT","[Spoiler] Beslan Ushukov vs. Vitor Pinto (WFCA 50)","Gaethje vs. Johnson Postfight Celebration Third Times the Charm","Jon Jones responds to Ilir Latifi's fight request","Post your favorite technical fight thread","Tony Ferguson - An Artist Tames His Monster [feat. Dr. Jordan Peterson]","[Spoiler] Brave CF 14: Jeremy Kennedy vs Danyel Pilo","Bruce Buffer, Frank Shamrock giving an Interview about the game \"Ultimate Fighting Championship!\" (2000)","Gaethje finishes Palomino with leg kick and punches","Rafael Cavalcante’s ideal opponent for Anderson Silva’s return? Daniel Cormier","Free Fight: Rockhold vs. The Chris I","Low-Key Week in MMA Able to Surpass Expectations (Per: Craig Allen)","Masato knocks down Buakaw for the first time in his K-1 career with a perfect uppercut/cross combination [Image/GIF] [Kickboxing]","Anatomy of JacksonWink chapter three AOF","Dana White: GSP is looking for one off big money fights, but we’re not interested in that","Renato Canuto backflips into side control, epic","Free agent Michael Chandler expects ‘boatloads of money’ in new contract","[Announcement] Upcoming AMA with Erik Anders on August 20th, @ 8PM ET!","Caldwell defeats the nation’s no. 1 ranked wrestler to win the NCAA title (2009)","James Vick Stands by calling Justin Gaethje “Homer Simpson of MMA”","[Official] General Discussion Thread - August 19, 2018","Toby Smith vs Jakub Benko, Rebellion Muay Thai, (JWP on commentary)","Francis Ngannou and Uriah Hall sparring. Major size difference.","Ex-champ Phil Davis vs. Vadim Nemkov added to Bellator’s Israel return","Anderson Silva Deflecting Punches from Bisping With His Forearms","Artem Lobov vs. Zubaira Tukhugov added to UFC Moncton (October 27)","Volume vs Power. 21 uppercuts and combos &gt;=&lt; ONE Powerful Uppercut. Gustaffson vs Rumble Johnson featuring Glover Teixeira","Casual/invested fan issues.","James Gallaghers statement after Brutal KO - “I’m still the Sh!t”","[Spoiler] James Gallagher vs. Ricky Bandejas","Kevin Lee gets into mount and begins to drop bombs on Tony Ferguson","Ketlen Vieira: Holly Holm is tougher than Amanda Nunes","Paul Harris supposedly unaware of weight limit, weighs in 218 instead of 185","USADA has started testing in Thailand through Doping Control Agency Thailand(DCAT)","[Spoiler] BraveCF 14: Djamil Chan vs Alejandro Martinez","[Spoiler] BraveCF 14: Felipe Efrain vs Arnold Quero","[Spoiler]Road FC - Kazuyuki Fujita vs. Justin \"That Guy\" Morton Result","The time GSP came into UFC 217 with the most OP corner of all time.","Aleksander Emenalienko vs Tony Johnson Free and Live on Youtube","UFC 229 sells out in 3 minutes","Rizin FF Planning Double Digit Events in 2019, 4 Saitama Super Arena Shows, 4 Events In 5k Venues Like Rizin.12, The Rest Will Be Developmental","Okamoto: Luke Rockhold (@LukeRockhold) has informed me he and the UFC have come to terms for the Chris Weidman (@chrisweidman) fight on 11/3 in NYC. Fight was basically agreed to, but Rockhold needed to speak to UFC about his deal. That's done, and he anticipates signing shortly.","UFC Hall of Famer Dan Severn talks about Tom Lawlor impersonating him at UFC weigh-ins and getting to wrestle him in a pro wrestling match.","ONE Super Series: 4 Exciting Striking matchups at ONE 79 Shanghai.","Fight Facts: PFL 6 Regular Season 2018","[Spoiler] Masaaki Noiri vs. Yang Haodong Krush 92(Kickboxing)","THIS IS UFC II","[SPOILER] Shocking development during Bellator 204's main card opener","Khabib Nurmagomedov times a perfect double leg takedown on a worn out pat healy","Paige VanZant has agreed to a fight date.","[Spoiler] Bellator 204: Caldwell vs. Lahat","Khabib vs Conor - The Promo list thread","Max Holloway drops Jose Aldo with a double 1-2.","Solid prediction for UFC 1","Fighters react to James Gallagher vs. Ricky Bandejas at Bellator 204","People still confuse Rena Kubota and KING REINA so here's the difference.","Galore Bofando ragdoll slam ko’s Charlie Ward.","[Spoiler] Bellator 204: Logan Storley vs A.J. Matthews","Volkan No Time Oezdemir boops Jimi Manuwa in No Time at UFC 214","[Spoiler] Bellator 204:Romero Cotton vs. Willie Whitehead","[Bellator Spoilers] Loser of James Gallagher - Ricky Bandejas Reacts to Loss","Dana White: I Would Have Beat Tito Ortiz in Boxing Match","BREAKING: @ZubairaTukhugov vs. @RusHammerMMA in the works for UFC 229 October 6, Las Vegas, T-Mobile Arena ((information is confirmed now)","Fight Night Lincoln Free Fight: Justin Gaethje vs Michael Johnson","Morning Report: Luke Rockhold says Brock Lesnar, Jon Jones ‘should be suspended for a long time’","Jimi Manuwa has signed his bout agreement to fight Thiago Santos: FN Sao Paulo","The Notorious Conor McGregor blast Ivan Buchinger with a textbook McGregor counter left to become the champ champ at Cage Warriors 51","Rousimar Palhares weighs 218 pounds for grappling match","Robson Gracie Jr., brother of Renzo Gracie, signs with Bellator","Mike Tyson Vs. Michael Spinks HD. A short, exciting fight that showed just what a monster Tyson was in his prime.","Marlon \"One kick man\" Moraes puts Aljamain Sterling to rest","Georges St-Pierre describes how Freddie Roach helped him vs Michael Bisping","Petr Yan's new opponent for UFC Moscow: Jin Soo Son (9-2 DEEP fighter)","[LIVE] XIAOMI ROAD FC 049 IN PARADISE","[Unofficial] Bellator 204: Caldwell vs Lahat Live Discussion Thread","How can axs facilitate scalping for four times the price (original was $255 I believe) and then have the nerve to slap a $250 resale fee on it as well?","Thiago Santos has emerged as the front runner to fight Jimi Manuwa in the main event of UFC São Paulo","Organizations &amp; Their Followers Explained","[Official] General Discussion Thread - August 18, 2018","Bas Rutten level... overdone!","Tyron Woodley started impromptu sparring session in Staples Center after being seated next to Darren Till at UFC 227","UFC champions rankings by PFL point system","Thiago \"Marreta\" Santos hits the pause button on Steve Bosse","MMA 101: The art of the takedown","Poliana Botelho will fight Cynthia Calvillo at UFN 140 in Buenos Aires, Argentina.","Conor McGregor Study - Takedown Defence","Five years ago today: Michael Johnson batters heavy favorite Joe Lauzon en route to a dominant decision victory","Justin Gaethje acknowledges downsides of his fighting style, says he 'needs to be scared' vs. James Vick at UFC Lincoln","Polls: TWO DIVISIONS NEED NEW r/mma VIRTUAL CHAMPIONS!","My first (and only) MMA fight and my run in with Adam Cella","BLESSED ERA: All of Max Holloway's UFC stoppage victories","UFC 229: Khabib Nurmagomedov - My dream is to smash this guy","Current Double Champ DC dodges The Spider's punches and lands an overhand","DC and Khabib Compilation","Never forget the best regional MMA run in history. Jon Jones wiped out all six of his opponents from April 12 to July 12 2008 in devastating fashion before getting signed to the UFC. 🐐","Devonte Smith: \"There was no doubt I was gonna get the contract\" | UFC ® - News","Michel Prazeres (9-2 UFC) submits Mads Burnell with the rare north-south choke","UFC 228: Valentina Shevchenko Pre-Fight Scrum","Brave 14: Official Weigh-in Results","Brunson calls fight with Adesanya 'a step down'","A complete history of the UFC Featherweight Rankings","Was the UFC really better 'back in the day'?","VIDEO: Wanderlei Silva trains for fourth fight with ‘Rampage’ Jackson","Mike Perry Gave Advice to Till on How to Beat Woodley:\"I think maybe you could do this some more; bend your knees some more and get lower sometimes.\"","Petr Yan can do it all (vs. Ed Arthur)","UFC has found a new opponent for Petr Yan at UFC Moscow.","Nate Diaz suffers his first knockout loss against Josh Thomson","Beautiful hellbow KO by Kunseuklek Aor.KuanMueng (The BattleMT)","[QUESTION]: Who are your all time top 5 P4P announcers?","Wanderlei Silva Training for Bellator 206 Fight With 'Rampage' Jackson - MMA Fighting","What KO had you legitimately worried about a fighter?","What fights, which happened early in fighters careers, would be huge fights if they were to happen today?","Conor McGregor styles on The Underground King Eddie Alvarez to become the first dual weight UFC champion","Curtis Blaydes vs. Francis Ngannou is scheduled to be the main event for the 11/24 card in Beijing, China, per sources. The fight has been agreed to but not yet signed. Story coming to @espn.","Sad moment in MMA when Lyoto Machida kicked Randy Coutures tooth out of his skull","UFC contender Anthony Smith to Daniel Cormier: ‘Put up your title or get out of my way’","Cowboy vs Platinum - UFC Denver Promo","One of my favorite KO's of all time. DHK vs John Hathaway","Tony Ferguson Responds to Iaquinta's Call Out:\"You Sell Houses, I Build &amp; Buy Em’\"","Luke Rockhold: Without right contract, no fight vs. Weidman at UFC 230","King Reina's prospects in the West","[Spoiler] PFL 2018 #6: Rick Story vs. Carlton Minus","Nate Diaz lands a delicious 5 piece combo to crumble Junior Assuncao.","'Groovy' Lando Vannata drops Bobby Green with a right hand shot","Caldwell talking about going for two titles in new Bellator promo","Israel Adesanya puts on a striking showcase against Brad Tavares.","[Image/GIF] Conor McGregor elbows Steve O'Keefe for the TKO.","This is one of my favourite highlight reels. 2017 was a good year to us","[SPOILER] PFL #6: Ray Cooper III vs. Pavel Kusch","UFC’s Mike Perry ready to stab Colby Covington in the eye with his thumb, beat Cowboy Cerrone and buy a boat","Tyson Pedro: Setting Up Power Strikes With the Jab!","Thiago Santos kicks Anthony Smith in the liver, proceeds to smash his face","GIF Breakdown of some of the best shots Michael Johnson landed on Khabib","James Gallagher: Bellator 204 Full Media Day Interview","Making my professional debut tomorrow!","New Bellator Signing Richard Kiely: I’d like punch the head off Raymond Daniels in Bellator Kickboxing","Demian Maia vs. Rick Story Free Fight","Rumble Johnson sends Glover Teixeira's tooth to andromeda with a vicious right there fred","[Spoiler] PFL 2018 #6: Jake Shields vs. Herman Terrado","Brave CF launches global streaming platform","UFC 229: Khabib vs. McGregor - 'Big Drama Show' Trailer (Hizzer Edits)","UFC 228: Champ Camp 5 Tyron Woodley Ep.1","[Official] General Discussion Thread - August 17, 2018","Conor McGregor finishes off Paddy Doherty in 4 seconds with a clean counter left","Dan \"Hangman\" Hooker Highlights","Bellator 204 fighter Willie Whitehead misses middleweight limit by 14 pounds","Brendan Schaub and Bryan Callen react to Conor McGregor vs Chad Mendez. Does Khabib have a chance? I think so.","Anderson Silva says Khabib is currently the UFC’s best fighter","Frankie Edgar on fighting at UFC Denver: \"It’s funny, because in February I’ll be in the UFC for 12 years, so considering this is the 25th anniversary, I’ve been in the company for almost half of its existence. It’s nice they chose me to lead an event like this.\""]