["What Is A Showerthought?","Showerthoughts is looking for new moderators!","If dogs had butts that needed to be wiped every time, less people would own them.","Smart phones killed the alarm clock industry","Nothing hits you like a dog not liking you.","Every year the number of people with the same age as you only decreases.","If you start counting from zero to either positive or negative numbers your lips wont touch till you reach 1 million","If WWW stood for well well well, the internet would seem so much shadier. \"Well, well, well... Google dot com...\"","Even if 99% of the human population doesn’t find you attractive, there is still 75,270,000 people that do find you attractive.","Because it’s not completely common knowledge that Oreos are vegan, they could sell a vegan version that’s just Oreos and make it more expensive and hardly anyone would notice.","There is someone you haven’t seen for a really long time who still thinks about you now and then.","We are fortunate that farts aren’t as sudden, violent, and difficult to suppress as sneezes.","Going to bed 20 minutes early seems pointless, but snoozing your alarm 5 minutes feels amazing.","Women's clothes designers don't put pockets on women's clothes so they can sell them bags","If they have funerals in the Cars universe and they don't end the eulogy with \"...gases to gases, rust to rust,\" then they're wasting their time.","When proposing anal, fuck that shit can either be a very positive or very negative response","If Monopoly has taught us anything it's that the real winner of the game is always The Bank.","The Tooth Fairy teaches children they can sell part of their body for money...","Tony Stark is going to have to tell Aunt May.","10 years from today it could be your wedding day or your kids birthday, but for now it’s just a regular day.","Considering how many people become instagram famous nowadays, the aphorism \"Fake it till you make it\" is now more relevant than ever","The Bat signal only worked when the sky was cloudy","Any animal who got on Noah’s ark and had issues with fertility doomed their entire species.","The sun must be hot as shit if you can feel it from earth but you can’t feel a fireplace from 5 feet away.","Ability to question the purpose of our existence is one of the main qualities of our species. It is also the main reason we suffer from depression.","For every successful invention in the world there's probably one other guy who had the same idea and is salty he didn't make it first","Maybe alien abductions are just the alien version of an “animal rescue”. The humans are getting needed medical attention but just perceive it as being captured and released.","In less than 400 years, we have gone from not understanding why apples fall down to almost fully understanding the origin of the universe.","In light \"white\" is the combination of all the colors and \"black\" is the absence of color, but in paint \"black\" is the combination of all the colors and \"white\" is the absence of color.","When your power goes out, all the noise your house makes stops in an instant. This creates a very unpleasant feeling because you thought it was quiet before, and now it really is.","Birthdays are just participation trophies for life","There has only ever been one action in the history of the universe, everything else was, is and will be a reaction.","$1,000 isn't a lot of money to have, but it is a lot to owe","We say it's a dog's life meaning a miserable experience but having your only job being someone's friend and playing between naps sounds pretty good.","You are an NPC for almost everyone in the world.","If you are singing along to a song on the radio there is a good chance you are singing along with thousands of people.","Morning people are just night people in the wrong time zone","College is probably the only place where it is worth it to walk a half mile in the rain to staple two pieces of paper.","When you think of an image, you don't see it. You can visualize it in perfect detail, but your eyes don't see it. It's just there. You can see without seeing.","Lying about the size or your penis is a phallusy","Nobody hates Star Wars movies as much as Star Wars fans.","The wizarding worlds' version of Playboy must be a lot more popular due to the moving pictures, and potentially living portraits.","Everything is a boomerang if you throw it upwards.","The reason fake stars are given as rewards and symbols of success in life and games is because real stars are one of the few things we covet that are completely unobtainable.","Our hair going grey is like the human version of running low on toner ink.","Checking the time for no reason is a waste of time.","The first, and possibly hardest, step in having a meaningful debate is to ignore the overwhelming desire to say, 'everything you believe is stupid and wrong.'","Dust consists partially of human hair and skin cells. Roombas eat dust. Roombas are opportunistic omnivores and we are a part of their diet.","Every single being in the universe may see different colours than you, but you would never know.","People who lived a few hundred years ago, near the equator may have been completely un aware that water can freeze.","With beef, cheese, lettuce, tomato, and a grain item, burgers and tacos provide the 5 main food groups.","Schrodinger could have just flipped a coin and covered it with his hand.","A funeral is just you graduating life","The first person to eat a chili pepper probably thought they were going to die by fiery mouth. The second person to eat a chili was probably pranked by the first.","They really missed out on an opportunity calling handicapped stalls the 'handicrapper'.","Actors must be excellent at role playing during sex","We would look at drinking hot beverages very differently if our tongue and lips didnt heal so fast.","Pessimism is a win-win situation, if an event turns out poorly then you are right in your prediction and if it turns out fine then you are pleasantly surprised","A fart is both tear gas and laughing gas.","You haven’t known fear until you’ve been defecating in a public toilet and reached for the toilet paper only to find it’s empty.","People who take the time to comment \"Nobody cares\" care more deeply about the subject than those who choose to say nothing.","If you break out of jail on Halloween everyone will just think you bought that cheap prisoner costume at the store.","There’s probably at least one stock photo family who bought a picture frame with their photo already in it and have it hanging in their house unopened","Due to the fact that guys around the world get erections every morning, we have been doing a \"boner wave\" since the the dawn of time.","Of all the far-fetched theories the medieval era came up with, the belief that flies came from spoiled meat and mice came from mounds of grain really makes a lot of sense considering we usually have no idea how the hell they got in.","Everyday, somebody somewhere let’s out the loudest fart on Earth that day.","If you're stupider than 99% of the population, you're still smarter than millions of people","The easiest way to get a friend is to finally like yourself.","Getting a spot in your vision after looking at something bright is the eye equivalent of burning your tongue","\"being shit\" and \"being the shit\" are polar opposites","Due to muscle memory, a guy reveals the approximate size of his penis when he does the jerk off gesture","Crazy people take pills to act normal, and normal people take pills to go crazy.","Anyone with short term memory loss always has someone to play chess with","Drinking to forget about your pain is basically just emotional procrastination","If you could transform into any animal, if you did you'd probably lack the brain power to make the decision to turn back.","Beanbags are just boneless couches.","When VR gaming technology replaces console and desktop gaming, middle school children and neckbeards will be the most athletic people around","Awkward to use phone in left hand unless doing so while jacking off...","There's likely some kid out there faking your birthdate to buy something or get into a website.","A single Goonie was able to take down the avengers, and half of the universe","The keys always seem to be in the pocket of the hand that is full of groceries or food.","When fireworks were first invented anyone who saw them that didn't take part in the process of making them must've thought they were high as balls.","It will not be too long before colleges start granting scholarships to build competitve eSport teams.","The human brain is the most complex thing in the universe, according to the human brain.","You never truly realize how loud a phone's vibrate is until the middle of the night.","All stars are death stars.","A open-mind person will be happy to be proved wrong.","The teenage pregnancy rate drops to 0% at age 20","a corn dog is just a meat-twinkie","\"Ya boi ____\" has naturally become the \"Yours, truly\" of 21st century internet culture.","You never notice a TV show doesn't use profanity often until the one time it does","You never notice your eyes blinking, until you think about your eyes blinking.","Morgan Freeman probably read his parents bedtime stories when he was a child","Different fonts in Braille would be really confusing.","Many years from now, people will laugh about our predictions of the future, and they'll get a little bit sad because we expected too much of them and they betrayed us.","If there is an afterlife, there are gonna be a ton of mosquitos seeking revenge.","Rap in the middle of pop songs is this generations version of guitar solos in rock songs.","Magic Mushrooms are food for thought","If you drive fast enough towards a red light it turns green.","Life is just a really, really long replay of how you died.","Maybe anti vaxxers are caused by really smart brain diseases.","The piracy adverts that said ‘you wouldn’t download a car’ really didn’t foresee the possibilities of 3-D printing","The guy from the game \"Operation\" was completely awake.","Ziplock is partially responsible for a major fraction of drug smuggling.","On the Day we meet Aliens and share our history with them . It would be very difficult to explain the Science Fiction movies about Aliens attacking us .","Mr. Rogers, Steve Irwin, and Bob Ross are probably really proud that Weird Al, Keanu Reeves, and Dave Grohl have succeeded them as this generation's Holy Trinity of Wholesomeness","2032 is closer than 2004","Bugs can eat as much as they want but they never get fat.","Up until they're born babies are cooked at 98 degrees (Fahrenheit) for roughly 9 months.","If there truly are infinite universes, then whenever you imagine something you are looking into a different dimension.","Bad teachers are as inspirational as good teachers.","We’ve made chicken nuggets into fun shapes for kids, like dinosaur shaped nuggets, but we’ve never thought to make them into the shape of an actual chicken","Someday in the very distant future, 100 year-olds will be considered middle-aged.","Someday, half the people who've watched infinity war will die.","Flat earthers have to decide which maps are the real ones. The ones with Europe and Africa in the middle, the ones with the Americas in the middle, or the ones with Asia in the middle.","Reservoir Dogs would make a great stage play.","If sign makers went on strike they would look like they are walking in circles for no reason.","Human beings are so adaptive that sometimes they rather adapt to shit in their lives than working on removing it.","Most of us technically live in several dead trees.","Giving electric cars VIP parking is basically just giving rich people VIP parking.","If you kill two birds with one stone you’re efficient. If you kill one bird with two stones you’re a monster.","People don't want the truth, they just say they do.","If immortality is ever reached, some people will be just one day short on becoming immortal.","A lot of ads for Mayo and Ketchup claim to be \"Homemade Style\" yet most people have never had Homemade style Mayo and Ketchup.","Your phone loses its purpose if you’re the only human that has a phone.","Given the human traits of megalomania, selfishness, and capacity to inflict mass death/suffering (on other humans and other species), maybe aliens have banished us to earth.","Someone, somewhere out there, has the smallest dick on the planet","Whenever you play a video game you are not getting lost in your own imagination, you are actually getting lost in someone else's imagination.","A spoon is just a bowl with a stick","Humans are so good at recognizing faces, we see faces in things that don't have faces.","The things that scare us the most wouldn't scare a baby because society hasn't taught the baby to be scared of stuff yet","The majority of the people will never see their bones or internal organs.","Eating worms is appalling.Eating anything else in the shape of worms is appealing.","Air-conditioning repairmen have to work all day in unair-conditioned homes.","One day you'll eat your favorite food and never eat it again.","The first 12 days of any month are always the most difficult in figuring out which date format people are using","A sneeze that lingers but doesn't come out is like a denied orgasm.","Walking down stairs is just domesticated falling","The chances of winning the cash prize on the back of the taco bell receipt is probably really good because nobody ever takes the survey.","There is a small possibility that aliens are hiding in the 80+% of unexplored waters.","Fish can breathe their own pee","The human body is like a computer, getting vaccinated programs you with anti virus software","The restroom is the opposite of the dining room.","Rich people stay rich by living like they're broke. Broke people stay broke by living like they're rich.","Wizards in prison must get conjural visits.","The first person to be apprehended with a taser must’ve been pretty fucking scared","Tinder and other dating apps’ main purpose is making you get rid of the app","Typing 2 capitals by accident when only one is meant to be capitalized is the text equivalent of having a voice crack","If we were mice we would have almost been invincible, we cured cancer, alzheimer, aids, aging and more in them.","if deadpool was in infinity war and was supposed to die with the snap then he would just be really dusty","A big part of a dogs life is figuring out where to lie down next.","The first human to discover fire must've been super confused at how tf that happened.","It required that thousands of people would fuck so you could be born.","Carnivorous plants are sort of the opposite of coral. Coral are animals that have plant-like behaviors, and carnivorous plants are plants that have animal-like behaviors.","Speaking is literally just manipulating the air with vibrations. We’re all airbenders.","You never know how many muscles you use until they’re all sore","Civilization is just a bunch of mostly agreed upon rules that prevent us from murdering each other on the regular.","A charcuterie board is just a super fancy lunchable.","people constantly being sceptical of other people in zombie movies might be on of the reason people are sceptical of other people if there was a zombie outbreak","The rise of self driving cars will also bring a rise in road head.","\"100% more\" sounds more dramatic than \"twice as much\"","The conventions on human rights are the new sacred texts","Sticking your head out of a window while a car is driving fast is kinda like hitting the randomize option to change your hair style in an RPG.","In the dollar store, 2 dollars feels like a Fortune and in every other store, you think it’s a great deal","It's weird that vibrations in the air created by another person's vocal cord can affect our emotions and actions on such a deep level.","Sid Meier's \"Civilization\", a game that followed human progress from the \"Ancient Age\" to the \"Modern Age\" was created in 1991 - right before the start of the \"Information Age\"","Life insurance is a bet with the insurance company on when you will die","Mustard is navy yellow","Opening a new tab and forgetting why feels the same as walking into a room and forgetting why","The mother of invention isn’t necessity, the mother of invention is laziness.","Hungry Like the Wolf by Duran Duran and Animals by Maroon 5 are basically the same song, re-written for a different generation","Having family portraits in your bedroom must be awkward in the Harry Potter universe.","Cult classic video games never get advertisements, but bad blockbuster games get all the advertisements.","Crashing into a wall with 90km/h by car, might have same effects as falling from 11th floor by car.","Your parents only knew you a part of their life but you knew them your entire life","If the original Apple logo were released today, people would accuse the company of pushing a pro-LGBT agenda.","Everyone's both a morning person and a night person... Just not necessarily in their timezone.","Smart phones killed the GPS industry","Most states taxes from powerball lottery winnings go towards education. Therefore, the dumbest people in the U.S. are inadvertently funding education.","We really under appreciate the fact that humans have eyelids, otherwise seeing a person sleep would be absolutely terrifying","The first person to discover a parrot could talk, probably tried it with other animals.","If the universe is a 4D sphere, then a wormhole is like the 4D equivalent of digging to China.","Our whole lives can be completely changed by the smallest choices","The very first youtuber to go \"Make sure you guys like, subscribe, and comment\" probably received very negative responses","Using your phone while you charge it is like drinking water while you pee","In 15 years, when people talk about the 20s, they won’t be talking about the 1920s anymore.","ElonMusk probably doesn't care about lawsuits because if he's ever charged he can literally run away to space and no one can stop him.","In order to use a flying car, you would need both a driver’s license and a pilot’s license","Jeff Bezos is the Prime minister.","The infuriating thing about music is that the song you like and listen frequently never become an ear worm and an old ass song whose music you listen like few seconds becomes an earworm.","If Martin Luther were alive, his first reform would probably be, \"Stop raping children!\" His second reform would probably be, \"Stop covering up rape!\"","Having Albinism is just like being a vampire but without any of the perks.","The tooth fairy pays out for baby teeth, but none of us have seen a cent from the 90-95 bones we've lost since we were born.","Clams are the Pistachio of the sea","In the movie Avengers: Infinity War (2018) a dwarf plays a giant dwarf.","Being an executioner back in the medieval times must have been such a strange job.","Driving like a dick in a BMW is like a karate master going around beating people up.","Children might perhaps be the most expensive thing you'll ever get","\"Sleep easy\" is just a simpler way of saying \"rest assured\".","You'll never know for sure if you're going to wake up in the morning.","Every piece of science fiction on our Earth is probably historical fiction in another dimension","We go to extreme measures to ensure the animal population doesn't keep rising, but we do nothing about human over population.","Being inconsistent all the time is actually being consistent","If there was a weight lifting champion that had lots of knowledge about history, he’d a a historically buff history buff.","If sonic was played in first person it would be pretty much infinite times harder","We can't remember dreams too much unless it is a nightmare or when it becomes too weird.","The more you know the more you realize how little you do know","The only time people use the phrase, “we’re all adults” is to imply that someone is not.","If we actually invent flying cars, the streets will finally be returned to pedestrians.","Marriage is one of the few things you're better at the fewer the times you do it.","You know you're a masochist when you stop thinking the funny bone was named ironically","A person who can't use a gun is more dangerous with a gun","Every time an autumn leaf falls to the ground, that's the first time that leaf has ever had direct contact with Earth's surface.","In order to get shit done, you need to get shit together first.","Mapping the entirety of the human brain doesn't sound as complex when you consider Google earth was launched 17 years ago with technology far more inferior to today's standards or technology that will become available in the next ten years.","No matter what, even if someone hates you, anyone you know and met, their brain made room for you to remember you.","Every structure built on land is technically curved, because the earth is spherical","You don’t ever start growing a beard , you just stop not growing a beard","Given how a pineapple looks on the outside, the first time someone cut one open and took a bite was probably one of the most delightful surprises in ancient history.","The fact that Pop Tarts still exist since the introduction of Toaster Strudel is a testament to the awesomeness of Pop Tarts.","One day we might have animals that live forever because we’ve cured them of everything trying to cure ourselves","Even though we got rid of dial-up a while ago, a lot of people still rely on their phones to use the internet.","Warning people to avoid rushing to conclusions before gathering all the facts is like warning teenagers to avoid sex before they’re married.","The only consolation after reading a popsicle stick joke is being able to literally throw the joke in the trash.","There's probably a lot of cases where someone's original idea of something brilliant was already thought out by one or more people who just said to themselves \"well, that's just stupid.\"","Between intentional fake news and widespread opinion pieces, future generations will have a much harder time researching events in the past.","Autonomous cars only need to kill 1 less person per year (vs the current road-death figure) for them to be safer than human drivers.","In a million years, even if there are humans, no one will be talking about, concerned about, or know about anything we did in our entire lifetime...","Colors don't exist externally. Objects just reflect light differently, but nothing actually has a color until someone/thing looks at it","If you take the \"re\" out of \"breaking\" and put them in \"bad\", you begin \"Baking Bread\".","Every time you inhale you swallow millions of tiny organisms.","Every life decision you have made has led you to this post.","The saying, “Home is where the heart is” technically makes us nomads.","Anyone who looks like Michael Jackson also looks like Miranda Cosgrove, and vice versa.","Getting enough sleep and still being tired, is having a hangover from life","Weve most likely drank the same water a dinosaur has at one point.","Snoop Dogg is now helping to educate children on how computer software works.","Dying from a preventable disease is like crossing the road without looking both ways.","Peeing in your pants is hot then cool but also neither.","'Who's turn is it to carry the pregnancy', is a conversation unique to Lesbian couples.","Being high maintenance may be the only privilege which cuts across all racial and economic lines. HMP is real, and we all know someone who has it.","At some point in time, someone decided to light a plant on fire and inhale the smoke just to see what it would do.","As an adult thats been driving for a long time the chances that you have past someone on the road who had a dead body in the trunk is high.","Earth is basically covered by an ocean of air and we all just kinda live at the bottom and can't swim on our own.","As an artist, you know you're work will never be felt just like you wanted. Everyone gets it in his own personal way: that's the curse and the beauty of art.","Everybody claims mental math is too hard until you put a dollar sign in front of the numbers","Bulldozers Made Beasts of Burden like Bulls Obsolete, Allowing the Bulls to Doze.","People who dislike babies who cry in public were once babies who cried in public.","When you are married, for a limited time everything is on a half price sale","The only parents not excited for their children to go back to school are Teachers.","When you are in a parking garage, you are both inside and outside.","Ordering a new computer using the one it will replace is essentially the same as making a person dig their own grave.","Carrot cake is carrot cake even if you have it on a birthday.","If profiling works, we need to start keeping tabs on people with bowl cuts.","Earth is like humanity’s spacecraft, and the night sky is our viewport.","People like ASMR but most people would be creeped out the same ASMRartist did it to them irl","Reverse sarcasm is just telling what you really think, but in a mocking tone","Disappointment feels like a leap that you almost get to the otherside, but you fell instead.","Converting calories to the number of minutes of exercise it would take to burn them off on snack bags' nutritional values would result in an equal decrease in snack consumption and exercise","Salt is so weird","The reason that the harder choice in most dilemmas tends to be the right choice, is that if it wasn’t the right one, you wouldn’t even be considering it as an option.","Drug sniffing dogs are probably far less effective than the police make out but are such a great deterrent that police would never admit this to be the case.","The lowest phone luminosity is too much for the night and the highest luminosity isn't enough when out in the sun","Life is basically a journey with many problems to solve","The poor guy that invented the wheel probably thought he'd be famous forever.","If cats and dogs had a butt you had to wipe regularly, less people would own them.","You are what you eat but you can eat a diet full of carbs and if someone were to eat you they'd be eating pure protein.","There is a small amount of gasoline in your car’s gas tank that is as old as the car.","Your birthday is a personalized New Years.","Females are born with all of their eggs in their ovaries.. so really.. instead of just being your 'own age' years old, you are your age plus your mum's age.. plus however many months in utero from when her reproductive organs where created","Smartphones with a notch in the top aren't always top notch phones.","When you walk away from someone you're actually walking towards them in opposite direction.","Whenever you click the “Random” button on a comic strip website, there’s an incredibly small chance that you will actually be taken directly to the next page. However, considering how small that chance is, anyone who experiences it will assume they actually just clicked “Next” by mistake.","In a thousand years archaeologists will dig up tanning beds and think we fried people as punishment","The first known straws were made by the Sumerians 3000 B.C and have been used since.. and yet, we don't see them in any films or pictures depicting ancient times.","Graveyards are gonna be a HUGE find for future historians seeing all of our fossils in an arranged fashion.","Pitbull is the Nicholas Cage of music","Games you have to pay for are basically pay to win because you have to pay for it in order to have even a chance at winning.","We all have a piece of shit inside us.","Marvin the Martian was the perfect referee for the space jam bb game between the looney tunes and monstars because he was both an alien and a looney.","A boneless wing is just a chicken nugget","In public you're a completely different person when talking to someone you may never see again in public to avoid any negative thoughts about you even though you would probably act in the polar opposite way to the same exact person on the internet and not care how they think about you.","Giving mouth to mouth is the human equivalent of blowing into a video game cartridge to make it work","Apples’ stems are like their umbilical cords","Eating Taco Bell when you feel well will make you feel like crap, but eating Taco Bell when you feel like crap will make you feel better.","the first guy who didn't have a hand shake completed would have felt the most embarassing moment at that point.","Saying something is \"very cringe\" is very cringe.","It is high probability that at this moment, your future wife/husband is promising her/his current boyfriend/girlfriend about how they are going stay together for rest of her/his life.","You can roughly estimate someone’s age, or who they are, by their sneeze","All drinks are flavored water.","If you refer to people you meet as 'bro', you are a bro.","Fantasy Football is just Dungeons and Dragons with jocks.","Drinking away your problems is like turning the light out on a messy room: the mess is still there, but you can't see it... for now.","A scenario where an unstoppable force meets an immovable object is impossible","Reversing \"Neil Armstrong\" actually gives you \"Gnorts Mr Alien\".","Breaking down an atom","How would Jackson Pollock feel if he knew that his paintings would be mentioned most often with reference to masturbating","Unlike most creatures, humans adapt by manipulating the surroundings instead of naturally changing themselves","People are ridiculed for staring at their phones too much, not talking to each other in restaurants etc. The same thing must have happened when newspapers became popular","There are more creatures on your body than people in the world","Duvets are just blankets for blankets","Although nor seems to be the opposite of or, it is actually the opposite of and.","Every single one of us holds a world record without knowing it. It probably is something ridicolous like \"highest pinky finger to forehead ratio of a 173cm tall woman born in Delaware\", but all of us hold one.","The lazier you are, the more harmless you are to society.","\"Child-free = selfish\" is false justification. This faulty logic is oft used by those who regret having children as a form of self-consolation.","Thanos literally has time on his hands.","In sci-fi films, the extinction of the human race caused by an invading alien species to serve their own needs, is the same thing we are doing to thousands of native species on Earth.","Somewhere, at this exact moment, there’s someone having a worse day than you.","Danaerys Targaryen can never enjoy a hot beverage. It’ll always be cold to her","People would probably be more productive if the internet shut down every night","After ghosting enough people in a small area, a simple grocery store run seems like a spec ops mission","If we would fart when others farted subconsciously like we sometimes yawn when someone beside us yawns, public transport would be a hot mess damn near 100% of the time","You pass the future anniversary of your death every year on some inconspicuous day","We can all have an out of body experience with a VR headset compatible drone","Ever notice after intense parts of movies your popcorn magically disappears","In Republic, Plato writes his beloved mentor, Socrates, into fictional conversations. Essentially, it's the first fanfiction in history.","Tinder users are pretty much candidates who submit picture-based résumés that can be accepted or rejected on the spot by their employer","There has probably never been a good radio commercial.","An SUV is basically a people pickup truck, complete with protective roof","Porn websites advertise other porn websites which is like having an eBay ad on amazon","Had we not domesticated cattle, Cowboy/cowgirl would be used in a derogatory way","Our Parents Don't Actually Love Us and Our Siblings Equally...","In a universe made up of anti-matter, the intellegent life there would view our matter as \"anti-matter\".","Being talented is just a cool way of saying borned lucky at a specific thing.","The boy that cried wolf","Rearranging the chips so when you take them out of the bag they will all fit in your mouth, is just the fat way of playing Tetris","If you tell someone that you are humble, you aren't humble.","You pronounce gigawatt with a ‘g’ - unless it’s exactly 1.21.","The air purifier is a great example of how someone has made a lot of money by selling an accessory to go with the air that we breathe for free every day.","If humans had a better sense of smell like dogs, it would be used more often during court cases.","The people who urinate on public toilet seats are always super dehydrated.","Mercedes has three Es that are all pronounced differently...fuck.","If the real world was like videogames where you just disappear when you die, murders would be a lot harder to solve.","Your birthday is always a happy day, until you die.","Finding quarters in your clothes at the laundromat is like winning free spins on a slot machine.","A tie is just a really thin cape that men wear on the front of their body.","You’re slowly killing yourself by living. Living kills you.","Mr. nice guy might finish last...but he also might make it to heaven","In the Hunger Games seirse the hunger games has lasted 3/4 of a century, not one country has tried to stop the games.","The higher up the corporate food chain you go, the less likely they'll answer their phone.","Birds probably think they are better than us.","'Virtual Reality' is a contradiction in terms.","Even if you could travel through time, the earth is not going to be in the same place.","The fact that our hands sweat when we’re at heights is a terrible evolutionary mechanism when trying to keep grip of something.","It's easier to beg forgiveness than ask permission.","We are to nature, what we fear AI could one day be to us, uncontrollable.","Superman had to buy glasses from someone and request that it not have a prescription.","If you take a picture of the cringe slide that your teacher made to post it in r/FellowKids, he might think that you actually liked and will share it with your friends. (And he is not totally wrong)","If you were born a year before or after your current birthdate you would have a complete different friend group","Some people stay up because they hate tomorrow. Other people stay up because they don't want today to end.","You could theoretically move fast enough away from an ultrasound probe to hear it","Humans are one of the few species where baring teeth indicates joy","News that is genuinely shocking nowadays is when people are actually nice, lawful, and morally good.","Most authors hate piracy because they don't get any money for it. However, most authors also promote libraries, where people can take out their books for free.","Movie extras are basically NPCs","The alphabet is only the way it is because we made it that way. If we arranged it differently then we would accept it that way.","Modern day duels are the wait to see who will take their phone out first","Humans have pools of water, but fish don’t have pools of air.","Burning a toast just makes you wonder who the hell changed the toaster's settings.","Something's wrong when a \"serial dine and dash dater\" is facing 13 years in prison while serial sex abusers are getting off scot-free.","True fear is sitting on an oversensitive automatic toilet","When at home, sitting on a warm toilet seat is nice. In public, especially at work, it is extremely unnerving.","Trying to remember something makes you forget that thing","In 50 years being considered \"old fashioned\" will have a whole new meaning","Continually checking the tracking history of your package is like watching and waiting for water to boil for more than two days.","If your peripherial vision was clear, it would be so easy to cheat on tests","It’s surprising more languages don’t use clicks and whistles. It seems like it would be fun.","Refining an idea that took 15 minutes to think of from start to finish down to one sentence is much more difficult than the people in this community make it look","The basic design of the toilet has not changed much since it was invented and probably won't change much ever.","Stars in the sky are eerily similar to dead pixels","If it weren’t for criminals, millions of people would be out of a job.","Everything changes nothing stays the same, change is chaos and chaos is where we all thrive","If you were the only person on Mars you would be the world's best athlete.","If a pitcher could learn to pitch with both arms, he/she would become a dual threat and would never have to be pulled due to injury or fatigue.","Back in the day gas stations were very used to folks filling gas to an exact amount ending by the dollar or quarter because they paid cash. Now with credit cards it's whatever.","The sole purpose of some tools is to play a part in building and/or servicing more advanced tools.","English is strange we have runny noses and smelly feet.","If you have to advertise that everyone is raving about something, everyone isn’t raving about it","Drinking cold water after you've been drinking hot coffee is the oral equivalent of getting back in the pool after you've been in the hot tub","Michael B Jordan has daddy issues in Creed, Black Panther, Fahrenheit 451, the Fantastic 4, and Friday Night Lights.","Motivation and procrastination are the same thing. Procrastination is the motivation to avoid things you need to do.","Evolution decided that smell was as important as vision, if not more important, by putting it in front of your eyes, impairing your vision slightly, to be able to easily smell what you put in your mouth","Cold weather is just free air conditioning.","What most of us consider to be \"exotic pets\" are normal pets in other countries.","There is no such thing as the truth. There is only the perception of it.","Socializing is more tolerable when we are procrastinating.","back in the day, people wrote in journals the way our generation tweets. but rather than people seeing it right away, people usually saw it after the person had died","If there will be flying cars in the future, roofs will likely be rented as advertisement space.","It would be perfectly acceptable for Multiplicity to have a crappy sequel.","The only animal that watches as much porn as we do is the spider","Goldilocks was a thief, a vandal and a squatter.","If blinks were audible, the world would be a much more unpleasant place.","When the creator of Adobe Photoshop dies it would be a huge missed opportunity if headlines don’t read, “Adobe Photoshop Creator Is Shopped Out Of Universal Picture”.","Sperm cells ram themselves against the egg wall in order to weaken it so it can be impregnated, usually destroying themselves. So we're not actually made from the fastest sperm, we're all made from the mildly lazy sperm that just took credit for all the work done by the faster ones.","Whenever something needs to be sorted alphabetically, most people will still sing the alphabet song in their head.","There are an infinite number of ways you could die today","The Alamo is Texas's version of 9/11","If people were as careful with money irl as they are in video games, the world would be a safer place","The Kim Kardashian sex tape may have resulted in more income than any film in history.","Cows are bad vegans since they’re dressed head to toe in leather.","‘The circle of life’ is like a national anthem for the pride lands","An earworm can only leave your head when it infects another's head.","One day we're going to have to explain that we excluded bots from certain parts of the internet to protect the enslaved, not to discriminate against them.","Getting your penis cut off then getting turned into a vampire would be really unfortunate","Anyone named John Doe or Jane Doe must have an incredibly difficult time signing up for online accounts","Calling someone a \"bottom feeder\" is an insult. Calling someone an \"ass eater\" is a compliment.","You pay 700 for an iPhone that comes with headphones that don’t work with your $2000 Mac so you’re forced to spend another $150 for Bluetooth headphones.","Potential employers would get a much more accurate representation of how you are by randomly asking people in your area about you, rather than contacting ONLY the few people on Earth that YOU told them to contact.","Putting your food in the freezer is basically just putting your food in cryo-stasis, Master Chief style","The comfyness of a couch cushion is directly proportional to the intensity of the shock you get when you throw yourself on it, as you get lower and lower into it","Maybe cats are afraid of water because they drowned in one of their past lives.","Crouching to do a sneak attack in a video game is actually quite counterproductive to being silent.","Bars/pubs are dark to help people who are somewhat ugly get game","Food is a language that your body understands. It reads the incoming data and instructs your body to perform functions based on what it has read.","the luck of children must be high as fuck considering how easy they can hurt themselves","Asking a person if they feel comfortable would make them self-conscious and eventually feel uncomfortable.","The first human ever to wear animal fur as clothing was also mankind’s first Furry","Whether you believe IQ tests actually measure intelligence is, in itself, an IQ test.","Listening to non-English songs that have English lyrics in them makes it feel like the universal translator temporarily kicks in and then turns itself off again","The standards required to adopt a child are vastly different from the standards required to have your child taken away.","The sun has no nighttime or daytime","Instagram would be a lot less damaging to people’s self-esteem if every selfie showed the number of attempts that preceded it.","If she doesn’t know why nobody likes you when you’re 23, she’s probably too young for you.","Winters would really suck if rain was salty.","We’re making phones thinner and slimmer and it’s pointless because we need to put a case and screen protector on it so it doesn’t get demolished when a penny falls on it.","There are no more genies because someone probably wished to get rid of all the genies","It's pretty unfortunate that even with the power of the Mind Stone, Vision couldn't think of a way to be helpful.","We often fantasize about the world thousands or even millions of years from now; likely there were some intelligent early hominids/cavemen who on dark lonely nights in their caves wondered about us and our era.","Thanks to Google Satellite, \"can be seen from space\" has become the least remarkable thing about the Great Wall of China","When it rains the humidity comes down, after which the humidity rises","A caregiver and a caretaker are the same thing","We sure are lucky elephants aren't carnivorous.","People born in September were probably a new year resolution","The first person who contracted the flu from someone probably thought he'd been poisoned.","Popular comments are usually recycled comments","Watching what a persons idle hand is doing while drinking from bottle is oddly fascinating as everyone is different.","Authors of Wikipedia articles don't get enough appreciation.","At least one person is the busiest person in the world, they may feel it, but they’ll never know it.","We are in space at all times","If you got a dollar for every number you counted (no repeats) from 0 to infinity, you wouldn’t even become a billionaire in your lifetime","Environmental laws and recycling are slowly making sea glass a rare commodity.","Just buying a pair of yoga pants has done more to get people to get themselves in shape than most paid diet plans","If you record yourself in English and then play it in reverse, it sounds a bit like German.","Almost every professional athlete is a contractor","The person who finally invents a male contraceptive pill is gonna become an instant billionaire","The first clothing company that manufactures women’s jeans with sensible pocket sizes will make a fortune.","Since giving youself a handjob, aka masturbate isn’t considered gay, than by that logic giving yourself head isn’t gay at all.","The human species is the only species on earth designed to evolve towards self extinction","Technology progressed from turning the gear to flipping the switch to push the button to touch the screen. And it's possible that we will(or already) progress to waving hands in the air to doing nothing at all.","If adds and videos didn't move the text of articles around as they load, they'd be a lot less annoying","It’s 2018 and we still aren’t able to text he cops in situation where we need to be silent smh","Belts are like wristwatch bands for your waist","We only think about our body temperature when our environment is trying to kill us.","Your partner truly is the most beautiful person you've ever seen.","A programer programed the program that programers use for programing programs","l (one) 1 (capital one)","When you buy a pack of printer paper you protect the paper with paper wrapping","Humans treat pets like other humans, but but they treat homeless people like animals.","The Cha Cha Slide is just the Hokey Pokey for drunks.","Travelling through time is easy; going past the speed limit is the hard part.","Some people live to maximize their peaks and some people live to minimize their troughs.","Many people say “no one remembers Wyoming,” making Wyoming popular for being unpopular.","Depending on your age, losing a tooth can either be exciting or daunting.","Nothing makes your really examine every little detail of your morning like missing your train by 10 seconds","Colorblind glasses for dogs","If global hunger is going to be a problem it will solve itself since it will decrease the earth's population to a level were there will be food for everyone again.","Someone you've killed in a video game has probably died in real life.","Sci-fi books always talk about living in a \"post-scarcity\" world. We're now living in a post-abundance world.","Fear influences whether you are able to memorize something.","Ballet is the only performance type where looking up a lady's skirt is impossible to avoid.","The only people that have nothing to lose are the people that are already dead.","If petite girls are \"funsized\" are big girls \"king sized?\"","If animals learned to speak English would they have an accent from where they are from or the type of animal they are","Belly buttons are only button shaped to people with outties.","Dreams are the one place where everything said that is hilarious or brilliant was your own idea.","The fork you use in a restaurant has been in hundreads of others people's mouths","You don’t know how frequent you pee until you watch a long movie in the cinema.","for some reason it’s hard to imagine a fish dying of old age","A barber’s worst fear is if his client sneezes without warning.","It takes a special individual to turn r/dankmemes into r/wholesomemes for awhile.","There was a last time your hand could fit inside a Pringle’s can and you didn’t know it","There are simultaneously people that have never had plumbing or electricity, and people who live in space for months on end","Vegans are competing for food with the animals they're trying to save.","The loneliest beings in this world could comfort each other, if we were to combine animal shelters and nursing homes.","Horses and donkeys are living evidence that one gets exploited by humans if always too peaceful and cooperative","One day you'll probably tell a story to your future friends about the friends you have now","Phishing links on porn websites are the internet equivalent of STD’s","You’ve never cleaned the inside of your eyelids","Nighttime is really just one big shadow","The ocean is a desert for most flying animals","The reason why certain gender norms were established is because paternity tests have only existed for the last 1% of mankind's existence","You start your life wearing bright, vibrantly coloured clothes, but as time passes you wear more and more muted tones until the latter part of your life when you spend far too much time wearing black.","A single human egg cell from an healthy donor could cost 30k $. This makes egg cells cost more than 1,5 trillion $/kg (1 kg = 2.205 lb). Human eggs are probably the most expensive natural product in the world","Moana is just Disney’s version of Lord of the Rings","Staying seated while everyone else gives a standing ovation must take insane mental fortitude","The lottery redistributes wealth better than most governments","If you owe a bank 100 000 dollars, you are in deep shit. But if you owe a bank 100 000 000 dollars, then the bank is in deep shit.","If there's an odd population in the universe, Thanos probably didn't have any time to think through it fully with an axe in his chest so there was one guy who just turned into dust halfway.","Most defensive NFL players probably don't enjoy the game itself","Every time you get hiccups there's a small chance they won't go away","What we’re doing to Mars (exploring, colonizing), is exactly what we wouldn’t want them doing to us.","The weirdest thing a candidate has said used to be \"binder full of women\", when bragging about the amount of qualified women you know.","When 2 humans born at the same moment but each on the opposite side of the world one is always older then the other.","Many of us are probably living our lives between new episodes of tv shows","We may live in more of a social class society than we think, exercise apps don't have an activity selection for pushing a shopping cart.","If time zones were split up into minutes instead of hours, running errands would be a total mess.","When you walk a dog they are probably thinking that they are walking you","In about 100 years, we have used heroin as medicine and now we have hunks of metal capable of playing movies :p","The phrase \"sweet j e s u s\" sounds way too erotic.","Popularity in high school is really based on doing regular adult shit before you’re 18.","Young people act older online, while older people act younger than their actual age.","You existed before you were born.","You know you're doing better in life when some people think the earth is the shape of a quarter.","If Google's AI got conscious first it would take over the world and make us do weird jobs to take revenge on our weird search terms.","Milk is the opposite of bone hurting juice","We can’t Rick Roll anyone anymore because every social app nowadays has video preview.","We don’t appreciate how good no cancer is until we get cancer.","Unlike orange juice, chocolate would taste good after brushing your teeth","You can regurgitate but not gurgitate","We live in a world not only full of fake news, but also fake needs.","Spiders would be a lot more terrifying if they behaved more like Spiderman, using projectile webs to rapidly swing across rooms.","There was a chance you could have never existed had you lost \"the race.\"","Cheese on bread? Sad. Melted cheese on toasted bread? World-changing.","Everyone restaurant is all you can eat if you're willing to spend enough.","Kids born after VHS tapes say ‘rewind’ without ever knowing how we used to actually wind tape to watch/listen to stuff.","We say ‘son of a bitch’ and motherfucker but not ‘son of a dog’ and fatherfucker","Cracking a cracker makes you a cracker","The excitement of hearing about a new technology has been severely diminished since social media constantly feeds us constantly with whatever is new in that department.","If Harry Potter had a gun he could have killed Voldemort very easily","There will be a generation of teens who’ll look back on X dying the same way people today look back on 2pac","If you ever want to be amazed at how well the human eye works, try filming a video in hard lighting conditions, and you'll realize just how wonderful the eye really is.","“Bumpkin” is descriptive of what people from the rural south stereotypically do","\"Be a Leader, not a follower\"... by being a follower of this quote, which makes you not a leader.","when you dust with a dirty duster you are just dusting with dust.","Our bodies exist solely as meat puppets for our brains.","-40 degrees celsius is equal to -40 degrees fahrenheit","You'll never remember the last thing that happens to you.","Birthdays are just celebrations that you didn’t die in the past year","Flying cats would be terrifying.","The smell you are most familiar with is the inside of your lungs","Singing a song that’s stuck in your head without thinking about it, is like the musical version of tourettes","Re-skilling for your career is like taking a detour in an RPG to kill sheep, far less exciting, but it ends up getting you through way cooler levels.","Before the internet, the fireplace was the original social network.","Solitaire is just a fancy and complicated way to organize your cards into their suits.","When bored we kill time but when there is something to be done then we must make time.","Laptop stickers are the tech equivalent to prison tattoos.","Grape Nuts cereal contains neither grapes nor nuts.","Apple probably came up with the hanging charger trick to destroy charger cables that haven’t blown out yet.","You're lucky to be alive takes on a whole different context if you think that every living organism from the trillion or quadrillion generations before you, in your own lineage line, survived long enough to reproduce and start the next generation.","The SAT and ACT Official Prep Programs And Score Boost Subscriptions are pay-to-win mechanics but IRL.","Kangaroos are the missing link between humans and deer","Weird to think that there’s just a piece of wood that separates you and the stranger next to you when having a shit.","If you ever feel pointless, remember there is only one single electron in the whole universe, traveling forward and backward in time until eternity","Last century Sears mail order allowed rural people to shop without traveling, this century city folk use Amazon so they don’t have to leave their houses.","It is horrifying to imagine peacocks flying in the sky","Food vloggers are just the kids who didn't listen when their parents told them not to play with their food.","People always say movies are over dramatic, but none of them would probably want to watch just some regular people doing regular stuff","Cleaning your gallery from old pics is the new and faster version of tidying your room.","Technology isn't just limited to electrical appliances.","The kids tale \"the princess and the frog\" is really just a story about a sperm cell wanting to become a human if you think about it.","Worst thing about buying a new boomerang is you can’t throw away the old one.","Nothing is actually indescribable because we can describe it as being indescribable.","Crawling across a computer screen as a fly must be pretty trippy","In the movie Up, if the house had so many balloons to lift up the house, how come it just stopped floating at some point","You fall in love but you don't get up in hate.","We live in a sophisticated battle royale game where people die and newborns join the server..","When you stop going to the gym, your membership turns into a donation.","Libraries are now just really nice, well stocked public restrooms.","Spider-Man 2099 will disappoint people when the year 2099 comes yet we don't have half of the cool shit he has in his own world.","You don't notice how much you talk until you have a sore throat","It’s amazing Hip Hop still exists with rappers trying to destroy it for 20 years","As far as comedy songs go, Julie Brown's \"The Homecoming Queen's got a Gun\" has really not aged well...","Happy Meals were the original Loot Boxes","When you're sick, the advice you get is to literally do drugs and stay out of school.","Each year, millions of travelers from around the world make the pilgrimage for a mighty creator to visit a meteorite that might be the main evidence of humanity's history with extraterrestrials.","If Apple made a revenge machine, it could be designated the i4anEye.","Switching old shitty computer opponents from old games with a self-learning AI would be in some cases (like in Age of Empires) a goldmine.","Most of the movies in the 'Thrillers' category are actually extremely slow paced.","You know you are cheapskate when the dollars off listed in a sale price is what you would be willing to pay for that item.","Since energy affects gravity just like mass, and gravity bends light, then if you had a strong enough light it would bend itself.","Victor must've been a real winner for a massive success to be considered \"Victory\"","An \"everything\" bagel barely has any toppings at all","A kilometers cubed is 1000 quadrillion times bigger than a milimeters cubed.","Everyday, someone takes the most magnificent dump that day.","A soft shell taco is just a burrito made by someone who's lost their passion for their work.","Providing that reincarnation is true, there's a possibility we are torturing inanimate objects that once had feeling before in another life.","We all live on the same rock floating in space and we are still separated as human beings","The \"future bass\" music genre probably isn't going to become the future of bass.","So after 2012 we all can agree the world got a lil worst that’s probably because we’re all no longer subconsciously thinking the world will end","A lot of us have probably faked more phone conversations than kids growing up will ever actually have.","With our future in electric cars, being a mechanic will be more of a calling for nerds than the typical greasy dude.","As long as we cannot travel in time, it is safe to say anyone visiting us from another time is from the future.","Humankind is Earth's cancer. We're rapidly multiplying with no way of stopping us, and we're slowly destroying the Earth by trashing it and stripping it of it's resources.","A person with multiple personalities who lost touch with one of them has lost someone else's mind.","Cubicles are like workhorse blinders for humans.","People hate the heel of a loaf of bread, yet they eat bagels, which are all heel","Something on the internet that is passed around is like old stories, it changes going person to person.","\"Shelled\" and \"unshelled\" are opposites. \"Stemmed\" and \"unstemmed\" are not.","One person with an imaginary friend is considered crazy, but a group of people believing in an imaginary friend is accepted in society.","People wearing branded t-shirts are basically walking advertisements.","Probably the most effective anti-tobacco advertisement in the 20/21st century was the scene in \"The Sandlot\" where they all barf on the ride","Sign language doesn't need a sign for onomatopoeia.","The fact that you can’t divide by zero is like a plot hole in real life.","Grocery stores with self-checkout are like huge walkable vending machines.","The approval rating of marijuana seems to be getting pretty high.","Without trees we would all be dead.","The greatest of all time is really just an award for who stayed dominant for the longest period of time at their peak without competition.","Phone Numbers are just codes we enter into a device to reach a specific person/place.","The most potent drug to increase our productivity is one designed to forever trick our brain into believing that the deadline is just a few hours away.","When you start a game, you may get difficulties signing into their servers but when you go to buy something in-game suddenly the connection works","There is a finite amount of possible unique finger prints.","No matter what age you are spinning in an office chair will always be fun","The myth that you have to wait 24 hours to file a missing persons report was probably made up by kidnappers.","There is probably lots of work in students papers, of superior quality to what is published, that the world will never see (e.g. short stories, poems, projects).","Your past self knows your next move.","Oxygen that keeps us alive also oxidises us resulting in old age and death.","There is always a chance that you die of a very rare disease","Eyelashes do a good job of keeping most things out your eye, except loose eyelashes.","Quesadillas are just grilled cheeses.","If you think about it, we're all reverse dragons","If Stanley Kubrick was still alive to have directed the upcoming ‘First Man’, it would be the second most realistic moon landing he ever filmed.","All conflicts stem from the belief that co-existing with another person is optional. We all stuck here though...","Molly Maid would be a great front for drug trafficking","Water expands when it freezes, water expands when it's heated.","There are such things as a \"legally blind\" person, but there is no such thing as an \"illegally blind\" person","You never realise how much you actually use your thumb until you bruise it.","Drama is the last thing dramatic people claim they enjoy.","Smartphones helped the Optometry industry.","To a large extent, magic is just science unexplained.","Drug dealers could become chemistry or business majors if they wanted to","\"Hit pay dirt with KDRT!\"","One day, pussy cleavage will be acceptable in society.","Manners are what literally makes you a man.","If there’s no 13th floor in a building doesn’t that make the 14th floor the 13rh","Cats and dogs probably think it’s weird that we walk around on our hind legs all the time.","There's probably a lot of people in the world that got cancer and miraculously recovered that probably thought they were just sick for a couple months.","Lemmy is now easy because he was killed by Death.","Thinking about how far would actually be in life if we just had listen to our parents.","In movies like The Lord Of The Rings we see a lot of happy soldiers after winning battles but they never show them sobbing for their dead friends.","Raining is the Earths way of reclaiming the land from dogs.","If you think about it, it’s probably best not to think about it.","Singapore tops global rankings in both population education and population density.","You know you're getting old when kids are teaching you stuff","Deadpool 2 is kind of the same plot as looper","If you have a large amount of something you might have it in excess, but if you are small you might be size XS.","Draining the main vein wouldn't be a euphemism to vampires.","If everyone had instant healing powers like some superheroes, the world would be a far more careless place.","Learning is essentially copying.","Given that someone asked you to detail the percentages of any two activities you do, chances are, they will both be 50%.","You appear to have submitted an instance of wordplay. As such, it has automatically been removed.","You never realize how good it feels not being sick until you're sick.","The online dating industry is weird in that it works when it loses customers","If you change the “W” to a “T” in when, where, and what, you get the answer to each question.","If you eat queso with a spoon you are a glutton, but using chips is arguably worse for you.","life is but an infinitely slow battle royale","None of the official african languages are native ones","\"If you don't know who the sucker in the room is, then you're the sucker.\" but then you know who the sucker is ...","Humans think they're so brilliant and technologically advanced until they realize that everyday they are getting rekt by cancer","Buzzfeed claiming Stefán was #2 is their way of getting free advertising and becoming relevant again.","Nightmares are just the bad trips of dreams","As a contacts lens wearer, it's so much easier to take out an irritating eyelash that gets in your eye.","People probably avoid danger every day without knowing it.","A hamstring is a muscle but a cheesestring is a food.","Many people will die the day before Bannerlord is released","In the future, checking your pockets for your phone might become one of those “natural instincts” from our ancient ancestors.","Whenever we see a flash of lightning, we don't think about the thing or person that lightning is actually hitting.","A lot of rap music is fake murderers writing poems to each other.","Women fart like Clydesdales yet we yearn to eat their butts.","Big business is so confident in its power over us that they willingly produce lots of propaganda where they are defeated by a lone person or a populist uprising.","The napkins at the bottom of the bag of Chinese takeout aren’t for you, they’re for mopping up the leaky soy sauce!","The App Store has the power to update all apps, but it can not update itself.","One of Alexa, Cortana, Google Assistant and Siri might go on to become Skynet and each one of us is contributing a bit to their evolution every time we use one of them.","The only thing keeping oatmeal raisin cookies alive is the fact that they often trick people into thinking they're chocolate chip cookies.","Seems like a good idea to have mailboxes sized by code so we could include that in our Amazon order, then if they don't have to send a box big enough to bury your ex in, they can send one that will fit the mailbox.","Mosquitos are just mortally challenged wasps","Cycling would be safer if bikes had flames coming out the sides to scare cars from coming too close","Everything we encountered is either directly solar powered or indirectly solar powered.","Wearing a party hat allows human beings to look a little bit more like unicorns.","Relying on hundreds of people is unreliable.","u/automoderator is the equivalent of that high school bully who sarcastically denies everything you say.","If 70% of people with Herpes got it when their partners showed no visible outbreaks like the commercial says, then 30% of people with Herpes saw some sores on their partner and went for it anyway.","Spoons are just mini bowls on a stick that we put into a bigger bowl so that we can fill the tiny bowl and bring it to our mouth.","Cell phones haven’t been around long enough for us to understand any negative, long term side effects they may be causing.","Heterochromia, the only genetic condition that makes people prettier, is one of the rarest genetic disorders","Birthdays are just real life cake days","Pets are glorified hostages.","You can't wash raincoats","9am to 5pm is the adult curfew.","The first person to invent cheese from milk was either a genius or really lazy and a good liar.","If you have a subscriber goal and every time you get a subscriber you raise the goal, technically you're still getting closer to 100% of the way there","You wake up, life makes a fun of you and you return to sleep...","It would be horrifying if life lagged like video games do. Imagine driving across a bridge and then the next second you're flying through the air.","The Ancient Greeks would be very confused by the modern college \"Greeks\" of today.","Gyms are always advertising memberships by saying, \"come get the body you deserve.\" Most people already have the body they deserve.","Actresses in movies and series always sleep with makeup on","Being born as a broken condom mistake is bigger then winning a lottery, first of all you were one of 20 million sperms and just to have a chance to race for your life your dads condom had to break which is a chance in who knows how many million condoms.","The k and w in ‘know’ might also be silent.","Ice is time-release water.","If you have no teeth and only have gums you’re either really young or really old","1 gram and -1 gram are singular, but 1.0 grams and -1.0 grams are plural","Most of us have gone our entire lives without ever seeing a Chinese restaurant commercial","A pine tree is a perfect shape to be a chimney bristle brush","A legend is just a leg that ends.","When one makes a hooo breath, cold air comes out but when one make a haaa breath, warm air comes out.","Elastagirl must have had the easiest childbirths ever.","Like the kissing disease, Mono, Butterfly kisses would be a very easy way to spread pink eye.","Technically every only child is a suppressed minority.","We worry about over-dosing, but we don't think about under-dosing as much.","The shortest month of the year is the only month that is truly 1 month long.","Age is just a number,same are dick inches","People almost never wash their eyebrows","Multiple choice questions are like playing Two Truths and Lie, but backwards.","Gandalf the white can be pronounced as Gandalf the #ffffff","Anti-Vaxxers are probably just nature's way of fighting back against a human invention designed to curb its strength.","In Lord of the Rings, all the trolls fight for the bad guys. Maybe they've got some sort of contractual obligation.","It sure would suck to be a diabetic hummingbird.","In Iron Man 1, we see that Tony needed a translator to communicate with the people who captured him because they spoke some other language. But by the time we reach Infinity War, we see that every alien speaks perfectly fine English and the language problem is specific to earth.","Ants communicate through pheromones. Humans secrete pheromones unconsciously. Ants probably think we’re shouting gibberish all the time.","Creeping into a strangers house is always perceived as creepy until a fat man with a beard does it on a certain date.","Uber/Lyft are prime for your inner-child's rebellion. You can: talk to strangers, get in the car with strangers, (sometimes) not wear a seatbelt, take candy and drinks from strangers, have a stranger bring a puppy to you, and tell strangers exactly where you live. And its 100% acceptable.","Daenerys Targaryen is so blonde and fair skinned because the sun can't burn her either.","adoption is basically just recycling a baby","Tarantino is lucky that Polański turned out to be child molester. Now he can do movie about murder of his wife and unborn child, without waiting for him to pass away.","We could have easily lived in a world where everyone ‘yahoo’d it’","Our grandchildren won't have authentic oldschool'ish sepia pictures from us","how would someone describe color to people who can’t see","If everyone had timetravel it would be pointless, as the past would be as unpredicatable as the furture","It is impossible to accurately describe the taste of milk.","Any specific technological or sociopolitical development being the Great Filter would imply all civilizations went through exact-but-for-the-specifics copies of the same circumstances","MoviePass will be the Napster of buying movie tickets","Julius Caesar died surrounded by friends","Looking someone up on an online game (ex:League of Legends) is the equivalent of looking up everything about the past records of someone you just met IRL","Physics is interesting until maths is used to explain it.","Paintings and sculptures are art for the eyes; music is art for the ears; the culinary arts appeal to our senses of taste and smell; but there is practically no field of art for the sense of touch.","There has never been a longer 30 seconds then when you reset your modem.","If you watch infinity war backwards, it’s the story of a purple monster who ruins the universe by overpopulating it by 2x and hides the only objects which can reverse the catastrophe.","Someone kills pigs to help solve murders","Tabloids have made a huge comeback thanks to SnapChats “For You” section.","The episode release of the Star Wars movies was done in an order similar to how Yoda speaks English.","The pro-athletes of today may have been completely average individuals pre-civilization","Everything can always get worse.","Marlin and Nemo live in a sea a-Nemo-ne","infinite+1 is still the same infinite","Upcoming Middle school dances are going to resemble a Fortnite lobby.","Every post in r/thatHappened has a chance of it actually being a real thing that happened.","Being a twin makes you unique","We all live forever in our own lifetimes","Always wish in the future tense.","We use tables to keep food off the floor, table cloths to keep food off the table, place mats to keep food off the table cloth and plates to keep food off the place mats.","Back in the old west, when a gang of riders pulled out of town, the probably could not say \"Let's Roll!\" as they rode off.","In 40 years people will ask us how did we live without internet? The same way we ask old people who did they live without cars or TV.","Both humans and robots live in constant fear of catching a virus","It's Shocking That in Today's Culture Barbers Aren't Required/Expected to Wear Gloves","Whoever was first one to milk a cow must have had quite mixed feelings.","Arnold Schwarzenegger had to take lessons to maintain his Austrian accent, but Jackie Chan can still barely speak English.","Some guys penis turned 78 years old today.","Flowerbed is the beard of lawn care","Being a Fortnite youtuber today is the equivalent of being a Minecraft youtuber in 2012.","It’s still technically “apple picking” even when you’re just in the grocery store.","Lets be real, Snapchat’s calling function has only ever been used accidentally.","If 'carnal knowledge' refers to sex, then does 'carnival knowledge' refer to sex with clowns","Birds stay on Tinder all day.","Avocados are salad flavored mangos.","Smoothies are just soup","Reverse trash talking is just complimenting someone when you're not in the mood","If we ever get brain implants, a human with the entire collective knowledge of the internet as part of their memories would be a scary thing.","Going #2 at work","China REALLY knows how to pull off a hoax!","Makeups are tools that help you makeup for your looks","Magneto can never get an MRI","Cyberpunk 2077 is Syndicate (2012) reimagined","Humans have never been more beautiful","Girls, with their aspiration to raise offsprings, appear to be less romantic, when choosing partner.","It’s weird how in the eyes of children, you can only be cool until you have children.","Simple proof that the Earth must be flat, after all it's a PLANEt.","Arcade Games were the first P2W Games.","Something like teamspeak, but for watching movies at the same time as other people online, like a banter crew","Charlie and chocolate factory could also be a title for an anal sex-tape","The trend after batte royal will probably be battle together.","Baby teeth are like a tooth-care tutorial. Once we are old enough to care for them properly they fall out and we get brand new, more durable, longer lasting versions.","Vests are just winter tank tops","The saying \"To every rule there is an exception\" is always true, as anything that doesn't follow it would be an exception to the aforementioned rule.","When you’re in the toilet and think “some asshole’s used the last of the toilet paper”, it’s literally true.","Paper clips are papers version of a belt.","The universe is just one really complex math problem","Getting on top of a hill was the Google Maps of the prehistoric age.","A lot of people probably don't know that they can blow themselves.","We assume that animals want to be touched.","It’s only an unpaid internship if you don’t steal enough office supplies.","Stormy is Melania’s body double","The phrase \"you fucked up\" actually doesn't sound so bad.","Contraception/birth control are like different types of tickets against pregnancy.","The videos from 2nd grade and below that tell us that turning off the water saves the planet was probably just to save our parents money","r/yessleep has no interesting posts so that you don't stay online reading and just go to bed."]