["Daily Locker Room and Free Talk + Game Threads Index (2018.08.29)","OKC Super Fan's poignant goodbye to Manu","LeBron James on speaking out: \"When I decided I was going to start speaking up and not giving a fuck about the backlash or if it affects me, my whole mindset was it's not about me. My popularity went down. But my truth to so many different kids and so many different people was broader than me.\"","Messi on Ginobili: They should call me the Manu of football","Manu playing 5D Chess (while Timmy plays checkers)","Allie Clifton leaving Cavs sideline reporter role with Fox Sports Ohio for a new one in LA","DeMar time in San Antonio.","The Angriest NBA announcer...EVER","\"I knew I had to be better because of Kobe...I knew he was working on his game...every day that I didn't want to work out...I always thought of Kobe...'Man, if you take a day off, he's going to take advantage of it. You cannot take a day off...'\" -LeBron on Kobe","[Spears] The Hawks say that State Farm Arena, their new home after a $192.5M renovation, will feature the third largest NBA scoreboard, Topgolf Swing Suites, Killer Mike’s SWAG Shop (a four-chair barbershop overlooking the court) and the signature Hawks Bar, the NBA’s first courtside bar.","Dirk continues to add new moves going into his 21st season","[DePaula] The NBA is removing ALL footwear color restrictions for the upcoming 2018-19 season. Players can wear whatever colors they want, every night.","Manu handles the kisscam like a pro","Just reminding you guys that my boy Metta World Peace used to drink Hennessy at halftime while playing for the Bulls","[The Ringer] Are We Sure … That the Bucks Aren’t a Finals Contender This Season?","[Klein] NBA League sources tell me Hawks have signed a 20-year-deal with State Farm - Will now play in State Farm Arena -","Can Kobe Bryant Guess Kobe Beef Vs. Cheap Beef? (GAME)","The Prodigal Sons’ Return (2018-19 schedule)","First photo of Derozan smiling in Spurs gear.","Fun Fact: This year, Damian Lillard received nearly 3 times as many MVP votes than Russell Westbrook, Kevin Durant and Giannis Antetokounmpo","Toronto has a dunkfest!","MJ teaching MJ how to moonwalk","Carmelo Anthony 50 points on all jumpers","Blake Griffin been working on his Steph Curry moves this summer.","With the NBA reversing the color restrictions rule, I'd like to share this historic Nike commercial from when the ban began. The ban &amp; commercial helped spark the Air Jordan craze, which still exists today.","Bill Walton gives Dave Pasch (creationist) The Evolution of Species by Charles Darwin live on air","Dwane Casey yells at referee Michael Smith to stop making up rules","[Bleacher Report NBA] Enes Kanter on resigning with Knicks: “You don't leave New York for Milwaukee,” per Royce Young.","There have been 6 teams in the past 6 years with over 65 wins. Teams have have played at or over a 65-game pace only 23 times in NBA history (18 in the 3-point era): 6 times in the 2010s, 4 in the 2000s, 3 in the 90s, 2 in the 80s, 3 in the 70s, 2 in the 60s, and once in the 50s.","The Shop: Draymond, with wine in hand, talks about LeBron being the best player in the NBA","The 2017-2018 playoffs if every game was determined by a coin flip.","Blake Griffin makes a Clippers joke","The final 20 seconds of the Celtics-Blazers game was one of the most exciting and clutchest finishes last season","[Sixers.com] Philadelphia 76ers Head Coach Brett Brown announced that the team has signed guard-forward Anthony Brown.","JR lays the Pipe so hard on the Hawks that Kevin Harlan starts sippin the Henny","Who's the most talented player in the history of NBA who was traded against their will?","LeBron and D-Wade Kiss Cam","[Bucks] Statement regarding the City Attorney’s legal response to the Sterling Brown case:","Every Player from the 2017-2018 NBA Season, rated in dollars per minute played.","The Spurs won 72% of their games when Manu played. That’s the highest win % of any player with &gt;1000 games played.","[Yahoo Sports NBA] LeBron James was given a $100K gold-plated, crocodile skin version of the LeBron 15s to celebrate passing 30K career points! 🔥","Bill Walton with one of the greatest calls in NBA history","Despite Winning 6 of the last 7 games, the West All-Star's are still down 29-37 against the East (From 1951-2017).","One of LeBron’s best posters lands on Timmy D","Aron Baynes Highlights vs Brooklyn - Eviscerates Nets with 26/14 statline in 20 minutes","What are the odds that LeBron plays in the first preseason game of the season?","With the retirement of Manu. Tony Parker officially becomes the player with the most rings in the NBA at 4.","[Team USA] USA Basketball Men’s Junior National Team Program Announced in Partnership with NBA, NBPA and NCAA to Provide More Than 80 Junior National Team Athletes with Additional Basketball Training, Life Skills Education, Health and Wellness Opportunities","LeBron's loudest dunk, almost tore the rim down!","Enes Kanter: You don’t sign with Milwaukee Bucks ‘unless they give you good, good money’","Walt Frazier on KD: “For him [joining the warriors] I still don’t give him the full credit he probably deserves than if he stayed with OKC. There will be an asterisk beside his name [on the all time list for me]”","Bold Predictions/Unpopular Opinions for the 2018-19 Season","Manu Ginobili and Raja Bell: When a Stoppable Force Meets a Movable Object","Larry Nance Jr is worth every penny in extension with Cleveland Cavaliers","The Knicks Fan Who Sold his Fanhood On Ebay is Now a Lakers Fan","NBA players Dark Souls Boss equivalents","One of the smoothest fast breaks of all time","Wakeup r/nba, the preseason starts in less than a month!","[Pull Up Podcast] Jahlil Okafor is no longer vegan as it was affecting his blood count and cardio. He also mentioned he changed his shot motion this off season.","Diana Taurasi hits the unbelievable fadeaway 3 to tie the game late","Russell Westbrooks and Kevin Durants last win as a duo- Game 4 of the 2016 WCF as OKC take a 3-1 lead against the Golden State Warriors","[SI] Can Giannis lead the Bucks to playoff success and fulfill the prophecy?","What if Michael Jordan joined the 76ers in 2001, could the 76ers have reached the finals again and Jordan win his 7th championship?","Here's a reminder that Manu Ginobili is the only player in NBA history to win Sixth Man of the Year and make an All-NBA team in the same season.","[By Any Means Basketball] Kyrie vs. Dame: Closer Than You Think (Full Player Comparison)","Who are the fastest players in the league?","NBA fans, what is a superstition you practice that you believe improves your team's chances of winning? (x-post r/AskReddit)","What’s the most realistic scenario where golden state struggles in the finals?","San Antonio Spurs sign forward Quincy Pondexter","The Beautiful Game that was the 2014 Spurs run. Basketball doesn't get better than this season for me.","[Charania] Charlotte Hornets rookie Miles Bridges, the No. 12 overall pick in the NBA draft, has signed a four-year endorsement deal with Nike, sources tell The Athletic","ELI5: Rico Hines","/r/NBA Hall of Fame. Class of 2010. Pending Inductees. First Ballot: Allen Iverson, Gary Payton, Dikembe Mutombo, Yao Ming, Alonzo Mourning. Third Ballot: Robert Parish","Chris Paul Speech To The Next Generation of Basketball In Los Angeles.","LeBron James Earned $11k Per Minute Played For The 2017-18 NBA Season","NFL vs. NBA: Revenue, Salaries, Viewership, Ratings.","Durant and Westbrook's playoff elimination game stats in their time together in OKC","OKC Thunder Fan Favorite Taj Gibson Forgets He’s Playing Basketball and Tries to Secure an NFL Contract","What Wins Basketball Games (Basketball Analytics From 2005)","When was Michael Jordan considered the best player in the league?","Who is going to get a better applause this season, Kawhi in San Antonio or KD in Oklahoma City?","The NBA, NCAA and National Basketball Players Association announced Wednesday they have come together to extend their support of USA Basketball and its Junior National Team.","[OC] Do shorter players jump higher?","Lakers + KD vs Raptors + AD - who wins in a 7 game series?","Throughout the 2018 Playoffs, Kevin Durant averaged 29.8pts/7.8reb/4.7ast on 49/34/92 splits (60.6% TS) while being the most tightly guarded player in the league","One of the most underrated players of the 90s, Hall of Famer Šarūnas Marčiulionis","Is there an active subreddit dedicated to NBA Jerseys?","Is Manu Ginobli a 1st ballot HOFer","[Discussion] Which playoff teams from last season won't make the playoffs this season?","Enes Kanter on trying to get in LeBron’s head: “No it does not work. But I’m trying.”","Elaine Benes (Wizards) dishing up an All-NBA caliber ball fake to Jerry Seinfeld (Knicks) circa 1992","Giannis in transition euro-stepped around Westbrook and boomed Ibaka","'One-and-done' done? NBA, NCAA, NBPA align","He might not be a HOF player, but Mehmet Okur had some of the biggest balls in the NBA. Here's 17 minutes of Okur's clutch shots and game winners.","Is Manu Ginobili the greatest player from the 1999 Draft?","Could last 5 DPOY win the finals?","What star player seems to almost never play well against your team?","Could the Southeast Be the Worst NBA Division Ever?","In today's episode of Rico Hines' UCLA Runs, Blake Griffin makes an appearance. Along with Antonio Blakeney, Darren Collison, Chandler Parsons, and others","Jeff Green turned 32 today. To celebrate, here is his insane buzzer beater with .6 seconds left against the Heat (11/9/2013)","[Question] Ways to pull 2018 NBA 'off-the-bench' stats from BasketballReference?","I went through the top 25 NBA players ever according to Fox Sports. I went through each of their averages (pts, ast, and trb) and saw if they ever had a game where their stats happened to be their career average. Here's what I found...","Steph Curry breaking barriers to achieve gender equity in sports","An Argument for Lebron as the best scorer of his generation","Nick Friedell on Jimmy Butler's future - \"Being around that [Timberwolves] team a lot last year, I think Jimmy is probably going to be gone a year from right now\"","Is it a coincidence that both Spurs retire Manu and Man U today?","In step toward abolition of one-and-done rule, basketball stakeholders align to support USA Basketball","[BehindCurve] On Fultz, I’m hearing the Sixers are encouraged by the recent clips and maybe even how the shot held up during live action. It’s not perfect and there may be some ups and downs but it’s made steady progress. The plan is for big minutes and a starting role from the jump.","[NBA on ESPN] Melo looks like he's ready for Houston 🚀","With Duncan and Parker sitting out, a young Manu Ginóbili leads the Spurs vs Kobe, Shaq &amp; the Lakers","The epitome of catching a body","Lance Stephenson preparing for Lebron with some Curryesque pickup highlights","Bob Costas is reportedly leaving NBCS, if he were to return to NBA Broadcasting what network would he fit best? TNT or ABC/ESPN","Random Useless Fact: Midway through the 2014-15 season, Klay Thompson actually lead the Warriors in scoring over Stephen Curry.","Great plays receive great reactions: Pau Gasol leads the Lakers fast break","Manu Ginobili to contribute to San Antonio Spurs in retirement","Luka Dončić awards so far (age 19)","Uh... Are my eyes messing with me or is Markelle Fultz a lot taller than his listed height?","[Urbonas] Valanciunas is heading back to Toronto on Sep 15. Raptors asked him to come earlier &amp; skip FIBA qualifiers in order to be fit for preseason camp. Valanciunas told Nurse wanted to have the players earlier than official training camp, so that they could save some time &amp; work more.","Taking a look back at James Hardens Houston Rockets Debut 37/12/6 and 4 steals","My Favorite NBA Finals Promo Ever: Heat vs Spurs 2013","[HoopsHype] Danny Green has a new hairstyle","[Zgoda] Thibs on Butlers upcoming Free Agency, \" The winning will take care of that...We have a lot to offer him. We think this is the best place for him, and it’s up to us to show him the reasons why.\"","I always liked abc's NBA finals commercial featuring Dirk couple years back. Hope yall enjoy it as well","Jeff Green Dunks on his own head","Steph Curry's stats in the 3 Finals he has won are comparable against multiple recent Finals MVPs","\"It's a relief...the circus has left town...all that drama is gone.\" - Sam Amico on how some people on the Cavs truly feel","[Golliver]Lakers' LeBron James and NY Giants' Odell Beckham Jr. discuss double standards for black athletes &amp; white athletes &amp; claustrophobia of fame From James's new HBO Sports show 'The Shop'","What would happen if science figured out how to cure aging ?(especially for athletes)","What are your sort of crazy but not totally outlandish predictions for the upcoming season?","[Charania] Sources: The Grizzlies have waived guard Kobi Simmons, who was on a two-way contract","Dwyane Wade Pays Tribute to Manu Ginobili With Heartfelt Message","John Wall filming a video with his favorite rapper Lil Wayne.","[Utah Jazz] We've signed guard Trey Lewis!","Nostalgic NBA on NBC intro","At what distance would a basketball be unable to enter the hoop?","Best Ball Handler in NBA?","Who do you have coming out of the East?","Your teams nemesis","[Deadspin] \"How Kansas City Lost the Kings\" -- includes Stern vs. Congress, proposed $1/yr stadium leases, and NBA owners blackmailing fans","What impact did Kobe's Achilles injury have on the rest of his career?","Patty Mills is the longest tenured Spur","When was the last time your team was a \"squad\"","14 years ago today, Manu Ginobili leads Argentina to a gold medal in the '04 Olympics.","Would this be a good trade for the Orlando Magic?","Create an anagram out of a player's name. Everyone else guess who the player is","How do you kill something that's already extinct? Ask Kobe.","Adding which franchise legend to your team will have the greatest impact?","Will Chamberlain 100 Point Score","Jeremy Lin gets mistaken as a high schooler by a Lyft Driver","Every NBA team's best iteration ever","35-year-old Vince Carter posterizes Serge Ibaka (2013.01.18)","[Trigg] Brandon Payne (Steph Curry's personal trainer) confirms that @luka7doncic worked out with the @acceleratebball guys on Sunday night. Payne also tells me, “We will be discussing future work (with Luka) in the near future.”","Nikola Vucevic Trade Rumors: Magic Expected to Shop Center","Lebron James with the dance moves 😂","Wade Bamboozles Garnett","The Spurs offense could be a surprise thanks to their youngsters","Question about what player you’d rather have","Was this Kelly Olynyk's legacy defining game? Game 7 vs. the Wizards","Manu freezes KD with the pass fake for the and-1 in the 2012 WCF.","Oklahoma City possibly got the biggest steal of the draft with Hamidou Diallo.","Manu's last win as a Spur in his last game in San Antonio: 16 points (8 of the last 10), 5 assists, G4 1R vs. 2018 Warriors","TimberWolves and Bulls 2017 trade revisit","[Charania] San Antonio Spurs legend Manu Ginobili has retired from the NBA. Hall of Famer","Who are some of the best 7th men in NBA history?","Best of Stephen Curry | 2017-2018 NBA Season","WNBA Analytics Have Changed the Game.","How would you guys feel about season summary videos?","The Trailblazers and the Pelicans should combine to make the Blazikens","All 30 Teams are having a bonafide DUNK-OFF...select your champions!","[Stein] Charles Barkley of the @NBAonTNT tells @nytsports in response to the retirement of @manuginobili: \"Today my Manu retired -- it's like losing a family member. It was an honor and pleasure to watch you play. See you soon at the Hall of Fame.\"","'The Shop' Game Thread","[OC] Out of all Wilt's and Russell's biggest rebounding games in Playoffs, nearly all of them were against fellow great rebounders","If the NBA had as strict requirements to get into the Hall of fame as the NFL and MLB does, then who would be some notable players that are currently in the Hall of fame that would probably no longer be in it?","[Manu Ginobili] Today, with a wide range of feelings, I'm announcing my retirement from basketball. IMMENSE GRATITUDE to everyone (family, friends, teammates, coaches, staff, fans) involved in my life in the last 23 years. It's been a fabulous journey. Way beyond my wildest dreams.","Tony Allen Appreciation Thread","Why Carmelo wasn’t the main reason the Thunder didn’t work out","What do we think Dončić's upside is?","Where would this hypothetical season rank all time in terms of peaks","My favorite Manu play that's lost somewhere on the internet.","Manu, with a broken elbow, hits a crazy, clutch shot to keep the Spurs alive. 2011 Playoffs, game 5 vs Grizzlies","Does any NBA city not have a public transport right at the arena?","If CP3 is a main cause for the Rockets for winning a championship in he next couple years and stays there for the rest of his career, will he become the only person to get their jersey retired by 3 different teams?","Chris Paul, Russell Westbrook, Antonio Blakeney at Rico Hines UCLA Run! Dante Exum, Bobby Portis","[OC] Points Created and Weighted Points Created: Measuring Offensive Production","The NBA Should Rename the Sixth Man of the Year Award after Manu Ginobili","Multiple dribble handoffs sets up an open corner shooter for a long distance 2 in the first NBA Game in 1949","Manu Ginobili's last field goal as an NBA player","Do you enjoy watching basketball in 60FPS?","Evolution of NBA.com","CP3 shammgod has Ibaka bamboozled","Prime Manu Ginobili or Klay Thompson","Which NBA team has the most free/uncontested shots?","Bill Walton with another one of the greatest calls of all time","Lorwry or derozan","The narrative that players from the older generation don't flop is absolutely not true. Here is Dirk flopping harder than Harden ever did. What a disgrace.","Who is the worst starter in the NBA?","What’s an NBA finals you totally forgot about?","Bobby Brown's Inspirational Basketball Journey: Best of Both Worlds","What actually happened during the 2004 Olympics?","[San Antonio Spurs] San Antonio Spurs guard Manu Ginobli today announced that he will retire after a 23-year professional career. #GraciasManu","What current player would be the most likely to average 35-40 PPG given the ultimate green light on an awful team?","The last time the Spurs played a regular season game without Duncan, Ginobli or Parker on the roster was 04/20/97.","Kobe Bryant highlights NBA JAM style","Yao Ming fancy no look behind the back pass - 2008 Olympics","Thank You San Antonio","Three years ago, we wrote an NBA-themed sitcom pilot. Read/love/trash it here.","[Stein] Incredible: Tim Duncan, Tony Parker, Manu Ginobili … Gregg Popovich outlasts them all in San Antonio","Is Damian Lillard Overrated or Underrated?","Manu Ginobili seals Game 5 with a block on James Harden","Manu Ginobili Fakes out Kevin Durant Before Finishing the Clutch And-1 Finger Roll","Better scorer, Shaq or Kareem?","[Silver Screen and Roll] Kobe Bryant is done playing basketball","Could Gordon Hayward be the best player in Boston this season?","Ginóbili letter to La Nación (spanish)","Chris Paul Amazing Speech To The Next Generation of Basketball In Los Angeles.","My favorite game from Kobe’s most underrated season. Super clutch","There was an NBA tv special about ten or twelve years back which covered a great player on a bad team and a benchwarmer on an elite team. Anybody recall this or have a link?","Manu baits Anthony Davis into a tech","[OC] Majestic af NBA desktop backgrounds collection","[Serious] What is DeMar DeRozan's ceiling as a Spur?","Manu, Timmy, Tony and Pop sit down and reminisce after the 2014 chip. Such good banter. Get me tissues...","The only two players--Manu Ginobili and Bill Bradley--to have won a EuroLeague title, an NBA Championship, and an Olympic Gold medal were both born on July 28.","Arguably the GOAT team photo: Sacramento Kings holding up middle fingers","A 5 minute montage of Manu Ginobili nutmegging dozens of NBA players.","On this same day, 14 years ago, Manu Ginobili took Argentina over USA, with 29 points, 69FG%.","In his 3rd year in the NBA, a 21 year old Kevin Durant averaged 30.1 ppg and led league in scoring on splits of 47.6/36.5/90.0","Cousins drops a double nickel on the Blazers, including an ejection &amp; comeback (2016)","Pounding The Rock-Translation: Manu Ginobili’s farewell letter to fans","Tony Allen's Players Tribune article after leaving Memphis. One of the best I've read.","WNBA Players Aren't Actually Trashing NBA Players, But They Are Fighting For Fair Pay","NBA arenas","What's your pet peeve about sports fans?","Friendly reminder that in the 4 years before joining Golden State, Kevin Durant averaged 39 points per 100 possessions on .64 TS%","Manu teaches some young beard who's too slow on the flop how to really draw a foul.","Daily Locker Room and Free Talk + Game Threads Index (2018.08.28)","Duncan almost signed with ORL with McGrady and Hill, how good would that \"BIG THREE\" have been? (if Hill stayed healthy)","Whats your NBA All Flop team?","Who are some of the most \"natural\" basketball players in NBA history?","[OC] Making a case for why Wayne Ellington is the best player in the NBA","Never forget Manu’s FOH hammer-dunk on Chris Bosh in the 2014 Finals","Dirk Nowitzki's 2018-2019 Farewell Tour","Charles Barkley - GINOBILI!","A heartfelt letter to Manu Ginobili","Diana Taurasi with a clutch shot on the road @ Seattle! 11pts in the final 2mins ... GOAT","Bill Walton's Best Call in the 2004 Olympics","The Hornets have 1 nationally televised game next season - their season finale on the last day of the regular season vs Orlando which in all likelihood will be flexed out for a game that has playoff implications.","Manu Ginobili game winner against Serbia (Athens 2004)","\"Rookie\" Manu Ginobili vs New Jersey Nets - FULL highlights - G6 2003 NBA FInals","Manu Ginobili - All Game Winners of his Career (11)","Which Western Conference team is better: Timberwolves or Lakers?","[Sixers.com] Elton Brand Promoted to Vice President of Basketball Operations for the 76ers","ELI5 how team point differential determines expected wins?","What team are you going to be following/watching the most outside of your favorite this upcoming season?","What team is severely underrated?","NBA Coaches and Players celebrate Manu's Career","Ginobili is the highest-paid player ever in local-currency terms, if you factor in the collapse in the Argentine Peso's value","Who are your favorite 3 and D players?","Kevin Pelton says Raptors/Kawhi trade was most underrated move of the offseason (3:15 mark)","Was Manu unable to physically play 35 minutes per game?","Is there anything stopping someone who is in the HoF from rejoining the league?","Amazing clip of the Showtime Argentina National Team vs Team USA in 2004","If LeBron was a character of Game of Thrones, who would he be?","Do the writers on The Jump on ESPN browse this subreddit?","[Chris Haynes] Free agent wing Quincy Pondexter has reached an agreement on a one-year deal with the San Antonio Spurs, league sources tell ESPN.","What’s your teams flavour","Manu Catching a Bat During a Game","Translation of Column Written by Manu Ginobili for Argentine Newspaper, La Nación","Kyrie Irving finds his Native American roots.","Kevin Garnett debuts for Boston Celtics with 22/20/5/3/3 statline and the W","Manu Ginobili 29 points vs. USA 2004 Olympics","[Enes Kanter] East and West, look at the East. East is like AAU teams, and the West is like, the league.","When you google Anthony Tolliver, you get Amar'e Stoudemire","NBA fined Michael Jordan 5000$ each game for wearing black and red shoes","What does it mean to be a Sixth Man?","NBA on NBC \"Friends\" promo: Monica (Courtney Cox), Phoebe (Lisa Kudrow), and Rachel (Jennifer Aniston) appreciating John Stockton's short shorts","Has there ever been a shot as crazy as J.R. Rider's \"Play of the Decade\" shot in 1994? What are some other contenders?","DeRozan takes it the full length of the court with 10 seconds to go for the and-1 dunk","What is the value of this player?","Timberwolves to Host Preseason Game at the Hilton Coliseum in Ames, Iowa - Home of the Iowa State Cyclones","Melo is going to shut a lot of people up this season.","WOB FILES: Unexplained NBA Myths","Manu's resume: Euroleague champion, Euroleague finals MVP, Olympic gold medal, NBA champion, NBA 6th man of the year.","Scott foster is the head ref for every nba game...how does the league change?","Who's more likely to be gone from their respective teams next year, Kawhi or Butler?","Start one, Bench one, Trade one","Manitowoc Minute: Da Milwaukee Bucks Fiserv Forum","2003 - Ginobili (rookie) eurostepping around Shaq","Which if these hypothetical young cores would you choose to start a team with?","What’s it like being an NBA player’s close personal friend?","Is Wade only not seen as consensus top 20 all time because his peak was too short?","Manu Ginobili: best guard off the bench ever according to advanced stats","The Top Ten Basketball Movies Of All Times","Just want to take a moment to appreciate this camera angle from the sideline in the 2001 NBA All-Star Game. I'm assuming the camera is on a dolly moving with the action, and it's a really cool view.","Kyrie Irving, Gordon Hayward of Boston Celtics ready to go for training camp","Ginobili hits a nutmeg at age 40.","Steve Nash crying in the locker room after losing game 6 in the 2010 WCF","Manu blocks Anthony Davis","In the 2003 NBA Finals, Tim Duncan averaged 24.2 points, 17.0 rebounds, 5.3 assists, 5.3 blocks, and 1.0 steal per game","James Harden with Kobe’s defense. How good would he be all time?","The San Antonio Spurs’ Manu Ginóbili is a statistical freak...","NBA G League Tips Off 2018-19 Season On November 2","[Wojnarowski] Sixers are re-engaging on GM search, but managing partner Josh Harris doesn’t rule out existing front office structure for coming season. “We prefer to find an elite talent ... but we aren’t going to compromise,” Harris tells ESPN.","[Charania] Story on The Athletic: Top prospect Darius Bazley tells Athletic he’s decided not to play in G League, will use year to train and prepare as professional before 2019 NBA draft.","How Manu Ginobili Revolutionized the Eurostep in the NBA","Windhorst: 'Nothing happening right now' between Karl-Anthony Towns and Wolves","Ty Lue dishes to Josh Smith for the nasty dunk over Primoz Brezec.","Lets remember the epic Mike Conley v. Kawhi Leonard duel from game 4 of the 2017 playoffs","Who would win in a fight, 100 duck sized Isaiah Thomas' or 1 Isaiah Thomas sized duck? [OC]","Does anyone know luka doncic wingspan?","(2015) Spurs’ Duncan, Ginobili, Parker become winningest trio in NBA history","Jazz Bear wins third Mascot of the Year award","Sacramento Kings Backcourt","Patty Mills and Marco Belinelli* are the only Spurs players left from the 2013-2014 Championship team.","[2017] San Antonio Spurs fans give Manu Ginobili an EMOTIONAL STANDING OVATION!","Norm Powell Steals the Ball and Ties Game With Superman Dunk","Whose career would you want? Ginobli or either Chris Paul/Russell Westbrook/Carmelo","The NBA regular season begins in 50 days.","One of the Greatest Passing 2 Guards this game has ever seen","Add prime Kawhi to the '07 Spurs team. How would they fare up against today's Warriors?","A Mediocre Historian's Thoughts on Kevin Durant's Legacy","Lonzo Ball says he’s spoken to LeBron James a couple times; think the Lakers can do ‘something big this year’","How many games would this team win?","Would you get the best player in franchise history back except 6 inches shorter or the #1 pick in next years draft?","Was Manu Ginobili ever a top 20 player in the league?","Manu Ginobili Top 10 Between the Legs Nutmeg Assists of his Career","If you could go back and change any 2 moments in your franchises history what would it be?","Most championship rings among active players now that Manu has retired","Young Manu Highlights - The Scientist (Poor quality but some amazing plays)","Is Manu the biggest steal in the history of the NBA draft?","What Big 3 was better at their peaks, KG/Allen/Pierce or Duncan/Manu/Parker","[Charania] Sources: Free agent forward Thomas Robinson is signing a non-guaranteed deal with the Atlanta Hawks","Manu seals the deal in final home win","NBA in-game attire/accessories","Manu Ginobili Career Highlights Mix! LEGEND!","ASIAN GAMES 2018: Philippines beat Japan, 113-80.","Quincy Pondexter, San Antonio Spurs agree to 1-year deal","TMac and Ernie play baseball and Shaq’s loving every bit of it.","Which player would you rather have?","Manu Ginobili single-handedly defeats the Nuggets","Donovan Mitchell getting clutch bucket after bucket against the San Antonio Spurs","Ben Simmons INSANE highlights (Game 2 2017-2018 ECSF)","If Kawhi and IT had the same season from 2017 in 2018, who would've won the MVP?","The Most Forgotten Defender in NBA History","Draymond green HoF","your worst NBA take ever?","One of Manu's greatest moments, Game 1 of the 2013 Semifinals vs the Warriors.","Add Prime Kawhi to the '07 Warriors: How far do they get in the postseason?","Ginobili buries a 3 late in Game 6 of the 2014 WCF. One of the gutsiest shots I've ever seen.","Do you think Boston will regret Hayward's contract?","Measuring Shooting Across Eras: Weighted True Shooting (wTS+)","Where would you rank Manu all-time for shooting guards?","Why did Manu come off the bench?","Birdman doesn’t do interviews during pregame","ESPN BPI Predictions","Would a pre-injury prime D-Rose be a top 3 PG today?","Who is an NBA player that’s had an old man game for his entire career?","Rookie Steph Curry witnessing obliteration of Anthony Tolliver.","Translation for hupu","Incorporating team success and supporting cast in player rankings (KG vs Kobe as an example)","Carmelo’s Jersey","LeBron James - The Kobe Fade (Reverse Pivot/Spin Fade) 17/18","Manu Ginobili - \"The Ultimate Competitor\"","Monta Ellis Highlights","Probably the best quote from Pop about Manu.","Who is your pick for the MVP next season?","John Stockton doesn't back down from Jordan","Phoenix Suns displaying no effort on defense against the Celtics","Who's your unpopular choice for top 10 player in the league right now?","NBA Veterans Hate Steven Adams","Manu Ginobili's Top 10 CIRCUS SHOTS of his career.","Fun trivia fact: Kobe has exactly twice as many regular season games (122) with 40+ points than LeBron (61). LeBron has almost exactly twice as many playoff games (27) with 40+ points than Kobe (13).","What made-up NBA awards would you like to see, and what are the all time greats for your award?","Add two players that equate to the sum of two other players.","Manu ginobili keeps spurs season alive with game 4 performance","Its sad to think that Spurs fans didn't have a chance to say goodbye to Duncan and Ginobili (and most will Parker).","Struggling to find real nash jersey","Amare Stoudemire Highlights","Svi Mykhailiuk lays down some sauce and Lance reacts","In the case of Steph, how much of his success is due to genes and how much is due to hard work?","The moment that made me realize that Giannis will go down as one of the greatest to ever play the game.","Is Manu Ginobili better than Sidney Moncrief?","Whats the worst take youve seen this offseason?","With 49 days left until the start of the season, here's Steph Curry dropping a season high 49 points vs. the Celtics","The 2015 Kings baby race was as exhilarating as it sounds.","Shaq singing his own version CHEERS on the Laker bus.","Manu explodes on the Detroit Pistons","[2007] ESPN Roundtable: Who's better -- Kobe or LeBron?","Who would you take, Ben Simmons or Luka Doncic?","Just how much more efficient is Lebron than Kobe...","[Charania] Sources: Undrafted Louisville forward Deng Adel has agreed to a training camp deal with the Minnesota Timberwolves","How many teams will this team win?","Kawhi Leonard 2014 Finals Game 3 @ Miami - 18 in the first quarter, 77% FG for the game, new career high!","On December 13, 1994, Willie Burton put up 53/8/3/1/2 on 85 TS%","Hypothetical: If Kawhi is 100% healthy this season, but still shows a significant decline in performance, would / how would that change your perceptions of the legacies of Popovich and Duncan?","The moment Manu Ginobili sealed his fate as a HOFer","21 year old Lebron vs 27 year old Kobe (2005-2006)","What’s something you’d like to see happen this season that probably won’t?","Dr. J Dunks On Michael Cooper- Rock the Cradle","LeBron vs. Kobe is tired, Gasol vs. Love is the real debate","Do you consider Kevin Garrett a fake tough guy?","Top 5 Elbows By Karl Malone","Manu Ginobili's Monster Dunk from All Angles!","r/NBA Hall of Fame. Class of 2005 Inductees. First Ballot: Michael Jordan, Hakeem Olajuwon, David Robinson, John Stockton, Karl Malone, Scottie Pippen, and Patrick Ewing. Voting for Class of 2010 begins","Shaq as a middle schooler in his new commercial","Name a player and i will draw them without looking at the paper","Spencer Dinwiddie led the league in shots made from 30+ feet last season with 11, here's all 11 of them.","Kobe makes one tough shot after another in Game 6 of the 2010 WCF, eliminating the Phoenix Suns. Bonus footage of Alvin Gentry in the post-game presser.","[WNCT9] Brandon Ingram returned to his hometown of Kinston on Saturday to give out book bags and other school supplies to kids in the community.","Brian Scalabrine Blames Manu Ginobili For NBA Flopping Problem","A brief history of Manu Ginobili","Hypothetical: If The Basketball Hall Of Fame was specifically the NBA Hall of Fame do you consider Manu a Hall of Famer?","Great podcast by former NBA player, NCAA coach Rex Walter featuring SVG, Tim Hardaway and more","Ginobili`s amazing fake on KD!","Cedi Osman lays down some sauce and LeBron reacts","NBA players with notably difficult upbringings","Top non-american players discussion: Manu and dirk. TP out?","Jayson Tatum Highlights vs Thunder - 23/11/4 Real Smooth","[OC] Q: What was the game where Wilt began to get called as loser? A: The G7 vs Celtics where Wilt shot at 80% for 30 points, scored the last 4 points- and probably 10-12 points- of the game, and outmaneuvered Russell+dunked with 5 seconds left","Lebron refuses to lose a game of \"knockout\" and banishes one of his campers to the shadowrealm","My favorite Manu Ginobili moment","[OC] Stephen Curry demoralizing Austin Rivers (and Raymond Felton)","Ginobili Imposes His Will - Game 5 vs Rockets, WCSF 2017","Manu Ginobili Buries the Game-Winner to Take Game 1 against the Warriors","Russel Westbrook's dealership","Are there any players in the BIG 3 League that could still compete / be productive in the NBA today?","How good was Elvin Hayes? Any modern day equivalent?","What's your opinion about whole drama surrounding Jimmy Butler?","The day I met Manu","40 Year old Jordan performs a grab block","What’s a vintage 90s game not involving Jordan that you’d recommend checking out?","Would you rather have TWO Derozans and one Robert Covington dropped on your team OR one Kawhi and one Aaron Baynes?","James Harden should be an all time great","Daily Locker Room and Free Talk + Game Threads Index (2018.08.27)","Free The Bamboo: Episode 1 (Jaylen Brown)","'Man, I'm gonna get fined.' Trolling with Enes Kanter","Gasol hits game-winning 3 and proceeds with the Conor McGregor walk","You name a basketball player and I'll compare their career to someone in another sport with a 1 sentence explanation","An all time playoff performance in a loss - Steve Nash drops a 48/5/5/3 on 20/28 shooting in a loss to Dallas in 2005","LeBronto is born with a series of devastating 4th quarter fadeaways","How many wins would a team of this starting 5 win in the regular season?","Player that you can’t stand that everybody else loves","What is your most surreal, \"I Can't Believe This Is Actually Happening\" Moment in NBA History?","NBA Survivor?","Westbrook DOES NOT have the same amount of games shooting below 36% than Steph has shooting below 50% in the last five seasons.","Buddy buckets","Who would win in a 7 Game Series: Team All-UCLA or Team All-UNC?","In the 2017-18 regular season, the Sacramento Kings only had two instances where they had someone score over 30 points.","A camera finds its way onto the court mid-game and Amir Johnson seizes the opportunity.","Who would you rather have as your 6th man: Manu Ginobili or Jamal Crawford?","Gilbert Arenas and his approach to offence","Is Wiggins going the way of Bargnani?","Would you rather have Devin Booker or DeRozan for next season only?","Why do people say Steph Curry doesn't have longevity yet are okay with putting Kawhi as a top 3 player?","In the 2016-17 season, Isaiah Thomas had the highest TS% of any 20+ PPG scorer in the league other than Kevin Durant.","An alien visits earth and checks r/NBA to learn about the league. What does he leave believing?","With Manu Ginobli and Tony Parker gone, how much cap space do the Spurs have? Who can they potentially get?","The NBA should just give out regular season awards and then have the awards show for the playoffs.","Was that Britney Griner quote quoted a few minutes ago real or fake?","Longest Playoff Droughts Currently","basketFilms | Watch NBA documentaries - A curated collection of NBA documentaries","Manu Forever: Shea Serrano Reflects on the Retirement of a Legend - The Ringer","What is the ultimate X OR Y player when asking someone randomly?","[IMDB] White Men Can't Jump - trivia","Manu Ginobili dunks on the Lakers","[Doug Gottlieb] I would rather have Manu than Dirk. Better defender, more diverse set of skills, tougher, better passer... There is a reason he has won everywhere he has been","I have a feeling Devin Booker and the Phoenix Suns are going to explode this year","Tracy McGrady makes Kevin Garnett question life","Chris Paul with the ridiculous teardrop","The Bullchelor: Starring Robin Lopez","[The Players' Tribune] This is Personal | By Steph Curry","NBA players as Naruto characters","Does Ginobili's retirement make the 2018-19 Spurs worse?","[MaxaMillion711] BIRTH OF THE MAMBA - Young Kobe Bryant Highlights Part III - YouTube","According to Bill Simmons's most recent podcast (with guest Jayson Tatum), Tatum used to get rides home from school from Bradley Beal despite being 5 years younger","Air Jordan","Who is going to the be the next Spurs like team, with a core of players that play their entire careers together?","KD gets bodied by Nance Jr. Such a satisfying poster.","Why did OKC give Kyle Singler $19,000,000/4 Years ?","Never forget this weird Ginobili-Harden moment","Mason Plumlee with the game saving block on Lebron to sweep the season series","I went to a Knicks game a few months ago.","This Promo from last season is now really funny in hindsight","Did you all know Stephon Marbury was up to all this?","Marc Gasol with one of the sexiest moves from last season","Rookie Brogdon Booms Bron","Vernon Maxwell messing with Derrick McKey moments before game 7 free throws","[OC] Who Would You Rather Have On Your Team: Jordan/Magic or Lebron/Bird?","Kevin Mchale is the only player in NBA history to shoot 60% FG, make 80% FT, and average at least 20 ppg in a single season","Best Steph curry hairstyle","Kyle Lowry Full Highlights 2016 ECSF Game 7 vs Heat - 35 Pts, 9 Assists, 4 Stls!","What OC do you want to see?","2016 Nike Hoop Summit: All Access Episode - De'Aaron Fox, Josh Jackson, Markelle Fultz, Ayton, Tatum, Etc.","James Harden Game 3 WCSF vs Spurs 2017 Playoffs- 43 Pts, 5 Ast","Duke has/had a Fraternity with extended memberships to certain Duke athletes like Kyrie Irving and JJ Redick","Consequences of paying a player under the table?","Kobe makes the easy corner 3","Kobe crosses Matt Barnes then hits the jumper, while chewing on his jersey.","Russell Westbrook annihilates the rim","Which finals player would you rather have?","Robert Sacre shocks the crowd with an ELECTRIFYING dunk for an almost perfect score","Allen Iverson is joking with Shaq about the crossover","[Amico] After playing just nine games last season, #Raptors forward Kawhi Leonard has been killing it during summer workouts, league source tells AmicoHoops' @amathur90. #NBA","Predict Demar DeRozan's statline next year","In 2017 we had Hoodie Melo. In 2018 we have Snapback Cap Kelly.","Who is primed for a breakout season next year?","Does Bruno Caboclo have a shot at starting for the Rockets?","[Wojciechowski] An inside look at Marc Gasol's harrowing mission to help rescue immigrants adrift in the Mediterranean Sea","[OC] Shaq's interactions with Asian women","Looking for a Manu play from last season","C.J. Watson once put up the following stat line: 1 point, 1 rebound, 1 assist, 1 steal, 1 block &amp; 1 turnover","Debunking Most Every Wilt Chamberlain Track &amp; Field Myth","In 2010, LeBron predicted he would win eight titles. Instead, he went to eight straight finals","ASIAN GAMES 2018 Men’s Basketball 5x5 Quarterfinals: Korea defeated Philippines, 91-82.","One of the greatest guard defenders of all time","What's an appropriate acronym for your team heading into this season?","In the 2002-2003 season, Bruce Bowen led the league in 3p% with 44.1. He was also last in FT% with 40.4","Michael Jordan's Net Worth Jumps $350 Million To $1.65 Billion","Mental Health and 'Choking'","Why do I keep seeing variants of \"he's so good\" x4?","So now Manu Ginobili has hanged it up. Is he in the Top 3 all time Shooting Guards?","What Player on Your Team Do You Want To Give a Shout out to?","[OC] 300 high res photos of the NBA in the 2000s","[Ben Taylor] Did Dirk Nowitzki really \"carry\" his team to a championship in 2011?","Daryl Morey is overrated","[Serious] If Jimmy Butler ended up on the trade block, what would you offer for him?","Rookie Brogdon BOOMS Kyrie","Who is the worst player you could make 5 clones of and defeat the Warriors?","[Serious] Who is on your all time Lakers Mount Rushmore?","What are some good examples of guys who didn’t get the money desired from their original franchise but did elsewhere &amp; succeeded expectations?","AK-47 Highlights","Steven Adam's best plays from the 2017-18 season.","How would you rate Kyrie’s defense?","Jonathan Isaac 10 points 5 steals 2 blocks vs Raptors","Jordan Clarkson with the MJ \"no-look\" Miracle Shot","Kobe has only a career 0.08 TS% and 1PPG average advantage over Carmelo","Amar'e Stoudemire is planning and hoping for a return to the NBA.","Is 2015-16 Stephen Curry the best offensive regular season of all-time?","Slam online ranks their top 100 players of all time and 6 of the top 8 are Lakers","[Zirin]: Why Kyrie Irving’s Connection to the Standing Rock Sioux Matters","Who gets the most \"passes\" for being a bad defender, and who gets critiqued the most?","[theScore/Pardon My Take] J.J. Reddick on his time with the Clippers: “It’s weird to think what we had the potential to accomplish and what ultimately derailed that was pettiness. Like, 45th-level pettiness.”","If healthy, would the Warriors starting 5 playing in the East all make the starting lineup for the Eastern Conference All Star Team?","[Predictions] NBA Awards (2018-19)","Are there any full-game recordings of pre-60s NBA basketball?","What is your first NBA memory?","Who was traded for CP3 in 2011? Eric Gordon, Chris Kaman, Al-Farouq Aminu, and a Minnesota First Round pick used on.... Austin Rivers","Hoop Nation CNN Philippines Episode One: Cebuano Basketball","Chris Paul and Dario Saric move to New Orleans. Enough for a chip?","How does KG not know what a travel is in this video?","In 2001 Shaq Was Body-Slammed By A 15-year-old Glen \"Big Baby\" Davis After Challenging Him To A Friendly Wrestling Match","Video of Nick Young Getting Arrested","Al Horford - Point Center 17/18","GSW All-Sport domination?","Big Baby Davis breaks down in press conference after winning Big3 title","Mildly interesting observation: in terms of player positions, the 2010s have had a very similar progression of MVP winners to the 2000s","Knicks social media guy claps back at a hater [Instagram]","Rookie Amar'e flushes it on Olowokandi; Marbury is disgusted","Potential problems for the Boston Celtics","That argument about Manu being a winner is stupid","Paul Pierce blocks Kyle Lowry on game winning layup in game 7","Are the Golden State Warriors the Migos of the NBA?","Michael Jordan goes for 46 points, 11 rebounds, 9 assists, 3 steals and 1 block to begin his first title defense (Game 1; 1992 ECQF vs the Miami Heat)","Will the 2010s be known as the \"LeBron era\"?","Quin Snyder once called a timeout to simply glare at his team in silence. They had just given up a 10-0 run to the T-Wolves. After the silent treatment the Jazz went on a 16-2 run to win the game.","[OC] Ranking the top 10 Defensive Primes(in the Playoffs) in advanced statistics","Players to average 30+ PPG on +.500 FG%","Jamal Crawford career-high 52 points (16 made FGs in a row). 20/30 FG, 8/10 3P.","Hypothetical: Kobe drafted/stays with the Hornets (or another team that isn’t the Lakers)","How would basketball be if humans have evolved with 6 fingers?","Okc fans, who starts at SG next season till Roberson is back","[OC] A Hypothetical NBA of the Future (48 teams, 2 playoffs, youth academies)","This is what got me into basketball","All these Kahwi and DeRozan posts/clips just making SA and Toronto fans sad.","City of Milwaukee denies wrongdoing in tasing if Sterling Brown","Who does this players athleticism and on-court excitement remind you of a young...?","Jordan Clarkson Full Highlights vs South Korea (Asian Games 2018)","[wallpaper] Lillard Time","Who on your team is your fan based hyped about but nobody else seems to care","where do you have Kobe ranked all time","Rank these teams in order","Isaiah Thomas 52 Points! 29 in the 4th Quarter | 12.30.16","Phoenix Suns displaying no effort on defense against the Cavaliers","The NBA needs a Michael Jordan Day","Lebron James TOYING With People In PickUp Game Leagues","Watching Mavs vs Kings 2003 playoff game. Here are some observations","I haven't seen this Kobe highlight around all that much. Surprised it's not replayed a bunch with other Kobe highlights...","What has to happen for Durant to pass Kobe all time? How likely is it?","Why is Donte DiVicenzo so underrated?","Which player is the most active in the league on the court?","Who's a player you think people 5 years younger than you have no idea how good they were at their peak?","Dirk Nowitzki showing off his athleticism on the soccer field","Maxi Kleber delivers a two-handed facial on Julius Randle","Carlos Boozer playing like he just got out of bed in the Big 3 Playoffs","Steve Nash vs Chris Paul","If you could give Lebron a skill besides Steph Curry’s shooting what would it be","NBA Breakdown: Best of Boston Celtics After Timeouts","Lebron destroyed the Raptors with his Fadeaways so they brought in Kawhi to shutdown his space.","Forgotten game: 2003 NBA Playoffs Suns (OT WIN) vs. Spurs; includes(Amare, Marbury, Johnson, Marion) vs. (duncan, jackson, parker, etc)","Who would you pick with the #1 Pick in a draft?","Genuinely well-made Carmelo Anthony Mix for all the haters - \"Switch\" (2019 Rockets Promo) via /u/Gbelfiglio5","[Body Shaming] Lightest and Heaviest NBA Players sorted by Height","Westbrook's block leads to Durant's BIG slam!","[Serious] If you had to compare, Manu Ginobili’s gold medal or Kevin Durant’s 2 rings, which is more impressive?","[Discussion] The NBA goes back to the 8-team league of 1960 (Part 2)","Who do you think regresses the most this year?","Some team should just feed one player the ball all game to try and break Wilts 100 point record","Question on the third place Big 3 game","Changes needed in Spurs pick and roll attack","Is Kevin Durant actually Voldemort?","[Paul Pierce]What you have to understand about Kobe’s game is that by taking that many shots, he’s meticulously wearing down the defender until he breaks them. He’s made a career out of making guys lose confidence in their defense and then continuing to attack them. He’s won five rings doing that.","Why won't your team win the NBA finals in the next 4 years?","Carmelo Anthony crosses over Manu Ginobili","James Harden's Best Play From Every Game: 2018 NBA Season","If KAT really wants out of MN, the Celtics should offer Jaylen Brown and a first rounder","Great basketball names","How important do you think a unbreakable self-confidence and mentality is to a NBA player?","Plays where Jordan got embarrassed?","Do you agree with this list of top 10 teams in the league today?","GOAT Conversation: What if the Warriors win 3-4 more championships?","Fun Fact: If you Google [image] \"24\", a picture of Brian Scalabrine comes up before a picture of Kobe Bryant","Favorite personal story about an NBA player?","What are the chances Harden wins another MVP next year?","Sarunas Jasikevicius: boys in college have no idea what Doncic can do! (in slovenian, use Google translate)","Top 22 Players with the Most Total MVPs","Four Warriors players from 2008 won basketball titles since June 2017.","The best possible starting 5?","Orlando Magic Young Frontcourt","Was Kobe Bryant ever actually the best player in the league?","One of best dunk contests ever - featuring young James White, Rodney Carney, David Noel","\"Thanks to the new rule change ______, the [your team here] are the new favorites to win the 2019 Championship.\"","Multi-directional euro-step?","From 2005 onwards, Kobe received 6 All Defensive first team, and 1 All Defensive 2nd team selections. During that same time frame, he finished top 20 in DRTG not once.","Podcasts","Words spread out really fast these days","A review of where the Championship Belt went among all NBA teams during the 2017-2018 regular season","[SI] Report: Jemele Hill to leave ESPN in September","presuming Golden State wins again this year, which of these 2019-20 storylines would interest you the most?","On June 15th 2014, The San Antonio Spurs won the NBA Championship. Four short years later…","[SI] ESPN's Michelle Beadle Leaving 'Get Up!' For Expanded 'NBA Countdown' Role","Who would you rather have for your team, Zion Williamson or Marvin Bagley III?","DeAndre Jordan's Amazing Charles Barkley Impression - Streamable","[Sarunas Jasikevicius] College players don't know what Luka Doncic is capable of","Wheelchair Basketball World Championships: GB men beat USA in final","I have some unpopular opinions...","Crazy sequence from OKC-Magic game 3 years ago: Oladipo nails the clutch 3 over Roberson with 3.9 secs to go. With no timeouts left, Westbrook decides to save the day","Dirk Nowitzki taking a penalty kick.","Which two players in their prime would you want to see in a Game 7 Finals?","Daily Locker Room and Free Talk + Game Threads Index (2018.08.26)","Which NBA players are the closest to having a 100% approval rating?","Why does no one ever talk about Adrian Dantley?","Reminder that Houston had 2 opportunities to eliminate GSW and lost both","Gauging The Value Of Rodney Hood For The Cleveland Cavaliers","Terry Rozier on coming off the bench: \"If you want to win a championship, that's what it's going to take -- sacrifice. ... We're all going to have one goal and it's going to lead us to the promised land.\"","Your choice","Did Duncan and Manu retire because they knew they wouldn't beat the Warriors anytime soon?","Is everyone done hating GSW?","Are NBA players better athletes then the NFL or is it the other way around?","Nick Young reportedly arrested in Hollywood","Who’s your teams most underrated player","Lebron James destroys an Angolan man's dreams (2008 Beijing Olympics)","Kobe Bryant crosses over Manu Ginobili","LeBorn James consecutive clutch 3s in the 2018 ECF","Fun Fact: Lebron has 3 of the top 5 playoff runs of all time, in Win Shares","Anthony Davis’s first and only three pointer of the 2015 season that lead the Pelican’s to the playoffs","Devin Booker drops a ridiculous 70 points vs. the Celtics at age 20 (Highlights)","[SHAQ] My condolences to @stephenasmith and his family on the loss of his father. Just know that I am here for you my friend. Please don’t hesitate to reach out if you need an ear. Omega Psi Phi Loves You","If players had to shorten their first and last names to nicknames, and foreign players had to translate their names to English, who would have the weirdest change?","Which player would be the GOAT at the Skills Challenge","[Serious] Is there some NBA Players that deserve the hate that they are getting?","Lebron James vs Conor McGregor who wins","More of Pascal Siakam and Jakob Poeltl Bromance","Bill Simmons calls this his favorite regular season game: The night the Bulls ended the Heat's 27-game win streak","Stan Van Gundy taking no joy in watching Dwight Howard become NBA drifter","Lebron James ignores I.T.","Steph Curry lead the NBA in TS% in 2015-16 with 66.9%, and in scoring, averaging 30 points a game.","Daniel Gibson to LeBron James alley oop","Which NBA season had the most parity in it?","Rule changes","You're assembling a team to play the Warriors in the Finals, who are you taking as your starting PG: Lowry, Irving, or Wall?","NBA Jam 2001 Gameboy Game.","NBA Finals Game 3 Final Moments insane","Why is Manu a HOF shoo-in?","Pinnacle of the off-season....","What player roles does a team need to function efficiently?","City attorney denies tasing of Bucks guard Sterling Brown violated his rights","Kawhi Leonard's first day in Toronto Raptors | Basketball Animation | Game of Zone inspired.","[OC] 250 high res photos of the NBA in the 1990s","KG and the Bone Breakers from Area 21","NBA Redraft","Can somebody help me find that picture of IT contesting a shot from 10 feet away from this season?","Remembering Keith Van Horn","Debate: If Lebron James can beat this current Warriors team in the playoffs with their whole roster healthy, and proceed to win the championship, he will be the undisputed GOAT.","The legendary (and overlooked) Kobe to Pau Connection","I hope Kobe fans will all vote for Carmelo Anthony to make the All-Star game","Remember the Greatness of Lebron","LeBron dunks over Alonzo Mourning and takes a nap","Clutch Khris Humphries said \"Yes OT\"","What are your expectations for your team this upcoming season?","Mohamed Bamba | \"Mo Bamba\" | x Sheck Wes|Career Highlights 2017-18 ʜᴅ","Pascal Siakam and Jakob Poeltl had the coolest rookies friendship in the NBA.","We need to vote Dirk into the All-Star Game this year","Assuming health, how does a team of KD/Westbrook/Horford/Roberson/Adams/Oladipo/Sabonis/Grant/Abrines do? Are they better than the current GSW?","Thanos Snaps the NBA: The Golden State Warriors","Is Dirk’s one ring better than KD’s two?","The Problem with Defensive Statistics (II): DRAPM strikes back?","Old Converse Commercial with Larry Bird and Magic Johnson","Khris Humphries denied Blake Griffin","NBA potential?","Stephen Jackson '08-'09 Highlight Reel (Captain Jack)","When Shaq got roasted by Chris Jericho on WWE","If Jimmy Butler leaves Minnesota and they are stuck with Teague, Towns and Wiggins and possibly a mediocre seeding — will Thibs eventually get shit for giving away Lauri, Dunn and Levine for a rental Jimmy Butler?","[Bleacher Report] The disrespect to Melo... Hawks announce that Vince Carter will wear No. 15","Joe Dumars has the most points scored without a single 2PT field goal made","These rookies have played one season. Who would you choose?","Let's r/NBA Pick Over/Under for the Season","Has Lebron James been a top 10 NBA player his whole career?","If the 3pt line was taken away, who would be the best team?","Does Anyone Know If Wiggins and Towns Are Working Hard?","The Robert Horry game: Game 5 of the 2005 NBA Finals. Tim Duncan with 26-19, Horry with 21, Manu with 15-9","If you changed the NBA game to golf scoring It would look weird.","Nick Young Arrested","Dumb question - Are all NBA players good shooters?","Andre Drummond and Stanley Johnson Have a Connection | THE SIXTH SENSE","How would you rank the desirability of NBA cities for players?","[Rowland] I asked Blake Griffin tonight who wins 1-on-1 if he played Buddy Hield &amp; Trae Young. Blake said they played this afternoon. Buddy won 2, Blake won 1, Trae was shut out. “It’s a rookie thing,” Blake said.","Zaza Pachulia Fouls 3 of the spurs players in the same game and then gets ejected for taunting.","Help me make a flowchart of NBA teams"]