["[DUB] Dragon Ball Super - Episode #77 - Discussion Thread!","Dragon Ball Super: Broly - Movie Megathread! (new TV ad, new design variations, etc.)","[SPOILER] [OC] Decided to draw UI Goku in the old Namek manga style. Hope you like it!","My new figure","Just got this in the mail today!","Did some fanart of my fave DBZ character! Hope ya like it! :D","The English Dub voices for Caulifla(Elizabeth Maxwell) &amp; Kale(Dawn Bennett)","Whither Gogeta","My students have been bringing me Pop figures because they know I like Dragon Ball Z/Super/etc.","SSJB is a nice breath of fresh air.","Goku Voice Actress Masako Nozawa Reveals Catchphrase in Dragon Ball Anime Started as Ad Lib","Super Saiyan Ape (Dragon Ball Absalon) [Animated by Mellavelli]","Best Gift Ever","I’ll be your Huckleberry. Super Vegeta style. [OC]","My new computer stand figures","It may be full of stock parts and old budget equipment, but at least Goku Black likes my build...","DBS manga discussion: Understanding the breakneck pacing (long post, spoilers all)","So what happened to Yamoshi the original Super Saiyan God?","Even more evidence that Gogeta will be in the DBS Broly Movie. (Part 2)","Are the SSJ transformations power multipliers or forms that unlock potential?","Is SSJ4 really an 'edgy' form?","Why doesn't Toyotaro get an editor who can give critical input like Toriyoma had?","Sick!","Caulifla and Kale English Dub Voices -Dragon Ball Xenoverse 2","Guru vs Old Ki's potential unlock","[OC] SSG Vegeta!","Funniest DB Moment of All!","If Cell had blown up the Earth when he was losing to Gohan","What do people think of SSJ3 overall?","DBS anime: Canon or Not?","God Master Roshi Theory","My new gaming buddy","I've decided that it is time to start collecting figurines.. here are the first 3","[OC] Tien Shinhan","Underrated Transformation","Music from one DB series that could fit in a scene from another DB series","Does anyone know what scene this Cel is from? Also, can someone add if they think it is legit or not? thanks!","[OC] Just a Jiren drawing :-)","Does Vegeta have the highest body count out of all these amazing characters?","Got my first figurine. Won from an arcade game in Tokyo","[OC] Vegito Beyond Super Saiyan Blue","A Piccolo figurine I got awhile back.","So what would happen if a super saiyan fused with a base form?","What would be Cooler (No pun intended) Brining Cooler officially into cannon? Or giving Frost Coolers 4th form as fan service?","Saiyaman Saga Commander Red","Frieza is directly/indirectly involved in nearly every event in Z and Super","If there was a redub of the original Dragon Ball (in the same vein as DB(z): Kai, would you watch it? What changes would you want?","Gonna give my entire Dragon Ball collection for my future son (dunno when that'll be) among other things, hopefully he appreciates it (too hard to get rid of it because of nostalgia).","Brazillian Dub Dragon Ball Super: Broly Trailer","Angel.. Angel.. Angel","Xenoverse 2 Extra Pack 3 - Launch Trailer | All CACs selectable through character select","Dragon Ball Episode 121: The False Cliffhanger.","Potential in different universes","It’s my birthday today and I got 2 new additions to my collection","[OC] MUI Sketch on a Post-It Note","Bought my son his first etcha sketch for his 2nd birthday, couldnt resist","Fusion Question??","My Dragon boi collection accompanied by a print from Kehasuk.","[OC] My favourite Gohan design. Should've kept the cape...","[OC] Dragon Ball Super Broly - movie FANART Poster","If Goku never knew about the dragonballs, would he be so carefree with his enemies?","How would Goku's Gi look like if it was replaced with modern day, buisness casual type wear?","Dumb Theory Time! About Beerus and the Oracle Fish","[OC] Blue Kaioken and Blue Evolution","Funi vs. Ocean dub","Androids 17 and 18: overpowered?","saw this guy on the interstate","Future of Beerus","Dragon Ball Adidas Shoes","UI Omen was far superior to MUI","Experimental watercolor of everyone’s favorite bad boy prince.","Credit to u/RockinMouth for his amazing Vegeta design, and my new tattoo","So I’ve been doing a rewatch of Dragon Ball with my gf","Vegeta Super Saiyan blue in my style","Got my Broly signed by Mr. Vic Mignogna himself!!","Since nobody has posted it on its own yet... the offical English dub of Limit Break X Survivor","Kid Goku [OC]","Dragon Ball Super Ultra Instinct Goku and Shenron Ornament","Somebody Did This in North Memphis","😏","Purchased this gold DBZ card what is it?","I always thought all the characters that rocked Saiyan armor along with the scouter looked so badass","I'm just now realizing that Buu was a necessary evil in the DB Universe, maybe even a God.","Which is cooler Super Sayian Blue or Super Sayian 4?","Theories on what the new version of Broly will be like?","Is Banpresto still coming out with new stuff?","If Goku trained in the dead world after the fight against Cell and returned very strong, seven years later, in the arc Majin Boo, why did not he return in the bad future of Trunks?","The movie ticket has arrived. Can't wait to see Broly in Japan this December!","FANART: Goku ssj fanart I did some time back.... Reworked it with a background","Is Xenoverse 2 still worth it on PC?","Something I loved in Z and wish to see more whenever Super continues was the emotional distress some characters were facing","Fan Coloring Hit. I wanted to do something in more of a western style and Hit's design was perfect for that. also the Toki aura... took forever.","Would you feel OK with some sort of supersaiyan powerup streamlining?","Really late but these were my buddy and I’s costumes for Halloween","Ever notice how Goku's most effect move is his almighty bite.","Best Video Games to Play?","Dbz Kai Blurays","Blesea","Why did Master Roshi recommend Fortune Teller Baba when her services were supposedly impossible?","Super Dragon Ball Heroes Chapter 13 - English Scans","Cauliflower’s Arc ( Manga chapters 32-39 )","My fiancé had her 12 year old cousin draw this for me. Can’t wait to frame it!","Why do people say Dragon Ball Z instead Of Dragon Ball When Talking About The Show?","Took /u/Kyek 's Tricolor Vegeta (link in comments) and changed the God form to his scouter form, complete with smirk instead of frown.","What do you all consider to be DBZ plot-holes?","Drew a Super Saiyan 3 GT Goku to get myself out of an artblock","Cabba , Caulifla and Kale are in their teens","Problems with DBZ","Would you be down to see a retelling of the Tuffle story from GT if/when Super continues?","I drew raditz gokus bro needs remembered","Will Vegeta Ever Go Ultra Instinct","DBZ wedding gift","(Manga) Why is Bulma so moody during the takeoff to planet Namek?","Characters getting into relationships offscreen","Re-arranged my Dragon Ball shelf recently.","Decided to eat at Soupa Saiyan","Question about Goku vs. Jackie Chun","A friend of mine drew this. Thought I'd share it here. Credit: Saania Shahid(instagram username: saania_shahid)","Dragonball Legacy: An Idea For A New Dragonball Series","Ramifications of Capsule Technology in the real world.","Gotta Delivery This A.M. Got nothin but compliments all day XD","Is anyone else slowly getting more disappointed with the animation style of the upcoming Broly Movie?","For those who don't know, the page owner/admin of popular Facebook Kakarot page passed away today.","Probaly the Strangest Rule In The Tournament Of Power","Final Flash!","What, in your opinion, is the best scream if DB/DBZ/DBS?","Latin America Dub Trailer for Dragon Ball Super: Broly","Just moved, got my DBZ Shelf set up!","Dragon Ball Super: Broly (Latin American Dub) (Official)","Just got this done today at Green Apple Tattoo on long island by Adam. Came out insanely good. Pumped.","Am I the only one that likes Dragon Ball more than the later series?","I can't decide how Gohanks is pronounced. This is incredibly stupid but I would like your thoughts.","I watched this religiously as a kid during the Ginyu/Frieza saga","My tattoo after it was finally done!","Do you think Fat Buu would have been able to absorb Jiren if he entered the TOP?","Rank ALL the Saiyan power-ups/forms from most to least favorite","[Spoilers] My thoughts on Super","A drawing I did of Gohan","Stumbled upon this awesome Dragon Ball shop in Barcelona","Super Dragon Ball Heroes: Dark Demon Realm Mission Chapter 4 (English Scans)","Dragon Ball Super: Broly - Movie Megathread! (WSJ: Takahashi's SSG Vegeta)","vegeta should get the spotlight","I don't want Goku to go MUI in the new movie. Hear me out","[OC] Gohan ssj2 drawing","Keflas english dub voice in Xenoverse 2","\"Ba...Bakana...!!!\" by @songocchin","[OC] Pain Gang","[Art][OC] I drew (doodled) Gogeta from memory","I Colored UI Goku VS Jiren from the last chapter","Golden Frieza illustration I made earlier this weeek!","Just finished Dragonball Z. Why was Yamcha a joke throughout the entire series?","What are the best dragon ball video games out there? I’ve never played one and I know there’s a bunch of them","With all this new buzz around the new Broly DBS movie..","Where the hell is Krillin in GT ?","[Manga Spoilers] Regarding Gohan..","Unpopular opinion but I hate SSB","We've all seen him drive but did you know that","Yūya Takahashi practices digital drawing in Clip Studio","My first Dragon Ball statue arrived today! I definitely plan on collecting more!","My small collection","A line in the latest chapter I don’t think is getting enough shit","Vegeth Blue appears - Recolored moment from DBSuper Manga Chapter19","My DB Android 18 collection","Makafushigi Adventure (electric guitar instrumental)","Why didn't Vegeta ever get SSJ3?","I know it’s a small collection. And definitely not the large figure counts a lot have. But this is my DB/DBZ/DBS collection.","My fiancee's reactions to DBZ Kai (a continuation) (Minor spoilers)","More characters for SDBH Universe Misson 4","Finally finished my second piece, what you guys think?","What if Broly is the one whom the gods feared? Not Jiren.","Thanks to whoever posted their pickup the other day. I found an old Walmart gift card and thought I’d check - sure enough, my local one had it too. $7.88USD","Supreme Kai being afraid of Beerus makes no sense","New Dragon Ball Complete Package from Brazil. It comes with a poster and a box too","Anyone else feel like, due to his popularity, Broly might stick around after the movie as a Z Fighter?","Would you have changed the amount of competitors per team in the Tournament of Power?","Is there a mention of Goten or Trunks’ tails?","So I just found this terrifying Vegeta on let-go","Found these hiding in the attic while helping my Mom move. Hadn't seen them for a decade.","Local hobby store had a bunch in stock and I couldn't say no","Super Dragon Ball Heroes Universe Mission 4 Trailer! Ozotto, Super Fu and Great Ape Kanba","Why didn't they give Piccolo a senzu bean?","I did this for the latest #DBredraw. Poor Goku is being bullied.","GT arc in DBS","My Updated Collection!","Just added the gokus to my Blood of Saiyans collection","An idea i had for a different DBS ending","(Spoiler) Manga chapter 39: About Muten Roshi, Goku and Ultra Instinct","For once can't vegeta be the guy","My problem with SSGSS or Super Saiyan Blue","Who is your avatar?","Why is the show paced so oddly in comparison with the source material?","Goku just tryna catch a sweat.","What if Gohan had a rival? A rivalry similar to Goku and Vegeta? Would he have been motivated to keep training?","Anyone else thinks its a good idea if super saiyan 4 becomes canon in super?","[OC] Vegeta Galick Gun Fanart.","What if: Great Saiyaman had a successor?","Funimation sent me a care package! The shirt is sweet.","A somewhat peaceful DBZ what if","Warped version of Perfect Cell feat Dr Gero by me - @godfreyatlantis (Ig an fb)","Harry Potter: Saiyan Son Frieza Saga","Do you think we will ever see Yamoshi's story told?","Saiyan boasting","Best Xbox 360 DBZ game?","Goku VS the Girls for AnimeAjay's DBREDRAW :)","Gotta stay hydrated if I'm gonna catch Bubbles!","Yūya Takahashi draws Goku in different styles","The submissions for latest #DBRedraw have been great, Kanchiyo also redrew the same scene a while back.","Wife and I found these at Hot Topic a few days ago","[VIZ] Dragon Ball Super Chapter 39","Harry Potter: Saiyan Son","My new MUI figure finally came!","Got sh figuarts sdcc goku in the mail today","My little Son Goku","Picked up my first Figuarts. What have I started ....","Just came here to say I just finished Super and I'm floored and absolutely ecstatic for Broly.","Star Wars reference in DBZ?","Would Majin Buu have ever died of old age?","Does anyone else feel like Tien could've helped against Raditz?","[Fanart][OC]I felt like drawing some chibis and figured GT needed some love. Bluff Kamehameha!","I need some clarification.","Bought Vol. One two weeks ago having never read them. Somehow this happened.","Is it possible that future dragon ball anime installments will have better artstyle/shading?","How do you think Future Trunks would react if he saw Vegeta descend into Majin Vegeta?","What Dub Does the Dragon Box Have?","Found some Nostalgia! Look at the date.","Does anyone else seriously HATE how the DBS Blu-Rays are releasing??? (Possible non specific spoilers)","[OC] Frieza Kahlo","Just got the Brazillian version of Dragon Ball Super...Our boy grew up","フリーザ (kokuzi.tumblr.com)","Do you think Broly will die in this movie?","What if kid Goku killed Gero?","Jump Force: Gamescom Trailer","Found a Videl, we touched balls","What was Jeice's special ability in the Ginyu Force?","Jiren Vs MUI Painting by Me!","Got UI Goku today and decided to have a little fun.","Starting to think these Dragonball figures are superior to S.H Figuarts","Why did Toriyama decide to name present Trunks Trunks?","What characters do you want to see fused?","Yet another question about fusion","About the Videl vs. Spopovich fight...","Is there a new source for downloading Dragon Ball Original/Z/Super sound effects?","Why did they ruin Chichi in Z?","Finished watching Dragon Ball GT for the second time ever - felt like sharing my thoughts.","Got this hardwood painting/picture for 20 bucks!","A really sweet nod from Piccolo to DBZ in ToP","Just picked these up from some nice kid I met off of offerup, he said he was going back to school and had no room. Only $25 for all 3!","Gohans hair style in the TOP (manga)","Found this at Walmart today","Caulifla and Kale with school uniforms by magumagu8288","Takahashi's take on SSJ 4","[OC] Here I come, Jiren! Minimal Mobile Wallpaper","New tattoo, can’t wait to get some more!","Sh figuarts collection","I think brolys chest scar is a reference to the original movie","What if: Yamcha fought in the Tournament of Power?","Just wanted to share my new tattoo with you guys!","Unknown saiyan mui inventor","Got some good deals for our trip","Thinking of coloring my hair to MUI Goku's hair color","Heres my collection so far, its not the best but its a start. My next buy I really wanna get one of the Xplus models.","Should I watch the DB movies?, (also why no Mr. Hero or Garren flair?)","Did anyone else tear up when they saw kid Goku come back from Heaven after his growth spurt?","Made a \"Planet Sadala\" arc in sprite comic form!!","Photo I took of @thatonen3rdd and pika.__ big shout out to them for indulging my nonsense with this pose lmao","Some pseudo-chibi spritework I did for fun of all the different transformations/outfits in Z and Super!","DBZ EPISODE BUDGET?","What's your favorite saga/arc in the franchise and why?","Jiren Vs Goku - Colorpencils and paint","Majin Vegeta - Colored Pencils (reference: Wizyakuza)","Made a couple variations on my Dragon Ball Super: Broly poster for the HYPE, hope Gogeta finally gets brought into canon with this movie","I have an addiction.","Everyone is hyped for Takahashi's work, and Shintani's direction, but there's one talent I'm exited for the next movie people aren't talking about a lot...","[OC] I drew Goku in brush pens","old time dragon ball fan, i have a question about heroes.","DBZ is taking over my cabinet!","Just picked up. To open the box or not?","canal 1 from colombia is broadcasting the original uncensored dbz(lat. america dub) every sat. and sun.","The collection so far","Vegeta's Feud with Goku is not unrealistic is not realistic nor insane","I need a new shelf.","Why are 6 and 7 parallels, instead of 5 and 6?","[OC] First time posting here Hope you guys like it!","What's next for 17?","Plot hole with supreme Kai during Majin Buu timeline","[OC] Drew my favorite Movie Villain, Turles. Hope you guys like it!","Super Broly by MahnsterArt @deviantart","Theory: Nigrisshi is actually super weak and they only call him their Universe's greatest warrior in order to flatter him","How would you make each form (ssj1-4 and the god forms) fight or act to make each form feel different ?","My dragonball collection so far","I see your Vergoota and I raise you my Ston Goglu","Watching the entire series before the Broly movie. Is there any fillers worth watching?","Unpopular opinion. The Great Saiyaman is the best thing to happen to DBZ/S","I don’t see a lot of Jiren fan art so I decided to paint him. Hope you like it!","Dragon Ball Super stickers?","Something strange about old supreme kai’s potara fusion (Spoilers)","[DUB] Dragon Ball Super - Episode #76 - Discussion Thread!","Oooh ho ho ho","Found this imposter: Super Soyman Vergoota","Canon SSJ4 is a stupid idea","Dragon Ball Super: Broly - Movie Megathread! (Shintani interview)","Super Saiyan 2 Gohan! Feedback is welcome and encouraged","DBZ Anime/Video Game Collection","Just finished Dragonball Z for the first time. My thoughts. Also, how should I start Super?","I still dont understand Goku black","Went to Boston Comic Con last week, got some DBS cards signed by Sean Schemmel (Goku) and Justin Briner (Kid Vegeta)","Loving my collection... just need a SSJ3, SSJ God, Nappa, and Whis.","Little Kid Goku animation I did after watching the new Broly movie trailer. Loving the new animation style","New Son Goku Tattoo","The one way I will accept canon Cooler","(OC) \"Body don't fail me now!\" Hopefully we see this state in the new movie","I just had to add this epic Vegeta &amp; Trunks statue to my collection!","[Discussion] DBS Tapion Storyline?","It will be really interesting to see how Chuck Huber approaches voicing Android 17 in Super","It's my birthday, and my girlfriend gave me this. Guess I gotta start a collection now","Toyotaro's drawing for Bulma No.19 motorcycle figure","Do Half-Saiyans, such as Trunks, Goten, Gohan, etc. have any limitations in comparison to full Saiyans?","First Look at Dragon Ball Super's Volume 7 Cover","Picked up this wooden picture from a random shop I came across. Couldn’t resist!","Got this baby today😍 and it went on great!","When you see Goku firing at you from a truck!","Anyone else wish the Anime followed the Manga plot line for the Zamasu arc more?","Goku vs Toriyama by joecanvas","DBS chapter 39 leaks w/Herms summary translations","My first attempt at drawing Goku while rewatching the tournament of power. Debating about an attempt on 18x24 with some more detail, any advice?","What if Hercule trained with one of the Z fighters?","Broly's Fighting Style in the upcoming movie","A fine addition to my collection","Ishizuka Unshou, the japanese voice for Mr. Satan and many other roles, has passed away at age 68.","My guess/theory towards how the Broly movie could end.","Goten the space patroller","My DBS Future Trunks collection!","Got these on my Taiwan trip! Totaled around $110 USD","Thought I’d share my Vegeta drawing","DBMFL: Full Interview with Director Tatsuya Nagamine","A Goku and Vegeta comparison.","Really loving this effect I got for SSJR Black","They need more merch of my guy right here","In your opinion, who is the biggest idiot in the entire DB Universe?","Dragonball Shoujo Highschool Concept by Oinkyfalcon","Can someone give me the official and correct japanese version of Master Roshi's \"final\" quote before he fires his Kamehameha in the ToP?","Origin of Beerus Power","Here's a Lucky Cat Korin that I just finished in Illustrator!","Super Saiyan Caulifla by Kanchiyo","Will Goku Ever Meet Bardock","Majin Vegeta [OC]","So pumped about my new tattoo! Kamikaze!!","My personal take on Pan! [OC]","[OC] Super Vegeta! I know this is the 100th time you've seen this, but I hope you like my take on the redraw!","Shelf has improved. Any good ideas for additions?","My recent Beerus tattoo","My brother bought me this for my collection!!!","What's the biggest differences between the Battle of Gods movie and the BoG episodes?","Some Cell/Gohan doodles I did while rewatching the Cell Games","(OC)\"Broly, your fights with me you cocky bastard!\" SSBE Vegeta","Found a Kid Goku figure at Fry's :)","Post Otakon Weekend Collection","What episodes would you watch if you were trying to catch someone up to speed who only kinda knows DBZ?","Zamasu Merged Lineart done by me! (Georgemooey)","Banpresto doesn’t quite make the Gohan I want, so I made one myself!","Crossover: Trying to hold out until everyone else arrives.....","Release Window For Dragon Ball Super English Dub On Funimation?","It's only fair to have vegeta on top for once.... BIG BANG ATTACK!!","[OC] Goku Super Saiyan Blue","Some art of Android 21 [OC]","[OC] Older Goten, Trunks and Bulma - movie poster redraw","Piccolo’s role in the dbs movie: Broly","[WHAT IF] If they were to do a \"Dragon Ball Kai\" (Kid Goku), should they reference the Saiyans? What else would you change from the original anime?","I stumbled across these beautiful stickers at my local record store.","The Ginyu Force - Most redeemable villains of DBZ?","Yūya Takahashi draws SS4 Gogeta","Spotted in Leeds, UK.","My first Majin Vegeta Sketch in over 10 years. What do you think?","First Female Super Saiyan.","Dragon Ball Z Kai","Building Hype for Broly! Legendary Model kit","Got vegeta tatted on me a few weeks ago from Dark Horse Tattoo Parlour in Alloa, Scotland","[OC] My submission for the Super Vegeta #DBRedraw","[OC] New Broly, Charcoal","[OC] LEGO Kame House","Why is Goku portrayed as a true martial artist","Any Vegeta or Goku SSJ2 figures or statues?","Best statue brand for Dragon Ball?","Got this absolute unit in the mail today!","[OC] Pilaf Pixel Art!","[OC] Super Vegeta!","The Z heroes at the park, a custom artpiece for a customer","I recently got some skate decks made. All artwork by me. @godfreyatlantis","what y’all think just picked it up ✌️","Super Vegeta OC","[OC] Broly, but he's the doucebag marine veteran at your local gym.","Epic showdown at work","There's something pretty interesting about the original Broly","I'm watching Super on blu-ray and a couple things are bugging me.","Birthday presents from the girlfriend!","MUI Goku finally came in.","What are some new themes for naming future characters?","Is there a more high RES version of this image without the text? I want to use it for my desktop wallpaper","This came today. It may be my new favourite figure.","Next line of Dragon Stars figures have been revealed on BBS, BAF will be Broly","My UDM Collection","Could we see SSBE Vegeta in the movie?","My very first handmade spiritbomb lamp!","First Goku Sketch in over 10 years! What do you think?","The shading and coloring on this figure is insane!","Gogeta and Gotenks question","Got this baby in Prague for only 80 crowns (less than $4). New favorite shirt.","\"Keep it up!\" - Super Vegeta #DBredraw","Line art of Goku and Jiren","Parallels between Kefla and Merged Zamasu?","Future Trunks’ Screw Up","Dragonball/DBZ setting for the Genesys RPG","How much time passes over the course of each arc?","Ultra Instinct Goku (sorry for pic quality)","Prince of all Saiyans! [OC]","If Goku Black achieved Ultra Instinct, by Q10Mark.","My brothers new gear shift is sick","Does anyone know when the goku shoes from adidas are dropping","Real life talking Freeza","Next figure?","Wanted to give a shot at this too, here is tricolor vegeta 😎","Ages of our heroes","How much advance planning did Akira Toriyama do for the DB --&gt; DBZ evolution?","Krillin Puppet","Senzu beans","[OC] My Super Vegeta for DBRedraw","Moment from super I recreated (OC)","All fusions are super cocky. So why is Kefla the only one hated for it?","[OC] I tried to make my own DBSuper movie poster, what do you guys think?","When the knock-off is so bad Vegeta turns into Tarbel","Such a good find!","The concept of a Saiyan hybrid race.","Power required to be a GoD candidate?","Kale/broly S-cells theory.","*SPOILERS* Someone who understands the Goku Black/Zamasu time loop, please explain it to me","Really liked the Goku art from yesterday, so I decided to make one of Frieza.","(I made) Custom Raditz Funko POP Vinyl","Decided to recreate my favorite shot from FighterZ's Broly Lvl3","Just got married, received this painting of our Sphynx kitten Beerus 😻","Trunks and Goten at work","[OC][Fan Art] \"I AM... SUPER VEGETA!\"","What are some things you didn't like in DB Super?","Akira Toriyama does not hate Vegeta","Full Earth Adaptation - by @Ariyoshi00db","Majin Vegeta by me","The most frustrating part about some of the sudden power-ups in Super","Condensed Dragon Ball series watch guide, for newcomers","Why didn't they help teach Trunks SSG while he came back?","My brother likes to sketch dbz characters. I think this is his best one yet!!!!","Anime Continuity and Jaco","What changes to the story would you have made?","I'm rewatching the Buu saga and...","Got Bardock the other day then Goku came in today. The Resolution of Soldiers line is one of my favorites. These statues are so good.","[Fanart] Gohan, SSJ2 vs Cell!!!","Found this gem on the boardwalk in Ocean City, New Jersey today","[Fanart] Too excited for the movie to not do a Broly piece.","[OC] “My power is MAXIMUM!” digital drawing","Gamestop has been carrying some really good Dbz statues lately!!! Im hyped af on these :')","Did Goku try to go SSJ2 Blue in this scene?","What happened to the animal people?","After re-watching all of the Z series movies..","Newest to the collection","Goku as a Superhero","Finally received my ssj4 Goku and I must say it really adds to the whole display!","DBS Ending Scene (Spoiler)","[OC] Decided to draw the new Broly, used the promotional art as reference obviously lol,","Gamestop has been carring some great dbz statues lately!!! Stoked on these bad bois :')","Anyone know what these are called?","Are the “bullet hole” marks below the cape clips accurate??","I drew Goku!!! UI Mastered","Mixed Opinions on Z Fighters","Just came in. I haven’t even opened them yet :)","Vegito vs Zamasu Statue Prototype (Xceed X Ofubito Resin Studios)","Got my Goku/Jiren Statue from ORS Studios","Gogeta tattoo I got yesterday :D","\"I Am The Ultimate Life Form\" by thanachote-nick","Saiyans in Black, by Gaura / WildBabe","Just finished DBZ except Garlic Jr Saga, I have some questions about this whole Gohan main character Toriyama thing.","Question about the manga","Had no idea one of my favorite fights wasn't even in the manga","I drew a Super Buu","In Funimation's release of Dragon Ball, how come most insert songs and the latter OPs/EDs are just flat-out omitted? Can this be corrected in the future?","Dokkan Battle could reveal some new info for DBS Broly","My gf got me the most badass scroll","Is the dragon ball tour going to be at nycc and anime expo nycc?","I drew a fabulous Merged Zamasu :)","\"Tapping into godhood\" hope you guys like my homage to the transformations DBS brought","[OC] Subarashii 🌹","Battle of the Manga Dimensions","After Super Saiyan 3, was there any electricity effects in SSB, SSB x kaioken, UI, UI Master etc?","Dragon Ball Shikishi Art","Goku &amp; Frieza (OC) - Acrylic Painting I did for a friend","Got laid off. Had to bring the guys home.","Gogeta drawing","Something interesting....","Had Sean and Chris sign some stuff (more in comments)","Fusion Reborn homage in Power Rangers comics","Why are all the DragonBall videos on YouTube being taken down?","Should Cell Return To Dragonball When Super Returns?","[DUB] Dragon Ball Super - Episode #75 - Discussion Thread!","My brother gave me some bad ass stickers today.","Bottle Battle","I made a thing","Look what came in the mail today!","Anyone else think that the Z-Fighters (Goku specifically) should just go all in immediately.","Did a quick drawing because I needed to get this idea out. The Tactical Android: Splinter-Cell","Turned my computer desk into a display.","Just got this beauty at a local Japanese store! Bardock’s paint detail is incredible and honestly it’s one of the best looking dbz statues I’ve seen yet","Flying Nimbus Dies In Dragon Ball Original","Having Fun With The Dragon Tour At Otakon 2018","Broly artwork by me [FanArt][OC]","Golden Frieza Ruined Cooler's Potential","In the future why did Babidi come so late","First one of many","DS SuperSonic Warriors 2 or 3ds Extreme Butoden","Dragon Tour ticket cost","Shouldn't the remaining zfighters be scared or at least worried when goku's coming to help fight the saiyans?","Modern DB","Are we still doing keychains?","What's your biggest pet peeve with Dragonball?","I drew cell as a ostrich cell.","MUI Goku Sticker Peeker [OC]","Thinking about reading the manga, but played xenoverse","Drawing from Memory - Cell Du Ultrmet Lifrrmmm","Which one of you was this? Brother spotted this on the road tonight peep the plate bracket","Dragon Ball Super: Broly - Movie Megathread! (new character bios)","Best DBZ Video Game?","We got this for our bedroom. What’s even better is that my wife was the one that said let’s get it lol","Could Future Trunks revive the others in his original timeline?","Bought a whole collection....","Tournament of Power: Kibito?","Meet my idol at comic con today.","This is one of the biggest dragonball mysteries imo: Why did bibidi have a desire to summon Majin Buu, and when Buu appeared for the first time, was that bibidi’s homeworld he was destroying?","Caulifla by Kanchiyo","Just revealed: Great Saiyaman SH Figuarts coming soon!!","Got my new family heirloom today","Broly being broly","Quick 30 minute vegeta","My birthday presents from my best friend! He's the best.","[OC] Dragon Ball A5 character images","Why did Goku not discuss the plan for beating Cell (getting Gohan enraged) with Gohan before Cell games?","DragonBall Z SDCC 2018 S.H. Figuarts Super Saiyan Broly Event Exclusive Color Edition","An epic cinematic remix of the Vegeta Super Saiyan Theme","Gohan-Vegeta Battle","Got the New Blood of Saiyans Blue Kaioken Goku Figure!","[OC] Awakening Ultra Instinct","Super 131 Director Megumi Ishitani on Vegeta's SSBE, Jiren, etc.","SHF Vegeta Royal Blue Figure.","Vegetarble (OC, well I mixed a couple renders)","Future Bulma: Can build a time machine, but can't build Gohan a new arm?","POP VEGETA NY COMIC CON 2018 😊","Hit by darkogoku on deviantart","Hyperbolic time chamber","Is it possible for Android 19 &amp; 20 to exist in Future Trunks(‘) timeline(s)?","[Alt Ending] What if Merged Zamasu used Kaioken and destroyed himself.","First and last dibs movie parallels","Goku and Luffy, fan art by Rudy Nurdiawan","Hit’s Backstory","All throughout Otakon the Dragon Ball Super: Broly trailer has been playing on loop","They gave me 20 minutes to power up at my first powerlifting meet.","Been waiting over a month for this","MUI Goku just arrived, badass.","Scrapped together the only colors I had for this, Hope you guys like it","Lighter take on Goku UI, finished last night. What do you guys think?","They really didn't do the whole 'Kai' process right, did they?","I got the SHF Majin Buu, he's HUGE!","Looking for birthday ideas","MUI Goku V Luffy (Figure)","HD Remasters of DB/Z Movies Coming to Bluray in Japan","Why did Frieza destroy Planet Vegeta?","Give Vegeta a beard already! (Art by BrusselTheSaiyan)","Adding to the HYPE with a poster for Dragonball Super: Broly, the only other time I was this excited for a Dragonball movie was Battle of Gods!","Just started season 4 of dbz with a friend and I have no idea what’s going on. Could someone summarize or link a summary to dead zone?","My brother got his new bag for school","My whole sh figuarts collection","What is the total number of videogames Goku has appeared in?","Practiced with acrylic paints to hopefully have DBZ nail art on my nails soon :)","“Episode of...”","Finally finished him, what you guys think?","Dragon Ball in the Library of Congress' Anime Collection (and a few bonus pics)","Early birthday gifts from my wife","Why doesn’t Vegeta know all of Goku’s moves after defusing from being Vegito?","If you could remove one character from Super without changing the story, who would it be?","Broly by beyond9thousand, Digital Painting, 3508×4961 pixels","[OC] Goku black drawing","ToP DB Super question: Goku's friend's faith in him translates into a power up how?","Is anyone else hoping for this","You know what.. I’m about to say it.","Videl cosplay by Maria Galvao","Ok wait what","[OC] drawing I did of Goku. This was my first real experience with digital art, so it took a few other other drawings to get here.","Been looking for ages for this DBZ fan made image/quote thing","The real fight starts now","Son goku: Xeno by me","[OC] Kefla fanart","Broly could have cyborg components maybe?","Well. This looks like the start of a new addiction...","Why people wants great ape and tails again?","Pixel art usually isn't my thing, but I took a crack at an SSJ4 pixel Goku while in class so hopefully you guys like it :)","2nd form Frieza beatdown on Gohan anime censorship breakdown","[OC] \"My apologies, fellow traveler.\" - Bandit Yamcha Fanart","I am a huge fan of DBZ games on GBA: Legacy of Goku 1 - 3 developed by Webfoot. Anyone knows anything about Legacy of Goku 4? It’s great to know these are the rare games got developed in the US not JP.","My dbz collection so far. Mostly Figuarts due do being my favorite manufacturer of figures.","New beauty","My girlfriend made me this cake","I finally got my hands on these, but it irritates me that they don't connect lol.","What if Goku survived the Cell Games by DBZwarrior","Homage to Broly Sneakers Made By Me for Myself","[OC] A drawing of Vegeta I've finished","Question for the BluRay releases","Broly energy sound?","My mom is moving and selling the house. She found these buried in the attic. I thought she sold these over 10 years ago. Stoked!","Picked this piece up for $38 at my local EB","Thought Project: Kai Ocean Dub","What’s one character that should really get their own movie or story arc?","My idea for a DBZ special/movie: Empire of Frieza","a little thought about beerus and the buu arc.","Has Goku genuinely got brain damage?","Made a minimalist Kamis Tower on Illustrator","Please, Judge my replication and give me any criticism you can throw at me!","New promotional artwork for Dragon Ball Super: Broly","Treated Myself To Some Custom Shirts Recently For My BirffffDay (8/8)","Not a fan of Bulma going to Kami’s","Who is Bardock?","New Dragon Ball Super: Broly - Goku (The 20th Film) Limited Edition statue up for pre-order on BBTS!","What was the first Dragon ball manga/episode you watched?","Can't believe it took this long.","[OC] Vegeta Beyond Blue Art.","Dragon Ball Super - Unpopular Opinion Thread!","What do you think being a Super Saiyan feels like?","Help with a Tattoo","Kid Goku Tattoo","Found this bootleg I just had to buy. Everyone, meet super salmon geeko","Musicians of r/dbz: Need some DBZ themed guitar pedal ideas","Dragonball z mug","I really think people over exaggerate Zeno's existence in the Dragonball Universe.","Anyone else kinda disappointed that the end of Kai: The Final Chapters doesn't tie in with the beginning of Super?","Made a DBZ cake for my boyfriends birthday","Is there an old Toonami promo that used scenes from The World's Strongest?","My first stop motion","I haven’t been home for over an year, I just came back to find this!","dragon ball z big mistake!!!","Being focused on just goku and vegeta is actually a good thing","The Philosophy of dragon ball: ALMOST anyone can be redeemed","How Cell can be \"redeemed\".","Is this anyone here?","Now to play in style","The Tournament of Power Took Away Potential","About to start Super and have a question","Idea of how to redeem Frieza","Question/PSA: How many of you are going for the Adidas x Dragonball Z collab shoes? (PSA in comments)","Dyspo's Light Speed Mode","Added rose goku Black to the collection!","Guarding my desk from evil.","Cell's Version of Hell.","[Spoilers] Do you want a more serious tone for the Broly movie?","My Dragonball cross Studio Ghibli tattoo by Aaron Ball at Progression Tattoo Unley","Line art of UI Goku","HOW did Jiren get so strong?","How would you improve Frost?","I got a new hoodie","Manga inspired Cell idea","Toppo and GoD?","If Frieza was in earth’s hell for dying there, and wasn’t reincarnated, then who else would be great to see brought back from hell?","Goku meeting Bardock","[OC] I tried to draw Future Trunks without reference. What do you guys think?","Daughter Wanted Squishy \"Play-Doh\" Buu","DB Collection 2018","[OC] Kaio-ken Krillin","Thanks to my awesome wife I got these 5 for my birthday. Now, I’m only missing the last 4... and then DB Super.","Cooler Confirmed for DBFighterZ in EVO 2018 Trailer","Packing and moving's no fun, but at least these badasses will be getting a more suitable displaying area","What would be your opinion on introducing in a very distant future this concepts for Dragon Ball?","Can Yamcha make a comeback?","Interesting little detail I found on Episode 130","Vegeta and Nappa... Best day ever!","Senzu Bean Workout?","Can a dragon ball kill its creator?","Is magic just a form of ki?","Went to Wakandacon in Chicago and they had these beautiful stickers","My first birthday gift 😍","(Cell Saga) What if Goku had told Gohan this when he said goodbye..","Who would you say is the most underrated character?","Would Whis step in?","Had a nice pick-up from Craigslist the other day!","My take on Ki after Z","Full Broly Movie Cast (announced) (OC)","How would you go about (re)writing Muten Roshi in ToP, when it comes to him as a fighter?","Daughter watching dragon ball.","Capsule Corp I by Ryan Wai Kin Lam","Panda Oolong Fanart by LemonEmpress","Why did Beerus, Whis, and the rest of the G.O.D.s and Angels feel the need to shield themselves from the shockwaves from G.O.D. Toppo’s hakai against Frieza?","Found this Shiny Boi to add to my Collection","Kale, OG Broly and Broly by Niitsumee","[OC] Revere him. Praise him. Merged Zamasu!","Hit is Perfect","DBS Broly - Would love for Vegeta to be the hero for a change","Are there any characters in the series you didn't like at first but later grew on you somehow?","Help with the name of this specific theme","My new Kid Goku on Flying Nimbus tattoo!","Could Android 21 be canon?","What was the point of Super Saiyan Blue Evolution?","Starting my collection off right","Found this happy boy in an antique shop","Found this old Shonen Jump promo card while cleaning out my storage.","I got my drawing of Bojack signed by Bojack himself. Really nice dude","How can I tell if my DVD copy of Lord Slug is edited or not?","Does my nimbus cloud tattoo look like a piece of crap on my arm or am I just tripping?","[Fanart] With the exception of beards, and moustaches...","Goku [OC]","Why are box sets so hard to find?","I've rewatched Z and Super lately, and Goku's character DO feel different","[Tattoo] The Prince Of All Saiyans","A thought about a design for the evildoer who killed Jiren's parents and master...","The collection is slowly growing!","Lets have a peaceful discussion about grievances with modern Dragon ball","Went to Tokyo recently and brought this back from a Gachapon for my 3 yr old.","Finally got my display case up after moving.","roshis teachings and how they apply to vegeta","I carved Shenlong as my first chisel and gouge carving project","Is Ribrianne \"love\" Ki but utilized differently?","Finally got my first dbz figures!","Dragon Ball Super: Broly - Movie Megathread!","Any explanation for why the animation style looks like the old DBZ style in the Broly trailer?","Welcome to the collection buddy","Vegeta’s sacrifice by RLC.ART","Is it not beautiful?","[DUB] Dragon Ball Super - Episode #74 - Discussion Thread!","Does Vegeta still have Majin power?","Could a Bio Android absorb a Majin?","So Is Supreme Kai of Time a Thing, or What?","Are the written alien languages in dragon ball decipherable?","All evidence that supports Gogeta being in the DBS Movie over UI Goku.","Picked him up at Comic Con","Made a diorama for my figure rise","New DBS poster for my room.","Hmmmmmm, something doesn't seem right here.","I dont get how to buy cards","Not the best frames but I like my posters.","Paper Theatre Kamehameha","Would anyone like to see a remade/Kai version of the original Dragon Ball anime?","started watching dbz yesterday","[OC] Super Dagito, the sweetest warrior, and Majin Buu's worst friend","Ran across a random Gashapon machine today. I was kind of hoping for Brolly or Vegetto, but I'm still pretty happy with what I got.","Another trippy DBZ piece ^__^","Bardock Special - Briilliant","The beginning of an addiction","Hey I found this weird DBZ bootleg, should I keep it? 👀👀👀👀","New ad with tiny bits of footage not shown in the SDCC trailer","Made a SS3 Goku piece, would love to get this as a tattoo someday.","Just added MUI Goku to the collection","Why did they let vegeta stay on earth after the Namek saga?","Comicon success ??","Incredible art of U6 saiyans as SSJ3 by twitter user @nanidrive","Anyone think Super Saiyan 4 (or something like it) will ever be canon again?","Which version of the TOP arc do you enjoy?","If Gogeta Happens In The Broly Movie","Was I stupid to start Super bwfore ever watching OG or Z?","Never seen an episode","What if Goku was in My Hero Academia","In theory, should Goku be able to use the Spirit Bomb in master Super Saiyan?","Megumi Ishitani, director of Super 131, on Jiren's emotional breakthrough","Goku and Vegeta didn't do any good against Kid Buu...","Idk about you, but I feel as if Toei's playing us here. (DBS Movie: Broly theory)","Impulse buy; how am I JUST NOW discovering this line of figures?!","(OC) Super Saiyan Blue Goku in EoZ gi, sorry for the potato quality image","Added videl and chi chi (China dress) to my collection.","I found Goku while visiting Mexico","Dragon Box Cell Saga missing DVD. Price Suggestions?","How many times in the entire Dragonball series has Goku referred to himself by his Saiyan name?","Gogeta or U.I?","I drew Son Goku in the DS version of The Sims 2 (apologies for the poor photography)!","Plot hole in the original Dragon Ball series?","Finally finish getting og DB in manga form, now onto DBZ.","Made this for my boyfriend as a cake topper for his birthday.","Smartest and most tactical fighters outside of U7?","The best way to watch all of Dragon Ball","@Herms98 - \"The Saikyo Jump editorial office tells readers: 'Frankly, the enemy Goku and co. are up against in this movie is the strongest. Those who trust Goku will win may lose confidence, so be careful.' They also ask: 'Destructive power greater than a God of Destruction?!'\"","After years of DBZ it's nice to finally have some Dragon Ball Figures.","Special Beam Canon","Where to get SDBH cards in Tokyo","Could the Earth's Dragon Balls even given Vegeta immortality?","Broly's strength","Some dope ass gods.","Question: Tips on preserving production cels?","How did Goku and Jiren block Hit's time skip attacks?","Which teams did not cheat or try to cheat in the ToP?","My drawing of Future Gohan","How much has Fist of the north star influenced DBZ ? And what do you think about the simplistic lore/psychology of DBZ ?","DBZ anime vs manga","My Dragon Ball *Z* Funko Pop collection. Just picked up the new Gohan, Tien/Chiaotzu, and UI Goku(but he’s with the super collection) ones today.","The Mafuba is the most protected attack in Dragon Ball","I drew all Cell's forms in my style, hope you guys dig it!","I turned my favorite shot from Super into a printed canvas.","Just bought and finished building Figure-Rise Vegeta Saiyan Space Pod","Are there any cool Piccolo figures?","Found 2 video's of Vegito vs Zamasu, in English, different lines and voices.....how/why?","Nice poster at Tokyo’s Shimbashi station","Dragon Ball and Dragon Ball Z in Syndication","I found a picture if trunks that i really enjoy, but i can't seem to find without a filter. If anyone could help i'd appreciate it.","Can anyone help me recall a particular scene?","Future timeline story change","Awesome Broly Animation by MERIMO","After seeing these Banpresto figures posted often I figured it was time for my own","Anyone else own these and didn't know they had a final form until somebody posted it on here?","Majin Buu in relation to Majins as a race?","Combine any two moves from the series. (Dragon Ball Fusions)","I know nothing about Dragonball, my brother a fan found out and just sent me this. Can't wait to get started!!!","I found an old wall scroll I bought a while back, decided it needed hung up.","[SPOILER] Gohan's New Path?","Something I painted not too long ago","So apparently Super Saiyan Blue was supposed to have white hair, not blue. What are your opinions on this?","(OC FANART) Sayain Saga Vegeta (I took some liberties with the armor)","Could the Zeno twins create another Vegeta/Goku arc?","Future Trunks, Artist: Tomas Oleksak","oh my kami...... I’ll do EVERYTHING to buy this","It's a shame buu wasnt utilized more in the dbs series","Who else thinks that Broly should stick around after the movie? Or become a rival to Goku and Vegeta?","Kale Rewrite","My cousin went to the international manga museum in Kyoto and bought me this.","Thought you guys might enjoy","Why did Goku cry so much as a baby?","Shenron Tattoo","New Zen-Oh Theory","Instagram Poster Advertisements?","Emperor Pilaf and the Gang","Dragon Ball Globe by Gojirason","Anyone know what make this is? I thought it was Irwin Toys but it doesn't have the branding on the back. I'm just thinking it could be an old bootleg.","Would the Dragon Ball series something for me to watch?","Manga UK is releasing Dragon Ball Z Kai: The Final Chapters in the UK, first part coming out in October","Would you want Broly to survive the movie? And if he does, what kind of a roll would you give him?","Dragon Ball Reference In Deadpool/Spiderman #18 (spoilers for that comic)","Cumber (Kunba) vs Jiren Fan Animation","Is Goku x Chi-Chi a total sham of a relationship?","How would you have wished ultra instinct’s design to be?","Would you like to see Launch rejoin the main characters in the next series? What other old DB/DBZ characters would be a good fit in the next series?","Every Shonen Plot [OC]","son goku in google map","Dragon ball expo?","Drew some sad characters at work (including Yamcha)","Why we need a new DBZ JRPG Game.","Paragus and Broly will be like Zod from Superman.","Maybe just random merchandising? Maybe a tease towards the new movie? But this doughnut gives us DBS Goku and Vegeta doing the Fusion Dance!","As a I’ll grown man I have never shrieked so loud seeing this ultra instinct at my local GameStop! I’m college poor but that hasn’t stopped me from having a little collection! Can’t wait for the movie!!","I made a miniature Planet Namek","I picked these over kai because of the sound track, im so happy with my purchase","New super movie question","Dragon Ball Super : Broly fanart featuring two guests...OC","Lintophia — Hello world. I would like to introduce to you Big Body Krillin. Or BBK for short.","[OC] Drawing of Broly from Dragonball Super Movie","Anyone have Raging Blast 1 for 360 that would be willing to help me get the online battle achievment ?","Would it have made sense for Beerus to kill Goku and Vegeta before the Tournament of Power?","An idea for DBS if he gets integrated into the show like Broly.","Just a few Bulmas I collected.","DBS Broly has opened a Pandora's Box amongst the fanbase, and I don't like where it's headed","Why did Goku never revive Raditz?","Could Trunks have gone further back in time than he did?","Found my favorite unit depicted in my favorite moment at a shop in Lisbon. Couldn't be happier!","I combined nerdy faves for a little Raditz appreciation.","I find it strange android 16 was never rebuilt","Drawing I made of goku after being hit by a ki blast","Does anyone else think Yamcha needs a new English VA","broly trailer thoughts and beyond","Would you guys consider Frieza to be a villain or a Rival for Goku?","Cell transformations done by RLC.ART","What is your dream Cell return story ?","Vegetable Oozaru by Jorge Loeza Art","I posted the beginning of my collection a few day ago and now I’ve caught the bag and had to get a few more. The local game store is my little treasure trove.","The thing that I’m the most grateful to Super for is that it let me feel like I’m a little kid again.","Do You Guys Think Bringing Back GT with Super Aspects would be a Good Idea?","So with Broly becoming canon and the possibility of Gogeta also becoming canon could we see even MORE characters become canon?","I wrote a Fanfiction in the Style of Xenoverse/Heroes and I would like feedback!","Vic Mignogna on playing Broly in the new movie","Given the excitement in anticipation for the new movie, what has been your favorite Dragon Ball related movie so far?","New set arrived last week, World Collectable Diorama from the Future Trunks arc!","Help me understand the hype around Broly.","An iconic moment done by a friend of mine for my birthday","Majin Vegeta Fanart by myself!","Was vegeta projecting on toppo in their second fight?","I wonder what made Toriyama want to give 17 such a major role in the ToP *spoilers*","If The Dragon Balls Existed In Real Life","So why exactly didn't Universe 1, 12, 5 and 8 participate?","Why didn't Beerus just wish to be stronger than Zeno?","SSJ3 Broly picture signed!","Two Legends, one shelf. 💯 Just Two of my many. #itsahobbie","[Pseudo OC] Kefla is born! I coloured a page from manga chapter 38.","Wanted to share with the Dbz community my painting I just finished!","Chi Chi's mother?","Do we really need another brolly movie?","Awhile back I bought a fake before getting an authentic one, and someone suggested I get creative with it","So with the merger approved, does this mean that Disney will now oversee Dragonball related media here in the States?","Anyone else want frieza to be killed in movie","Added some flare to my lighter","A thought I had about Goku and Vegeta’s first fight","Look at what the Weeknd was rocking the other day","About Broly(Movie 20)","If Dragonball Existed In The Real World","I made some custom POPs based on Vegeta and Goku in the new Broly trailer!","Was there any point in introducing SSB","[OC] Xeno Goku taking on Goku black and Golden Frieza!","At what point did Piccolo really start to change?","SSJ Powered PC | Banpresto SMSP Super Master Stars Piece Son Goku – Limited Lunar Edition","Theory: Toyotaro is going to create the story for the next DBS arc..","Tournament of Power Roster &amp; Leaderboard (Chapter 38)","Does Toriyama know how many he has inspired to change their lives?","After 22 years of fandom, I'm finally going to complete my DB experience. Wall of Text warning.","Worst \"why did/didn't him\" moments in Dragon Ball","Anyone attend the Dragon Ball Tour at Comic Con?","[OC] my broly drawing","Nephew found these bootleg figures at a Mexican flea market. Lol @ Golden Frieza","DBZ X Adidas question","SS3 Kefla Fanart by me","Did goku master ultra instinct?","Missed chances themes in DBZ looking at you Ultimate Gohan....","Dragon Ball Super Broly Predictions! [SPOILERS]","The reason Dragon Ball never moved on from Goku.","Just started watching Super, and I have a question.","Future Arcs You Would Like To See","What if Ginyu body switched with a fused fighter?","Recolored my favorite panel!","GT is Original Dragon Ball reference! Art by Coa441","I just noticed that as Buu get stronger, his head tentacle grows","Car shade level of protection for my car is over 9000!!!","A18 and Krillin by「G evolve」[pixiv]","Really wish they kept using Kale's berserk voice","My other shelf full of more DB Figures","Why could the Shamron Dragon not make Androids 17 and 18 human?","Added a few more to my collection :)","Was Goku bored in Super?","Dragon Ball Z: Budokai Tenkaichi","Just noticed an oddity in the most recent expansion for the DBS card game","One of the better moments of the series","Gotenks | Majin Vegeta | Future Trunks | Kid Buu | &amp; Freeza - Illustrated yesterday by me, Zac (@zcounts)","This always bothered me : Gohan Fights Frieza","What if Zamasu swapped bodies with Broly instead of Goku!?","Ultra Instinct Goku I drew","I can't help but be a DBZ mark when Android 18 doesn't escape from Cell","Question about Buuhan regression to Kid Buu","My ability to not complete this from years ago still haunts me. This will change.","Best friend bought me a Goku","Badass Yamcha Fanart (By: Carlotus)","Could a capsule corp capsule hold a person without harm?","The Assassin and Super Saiyan of Universe 6","How would you have handled the power creep in Dragonball?","I haven't read the manga","Was it ever explained how Jiren was able to hover in the ToP?","Had a business trip to Japan. Couldn’t be back without this.","Go in for one of my GF birthday gift, come out with these 2...","Do you guys prefer \"Superman\" Goku or \"Idiot\" Goku","[OC] Godly Divination, Super Saiyan God Vegeta","What are some simple things that you guys didn't notice until much later about Z or Super?","Just starting out, I need to step up my game. Although I must admit it feels good to purchase merch for an anime that I grew up with.","Baby's First Cosplay!","Added Xeno Gogeta to my small collection!","“You Must Flow Like Water my Friend” (by @Huetek &amp; @gigstar_csf)","FIGURE-RISE MECHANICS MOTO TRANSFORMABLE N°19 OF BULMA.","What if Goten and Trunks competed in the Tournament of Power?","What's Some More Fanservice You'd Like To See? Z","For those of you asking about the dbz monopoly game","An aspect of Goku's character development that was dropped in Super","Frieza saga vs Cell saga","Picked up these bad boys today fromToy Dojo in Austin, TX.","[OC] Took at stab at emulating a cel animation look, how’d I go?","Am I the only one who basically just sees GT as a alternate Timeline where Beerus never woke up.","[DUB] Dragon Ball Super - Episode #73 - Discussion Thread!","Most brutal fights?","What happened to the U6 Saiyan girl hate train?","My new trunks figure! Came with a free mini blue Goku!","SSJ4 Goku by NovaSayajinGoku[my current lockscreen wallpaper]","Tiny Toppo (1 in.)I did to go with my collection.","Got 3 new Goku statues!","Does the last scene of DBS Super (goku vs vegeta in blue) give hints as to what we're going to expect in the movie? (No MUI/SSBE but Fusion instead)","Something interesting I noticed in the first chapter of the DBS manga","Scouter Vegeta","Frieza army..","Finally got my Grandista MUI Goku!","I've collected a lot of Dragon Ball figures and built a lot of models, but this is my first Dragon Ball model! Can't wait to finish!","Britney Spears on Instagram: Sometimes my son expresses himself through art! He's really into the Ultra Instinct look.","[OC] Champrus, the Fused God of Destruction (and Laziness)","I wonder how important Kikono is to Freeza. Spoilers","Are the Blu-Ray sets a good way to watch DBZ for the first time?","I couldn’t help but laugh. Ohohohohoh!","Does the manga ever go over the side effects or impact of bringing so many people back to life through the dragon balls?","Me: I'm making pillowcases, want one? — Bf's brother: Uh... Okay. — Me: What pattern? JoAnn has a lot of Pokémon fabric-- — BFB: I want Tien on it.","My theory on the Broly Movie - What's if history repeats itself?","[QUESTION] How much of a threat is frieza now?","anyone else is sad that SSJ3 is considered \"flawed\" and not used very often","[OC] Redrew Toyotaro's MUI Goku sketch! Thoughts?","Another goku vs vegeta battle?","Running out of Space","Instead of wishing for invincibility and switching bodies with goku, shouldn’t Zamasu have wished for all other life to be extinct?","What If Cell Won The Cell Games","[Fanart] The Legend is Real - I dig the new design for Broly, decided to draw it myself. I'm looking forward to the new movie!","Cell's Zenkai Boost","Should the humans have stayed dead after the Saiyan Saga?","Do my thoughts on the new DBS movie trailer make sense?","The real reason Vegeta killed Nappa (theory)","The weeknd's story.","Can somebody help me work out a world tournament rule? How can there be 137 contestants?"]