["Water Cooler Wednesday","Picture/GIF/Video highlights thread (Preseason Week 3, Sunday)","BREAKING 🚨 The #Packers and 2-Time MVP QB @AaronRodgers12 have agreed to terms on a 4-year extension worth $33.5 million in new money...plus incentives per year...He gets over $100 million in guarantees.","The #Saints are trading for #Jets QB Teddy Bridgewater, source said.","NFL Agent about longer season:There’s a way everyone could be happy. Go to 18-20 games, 0-2 pre season games, 2 bye weeks. Expand rosters to 65 from 53, a minimum of 25% of every single NFL contract is fully g’teed. Would allow players to make more, owners to make more, fans and media to enjoy more.","Packers are trading QB Brett Hundley to the Seattle Seahawks for a 2019 draft pick","The Browns recreated Jarvis Landry's training camp speech and it is hilarious. (nsfw language)","Pretty cool move by new Saints QB Teddy Bridgewater: Found out he was being traded, went to the bus to make sure he said good bye to all his Jets teammates before the team took off for Philly for the fourth preseason game.","[Connor Hughes] Sam Darnold is the starter","US Attorney Bill McSwain announces charges against former @Eagles player @MychalKendricks for insider trading.","[Ustadium] Mike Maccagnan signed teddy Bridgewater for only 500k guaranteed and traded him away for a 3rd round pick.","Trade of Teddy Bridgewater to the Saints is expected to involve draft picks. And with Bridgewater headed to Saints, Sam Darnold now looks to be Jets opening-night starter.","New book has another all-time Jerryism: \"I’ve been here when it was gloryhole days, and I’ve been here when it wasn’t. And so having said that, I want me some gloryhole.”","[Hughes] Jets get a 3rd round pick for Bridgewater.","Report: Cleveland Browns linebacker Mychal Kendricks likely to serve 8-12 months in prison for insider trading:","Aaron Rodgers’ signing bonus: $57.5 million, the largest in NFL history.","A statement from Browns LB Mychal Kendrick, who has just been charged by the feds for insider trading.","Source: DT Aaron Donald's deal is nearly done. The wait is close to being over.","#Seahawks are extending WR Tyler Lockett: three years with a base value of $31.8 million, max value of $37.8 million and $20 million guaranteed, source says. Another deal the team wanted to get done before the season.","Aaron Rodgers’ new deal is expected to be the largest in NFL history and will tie him to Green Bay for well beyond the two years on his contract and quite likely for the remainder of his career.","[NFL Research] Darnold will be the youngest QB to start a season opener since the 1970 merger at 21 years and 97 days old.","Aaron Rodgers - \"It’s been an amazing ride the last 13 years; excited to start year 14 knowing that my future is here, in Green Bay, for our 100th season. I’ve grown up in this place, and grown older..\"","Bills QB Nathan Peterman has eight completions of 20 or more yards this preseason, tied for most in the NFL.","Aaron Rodgers new deal with the Packers will be with $176m-180m total, per source. Big feature is cash flow: $67m before end of calendar, over $80m before St. Patrick’s Day next year, $103m practically guaranteed, per source.","Tony Romo, when asked if he'll be predicting more plays this season as a CBS analyst: \"I don't make predictions about making predictions.\"","Some notable names that appear to be on the bubble as we near roster cut-downs: * Ameer Abdullah * Paxton Lynch * Mike Gillislee * Rico Gathers * Hau'oli Kikaha * Cardale Jones or Geno Smith * Stephone Anthony * Breshad Perriman","[Clay] The Eagles signed DB Ironhead Gallon","875 pounds of fish, 54 dozen eggs and a kombucha machine: A week feeding an NFL team","Compensation update on Jets-Saints trade: New York is sending QB Teddy Bridgewater and a sixth-round pick to New Orleans for a third-round pick, per sources.","Clay: Russell Wilson is the only reason we’re not talking about the Seahawks as a viable candidate to pick first overall in the 2019 draft. Before you lash out, look at the roster and keep in mind Baldwin is hurting, Wright will miss time and Thomas is holding out.","The trade of #Packers QB Brett Hundley likely won’t be the last backup QB trade. Among the names being discussed by needy teams: #AZCardinals’ Mike Glennon, #Saints’ Tom Savage, #Steelers’ Josh Dobbs","Top graded corners of the preseason","Mychal Kendricks was not indicted. Charged by way of a criminal information, suggesting they have already agreed to plead guilty.","[Jacobson] Aaron Rodgers’ extension should free up over $15.4M in cap space for the Packers.","[Hammond] Kevin Demoff on stage talking at Rams charity luncheon: “My phone is buzzing. It’s Aaron Donald’s agent. No joke. I wish I were making it up.”","Daugherty: Kind of incredible that Case Keenum will be Demaryius Thomas and Emmanuel Sanders' best QB since first half of the 2014 season Peyton.","[OC] Potential \"40-Year-Old Virgin\" Coaches","Clark County has changed the Las Vegas Raiders Stadium address from 5617 Dean Martin Way to 3333 Al Davis Way","[USA Today] Is Aaron Rodgers really worth $33.5 million a year?","Just to make it clear, Rodgers' contract has not been signed, but the basics are done. Rodgers told people he was going to let former #Packers WR @89JonesNTAF break the story and he was true to his word.","Why Your Team Sucks 2018: New Orleans Saints","“Where’s Demoff at?! Did he get Aaron [Donald] done?!?!?” Sean McVay just said on stage. “I think we are close, I think we’re very close to getting this thing done.”","Official Browns Statement on Mychal Kendricks Insider Trading Charges","[Demovsky] After trading Brett Hundley to the Seahawks, the Packers plan to keep both DeShone Kizer and Tim Boyle as backups on the 53-man roster barring anything unforeseen in Thursday's preseason finale, per a source.","Per OverTheCap the Saints had ~$7,464,668 in cap space before the trade, Teddy’s deal comes with a 6 million dollar cap hit. Look for the Saints to make some moves to clear up a little bit of cap space. (Releasing Tom Savage will only take about 1 million off the books)","Why Your Team Sucks 2018: Atlanta Falcons","PFT: Someone way smarter than me has predicted a Tuesday press conference for the Rams and Aaron Donald to discuss his expected deal, a day specifically picked by the team for maximum P.R. impact.","Of note: A reported $57.5M signing bonus for Rodgers (the largest ever) means the #Packers will carry at least $23M of dead cap in 2022, when Aaron is 38-years-old - $11.5M in 2023.","49ers have waived/injured former Packers’ WR Max McCaffrey.","Vikings WR Cayleb Jones Arrested for Alleged Theft, Domestic Assault","[Mary Kay Cabot] The Browns were aware that Mychal Kendricks was part of a federal investigation, but were not made aware by Kendricks' camp that he was a target in the probe for committing any crimes","Source: Saints still trying to figure out what Marcus Davenport’s role will be","THE UNOFFICIAL 2018 NFL SEASON BOLD PREDICTIONS THREAD","Cardinals rookie QB Josh Rosen won’t play in the preseason finale, according to a team source","Underrated Gem: Down by 4 with 2:38 remaining, Vince Young leads the Titans on an improbable 99-yard game winning drive with no time remaining","[Ian Whetstone] According to a source, Steelers kicker Chris Boswell gets a hefty $8MM payout in 2018 in his new contract, including a $6MM signing bonus, a $1.295MM roster bonus, and a $705,000 base salary. That's more than 40% of the $19.72MM five-year total reported last week by Ed Bouchette","The #Bengals are signing star DT Geno Atkins to a 4-year extension worth $65.3M, source said. He gets $25.5M in first year. More than half of the deal ($37.5M) paid in first 2 years. $16.3M yearly average is highest yearly average signed by a 30+ year old non-QB in NFL history.","Tony Gonzalez: DeMaurice Smith shouldn’t lead the union because he didn’t play","Green Bay vs. New England \"Rodgers-Brady l\" (2014 Week 13) Green Bay's G...","Victor Cruz intends to sign a one-day contract, retire a Giant","Trent Richardson has signed with the Alliance of American Football Birmingham.","Who’s a player you would still root for if they got traded to your rival?","Who is your team's 2018 under the radar draft pick who is turning heads locally but we the NFL community should know about?","Jonathan Hankins met with Browns and Chargers. Intriguing option for both teams","If every NFL division formed an All-star team who do you think would win and why ?","[OC] 2018 r/NFL win total prediction contest","Alfred Morris appears to have locked up a roster spot with 49ers","[OC] Jason Verrett: Detailing His Injuries and the Mentality Underlying them","The Motley Awards: Recognizing the top blocking fullbacks in every NFL season","How an Explosion of Offensive Coordinator Turnover Will Affect Each NFL Team","As part of the company’s deal with the NFL &amp; NFLPA, @sleepnumber is giving free smart mattress (includes app that fully measures quality of sleep) up to $5,000 to every player on an active NFL roster. Team that has accepted most mattresses so far? The New England Patriots.","CBS President Explains Why Network Won't Mention Point Spreads During NFL Telecasts","[FiveThirtyEight] We Checked 50 Years Of Sports History To Find The Team That Stands Out The Least (Spoiler: It's the Pittsburgh Pirates for all sports, but the Cincinatti Bengals for the NFL)","Who has impressed you the most this pre-season on your team?","Jaylon Smith: 'I know I'm back'","The Art of the Pass Rush: Part 2","Who is this years Rookie human highlight reel?","2 Minute Drill: Washington Redskins","Aaron Rodgers Contract Estimate: Cap hit to increase by $500k in 2018","Who’s the greatest playoff receiver ever?","#Lions have released DE Robert Ayers.","Taven Bryan's debut went well, but it could cost the Jaguars rookie","What are some recent decisions by your team that have resulted in dividing the fan base? What were the differing opinions? How did it turn out? Which side were you on?","Bengals and DE Carlos Dunlap agreed to a 3-year, $45 million contract extension, per source.","If the NFL Hall of Fame required inducted players in the jersey of the team they started with, which ones would be the weirdest to see?","Ex-Patriots staffer: Lions WR Golden Tate a potential trade target for New England","For the Bills, It’s Year 1, 2.0","Hard Knocks viewing thread","Breakdown of New Look Steeler D Package.","Full breakdown of Rodgers' cap numbers over duration of contract","NFL advanced stats: Football Therapy, by the numbers","Why run defense is overrated | PFF","Odell Beckham in his relationship with Pat Shurmur: “From the moment we sat down and talked it’s been really beneficial to me. It reminds me of my relationship with my high school coach. I love everything he’s done.”","Tom Pelissero on Twitter: Lot of interesting stuff in the first episode of Kirk Cousins' documentary series, including the moment he finds out the #Jets are offering three years, $90 million fully guaranteed -- $6M more than he ultimately took from the #Vikings.","Top 15 Plays of Preseason Week 3 | NFL Highlights","[Mehta] there is another element to the Jets-Saints deal besides the 3rd rounder.","[Charles Robinson]Report: Khalil Mack 'likely' to miss games","Eagles WR Alshon Jeffery is expected to miss at least the first two games of the season, but the team will activate him to the 53-man roster this weekend with optimism he could be back by week 3, per @mortreport and me.","Read into it what you will but Sean McVay just said that there really is increased optimism that Aaron Donald will be here for opener. “See you soon, buddy” McVay says.","What are some wildly unrealistic upsets you feel will happen this year?","Geno Atkins signs four year extension with the Bengals.","Ravens will discipline Greg Senat for posting photo of injured foot","Bob Costas reportedly in discussions to leave NBC after nearly four decades","Jacksonville Shooting - How Did the NFL React?","Rodrigue: The NFL told linebacker Thomas Davis that he can’t use the PSLs he bought to watch the games as he serves his four-game suspension. So he’s donating them all to kids and to families through the TDDDF foundation.","Preseason Week 4 wagers thread","Teams are watching Baltimore’s kicker situation closely to see what Ravens do with undrafted free agent Kaare Vedvik, a kicker and punter who has impressed at camp. Vedvik has been more impressive than Will Lutz was with Ravens last summer, before he landed a job with Saints","Doug Pederson said that he’ll probably make the Wentz/Foles decision privately this Friday. Doesn’t have to make the call publicly until 90 minutes before kickoff.","Destroy Doubt | By Antonio Brown","The Buffalo Bills lead the league in Dead Cap for 2018 at $46 Million. This accounts for 26.4% of their cap space. The next highest team is at $26 Million(Cowboys).","What are you dark horse predictions for the upcoming football year?","Arrowhead to start checking tickets in the parking lot. Tailgate tradition may suffer.","[Le’Veon Bell] don’t believe the fake news, I never said anything to no one...","[FiveThirtyEight] If Le’Veon Bell Can’t Get Quarterback Money, What Running Back Can?","The night @God_Son80 was drafted @OBJ_3 flew from NYC to Louisiana to be there, and they shared this moment. Life's definitely changed - the two are now signed for a combined $170M","[Birkett] Matt Patricia, on Robert Ayers about 20 minutes before a practice Ayers didn't take part in: \"It’ll be a good opportunity for us to just take a look and see how (he) fits us.”","#Dolphins Minkah Fitzpatrick ( @minkfitz_21 ) is our highest-graded 1st-round rookie through 3 games","Dez Bryant says he’ll play, but maybe “a lil bit later in the year”","Chargers overcome a 28-7 deficit to defeat the 49ers(2014)","CBS says they won't mention gambling during NFL game broadcasts this season","The NFL's 50 most fascinating people: Players, coaches, GMs to watch in 2018","Steelers are freeing up over $2 million in salary-cap space by converting about $3 million of TE Vance McDonald’s base salary into signing bonus for this season, per league source. More flexibility for Steelers.","Antonio Brown, Gronk, and other NFL stars reveal secret sauce to creating big plays","[OC] Potential \"One and Done\" Coordinators","Career drop percentage among active tight ends with at least 300 career targets.","If you had to swap secondaries with a team in your division, which would you pick?","Expected Contract Value","PFF: Ragnow leads rookie class in run blocking during preseason","Looking for more advanced analysis and content to watch","Despite broken hand, Bears’ OLB Leonard Floyd on pace to play in opener vs. Packers","What if Brett Favre never played for Green Bay? An interesting alternative history theory","NFL Life | Kirk Cousins, Episode No. 1: The Path To Minnesota","David Lombardi: 49ers TE George Kittle (separated shoulder) says he’ll be back Week 1. “That’s definitely the plan.”","Why Tony Romo thinks Jets' Sam Darnold will be 'outstanding' long-term, even if he stinks in 2018","#Cowboys C Travis Frederick, dealing with Guillain-Barré syndrome, has had a workout &amp; is out watching practice. Too early to tell if he’ll be placed on Injured Reserve, though one source cautiously estimated his recovery will be measured in weeks, not months. Decision next week.","Recommended NFL weekly show?","Jerry Jones dusts off argument for 18-game regular season","#Cowboys Zack Martin is practicing full-speed w first offense.","Pete Carroll 'Song of the Day' video leads to Khalil Mack speculation.","LB Mychal Kendricks addressing the Browns on tonight’s Hard Knocks","Packers new Lambeau Field foods led by brat topped by curds","Kamalei Correa traded to the Titans","Malcolm Jenkins hates Super Bowl champion sign in locker room","Le'Veon Bell is telling teammates he'll report on Labor Day","Jerry Jones would write 'embarrassing' check for title","We always talk about teams we think will make the playoffs. What teams are you certain will NOT make the playoffs this year?","The Worst Plays in NFL History","AP Offensive Player of the Year number of winners by position: 25 running backs, 19 quarterbacks, 2 wide receivers","Who are the \"on the bubble\" players for your team?","Why Your Team Sucks 2018: Tennessee Titans","Mike Freeman's 10-Point Stance: Defense Is Becoming a Luxury Item in Modern NFL","Paxton Lynch “absolutely” hopes to stay in Denver","4 NFL players who should get new contracts before Week 1","Anyone know what happened to Real Football Network?","Quarterbacks targeting Josh Jackson this preseason: 7 targets 1 reception 9 yards 1 INT (returned for a touchdown) 1 Pass Breakup 0.0 NFL Passer Rating Allowed. (And another pick-six nullified by penalty)","Im interested in some data about this sport. Can someone point me in the right direction","[Kevin Clark] Kirk Cousins Is the NFL’s Greatest Gambler","#AZCardinals LB Deone Bucannon was a defensive menace against the Cowboys. He recorded a sack, 5 stops and 7 tackles (he did not miss a tackle) in only 30 total snaps. That effort earned him a 90.4 overall grade","[Duggan] Mara said Odell is always going to be an emotional guy. Mara just hopes the emotions are kept in check and Odell doesn’t do anything “that’s going to embarrass him or us”","Source: the Eagles and DB/core special teamer Chris Maragos have agreed to a reworked deal, eliminating the 2019 season of his contract. Maragos, currently on PUP, is now set to make up to $1.75M in 2018 and be a free agent in March.","When Matt Nagy gathered his team Friday for an important announcement, one player shouted from the back: “Have we all just been traded for Khalil Mack?” Prince Amukamara: “It was awesome. I was cracking up.”","#Eagles coach Doug Pederson says he wants to get undrafted RB Josh Adams involved early on Thursday. That's a guy teams have been monitoring. If the Eagles try to slip him through waivers and onto the practice squad, I'm not sure he makes it.","Video: Titans DB coach Kerry Coombs with a catch and spike against DB Dane Cruikshank","[Dave Spadaro] Coach Pederson says WR Alshon Jeffrey is “progressing well” and has been catching “75 balls a day” as part of his rehab. No word on his availability for opener. Jeffery remains on PUP","New Titans LB Kamalei Correa was high school teammates with Marcus Mariota in Hawaii","[Mike Chappell] Frank Reich: Andrew Luck. Not out there today. He's done fine. Will be out here Monday. He's feeling strong and good. Don't anticipate any regular-season restrictions for practice.","Is your team good at finding UDFA or end of draft (6/7th round) players and if so, at a particular position?","With contract settled, Odell Beckham wants to become “legendary”","Giants WR Odell Beckham Jr has now agreed to a 5-year extension that makes him the highest paid WR in the NFL on a $95M max deal, $65M total guaranteed.","American football bars in Paris?","Reviewing every NFL team's backup quarterback","Big play analysis","After forcing 8 turnovers against the Cowboys, @AZCardinals now have 16 takeaways (6 INTs; 10 FR) through 3 preseason games. The last team to have at least 16 or more in an entire preseason was Tampa Bay (17) in 2000.","Tiki and Tierney: Tony Romo talks Sam Darnold","Whitlock: “I want the NFL to survive and thrive, but NFLPA head DeMaurice Smith is standing in the way”","The greatest calls in NFL history","Browns are signing former #Bears OL Earl Watford, source says. Cut by Chicago the other day.","New start, new position for Rams' Dominique Easley at outside linebacker. Easley is down to 263 pounds.","Other than your favorite team, which team would you like to see win the Super Bowl this season?","Film Room: Run-Pass Option with a two-back set","Talko Tuesday","Abdullah understands he might be done with Lions","Thought's on Khalil Mack's Contract Situation","Torrey Smith's Unforgettable SNF Performance After His Brother's Death","Jackson said Damarious Randall getting second opinion on knee. Surgery not being discussed. #Browns","If You Want to Become an NFL Head Coach, Be Prepared to Move … Often","Broncos CB Chris Harris Jr. was asked today if Adam Jones coming in pushes him and everybody. His response: “I’m the best. Ain’t no one pushing me.\"","Who are some players that your team will try to stash on the practice squad?","Patriots' Robert Kraft, Cowboys' Jerry Jones retain stakes amid shift to sportsbooks","Hue Jackson tells Gregg Williams not to call players “stupid” in the media","Grading all 32 first-round picks from the 2018 NFL Draft through preseason Week 3","Dallas Cowboys: Addressing the Wide Receiver Situation","[James Palmer] It was no surprise Josh Rosen (thumb) was participating during the part of practice we got to watch today. As of yesterday though Wilks was “still debating” if Rosen would play vs Denver. He's trying to balance Rosen’s health &amp; not taking an unnecessary risk vs getting him reps","Preseason Week 4 complaint thread","What are some of the worst contract extensions ever given?","Why did the 2nd round of the 2004 draft have only 31 picks?","Blake Bortles and his foundation are providing meals for first responders working at Jacksonville Landing. Bortles wrote a note to first responders in JAX. He paid for meals for everyone on scene at Jacksonville Landing.","Has there been a successful head coach that worked on offense and defense?","NFL coordinators who could be head coaches in 2019","[Serious] Why is Dez Bryant called a cancer or selfish to his team?","The Chargers Are an AFC Competitor Hiding in Plain Sight","If you could choose any RB in NFL history to have for a 5 year period in there prime, who would you choose?","PFT: Is 18 game regular season with a 16 game maximum for each player the silver bullet?","Is the NFL experiencing a a rollercoaster of game-changing contracts or is it just me?","A year after Harvey, $37 million raised by J.J. Watt is changing lives","TV Coverage for Preseason Week 4 - 506 Sports","The #Giants and star WR Odell Beckham Jr are closing in on a 5-year, mega-extension that will make him the highest paid receiver in the NFL, sources tell me and @KimJonesSports. Well-deserved. Should be done soon. 💰💰💰","Seahawks LB KJ Wright getting knee scope due to \"not feeling quite right\" after Vikings game. Rookie LB Shaquem Griffin set to start in the meantime.","Which games to watch with season pass","[OC] How Hall of Fame quarterbacks play in the playoffs compareed to their regular season numbers (Fixed Formatting)","Cardinals vs. Cowboys Highlights | NFL 2018 Preseason Week 3","Assessing the 2014 WR Draft Class Financially","The Jacksonville Jaguars Defense is in Mid-Season Form","Josh Allen: \"I didn't do a good enough job getting the ball out on time and into the playmakers, Holding onto the ball is not going to be great most of the time.\"","2 Minute Drill: Tennessee Titans","Cardinals Defense Racks Up 8 Turnovers &amp; 5 Sacks vs. Cowboys","Lester Hayes applies Stickum to his hands and arms. This sticky adhesive paste helped players keep a grip on the ball, and was banned by the league after the 1980 season.","The #Patriots have agreed to terms with G Shaq Mason on a five-year extension worth up to $50 million, sources informed of the agreement tell me and @HerbieTeope. Former fourth-round pick gets top-10 guard money.","[Salguero] Teddy Bridgewater was very close to signing with the Dolphins this offseason, however Teddy wanted a 1-year $15m contract, which Miami could not pay. His deal with the Jets is worth $15m if all incentives are earned.","[Danneman] Field level view of Geno Atkins literally lifting a 329 pound OL off his feet and driving him into Josh Allen","Jaguars’ WR Marqise Lee is being placed on injured reserve today. He suffered knee ligament damage Saturday night vs Atlanta on a hit that some believe is related to NFL’s rules changes. Lee’s season is over.","Ranking every QB situation in the NFL","Colts QB Andrew Luck is dealing with a foot injury suffered on the 15-yard scramble in the first half of Saturday's game against San Francisco. Coach Frank Reich said Luck would play if they had a game this Sunday.","Deshaun Watson is the real deal","Will the NFL survive? 5 things it can do to save its future","PreSZN Ethan: You think the #NYG locker room is happy Odell got the bag? From Sterling Shepard's instagram story 3 minutes ago 😂😂😂","[Spadaro] Doug Pederson plans to play Christian Hackenberg against the Jets in the final preseason game","[Spotrac] Most Total Guarantees for a Non-QB, All-Time: Ndamukong Suh: $77MM, Von Miller: $70MM, Fletcher Cox: $63MM, Marcell Dareus: $60MM, Odell Beckham Jr.: $56.5MM","Underrated Possible Future HOFers","[Jordan Schultz] Steelers and Raiders are finalizing a trade to send WR Ryan Switzer to Pittsburgh, per league source.","#AZCardinals QB Sam Bradford has demonstrated his accuracy this preseason. Every pass that Bradford has attempted this preseason has been catchable. And 12 of his 13 throws have been accurate.","New at ⁦@Colts⁩ games: Fans can pick 3 7 oz selections of craft beer (21 ounces total) from list (Metazoa Brewing, Deer Creek Brewery, 3 Wise Men, Two Deep Brewing &amp; Sun King) for first ever NFL stadium to do craft beer flights. Cost is $15, per @centerplate.","Odell Beckham, Jr. has now played 47 career games. Over the past 15 years, no wideout has more catches (313), receiving yards (4,424) or receiving TD (38) through that same period of time in his career.","Chad Kelly to start vs Ariz on Thursday. Paxton Lynch to play second half. #9sports","Arizona Cardinals RB DJ Foster has suffered a torn ACL","Which two teams have the most trades between each other?","Which first year HC are you most excited for?","#Browns Josh Gordon still working off to the side with trainers in his helmet, visor and shoulder pads, but he’s scheduled to talk to the media today for the 1st time since returning from his treatment program","First Raiders season in Vegas and your team is visiting, is this a away game you must go to with Vegas in the fold?","Former CFL Standout C Brett Jones on Becoming A Viking, His Strengths, and Unique Path to the NFL","Predicting Strength of Schedule - Beyond the Win Loss Record","WR Hunter Sharp left the locker room party to tell me why Odell's teammates are so happy for his new contract: \"I think he deserves it. He's been real humble about it. He's worked his ass off. Just to see him do that is motivation.\"","Falcons sign former Raiders kicker Giorgio Tavecchio","George Edwards calls George Iloka's expedited knowledge of the playbook \"a blessing.\" They've gotten him some reps as a hybrid linebacker, which gives the Vikings flexibility in 3 safety sub packges, using Iloka as a deep safety or underneath.","Ryan Switzer on Twitter: I’d rather everything go according to God’s plan than my own. One step closer to finding a home. Excited to be in Pittsburgh!","If you could change one draft pick, but you could only pick the player taken immediately before or after the original pick, which one would it be?","Patriots G Shaq Mason gets $23.5M guaranteed, close to $30 million over first three years of new 5-year, $50M deal","My all time favorite return: Robert Bailey's 103 yard punt return TD","[Schefter] - Patriots officially released WR Eric Decker and DB Eddie Pleasant.","Gregg Williams says Denzel Ward's 'stupid' tackling led to back spasms","Why Your Team Sucks 2018: Carolina Panthers","[John Keim] Gruden said Chris Thompson has looked “really good”. Gruden said Jordan Reed is on pace to be ready for the opener.","Josh Gordon won't start vs. Steelers 'but I know I'm going to be here playing football'; Gordon addresses media","Matt Nagy and the Bears rested Mitchell Trubisky and starters for the “dress rehearsal” preseason game. The Packers sidelined Aaron Rodgers, the Rams rested Jared Goff and Todd Gurley and the Cowboys let Dak Prescott and Zeke Elliott sit. We’re looking at a new trend here.","The #Steelers acquired WR Ryan Switzer and a 6th rounder in 2019 from the #Raiders in exchange for the #Steelers’ 5th rounder, source said.","Jon Gruden calls contract impasse with Khalil Mack “a grueling process”","Lions signed former Buccaneers’, Giants’ and Broncos’ defensive Robert Ayers to a one-year deal, per source. More pass-rush help and versatility for the Lions","The weekly preseason pay for a 1st yr NFL player is $1,075. Jets undrafted rookie LB Frankie Luvu has made $4,300 this summer. The NFL fined him $20,054 for his illegal hit vs the Redskins. He’s officially in the hole $-15,754.","Bills WR Brandon Reilly said he broke his rib during the first preseason game of the year. He’s trying to make the 53-man roster while on the mend with that.","Every Josh Allen throw from preseason Week 3 vs. Bengals","Mvp sleepers???","[PFT]Hue Jackson: Josh Gordon won't be a starter Week One","[Meinke] There is nothing to the Khalil Mack-to-Detroit rumors","Who are the best athletes in the league today?","New study from Stanford: Very small changes to head and neck positioning can have drastic effects on concussion risk during tackles","[Wolfe] Adam Gase said DeVante Parker still can't catch a ball. He doesn't know yet if he can play Week 1 vs. TENN. We're two weeks away from the opener.","What’s the best game that no one remembers?","In 2017 Wilson was an MVP candidate due to carrying a team who rushed for 3.3 YPC to a 9-7 record. In 09 the colts rushed for 3.5 yards per carry. Manning went 14-0","The 49ers are averaging 411 yards per game and 6.4 yards per play during the preseason. Both are tops in the NFL.","In the 53 seasons from 1945-1998, a QB completed at least 65% of his passes just 27 times. It's happened 124 times in the past 20 years.","Biggest questions for your team this season","[Josina Anderson] The total avg on OBJs deal including his option year is $16.4MM/ year over 6 years. His new money avg on the extension is $18MM/yr, exceeding Antonio Brown on that specific metric.","People who know football: what is meant when people say that a good secondary helps a pass rush?","[Highlight] Arizona Cardinals punt for a TD","Who are two players that most people would be surprised to find out played on the same team together?","[RAIDERS] We have signed CB Jarell Carter and DT Connor Flagel. We have also released T Breno Giacomini and placed WR Griff Whalen on Reserve/Injured List","What surprise cut could your team make on September 1st?","Mass Shooting at Madden Tournament in Jacksonville","With @Julius_Thomas and @EricDecker87 announcing retirements, the only starter from the @Broncos’ record-setting offense in 2013 still on an active @NFL roster is @DemaryiusT","Why doesn't the NFL ask the player's union to come up with changes for player safety?","Coaches on the Hot Seat","The NFL kicking crown: Comparing Justin Tucker, Dan Bailey, Adam Vinatieri and Chris Boswell","Who were some of the best players teams traded up to draft? What's the success/bust rate?","SNF Producer's explanation for the Green Zone: \"[It] was developed primarily for the Skycam view, which we think makes it easier to gauge how far the ball carrier has past the LOS and has gotten close to the first down line—something that isn’t easy from that perspective.\"","Weekend Wrapup","Stephen Jones on @1053thefan asked if Randy Gregory is in any trouble with the NFL: \"The team doesn't hear until its time. We don't get on the inside of any of that, unfortunately. We just get to hear when unfortunately there's not good news. Right now we don't know of anything.","What move is your team's most painful at the time, but ultimately necessary to make?","How did John Elway have an entire NFL career with any ACLs?","The Cardinals defense finishes the game with 8 takeaways against the Cowboys.","Scott Kacsmar: The craziest table I made in FOA 2018 shows the decline in YPA for Aaron Rodgers since 2015. 1st downs, 1st quarters, play-action, vs. blitz, all big problems for this offense.","[Highlight] John Ross 57 yard touchdown","Andy Dalton and Bengals receive a standing ovation from the Bills crowd!","Survey - Predict all 256 games for the 2018 season!","Fixing the NFL's TV ad problem","Will Julio Jones and Antonio Brown push for new contracts with OBJ's record setting deal for WR's?","Stefon Diggs Highlights","Patriots WR Eric Decker is retiring from the NFL, he announces on Instagram.","Josh Allen has been pulled a quarter early. He finishes the night with 6/12 passing for 34 yards. 0 touchdowns and 0 picks. And was sacked 5 times and lost 39 sack yards","The Man Who Wrote the Book That Terrifies the NFL","18 Week Regular Season (2 Byes) Schedule Proposal","PFF's Preseason Week 3 NFL Team of the Week","Stephen Jones mentions OL &amp; S as two spots where he doesn't love the Cowboys' depth. Repeats that they'll have their eyes open for guys who can improve their roster this weekend during cuts. #cowboyswire","Source: the Patriots are releasing veteran safety Eddie Pleasant. He was signed this offseason after six years with the Texans.","Preseason Week 3 Imperialism Map","\"If ya'll don't want me to play, then why don't ya'll trade me\" says WR Corey Coleman who demonstrates lack of desire to play","(Twitter) Michael Dickson had two punts last night that went 55-plus yards and pinned the opponent inside the 5. Nobody did that in one game in all of 2017. There were only 25 punts like that the whole year, and nobody had more than 3.","Cowboys First Team Defense this Preseason: 13 Drives - 0 Points Allowed","[Rapoport] Giants star pass-rusher Olivier Vernon, who was carted off during practice yesterday, suffered just a sprained ankle based on initial tests, I’m told. Two weeks until the opener, so there is time to get Vernon ready. It may be close","What teams do you think will have a top 10 pass rush?","What are some offensive and defensive schemes of the past NFL that us younger fans might not know about?","2 Minute Drill: Tampa Bay Buccaneers","NFL fans immediately ripped NBC's new Green Zone","If you cold pick one year to change the results of the AFC and NFC championships, what year would it be?","Would QB Aaron Rodgers be the same potential HOFer he is today if it wasn’t for his predecessor QB Brett Farve getting traded to the NY Jets?","Carson Palmer has the most tackles all-time among Quarterbacks with 18. Second is Matt Hasselback with 16, and Drew Brees takes third with 13.","When Aaron Donald deal is done (and it's still close), look for $22M per year and as much as $80M fully guaranteed","Average team points per game by season","Jalen Ramsey on Marqise Lee injury: “You have to be mad at the NFL ... people are scared to tackle normal”","[Highlight] Patrick Peterson intercepts Cooper Rush for a pick 6","[The Ringer] Predicting the NFL’s Passing, Receiving, and Rushing Leaders in 2018","Degeneration Nation: best longshot prop bets","NFL book recommendations","Introducing a New Metric to Measure Success in the NFL: The Game Control Index","[OC] Sam's Film Room: Breaking down Derwin James' interception on Drew Brees in Saints' Four Verts Concept","Hue Jackson indicates Baker Mayfield is the Browns’ No. 2 quarterback","Bengals player takes out his own teammate on a punt return","Klis: Paxton Lynch does not own a house. His girlfriend is a realtor and he was giving her some support on social media. #9sports","The #NYGiants have traded C Brett Jones to the Minnesota Vikings in exchange for a 2019 draft choice.","Post Game Thread: Arizona Cardinals (3-0) at Dallas Cowboys (0-3)","[Dan Leach] Just heard from a Metro Detroit limo driver that he just picked up Raiders LB Khalil Mack and he is going to meet with #Lions GM Bob Quinn Monday. Stay tuned.......","Top Rookie Plays of Preseason Wk 3 | NFL 2018 Highlights","Mike Glennon in at QB. So Josh Rosen apparently isn't playing tonight. And Bradford's night is over.","Chad Pennington started a football program at my high school","Booth Review (Preseason Week 3, Sunday games)","Falcons vs. Jaguars Highlights | NFL 2018 Preseason Week 3","[Highlight] T.J. Logan takes off with a 59-yard TD","Which Super bowl was more entertaining, 43 or 52?","Lamar Jackson Part I: The Joy of Scrambles","Cosentino: Maybe Now We Can Finally Calm Down About The NFL Helmet Rule","Broncos are signing former Bengal CB Adam \"Pacman\" Jones","Who are players on your team that you are expecting to get cut this weekend, but can still make an impact for another team?","What team do you think will make the playoffs that were not in it last year?","Jets player: 'Flow is going' toward Sam Darnold as starter","Top 10 QBs 30 and under","NFL Coaches and QBs on how passers avoid injuries","What’s the ACTUAL worst first round pick?","[Highlight] Von Miller Raiden-Slams Colt McCoy","Sammy Watkins has a better deal than Odell Beckham","[Sports Insights] Longest odds for a Super Bowl matchup is 1950-1: Bills vs Cardinals, Dolphins vs Cardinals, and Jets vs Cardinals.","Cowboys S Kavon Frazier said his left shoulder popped out of socket and they were able to pop it back in. X-rays showed no damage, he said. He said he won't miss any time, may have to play wearing a shoulder harness.","AFC West - 3 teams have won the Super Bowl as Wild Card","Out of the Five NFL Teams Which Have Never Won any Championship Title, Which Team is the Closest to Finally Winning?","\"You may not love Andrew Luck like I do, but can you at least acknowledge now: He's the least appreciated great player in the NFL.\" — @ColinCowherd","Game Thread: Arizona Cardinals (2-0) at Dallas Cowboys (0-2)","Aaron Donald down to 280 pounds, shows off his abs.","Preseason Week 3 takeaways","NFL Rank: Predicting the best 100 players of 2018","Broncos and veteran CB Adam Jones are working on a deal and it could be completed soon, source says. The 34-year-old former Bengal is in the building and could soon be a Bronco.","[Highlight] Andrew Billings with the quick win at the LOS, absolutely rag dolls Josh Allen!","A Cowboys source tells @NBCDFW @NBCDFWSports that Randy Gregory remains in good standing with NFL.","The #Packers have traded CB Lenzy Pipkins to the #Colts for LB Antonio Morrison,","Injury Update: QB Josh Allen was evaluated for a head injury and has been cleared to return. #CINvsBUF","What is a team that you could see being terrible, but you could also see them make a wild card appearance?","Andrew Hawkins Jokes About His Patriots Tenure After Eric Decker Retires","[Spotrac] Breaking Down Quarterbacks for All 32 NFL Teams","Fisher: Cowboys Jerry Jones said he expects Randy Gregory to play in season opener and is not aware of some ominous turn around the corner other than the day-by-day nature of the work he does.","Vontarrius Dora three sacks tonight, three QB hits, two TFL, one FF.","[Machota]Jerry Jones continues to say Randy Gregory’s off the field issues are a day to day thing. Gregory left the locker room without talking to reporters","Sammy Watkins, Patrick Mahomes and Andy Reid’s Identity (In-Depth Analysis of Chief's Offense)","The Ravens, Bengals, Panthers, and Cardinals remain the only teams to be undefeated in the preseason, while the Dolphins, Titans, Cowboys, Eagles, Falcons, and Seahawks remain winless.","Defensive back and special teamer Kayvon Webster is signing a 1-year deal with the Texans for $2M, source said.","[Highlight] Brock Osweiler shows off his arm strength! launches the the ball 55+ yards!","Best of /r/NFL Roasts 2018","Taylor: Talked to member of front office about whether Cowboys needed a backup qb? “No,” he said “Dak is going to play all year.😬😬😬","Which receiving duo is going to be lethal this year?","Kiko Alonso just went over to the wrong sideline and got a delay of game penalty for it.","Game Thread: Cincinnati Bengals (2-0) at Buffalo Bills (1-1)","So your team has one of the greatest offensive skills position players in the league? Do you want your team to sign him to a bigger contract than OBJ or do you want them trade him for picks?","Post Game Thread: Cincinnati Bengals (3-0) at Buffalo Bills (1-2)","Anderson: I'm told Giants OLB Olivier Vernon's (ankle) x-ray came back negative, per source.","[Breer] Bears G Earl Watford was the subject of some trade chatter over the weekend, with the league desperate for OL depth. Team is releasing him tonight.","[Dunleavy] Olivier Vernon left practice on a cart #Giants","Paul Kuharsky on Twitter: \"Rishard Matthews passed his physical and was removed from PUP. Additionally, the #Titans placed WR Michael Campanaro on injured reserve.\"","What player is loved by an opposing teams fanbase?","Jon Gruden doesn't know if backup QB is on Raiders roster","What are your teams tailgating traditions?","The Best Play by a Rookie from Every Season Since 2000 | NFL Highlights","Brian Baldinger on Marcus Davenport","Cameron Meredith remains a work in progress with Saints after dealing with a minor injury early in camp. Still no catches in 48 preseason snaps (one drop was intercepted). And Sean Payton said WR depth chart is “written in chalk.” But the potential, opportunity are still there.","[McLane] Eagles have released LB Corey Nelson, per NFL source.","Taylor Gabriel explains the route that got him a first down.","What we learned about Tom Brady, the Patriots in Mark Leibovich’s Big Game - The Boston Globe","Former Cowboys are just about everywhere on NFL national telecasts this season","Hearing there could be more trouble ahead for Randy Gregory","Cowboys offensive lineman Dustin Stanton is in the locker room with a [right knee] injury.","Four teams are serious about a potential trade for Khalil Mack, and the Raiders aren't slamming the door on the possibility","Taking era out of the equation, who would go first overall in an all-time draft?","Who do you think will be the worst team in the NFL this season?","Who do you think will be a surprise cut from your team before the deadline?","Flags for the NFL's helmet rule have dropped significantly in Week 3 of the preseason. There have been nine calls in 14 games, with two left to play. That's an average of 0.64 per game. In Weeks 1 and 2, the average was 1.55 per game.","Jimmy G and Jacoby Brissett reunited after the game","The Khalil Mack Situation Could Define the Raiders’ Season","Richard Sherman: Why I picked the 49ers this offseason | NFL Life","If a defensive pass interference penalty is declined, but then the catch is challenged and ruled an incompletion, does the offense have a chance to accept the penalty?","Best Game of 2018","Average Wins By Division (Without Div. Winners)","[OC] An in-depth look at how much 2017's undrafted rookies accounted for each team's passing offense last season","The HOF QB that never was...","What exactly does the head coach do ?","Adrian Peterson Full Redskins Debut Highlights vs. Broncos | 2018 NFL Pr...","[Highlight] Lamar Jackson keeps it and runs it in for a touchdown","WR Marquise Lee’s season probably done per profootballdoc. ACL/MCL injury likely.","2 Minute Drill: Seattle Seahawks","How do player fines work ?","Who is your all-time favorite player to watch play from your favorite team and also your teams rival team?","[Browns] WR Josh Gordon has been officially moved to the active list and will be involved in walk throughs","Defensive Player Weight: Is the Line Blurring Between LBs and DBs?","[Rosenthal] The Browns are America's team. Eagles-Browns highest rated NFL preseason game on FOX since 2012","Sunday Brunch","Jaguars’ Jalen Ramsey Stands Ground After Criticizing NFL Quarterbacks","Marqise Lee being carted off the field.","Quentin Jammer (former chargers 1st round pick) makes it to quarterfinals of world world master jiu-jitsu championship","[Highlight] Fournette reverses field and takes it 21 yards for the touchdown!","[Highlight] Derwin James intercepts Drew Brees on his 3rd ever NFL snap","What's the best game you've seen that doesn't include your own team?","[Highlight] Ndamukong Suh destroys Deshaun Watson as he releases the ball. Lamarcus Joyner picks off the deep ball.","[Highlight] Tanoh Kpassagnon sack. Called for Roughing the passer","Hypothetical","Matt Nagy: “We’re at almost 2000 snaps in practice. ... For somebody telling me 25-30 reps is going to make [Mitch Trubisky] better Week 1, Week 2, Week 3, it’s not going to happen.”","Here’s a weird fact. The last time the Cleveland browns won a season opener was in 2004.","Kiko Alonso goes to the wrong sideline","[Highlight] Andrew Luck hits Eric Ebron for the TD","Booth Review (Preseason Week 3, Saturday games)","Patriots vs. Panthers Highlights | NFL 2018 Preseason Week 3","[Highlight] Andrew Luck shows off his sneaky athleticism and deceptive speed on this long 3rd down run!","Colin Cowherd On Dak - The Great Stabilizer. I've felt this ever since I learned who Dak was back at Mississippi State. This is why I feel any team would have been lucky to have him, and why elevating of everyone around him will always trump superstar QB in my mind.","[Highlight] Jacoby Brissett with a 53 yard bomb to Seantavius Jones","Apparently the Cowboys call the Falcons 8-sack game last year \"The Burning of Atlanta\"","[Highlight] Danny Amendola with the change of direction for the touchdown","[Highlight] Steelers 1st round pick Terrell Edmunds with the INT","Bob Condotta: \"Russell Wilson raved about play of offensive line. 'I had all day,' he said.\"","Check out this SB42 thread and see how reddit has changed since then","[Highlight] Jacksonville's first pass of the night is intercepted by Keanu Neal","What does the #Browns latest move with #WR Josh Gordon mean? Per @NFLprguy, Gordon is “cleared to return to all activities, including games.” It’s more than just walk-throughs. He’s officially back.","[Highlight] Chase Daniel pass to Kevin White for the TD","Jaguars DB CJ Reavis (best known for appearing in the first season of Last Chance U) is injured. Cart coming out","Question about NFL Preseason Scheduling","A reminder that another great season is 2 weeks away - Best Catch From Every NFL Team | 2017-2018 Season","Broncos right tackle Jared Veldheer—who the team acquired for a sixth-round pick this offseason—did not allow a single pressure in the preseason.","Lamar Jackson's prorated per/game stats this pre-season: 199 passing yards, 2 TD, 0.6 INT, 74 rushing yards, 1.3 TD","[Highlight] John Kelly with a nasty rushing TD","[Highlights] Bears WR Javon Wims gets both feet down for the touchdown. Capped off an impressive drive by the undrafted rookie.","Ravens UDFA RB De'Lance Turner finds a gap for a 65 yard breakaway TD","[Highlight] Micah Kiser called for roughing the passer","Post Game Thread: New Orleans Saints (2-1) at Los Angeles Chargers (1-2)","[Highlight] Patrick Mahomes takes advantage of the Bears blitz, swings it to Hunt for the easy TD!","Seahawks waived WR Tanner McEvoy, source said.","What was the best playoff game that your team lost?","r/NFL Roast Of the Oakland Raiders (32/32)","[Highlight] Sam Shields intercepts Brandon Weeden for 13 yards","Injury Update: Reuben Foster (concussion) is out. #SFvsIND","[Highlight] Roethlisberger goes deep to Justin Hunter for a 32 yard TD","If Josh Allen starts week 1 for the Bills, the AFC East will be the only division to have all 4 starting QBs wear double digit jersey numbers.","Jimmy G hits Pierre Garcon for 47 yards","What rookies have stood out from the start of training camp, to right now?","Post Game Thread: Kansas City Chiefs (1-2) at Chicago Bears (2-2)","First target of Richard Sherman as a 49er","[Highlight] Adam Humphries returns a missed field goal 109 yards for a touchdown","Post Game Thread: Baltimore Ravens (4-0) at Miami Dolphins (0-3)","Source: Browns WR Josh Gordon, made active today, dealing with tightness in hamstring, per club.","The Rams will rest all of their offensive starters except for RG Jamon Brown. All defensive starters will play but LB Mark Barron","Coach Nagy pumped up, receives game ball after win","Game Thread: New Orleans Saints (1-1) at Los Angeles Chargers (1-1)","Did Cardale Jones make a mistake by not coming out of college early?","Game Thread: Atlanta Falcons (0-2) at Jacksonville Jaguars (1-1)","QB Turnover Rate","With Josh Gordon being activated today and the hype train reaching max speed, I wanted to share the start of his redemption for those that have not seen it yet. We're all rooting for you this season Josh!","The Panthers just improved their all-time preseason record to 48-48. They're 192-192-1 in the regular season and playoffs.","Opposing QBs vs. Jaguars first team defense this preseason: 13-for-31, 107 yards, 0 TDs, 5 sacks, 51.4 passer rating","Post Game Thread: San Francisco 49ers (1-2) at Indianapolis Colts (2-1)","Beer Pong: Saints vs Chargers. The final QB challenge of camp!","Julius Thomas retires, will pursue doctorate in psychology","For the stat geeks (through 3 games): Darnold -- 29-for-45 (64.4%), 244 yards, 2 TD, 1 INT, 83.9 rating....Bridgewater -- 28-for-38 (73.7%), 316 yards, 2 TD, 1 INT, 104.7 rating. #Jets","Post Game Thread: Atlanta Falcons (0-3) at Jacksonville Jaguars (2-1)","Is it time to have a conversation about mariota?","1970 Monday Night Football Intro","Who is the best Qb for for each category?","Game Thread: Kansas City Chiefs (1-1) at Chicago Bears (1-2)","Oh boy. Some boos raining down as #Vikings rookie kicker Daniel Carlson misses a second straight field-goal attempt wide left. They cut incumbent Kai Forbath four days ago.","Game Thread: Houston Texans (2-0) at Los Angeles Rams (1-1)","Stanford reunion","New fan, what are some of the best/classic games to watch?","Game Thread: Baltimore Ravens (3-0) at Miami Dolphins (0-2)","[Highlight] Weeden floats one to Braxton Miller for a TD","Who will have the worst defense in the league this year?","Post Game Thread: Tennessee Titans (0-3) at Pittsburgh Steelers (2-1)","Could a punter who invariably manages to pin opposing offenses on their one-yard line be an MVP candidate/actually win MVP?","Game Thread: Tennessee Titans (0-2) at Pittsburgh Steelers (1-1)","Darnold and McCown do a hair slick at the same time","Jon Gruden on if Raiders have backup QB on roster: \"I don't know\"","Game Thread: San Francisco 49ers (1-1) at Indianapolis Colts (1-1)","Carr and Rodgers switch receivers. Carr throws to Adams, and Rodgers throws to Nelson","NFL’s ridiculous helmet rule is a bad joke","Cam Newton on Injury Scare: “I wanted to bring this plane down as smoothly as possible. I tried to avoid the hit and helicoptered out of there or whatever. It was a lot going on. A lot of malfunctions from the cockpit. Buttons were getting stuck.”","Picture/GIF/Video highlights thread (Preseason Week 3, Saturday)","Arian Foster on a podcast discussing NFL, personal life and culture","NFL’s interpretation of A.J. Bouye hit provides more clarification of helmet rule","Post Game Thread: Houston Texans (2-1) at Los Angeles Rams (2-1)","Russell Wilson the 2018 MVP? Adrian Peterson in perfect spot","Adrian Peterson breaks out for 15 yards on 4th and inches","[Highlight] On 4th down and 15 with under a minute left in the game, Kyle Sloter throws a 25-yard touchdown to Chad Beebe","Small divisional re-alignment idea.","Browns offered Dez Bryant base deal worth less than $5M; he prefers at this point to watch and wait","Security guards practice streaker drill prior to Cleveland Browns preseason game","What long time drought will be ended this upcoming season?","Which unsung hero of your team do you think will be a Pro Bowler this year?","What are some of the best stories last year from players relatively unknown prior to 2017?","In your opinion what are some dream trades you wish would happen? (Keep it somewhat realistically)","Atlanta Falcons to sell $5 craft pale ale at home games this season","What players in your franchises history are hated more than they deserved to be. What players are liked or loved more than they deserve to be.","Update: Yannick Ngakoue was fined $13,369 for his celebration. That’s $4,456.33 per pump.","Which NFL family members had the biggest gap in terms of overall talent?","Shitpost Saturday","[Highlight] Seahawks rookie Michael Dickson with a beautiful punt","Who's your surprise candidate for winning the NFL MVP","Achilles tear + RBs","[OC] Do Preseason Wins Predict Regular Season Wins?"]