["The Populist Uprising","Peach Mints Lead To A Holy Terror","Charges dismissed against 3 in New Mexico compound case","#StopTheBias","CNN is being torn apart from within based on their being caught in a major lie and refusing to admit the mistake. Sloppy @carlbernstein, a man who lives in the past and thinks like a degenerate fool, making up story after story, is being laughed at all over the country! Fake News","Hear a racist dog-whistle frequently? You are probably the racist | monkey: To play, fiddle, trifle, or tamper with something","OOOOPSIE! Christopher Steele Worked For Sanctioned Russian Oligarch While Composing Sham Dossier","NYT: Dozens at Facebook Unite to Challenge Its ‘Intolerant’ Liberal Culture","Ohh? Imagine this were Trump, we wouldn't hear the end of it.","Winfinity War: Trumpos Drains Half of the Swamp","Former NH Gov Torches CNN For Trying To Turn McCain Tribute Interview Into A Trump Bashing Event. Alisyn Camerota gets pissed. \"I don’t appreciate you denigrating our reporting. We have excellent reporters here.” And they still not backed down on the Lanny Davis crap","80% of black families do not have fathers in the household..","Member that all of the people that are part of this coup attempt were supposed to be the best at what they do. They were so easily corrupted. If thier coup attempt is any indication of thier skills, thier removal is another win for the US!","Cameron Gray of NRA TV tweets in response, “Antifa is whiter than Pat Boone making a mayonnaise sandwich with Wonder bread in a Minnesota snowstorm,”","MAGIC WAND ALERT: Second quarter even stronger than it first looked: GDP raised to 4.2% from 4.1%","**WHOSE MEME WEDNESDAY** “Let’s all thank McCain for admitting that the President’s time is more important than spending it at his funeral” Midday MAGAthread Edition","Not only did Congressman Ron DeSantis easily win the Republican Primary, but his opponent in November is his biggest dream....a failed Socialist Mayor named Andrew Gillum who has allowed crime &amp; many other problems to flourish in his city. This is not what Florida wants or needs!","Blue check mark insists you kill your white babies. Twitter is off the rails.","When you see “anonymous source,” stop reading the story, it is fiction!","“Anonymous Sources are really starting to BURN the media.” @FoxNews The fact is that many anonymous sources don’t even exist. They are fiction made up by the Fake News reporters. Look at the lie that Fake CNN is now in. They got caught red handed! Enemy of the People!","OH SNAP! \"How the hell is Bruce Ohr still employed at the Justice Department? Disgraceful! Witch Hunt!\"","Boom! US economy logs best performance in nearly 4 years","Zhe seems to have come to the wrong country","South African girl asking for help, and thanking Donald Trump.","“The Obama people did something that’s never been done...They spied on a rival presidential campaign. Would it be OK if Trump did it next? I am losing faith that our system is on the level. I’m beginning to think it is rotten &amp; corrupt. Scary stuff Obama did.” @TuckerCarlson DOJ","I am $450 million dollar athlete and entertainer Lebron James. Last night on my new show I blamed Donald Trump for Black America's problems. I think I understand the inner cities from my multiple homes in LA. I don't. I am just a puppet for the White Liberals who jumps real high when they tell me.","REVEALED: Chinese Govt. Killed and Imprisoned 18-20 CIA Spies After Penetrating Hillary Clinton's Private Server - WHERE IS THE INVESTIGATION!!!","100% of /politics stories are left wing.","DuckDuckGo Raised $10M As Google Faces Privacy Concerns","Give this PATRIOT some love...General Michael S. Rogers head of the NSA met with Donald Trump as SOON as he won the election, without telling his superiors (Clapper, Ashton Carter &amp; Obama) Rogers spilled the beans to GEOTUS about all the fuckery.","In 2011, Hillary Clinton was having trouble with her unsecure, private email system. She joked with a State Department staffer that it \"Must be the Chinese!\" hacking her.","Damn white people and their ...throws dart at own head...healthy eating.","SPACE FORCE CONCEPT ART","“Hillary Clinton and the DNC paid for information from the Russian government to use against her government - there’s no doubt about that!” @TuckerCarlson","UNBELIEVABLE: British police raid a party because they played a song insulting to Osama Bin Laden. Police helicopter was deployed as a show of intimidation. WTF is going with western civilization?","Jack Nicklaus Backs Woods on Trump Comments: 'You Respect the Office'","FITTON: It was never about Russia. The targeting of President Trump serves to protect Hillary Clinton and her enablers/co-conspirators in Obama administration from prosecution.","Conor Daly loses sponsorship over remark his FATHER made in the 80's","As a Democrat whose family escaped socialism, Ocasio-Cortez worries me. USA Today","Time to turn Michigan RED with this patriot!","THEY'RE ANIMAL CRACKERS","PRAGER U UPDATE: Facebook has confirmed to us that an employee on the content review team was responsible for making the decision to remove two of our posts as “hate speech” and that this employee is still employed by FB.","SEDITION! Lyft Will Give Away Free Rides to Anti-Trump, Open-Borders Activists on Election Day - Every Ride They Donate Is A Political Donation. PREPARE TO PAY UP LYFT $$$","Imagine the outrage if you replaced white with black","Take that you Trump supporters! Take that!","YOUTUBE MEDDLES IN SWEDISH ELECTION BY DELETING RIGHT-WING CONTENT","Candace Owens: \"I will be campaigning in Florida for @RonDeSantisFL in the coming months..I am so SICK AND TIRED of the left using the smear of racism to try to take down good men...\"","Whoops - Democrat nominee for Florida governor under investigation for corruption.","Democrats Hear \"Monkey\" or \"Guerilla\" and AUTOMATICALLY Think: Black Person. Who's The Racist Again?","Semper Fi, Grandpa. He was a Korean War vet. He passed ~2 years ago","Whiter than an Albino snowman.","Guys, I did a thing...","Polish Lawmaker Backs Burqa Ban, No Saudi Mosques in Europe Until Poland Can Build Cathedral in Saudi Arabia","Philadelphia Child Protection Agency Caught Running Pedophile Ring","The Facebook Employee who created an internal protest group that was pro-conservative? Turns out he wasn't such a big Trump Fan early on . . .the toxicity of the environment around him led him to the \"Other Side\" :P The left is slowly eating itself. #WalkAway","Bruce Ohr named 'half a dozen' FBI, DOJ officials who knew about Trump dossier ties, GOP investigator says","After just 18 months, Trump has “flipped” two circuits — the Sixth and Seventh — from liberal to conservative. Two more — the Eighth and the 11th — are on the verge of tipping.","Harvey Weinstein Probe Halted by Andrew Cuomo After $25k Donation From Weinstein's Lawyers","surely orange man is not as bad as you purport him to be","Shareblue forum sliding in action. Conspiracy user points out that 224 of the claimed 235 school shootings didn't actually happen, ALL top comments are raging at OP and defending the MSM's propaganda rather than discussing that fact.","The Battle Is Set For The Florida Governor Race: George Soros-Backed Andrew Gillum Versus President Trump-Backed Ron DeSantis. Do Your Part Florida!","Charlie Daniels: \"...anybody with enough gray matter to walk through a door without bumping his head knows that there’s way too much smoke in the Hillary camp not to be some fire somewhere.\"","CA, IF YOU ELECT THIS CUCK, YOU HAVE NO ONE ELSE TO BLAME BUT YOURSELF","Suspended Pentagon Whistleblower Says FBI's Russia Probe Was 'All a Set-Up'","\"Yeah they're here illegally and kill people like my daughter, but who cares THEY HAVE TACOS\"","FBI left out 'important facts' when presenting dossier to court to obtain FISA warrant, Jordan tells FOX News","BOOM! Donald Trump tells Canada \"sign by Friday or NO DEAL\" on new trade agreement... \"oh...and I'm gonna slap a 25% tariff on cars\" (Friday news...J.Trudeau caves...kisses USAs a%%)","Great record with endorsements","Trump is just a evil Russian puppet!","Another Hate-Trump Propaganda outlet is flaming out: Young Turks (TYT) Slashes Staff again, Drops Entertainment Programming..","In a post-Obama leftist world, EVERYTHING is about race.","BREAKING: Day After Ohr's Testimony, Congress Seeks to Question His Wife ~ WOE NELLY","FLORIPEDES: The guy on the left side wants to make Florida great again. The guy on the right side wants to make Florida Venezuela. Choose wisely.","Conservative Facebook employees are organizing to attack the liberal company's 'intolerant' culture (FB)","Since I’m taking photos in downtown Portland soon I thought I’d make the trip more interesting with a Pavlov style experiment. Thesis: Can leftists be triggered by a blank MAGA hat?","Two types of reactions to this headline. [Low IQ Liberal Sheep]: “MONKEY? BLACK PEOPLE? RACIST DOG WHISTLE!!! REEEEE!!!” / [Conservative]: “Did he actually say that? Let me look at the full clip.. oh, another misleading headline, per usual. Fk race, I don’t agree with Socialism period”.","TFW \"Gays Against Sharia\" Protests Happen and You Have to Choose Between LGBQT and Islam #GaysAgainstSharia","No Borking, You Silly Jackasses","BASED KANYE (Sacramento): “I ain’t here to massage you with a fake truth. Telling you that Hillary is going to win, over and over and over. And you wake up, and you still can’t believe it. You know why? Because you were lied to by Google. You were lied to by Mark Zuckerberg.”","3 Short Years from Je Suis Charlie to Tommy Robinson","😡😡Former Police Detective ‘Commits Suicide’ Days After Releasing Book Exposing Elite Pedophile Ring","Feds Just Raided Muslims’ House In Virginia. Recovered blueprints for the Muslim \"Takeover of America\"","WINNING: Trump Administration Says Palestinian Aid Provides 'No Value to U.S. Taxpayer'","Turns out the protesting of Chief Wahoo from the Cleveland Indians was really just fake to get grants: Prominent Chief Wahoo protester sentenced for embezzling grant money meant to help Native Americans","Meme War 2018: “Researchers at University College London studied millions of memes to determine how they are made and spread. The most effectively spread memes are first shared on two places, the subreddit r/the_donald and 4chan’s /pol/.” We are now proven to be the front line crusaders.","Polish Lawmaker: No Saudi Mosques in Europe Until Poland Can Build Cathedral in Saudi Arabia - Geller Report","Reports: Bruce Ohr Testimony Reveals More FBI Corruption","Don't forget to ask Nellie about her ham radio! ...LOCK HER UP!","The lady who appointed the compound judge hates Donald Trump","FAKE NEWS CNN IS DYING .... JUST NOT FAST ENOUGH","The Alex Jones Show Is Back, Subscribe To His New Channel On BitChute","Ill Never Forget. My father was in the 1st tower when the plane hit. We were escorted Home. Kids were pulled from class. Some lost their fathers, some thier mothers, a few lost both. Mine made it home. Tell your children about that day. Never Forget","I, a Jew and a former Democrat have a million karma as of today. Thank you all, pedes, mod pedes at The_Donald! Keep redpilling the masses so we can Keep America Great!!","Two Weeks After Ellison Abuse Allegations, DNC Offers No Update from \"Review\"","WTAF!!! Portland School Teachers Given “Social Justice” Guides – Praising Islam, Che Guevara, Black Panthers - ISLAM! WTAF PORTLAND!","Conservatives Paul Joseph Watson and Candace Owens post mugshots of Antifa members to prove that liberal CNN legal analyst Jeffrey Toobin is wrong about their skin color","TRUMP CANT BRING JOBS BACK 😝🤪🇺🇸🇺🇸🇺🇸Aluminum Mill to Bring 550 Jobs Back to Kentucky Town Crippled by Free Trade","Somehow Stumbled Upon a Romanian Pede At a Hipster Club in Bucharest","USA TODAY DROPPING RED PILLS","Larry O'Connor: Despicable race-baiting lie from The Hill. Here's the full quote: \"The last thing we need to do is to monkey this up by trying to embrace a socialist agenda with huge tax increases bankrupting the state. That is not going to work,\"","Quick! Post things that trigger liberals!","Here we go, not even 24 hrs have passed and race baiting begins","Valid point.","‘Only 2 out of 25 speak German’: Mom claims 3yo son ‘feels like foreigner’ in daycare center","With her creating content like this, it's easy to see how the NYT needs Sarah Jeong...","I wonder if this would have happened if Trump hadn't called out big tech.","College rejects applicant for following Alex Jones on Twitter","Or maybe it was because of their knee-jerk reaction to Parkland shooting?","Nothing to see here, just the CEO of Google offering his support for the 2016 elections to Hillary from his work Google-mail account, offering to create data analytics tools based on the insights from 2012. Normal right? #StopTheBias","Can the baseness of this man be overstated? Thinking no.","Gov John Sununu blasted CNN to bits. After a McCain question he said \"That story was from WP, I don't give much credence to WP. The CNN anchor claimed to have the story too. Sununu said \"Same thing applies\" XD","Wait hold up. You mean to tell me that Florida, the landing place for those escaping Communist Cuba, and Democrats are putting up a Socialist up against a MAGA candidate? 😂😂😂 Is this for real?","BREAKING: Congresses passes bill to memorialize Sen John McCain by naming a well-trafficked feature of Capitol Hill after him","Weinstein is trending just as a judge dismisses the compound case. #Whatever","Aloha SnackBar!","CNN anchor gets pissy when someone doesn't play into their bullshit","Google Your Search Bias Is Showing","Crazy Ocasio-Cortez was a big fan of tax cuts when she was trying to run a business, since she failed, she wants everyone else to fail too!","FAKE NEWS CNN CLAIMS ANTIFA IS A BLACK ORGANIZATION BECAUSE .... TRUMP IS RACIST! WHAT A FUCKING MORON! HOW DO PEOPLE WATCH THIS? 🙄","HILLARY HAS GONE FULL POTATO","Screw You Netflix!!! See ya!!!","Rachel Maddow, AKA 'Rick Madcow,' is worried DOJ won’t be able to Fight The Russian Mob if Bruce Ohr’s Fired ... bitchboy is cuckoo","BREAKING!!! Multiple anonymous sources confirm to CNN that Drumpf is done for this time!!! Impeachment imminent.","Former attorney for President Trump John Dowd on Fox and Friends just now: \"I'm afraid...I've just lost all respect for Bob (Mueller) because he didn't keep his word.\" There's a shocker.","Ron DeSantis now under investigation for campaign finance fraud and Russia-linked contributions day after election win. How convenient.","BIG Media Alert! Clinton email crimes compromised national security. Did both China and Russia hack her server? And why did Strzok/Comey FBI cover it all up while peddling fake Trump Dossier? I will discuss on Tucker Carlson at 8 pm on Fox News.","VOX complains that the WH intern picture isn't diverse enough. Here are the 4 people who occupy the only 4 seats on their board of directors. I'm sensing a pattern here.","How the hell is Bruce Ohr still employed at the Justice Department? Disgraceful! Witch Hunt!","Don't take this personally, but.....","DID YOU JUST SAY \"MONKEY WRENCH\"?!?","Obama used the term “MONKEY AROUND” too! Where is the faux outrage?","Anyone remember that Eric Schmidt (Google and Alphabet CEO) was directly involved in Hillary's campaign? #StopTheBias","Come for the shit, syringes and MS 13, stay for the criminals running wild on the streets. Kalifornia to become first state eliminating bail for suspects awaiting trial","Dicks Admits Corporate Gun Control Hurting Business (Get Woke, Go Broke, Chapter 11 Incoming)","Pope Francis facing calls to resign; sexual abuse scandal exposes rifts in the Vatican","Martha McSally is an extraordinary woman. She was a very talented fighter jet pilot and is now a highly respected member of Congress. She is Strong on Crime, the Border and our under siege 2nd Amendment. Loves our Military and our Vets. Has my total and complete Endorsement!","Oh, reality you ever present wet blanket.","When the fuck are they going to realize that GEOTUS gets daily intelligence briefings?? How many times do they say “without any evidence,” just to get BTFO within a week or two???","Thanks to Jared Holt successful effort in getting Alex Jones banned from multiple platforms, the President now reads him everyday. God bless the streisand effect. 🤣","The effect of President Trump's calling out of Facebook's bolshevik-mob mentality cannot even be hidden by the Failing New York Times","I work in the Search Industry. Google Bias is real and their search results have not been 100% algorithmic in many many years. There are thousands of Google employees influencing search results every day. They are called Google Search Quality Raters.","Trump warns of violence by the militant left; MSM twists his words as if he threatened violence if Republicans lose seats. This is what Fake News looks like. Link to article in comments","FEC Records Indicate Hillary Clinton Campaign Illegally Laundered $84 Million","If the GOP Loses Midterms Democrats Will Enact Change ‘Quickly and Violently’","The Democrat Party - Where \"Monkey\" = Black People, Guerilla means Gorilla, and that = Black People, and \"Felons\" = Black People","160 illegal workers detained in Texas immigration bust. Company has been busted before for hiring illegals. Time to shut it down!","Australia intends to ban US government contractor turned Obama celebrity leaker, Bradley Manning, from country ahead of his book tour","BASED Red Sox Slugger J.D. Martinez refuses to apologize or back down to the Libullies for 5 year old Twitter post defending the 2nd... After Growing up in Cuba he cherishes his right to defend himself from tyranny!","WTF: Judge drops charges against three New Mexico Jihadist compound suspects","libtards","🇲🇽","Mueller has never interviewed Bruce Ohr, who is a central figure in the fake dossier, proving beyond doubt that Mueller's investigation is a sham.","Hillary Clinton’s Emails, many of which are Classified Information, got hacked by China. Next move better be by the FBI &amp; DOJ or, after all of their other missteps (Comey, McCabe, Strzok, Page, Ohr, FISA, Dirty Dossier etc.), their credibility will be forever gone!","MRW T_D has been saying \"I wish Trump would say something about this censorship\" and he delivers again","MEME WAR -- Meme this image of Canada's Foreign Affairs minister (and Justin Trudeau's chief NAFTA negotiator) Chrystia Freeland having dinner with George Soros","How dare he...","White House Counsel Don McGahn will be leaving his position in the fall, shortly after the confirmation (hopefully) of Judge Brett Kavanaugh to the United States Supreme Court. I have worked with Don for a long time and truly appreciate his service!","Giant balloon of mayor Sadiq Khan in a yellow bikini to be flown over London","Twitter/YouTube/Facebook banning conservatives reminds me of the civil rights movement of the 50s 60s, I thought we were past this... I am sure MLK is rolling in his grave....","Hey Jeffrey Toobin! Do these mugshots of Antifa members look African American? More lies courtesy of CNN.","LeBron James Says He Lost Popularity for Speaking Out on Social Issues, But That Won't Stop Him (Get Woke, Go BROKE)","Get rid of Google and use DuckDuckGo. 10/10 would recommend.","CNN- The Most Busted Name in News- slammed for refusing to retract a bombshell story on the infamous 2016 Trump Tower meeting after Lanny Davis recanted and admitted he was a source. Now they claim they never talked to him","Chinese hackers stole sensitive data on US Navy submarine weaponry, report says","AP finally admits the truth!!!! \"Business investment\" is the key phrase meaning \"spending their tax savings on workers and equipment\". THANK YOU GEOTUS TRUMP!!!","Most of Europe’s leaders are childless. No wonder they do Nt give a damn about the future of European kids.","Somebody better wake up sleepy. This is his last chance as attorney general to do the right thing. Or else the people are going to start taking things into their own hands.","if James Woods is not on The_Donald, HE SHOULD BE! \"there. Fixed it for you\" tweet","Trump Warns FBI, DOJ's Credibility Will Be 'Forever Gone' If They Don't Investigate China Hacking Clinton's Emails","Senior Facebook Engineer Admits “We Tear Down Posters Welcoming Trump Supporters”","Texas Bishop Calls for ‘Thorough Investigation’ into Allegations Against Pope Francis","At what point will they be held accountable for their actions?","Report just out: “China hacked Hillary Clinton’s private Email Server.” Are they sure it wasn’t Russia (just kidding!)? What are the odds that the FBI and DOJ are right on top of this? Actually, a very big story. Much classified information!","This has not been debunked.","Virginia Beach Billfish Tournament knows what’s up!","Antifa is a Domestic Terrorist Organization, and CNN's Defense of Them Is Inexcusable","Mexico will indeed pay for the wall. You know it. I know it. Everybody knows it.","Alex Jones is going back on JRE to red pill normies!","CENSORED: Ben Garrison Cartoons Taken Offline - Why Bother With Social Media Shadowbanning When The ISP Can Just Silence You Directly. LAWSUIT!","Pakistan politician wants to NUKE the Netherlands: 'Give me an atom bomb and I'll wipe Holland off the face of the earth' - Geller Report","Went to the Holocaust Museum today. Left an important message.","We got the best ladies, don't we? Courtesy of r/hottiesfortrump","Sloppy Carl Bernstein is a degenerate fool!","Dana Loesch responds after Twitter user threatens her kids","FITTON:BIG Docs. FBI deemed Steele unsuitable “Confidential Human Source” but Ohr and Strzok used him anyway. FISA courts never told about this corruption when asked for anti-Trump spy warrants.","BRUCE OHR TESTIMONY: Reveals more FBI Corruption! ... House Judiciary Member Rep. John Ratcliffe (R-TX) offered sober advice to the Ohr family: “I’d retain a really good lawyer.”","Since you showed us how desperate you are, could you also split the cost of the wall with Mexico?? \"Nooooo. Absolutely not.\" POTUS: \"Well then I'll be happy to rip this up.\" Canada: \"OKAY, OKAY fine we'll do it.\" POTUS: \"Great!!! I'll put the funding under \"Trade Barriers\".\"","BREAKING: Race For FL Governor Is OFFICIALLY Set, And The Democrat Is Currently Under Investigation","The Cuban population and northeastern snow birds will have their say in November","Voltaire's Law: This is what far-Left European \"journalists\" call a \"violent far-Right mob of Nazi's\"","Another RABID Anti-Trumper Is BUSTED: NY Governor Andrew Cuomo Received $25,000 From Weinstein Lawyer’s Firm As He Suspended Probe...","Who here is ever surprised, at this point? \"BREAKING: New Mexico Judge Jeff McElroy dismissed all charges against the 3 ‘extremist Muslims’ who ran the ISIS camp training kids to shoot up schools.\"","Economists agree: Trump, not Obama, gets credit for economy.","Just two things about which we will never hear the truth. Thanks DOJ.","What a beautiful FLOTUS we have! Here she is burying McCain and still looks FABULOUS! So Helpful!","Kellyanne Conway: New #poll: blue-collar workers thriving in &amp; buoyant about the ⁦@realDonaldTrump⁩ economy -- ✅55% “better off” than 5 yrs ago; 61% among skilled trade ✅85%: my life “heading in right direction” ✅88% of parents: my kids will have better future","Rush Limbaugh: Why Aren’t Obama and Hillary Denying the ChiComs Hacked Her Server?","Hannipede: CBS and the rest of the MSM retracted FAKE STORY, CNN doubled down. They are f-ed. If they retract the story their credibility takes another major hit and Trump/Russia falls apart. If they maintain Cohen that gave them the info, then they are claiming he perjured himself before Congress.","Billy Corgan From \"Smashing Pumpkins\" Dropping Red Pills On Alex Jones","Pack it up, boys. We had a good run, but this is it. This is the end of Drumpf.","CNN starts out all excited because polls show that","Theybies, aka the mother is mentally ill and the father is a cuck.","Facebook Engineer's Stunning Admission: \"We Tear Down Posters Welcoming Trump Supporters\"","[BLUE PUDDLE] Republicans OUT-VOTE Democrats by a MASSIVE 8% in Florida - a state that Trump previously won by only 1.2%!!!!!","Keep up the boycott, folks. It’s working. 😎","Here Are Horrifying Things From The New Mexico Terrorist Compound","This guy has the nerve to complain, with a $95,000,000 deal with NY Giants, about being treated like an amateur in his careers early days, and had to make it a race thing","Lest We Forget","Ohhhh nooooo, That sucks: Gun control steps hurt Dick's Sporting sales, shares slip","Texas GOP shares arrest mug shot to attack Beto O'Rourke for skipping debate with Cruz","I suppose my USPS personnel weren’t quite radical liberals...Mesquite, TX","When President Trump gives you a name it's forever","Arrest of Iranian spies in the US just 'tip of the iceberg,' lawmaker warns","Yes, yes, yes... Hahaha this is too funny","Pro-Trump posts on front page? NO! Pro-Pedophilia posts on front page? YES!","Reminder that Steven Crowder's latest CHANGE MY MIND video, \"Donald Trump is NOT a fascist\", is dropping sometime today. This one is gonna be good.","Twitter Reverses Ruling After Backlash, Concedes It’s Against The Rules To Wish Death Upon Dana Loesch’s Children","Hannity on Grilling of Bruce Ohr | 'Ohr helped Steele spread anti-Trump Russian lies.'| FBI 'Knowingly Lied' to FISA Court to Sway Election","MFW I go to my first Econ class and my professor opens his lecture by shitting all over socialism.","*Instant Long Lasting Relief From TDS*","Alisyn Camerotten is a disgraceful excuse for a reporter, but she works for CNN. Par for the course.","Hmmmm.... Thought Rocky Dennis died too young to have a daughter.....","Stabenow, James agree to two October Senate campaign debates. VP Pence coming to town to help raise money for our guy, John James. Michigan needs a MAGA Senator!🇺🇸","Trump sees no color while the left just cares about their identity politics. The retardation is Strong with her.","REPOST because FUCK ANDREW CUOMO","In 1979, Shenzhen (China) became exempt from following the communist rulings - LOOK AT THE PROGRESS!","Democrats are moving to socialism, away from Trump. Losing strategy.","NPR actually doing REAL news : The School Shootings That Weren't","FBI Refuses To Disclose If It Met With Intelligence Community Inspector General Over Clinton Server","Trump meets with FIFA bosses. Gets a referee book with red and yellow cards, gives media a red card.","I will just leave this here....","New license plates came in today! MAGA!","“An alarming capitulation by Google on Human Rights” - How a coalition of 14 of the Worlds leading human rights groups described Google's act of censoring internet in China for the Chinese Government. But don't worry guys it's just a crazy right-wing conspiracy.","CNN #FakeNews Jeffery Toobin said \"Antifa is an African American Organization\" I Googled: Antifa Members and realized he was either legally blind or retarded.","This is what happens when public schools stop teaching history","VIDEO: Meet FBI Hero John Robertson Who Revealed Trove of Hillary Emails on Weiner Laptop – Blew the Lid on Comey-Strzok Criminality: Robertson will Go Down in History as Having Saved Children from Predators and Our Nation from Deep State Criminals.","The White House can — and should — bypass Congress to kill Obama-era spending","Muslims join the workforce in low numbers in the West. Some work secretly by cash and don't pay taxes, others get welfare, some commit crimes, and many stay at home and have 10 to 20 children. (Official census of Australia statistics.)","Not every millennial is a trump hater!","Barack Obama on Voter Fraud in 2008: Both Parties ‘Monkeyed Around With Elections’","Hey USPS, screw you too","Based Pewdiepie subreddit attacks buzzfeed","OMG racist president uses word \"Monkey\"....","FANTASTIC NEWS! CNN ANNOUNCES INFOWARS TO BE REINSTATED TO FACEBOOK, GOOGLE, YOUTUBE, APPLE","Half of our comments in the DeSantis victory thread predicted that , as soon as Ron won, he would be labled a Racist Bigot , lo and behold not even 24 hours later : this is one of the most disgusting and dishonest career assassination attempts i've seen in some time . (cross post /r/cringeanarchy)","Facebook has made Milo’s verified page completely inoperable for unknown reasons. Most likely a warning shot before a permanent ban.","Mexican Cartel Boss Offers $100K for Assassination of Breitbart Texas Writer—Arrested Within Days","When the Left start defending a Religious Institution, you know something is horribly wrong | A Red Flag","Chinese Owned Company Hacked Hillary's Server - Received Duplicates of Nearly All Her Emails IN REAL TIME!","One can only hope","Just a picture of two losers, move along:","Hey NYT, it takes one to know one","Draw Me a Picture of Corporate Greed For My Child's Snack","Posobiec on Twitter: \"The entire US clandestine network in China was assassinated from 2010-2012 -- We now know China was hacking Hillary’s server from 2010-2012 -- Let that sink in\"","Instagram Bans Gay Pro-Trump Account • Milo","Here are the candidates for an open house seat in Florida. I'm not going to tell you which one is the Democrat and which one is the Republican, because do I have to? Comeon. You know which is which.","What a POS! LeBron James: 'Took me a little while' to accept white people","Florida Friends: It is of the utmost importance that this patriot wins the Governor's race in November. We cannot afford to have a Bernie Sanders backed Tallahassee trainwreck socialist run our state.","Illegal ordered to be deported FIVE times and somehow he’s still in this country, then has the time to rape a CHILD multiple times!","Judge: \"you can't give away 3D gun blueprints\". Cody Wilson: \"3D blueprints for sale! Name your price!\"","President Trump: CNN is being torn apart from within based on their being caught in a major lie and refusing to admit the mistake. Sloppy @carlbernstein, a man who lives in the past and thinks like a degenerate fool, making up story after story, is being laughed at all over the country! Fake News","CNN’s Don Lemon Defends Antifa: ‘No Organization Is Perfect’","Syrian Migrant Who Stabbed German Woman Says It Is Acceptable In His Culture","SICK! Telling People God’s Okay With Abortion Is A New Low For Supporters","Golf legend Jack Nicklaus backs Tiger's claim about respecting the office of the president. Liberals won't be able to handle all of this common sense and decency.","New report shreds narrative surrounding number of school shootings - The College Fix","After Receiving $25,000 from Harvey Weinstein’s former lawyer, Governor Andrew Cuomo of NY Has Suspended An Investigation Into The Handling Of A 2015 Weinstein Rape Case","Surprise Motherfucker *note I hope the buisness owner gets charged","[ HAHA! ] --- Why do all ANTIFA arrested look like mental patients?","Congratulations to Governor Rick Scott of Florida on his conclusive Republican Primary Win. He will be a great Senator!","When PMSNBC can't come to terms with the fact their propaganda isn't working and Trump's base stays solid as ever.","Such a fantastic win for Ron DeSantis and the people of the Great State of Florida. Ron will be a fantastic Governor. On to November","Ron boils it down","Trudeau bends the knee","Blue check mark from Microsoft says “F*ck white people”. The left is totally not racist though.","You've Got Clinton's Email! Chinese reportedly got Clinton's emails in REAL TIME. This represents an even more serious breach of security than we originally thought.","Trump rips CNN over debunked Trump Tower story: 'They got caught red handed'","The Republican Party is now the party of President Donald J. Trump. GEOTUS helped Ron DeSantis catapult past Adam Putnam.","JD Martinez Doesn’t Back Down: “I love my country. I stand by the Constitution. I stand by the Second Amendment and it’s something I take pride in. It’s something that I’ll back up.” 👌👊","Just when you think Vox couldn’t get worse","Tree fort Pepe says he'll come down if you build a wall to keep out the violent illegals.","10 Times Google's Far-Left, Anti-Trump Bias Was Exposed | Breitbart","Sarah Palin Is Banned From The Funeral.","Hillary Clinton’s Campaign Implicated In $84 Million Campaign Finance Scandal.","My Twitter account just got temporarily locked for this, but they have no issue with leftists calling for death to the president","I was recently notified that the Meme War II had begun. I’m reporting for duty.","Winning - Commerce Department Revises Second Quarter Growth Up to 4.2%","\"We oppose stealing secrets\" ... thats why you guys steal our shit systematically ? INCREASE TARIFFS TO 70% , SANCTION HUAWEI!","CNN’s Jeffrey Toobin Falsely Blames Antifa Violence on Black Americans.","#walkaway from blaming White People for everything (This Was A Really Good One)","Democrats hate black people and don't want black judges","\"Ha ha, here's a funny joke about the race of the man who stabbed my daughter to death\"","I think that I'm now bi-curious, since I am falling in lust with a man. His name is Lauren Southern. Will I still be accepted here in the conservative community as a bisexual male?","Closest I could get but still beyond excited to be here!","Brown University censors its own researcher’s study on transgender teens because its findings went against its political beliefs!","Lets Not Forget Who let the Swamp Start to Grow Back in the 60s and 70s.","I was really enjoying season two of Preacher but in the latest episode some Nazi's arrive and one is shown wearing a MAGA hat. Fuck you AMC.","Big Election Wins last night! The Republican Party will MAKE AMERICA GREAT AGAIN! Actually, it is happening faster than anybody thought possible! It is morphing into KEEP AMERICA GREAT!","We know Hillary. We know.","Poll: Facebook at Risk of Losing 32% of Conservative Users","So true","Why are there no conservative controlled social media platforms? You would think someone could find the money.","Another Day, Another Liberal Rant . . .","You’ve heard of the Trump Curse? This is the TRUMP BLESSING! After polling neck and neck with Adam Putnam, Ron DeSantis was endorsed by GEOTUS and jumped to a 12 point lead. He won by 20 POINTS TONIGHT!","Priorities","“You have to think anyway, so why not think big?” - DJT","NPR Just Delivered A Headshot To The Anti-Gun Left's School Shooting Narrative","Democrats Just Confirmed Lots Of Trump's Judges So They Could Skip Town (LOW ENERGY)","Thanks, Hillary.","Candace Owens RIPS MSNBC Host To Pieces For Trying To Smear Trump","Realest Tweet Ever. He is on fire.","LMFAO‼️ Elizabeth Warren trying to get voters by saying they’ll vote on a marijuana bill... WRONG TYPE OF SMOKE SIGNALS, POCAHONTAS‼️ They can’t win on ideas, so they try to bribe people with false promises.... SAD 🌿🌿🌿🌿","CNN scandal shows network cares more about anti-Trump agenda than accuracy","Doctors can be fired for saying gender is determined at birth, but they can retain their license if they killed a child as long as they have the right skin color...","Bruce Ohr: FBI Knew About Bias Before Getting a FISA On Carter Page - BIGGER THAN WATERGATE","jOhHn mCcAiN hAd iNtEgRaTy","CNN’s Chris Cuomo on POTUS: “But I can tell you for free that this whole deal this morning was as much about distraction as it is about discovery of a pernicious practice by Google. This is what he does most. He finds something that can divide, that has a little bit of a fact gap\" and exploits it.","Drinking water to be shut off at all Democrat Detroit public schools due to lead and copper poisoning.","Lebron Learned To Like White People.","The evolution of “inclusive-ness” of the gaming industry","With This MAGIC WAND, I Shall Make EVERYONE DEPENDENT on the GOVERNMENT for EVERYTHING!! HAHA!! HAhahahu.......wait...","Imagine If Chinese Spy Scandal Involved Trump Instead of Feinstein","Why Liberals never learn lessons from their own history","It’s always something","Can we show some love for this truth merchant? Without Sara we would not know half of what the deep state did during the 2016 election.","Spoiler Alert! Hillary...WHAT?","This is ridiculous! As soon as someone who threatens the establishment runs for office, it's either the woman card or the race card.","Hats off. Hands on heart. No kneelers in baseball. Go Yankees!!","Google is a major investor in CrowdStrike. Perkins Coie is the law firm of Google. The Censorship Project makes a lot more sense now.","Tom Fitton: ’Will Hillary Clinton Ever go to Prison?”","Reddit showing how it really feels about us on the frontpage today","Sorry, Democrats. You don't get to attack us and then blame it all on black people.","Stunning Canadian trade reversal now seems increasingly likely - Nervous Freeland/Trudeau trying to position for political face saving","WELL THAT BACKFIRED! - Donald Trump Jr. at it again on Instagram with the truth!","Posting this every day until Alex gets unbanned #FreeAlex - Day 22","MONKEY WRENCH.....RACIST !!! REEEEEEEEEEEEEE!","London in 1967. When the people were thin, the girls were pretty, the streets were English and majority white and not a single Allah was being Ackbar-ed...","\"Pointing out that I call everyone who I don't like a Nazi only proves you're a Nazi you Nazi!\" - Another day, another meme the left fails at","Cape May, New Jersey MAGA fishing tournament...","UN Scientific Paper Suggests Capitalism Has to Die in Order for the Planet to Be Saved..they’re not even trying to hide their agenda at this point.","C_A deaths","MFW I am the only person not invited to a family wedding because I openly voted for President Trump.","No Further Evidence Needed: Hate-Filled McCain Family Does Not Invite Sarah Palin to Attend Funeral…","“But but but...Those jobs aren’t coming back!” Move over “Obamanomics”, FAO Schwartz is REOPENING a 20,000 sq. ft. toy store in Manhattan. #MAGA","Deep questions about Klantifa","Nothing to see here. Just liberal judges in America compliant with radical Islam planning hospital and school shootings","Merkel’s Nightmare: Now German Far-Left Wants Borders Closed!!!","Hey pedes, did I do this right?","\"Between January 2009 and October 2015, Google staffers gathered at the White House on 427 separate occasions.\" - #StopTheBias","MFW when \"Witch Hunt\" turns out to really mean \"Hillary Clinton Investigation\"","LOVE THIS MAN! --&gt; Trump Administration Says Palestinian Aid Provides 'No Value to U.S. Taxpayer'","Screeching Man Worried DOJ Won’t Be Able To Fight The Russian Mob If Bruce Ohr’s Fired","Mcstain is the epitome of Rino","This single image drives the left crazy.","Write an executive order on hemp paper","Report: 22 Islamic Compounds Exist in U.S.","Jim Jordan speaker of the House bid excites conservatives, garners tea party and right-wing support","US official: China has accessed Obama administration private emails since 2010","So, the tax payers funded their initial stay and medical attention at an ICE facility but then they sought E.R. services for several weeks. And now they sue the USA. BUILD THE WALL, DEPORT THEM ALL","House overwhelmingly approves Trump's prison reform bill that aims to help ex-convicts rebuild their lives after their release from prison. Shareblue says aiding Trump is aiding racism.","Based Betsy to introduce new rules to protect college boys from SJWism","CNN's Don 🍋 Defends Antifa: 'No Organization Is Perfect' AYFKM?","Robert Mueller, was born, bred, and married into deep state spy families. Mueller’s current role may be historical, involving his or his family members’ role in deep state events from the Bay of Pigs, JFK assassination, and Pan Am Flight 103 to 9/11’s Dancing Israelis, the Israeli “art students.”","Are you having a bad day? Here you go. You’re welcome.","CNBC: Why 4% growth is actually bad......This shit.....just wow.","Jeff Flake doesn't know the difference between an endorsement and a donation","Politifact tests Google search for Trump and gets same results but marks this as completely false because they feel they are not left of center.","New Street Turd Coming to Los Angeles – Obama Boulevard","Jeb! makes door openers. Who knew!?","ASIA ARGENTO fired as 'X factor Italy' judge following sexual assault allegations. Karma, bitch!","RESULTS MAGATHREAD: Arizona &amp; Florida Primaries, Oklahoma Primary Runoff","Fake News CNN Strikes Again. Jeffrey Toobin accuses African Americans of being Antifa Terrorists. 😳😳 What a racist!","Me after a few drinks at a wedding in Seattle this weekend with my wife's left coast friends....","Can we show Sara A. Carter some love?!? Girl has been KILLING it!!!","Spotted a Pede in the wild and just had to share!","Chelsea Manning set to be barred from Australia for failing the 'character test'","Possible human trafficking","Fantasy Tweet","For years, Google promoted Obama's State of the Union address on their homepage. When President Trump took office, Google stopped.","\"With respect to potential computer intrusion by hostile actors, we did not find direct evidence that Secretary Clinton’s personal e-mail domain, in its various configurations since 2009, was successfully hacked.\" --James Comey, July 5th 2016. Peter Strzok was notified of the hack in 2015.","Just a reminder of the goofy doofus who runs Canada.","Boycott the NFL...this puts it ALL into perspective (long but worth the read).","Presidential Message on the 55th Anniversary of the Reverend Dr. Martin Luther King, Jr.’s, “I Have a Dream” Speech","This pedophile-looking sack of shit just dismissed all charges against the Islamic terror cell that was training kids to shoot up American schools.","Oh Kanye... NEVER apologize. Kanye West apologizes for \"slavery\" remarks","Rep. Jim Jordan On Lou Dobbs - Trump Has Had an 'Amazing Year and a Half' [VIDEO]","This is sickening...","Google, 5 hours apart \"veterans are\" (POTUS is right again)","Fascism is left wing","MRW inmates are suing prisons for not providing halal meals.","FOR YOU down vote brigade shills &amp; cucks!","CNN you hooked yourself into another fine mess.CNNisISIS","Dems be like . . .","This sums it up","Yes DeSantis won, but a lot of the polling was still WAY OFF. Some recent polls had the race as a TOSSUP yet DeSantis ended up winning by TWENTY FUCKING POINTS. Don't forget this folks.","Support for President Donald J. Trump Renegotiating NAFTA","BTFO: If Lefties laugh at POTUS over Google \"fake\" censoring, ask these asshats, \"when was the last time they had to weed through Conservative headlines in their news feeds or search results to get to their news sources.. LIKE WE DO\" ((blank stare))","We have a chance against Bob Menendez for the Senate (New Jersey)!!! DNC just bought half a million dollars in advertisements in NJ for Menendez!","THIS--&gt; ICE raid at Texas company nets more than 100 illegal alien arrests &lt;---","Leftist “idealism”","DeSantis: Gillum 'Wants To Make Florida Venezuela' | Breitbart","But Dems always said more gun laws would stop shootings 🤷‍♂️. (Link in comments)","Just a picture of “Primarily Black” Antifa 😂","Christopher Steele Reportedly Worked For Sanctioned Russian Oligarch linked to Vladimir Putin","I apologize to 44 other Presidents; Some of them were awesome. But this image sings to me that right now. At this moment we have the best first couple that there has ever been.","CNN Supporting Antifa. \"Antifa is a black American organization\" (what?) Donald Trump speaking out against them is, once again, his appeal to racists. THEY ARE LOSING THEIR F-ING MINDS!","Az Pede checking in. Just voted pro-Trump agenda across the board. Suck it Dems!","Justine Trudope calls up Daddy Trump to grovel about the trade deal.","Little early for throwback Thursday, but just a reminder what happened the last time a progressive socialist regime tried to fuck with true blue blooded Americans and take over the world.","Not sure WHICH country. Iran, maybe?","Kanye West Apologizes for Slavery Comment, Reiterates Trump Support","LOOK at this TRUMP SUPPORTING PATRIOT supporting our MEN AND WOMEN in BLUE! #BlueLivesMatter","Pope Francis turned his back on a family that lost five relatives to state terror, including a young woman who was 5-months’ pregnant. The woman had given birth in captivity before being murdered to a girl who was given to a family “too important” for the adoption to be reversed.","Barry Hussein professes surprise at being invited to speak at McCains funeral","Beto Backs Out of First Scheduled Debate With Ted Cruz","In case anyone was on the fence about McCain being an asshole.","This is why every once great and successful company eventually turns into a failing liberal cesspool","Universities are learning that they're not above the constitution in the Trump era","Someone needs to educate r/NBA","THANKS OBAMA!!!","Pictures that make me puke, for $700 Alex.","Just a reminder that a person was investigated to find a crime rather than a crime investigated to find the person. Dangerous times we are living in","22 Islamic Compounds Exist in U.S. - THIS IS UNACCEPTABLE!","Really Fake News CNN — Trump Attacks ANTIFA Because It’s ‘Widely Perceived As ‘African-American’ Org","Over 90% of news coverage of GEOTUS is negative, but this just in: he's going to win by a landslide in 2020. Two scoops. Two womps. Two genders. TWO TERMS.","'We have a problem with political diversity': Facebook engineer reveals how colleagues 'attack – often in mobs – anyone who opposes left-leaning ideology', rip down Trump posters and silence criticism of Islam","Globalist Macron Vows to Kill Nationalism, While Italy’s Salvini Declares EU ‘Filth’","I gotta hand it to the left, their fear mongering is superb.","So much love. So much tolerance.","President Trump: \"Google, Twitter, Facebook 'better be careful'\"","Russian Collusion Investigation: It Was Hillary All Along","There Are Way Fewer School Shootings Than The Government Says — Only 11 Out Of 235 Reported Shootings from 2015 to 2016 Confirmed, 161 were errors and four were miscategorized incidents.","Parent of Victim at Parkland Shooting Demonized for Wearing a Trump Shirt *HIS RESPONSE","Progressive 17 year old attacks fellow classmate and teacher over MAGA Hat and she is now facing Battery Charges. Hopefully the DA goes through with them. She deserves to learn a lesson.","Amazing! Positive coverage in the usually cucked New Zealand media praising GEOTUS for halting South African land expropriations from white farmers. This is VERY unusual!","“Politifact thinks all Americans are complete gullible retards.” I rate this statement as: TRUE","Papa John's CEO jumps face first into regressive politics, it's a bold strategy cotton let's see if it pays off for him(the comments tell me no)","Republican NY Gov. Candidate Marc Molinaro calls out Andrew \"America Was Never Great\" Cuomo","Chinese company reportedly hacked Clinton's server, got copy of every email in real-time","Flip Flop","Weather forecast: Hot as Hell","CNN: AntiFa is widely perceived as an African-American organization.","South African politician Julius Malema: “We have not called for the killing of white people. At least for now. I can’t guarantee the future.”","Judge dismisses all charges against New Mexico compound suspects","ENLIST NOW AND DESTROY BUZZFEED ONCE AND FOR ALL","MEGA CUCK Fidel \"Little Potato\" Trudeau bends the knee to MAGA KING Donald J. \"Donald the Strong\" Trump","Congress Seeks to Question Nellie Ohr After Explosive Testimony by Bruce Ohr","STATEMENT FROM THE WHITE HOUSE: POTUS feels strongly that North Korea is under tremendous pressure from China because of our major trade disputes with the Chinese Government. At the same time, we also know that China is providing North Korea with considerable aid....","Based Hungary and Italy--Orban, Salvini Attack Globalist Macron as 'Leader of Pro-Migration Parties'","Mark Dice cracking up at Katie Tur and MSNBC trying to understand what the hell is going on 😂😂","Pence/Trump 2024","I know they'll delete my comment so I'll put this here for safe keeping","Katy Turd Mad Her Fake News Isn't Effecting Public Polling and Perception","Based Red Sox Player J.D. Martinez Stands Ground Against Liberals","Media says ‘Monkey this up’ is racist. It’s a reference to a 70s book, The Monkey Wrench Gang about protestors sabotaging machinery.","but spicy food bruh","In an effort to \"Katrina\" President Trump, they retroactively change the death toll from the 2017 Hurricane Maria from 64 to 2975.","FLORIDA: DeSantis got over 900k votes and over 56% of his party's vote. Gillum got over 500k votes and only 34% of his party's vote. Republicans overall outvoted Dems by well over 100k. Our second place guy got more votes than Gillum did. Now... DON'T BE COMPLACENT. VOTE IN NOVEMBER. But...","300 verified Twitter accounts promoting anti-white racism","Three Americans plus a wild POCAHONTAS","Escape from the evil empire!","Was looking through old memes, found this gem.","&gt;China revealed to have hacked Clinton's server, leading to the death of a dozen CIA sources &gt;headline: orange man bad","Ringleader of suspected Iranian sleeper cell identified","Any questions?","Well that didn’t take long...","Ron desantis being called racist for saying his opponent will “monkey things up” with socialist agenda","Student allegedly rips MAGA hat off classmate's head, slaps teacher, facing battery charges","I love it when patriots own the leftist invective and use against them!","DNC still denies stealing the nomination from Bernie, but they’ve just announced “historic reforms” to the nominating process so that what didn’t happen will never happen again. I wonder if they’ll let illegal immigrants vote in their primaries, too? 🤔","Don't you DARE call this a monkey wrench, racists!","WHAT THE LIVING FUCK: \"AntiFa is primarily an African American organization\" - Jeffry Toobin ((SPITS COFFEE OUT))","With Mitch McConnell’s Help, Trump Now Has 60 Confirmed Federal Judges","LeBron James: \"I'm Not Fucking with White People, That Was My Initial Thought to White America\"","Found a book for the violent left to start reading!!","Mattis: U.S. Will End Suspension of Military Drills on Korean Peninsula - “We took the step to suspend several of the largest military exercises as a good faith measure. We have no plans to suspend any more,” Mattis said at a press conference","Pocahontas on Mollie Tibbetts","This is John Pedo-esta. During the Clinton campaign he served as a freelance editor for NYTimes and WaPo writers who wanted him to make sure their pro-Clinton spin was fit for print. Journalism is dead, and he is an unindicted pedo.","Just like Netflix, Rotten Tomatoes changes review algorithm after being exposed...","\"Be nice to these people, we need to stay friends\" - Me three drinks later...","Conservative FaceBook Employees are Lawyering-Up to Fuck the Zuck—Good.","WTF!? Judge dismisses all charges against 3 'extremist Muslim' New Mexico compound suspects.","Love seeing my European brethren say no more to illegal aliens destroying their countries, better late than never.","DeSantis - Racist this morning, not this afternoon (screenshots from Bing search)","“Because you was lied to by google. You was lied to by mark zuckerberg” -Kanye the Great.","Can you fine Pedes help my hometown get the GEOTUS' attention? There is less than a month before the Atomic City's 75th anniversary is over.","Trump Rally - Thursday - Evansville Indiana","\"There is no past, only an ever-changing present in which 'The Party' is always right.\"","Twitter has Verified a member of ANTIFA. No, seriously.","Preach!","In an airport recently... I asked the guy on the ladder working above the ceiling tiles if that was intentional... he grinned and said, as long as I'm in charge, that dish will be aimed wrong... or until they stop playing fake news 24.7","Cenk Uygur Freak-Out Meltdown! That's BULLSHIT! You're a RACIST!","My Grandpa, a Marine. He gave those Norks hell. A LEGAL Italian immigrant who became a damn proud US citizen and US Marine. He passed away ~2 years ago. Semper Fi, Grandpa.","TRUMP CURSE: Dick's Sporting Goods anti gun policy backfires as growth &amp; income has STAGNATED (really bad for a stock)","When a headline tells you everything you need to know about a person’s character.....","Conservative Facebook employees are organizing to attack the liberal company's 'intolerant' culture","A federal appeals court unanimously decided Tuesday that printing “In God We Trust” on U.S. currency does not violate the First Amendment’s Establishment Clause, citing its longstanding and historical use, and noting that it is not “coercive.”","If the libs are correct.... This man deserves our thanks.","Sacre bleu! Napoleon syndrome: Macron Declares War on Salvini-Orban Bloc, ‘I Am Their Chief Adversary’","Add the 2026 World Cup to our long list of accomplishments!","Me walking into my political science class on the first day of school today","Red Sox star defends post: ‘Stand by 2nd Amendment’","Bikers for Trump. We have the best supporters. Full stop.","#walkaway","\"Student allegedly rips MAGA hat off classmate's head, slaps teacher, facing battery charges.\" Now if that DA will have the balls to formally charge her and set the precedence that this kind of crap isn't going to be tolerated anymore.","Lindsey Graham: \"I've Seen No Evidence\" Of Trump/Russia Collusion, But \"Tons\" Of Evidence Of Crimes Inside DOJ, FB","That time Acosta got slapped down on Immigration policy by Miller. OOOoooooFFFFFfffFF.","Surprise, surprise. Soros backs Gillum, Gillum wins the primary and r/Florida and city subs like r/Orlando all become mouthpieces for him","I am so sick of the worship of both of these treasonous snakes.","Theresa May goes full Justin Castro in South Africa. Never go full Justin Castro.","Social Media Speakers: Oversized &amp; Unplugged","THAT'S MY PRESIDENT! TRUMP WINS BIGLY! TWO MORE TRUMP ENDORSEMENTS WIN — That Makes President ‘9 for 9’ in Last Three Weeks!","What type of moron could look at both and choose Communism?","This should not be a surprise anyone!","The violent left: Trump Star Pickaxer: \"I would encourage anybody like minded or brave enough to go out there and make their voice heard, however they feel is right”...","More than 150 arrested in massive ICE raid in Texas","Harvey Weinstein Law Firm Gave Cuomo $25K Within Weeks Of Sex Probe Suspension","Proof Alexandria Ocasio-Cortez is secretly pro-tax cuts! Also, was well-off enough 6 years ago to blow money on office space while trying to write children’s books (Repost with fixed highlighted section)","Special Prosecutor Tapped by Sessions to Investigate FISA Abuses HAS NOT Interviewed Bruce Ohr","The Obamination: Team Obama Weaponized The IRS, The FBI, The NSA, The DOJ and Other Agencies Against American Citizens Deemed Political Opponents. American Citizens Were Treated By the US Government As Enemies Of the State. That's Tyranny.","\"extremely careless\"","A full blown clampdown on political freedom ahead of the midterms is underway, but all these Silicon Valley fucks will do is make the Underground Silent Majority more resilient, flexible, adaptive, angrier and likely to go the polls. Brace for a flood of salty tears.","Just because you’re offended, doesn’t mean it was meant to be offensive. Your parents should’ve taught you that saying, “sticks and stones may break my bones but names can never hurt me“ and then perhaps you won’t feel so victimized every time you hear something that you perceive to be offensive.","Don't post here as often as I used to do, but wanted to thank T_D and Donald Trump for teaching me to win!","Chinese Company Reportedly Hacked Every Clinton Email In Real ...","REVEALED: FBI Hero John Robertson Discovered Hillary Clinton Emails on Computer During Child Sex Investigation","It says we're moving on. It's MAGA now baby","Five midterm-election developments that aren’t getting much attention in the national media because they don’t fit the “blue wave” narrative.","Charles Ortel: Clinton Foundation Hasn't Had Proper Oversight For Almost 20 Years, Under Investigation Since 2016. [VIDEO]","All Charges Dropped Against Three Suspects In New Mexico ‘Jihadi’ Case","Just a picture of one of the biggest national security threats in US history","Democrat Abigail Spanberger Exposed for Ties to Terrorism-Linked Group","As Nasdaq passes 8,000 Google stops showing it when you search Nasdaq.","Google News Doing Their Part to Slander DeSantis Regarding His Innocent Remarks","Friendly reminder to switch to DuckDuckGo, because Google is so 1984.","Soros-Founded Hungarian University Stops Courses for Refugees and Asylum Seekers Due to New Tax Designed to Discourage Immigration","In English Town, 31 Muslims Charged With Sex Crimes Against Kids As Young As 12","GOP eyes another shot at ObamaCare repeal after McCain’s death","President Trump keeps winning! Signing Executive Order protecting Retirement.","\"Gladiator - What is Your Name?\" \"My name is Donald John Trump. Son to a beleaguered country, inheritor of a butchered economy, servant to a disenfranchised electorate, but we shall reap our Victory, in this term and the next.\"","2018 Body Count in Sadiq Khan’s London Reaches 100 (link in comments)","Box Office: Summer Movie Attendance Second Worst in 25 Years","Dem House candidate says she'll file Clarence Thomas impeachment resolution if elected","NORMAL PEOPLE VS. DEMENTED LEFTISTS","Legalize it","Going to my 2nd rally!!!","Don't buy the hype! they're coming for the Farms! First the guns then the genocide","James Woods Puts the Most Awful Gavin Newsom In His Place","This must piss racist liberals off so much 😂","California Lawmakers Pass Bill That Would Let Teachers, Employers, Co-Workers Ask Judges To Remove Guns From People They Deem Dangerous","While Top Story on Google News is that Google Isn't Rigged, Trump Renews Attack on Search Bias","TRIGGERED","\"No reason to suck at two things\" lololol","The Hillary Clinton subreddit is ripe with many perfectly aged posts","HAHAHA... Drumpf is surely done now!! No candidate he backs can win! Right?","Conservative employees at Facebook this week","Trump threatens action against Google for 'rigged' search results","CNN's Jeffrey Toobin Falsely Blames Antifa Violence on Black Americans","FBI agent says bureau leaked stories, then used them to get FISA warrants","Newly compiled research indicates a widely reported study claiming the US has huge share of world’s gun killings is wildly off base","These guys are one of the first bands I have ever heard call out the Muslim caliphate with such epic results. I'll comment the lyrics.","Bono has found what he's looking for","Saw this on the main page and it just reminded me how beautiful all cultures are. So much respect to not force her to be cooped up in a van.","Warning. This video Does contain violent actions. Afghan asylum seeker decides to show his host's some love for the generosity they've shown him. When will these politicians who have allowed these people in be punished for it?","I am falsely being accused of being a bot. Make MRSA Research Great Again is ex-military and has a lot of free time. Is solutions for the MRSA superbug more interesting than false allegations?","Lawmakers who questioned DOJ official Bruce Ohr on Aug. 28 say there are significant discrepancies between what they learned from Ohr and testimonies given by former FBI attorney Lisa Page and Fusion GPS co-founder Glenn Simpson, suggesting that at least one among them may have lied to Congress.","TEXANS!!! We need to stop this BETO creep...SOROS OWNS HIM!!!!!","Media had no problem with Trump when he seemed nothing more than a self-indulgent bad-boy playboy who cared only for himself. Started hating him when he revealed himself as something more: a patriot willing to fight &amp; sacrifice for America. Tells you everything you need to know about his critics.","We are living through one of the greatest tragedies in constitutional history in that a person was investigated in order to find a crime rather than a crime investigated to find a person. Flat out dangerous precedent.","Google CEO slammed by lawmakers for declining to testify at Senate hearing","Merkel must go!","So the Jacksonville shooter was able to exploit a loophole by lying. So we should pass a law to make lying illegal? How about making murder illegal? Oh right.","“Consumer confidence pops in August to highest level since October 2000”","Just some blatant racism hypocrisy in Marvel's Cloak and Dagger show..","Goxgle","Coming soon to Dollar Tree next to the $1 pregnancy tests","Flashback July 2018 - Majority Of Clinton Emails Funneled To \"Foreign Entity\"; When IG Told Strzok - He Completely Ignored","Here Are Horrifying Things The Media’s Not Showing You From Inside The New Mexico Terrorist Compound","VICE : \"We shouldn't demonize even people who have committed horrible crimes\" - These people are insane! Violent murderers ARE animals, and should be demonized.","Hi guyz! I’m Paul Ryan, do you know what I do all day?","We're trying to MAGA over here, Florida! You better not monkey it up!","Dicks Admits Corporate Gun Control Hurting Business | Breitbart","South Africa withdraws farmland redistribution bill","Democrats: Raping and Murdering Foreign Invaders are \"Otherwise Law Abiding\"","\"China, if you're listening, I hope you're able to find Hillary's 30,000 missing emails...\"","US. Customs and Border Protection officers seized more than 400 pounds of narcotics valued at over $1.6 million and arrested 10 wanted fugitives in San Diego and Imperial Valley counties over the past weekend.","Peter Thiel Prefers Trump's \"Rude\" Honesty To Other's \"Beautiful Lies\" About World Issues","Just an old picture of GEOTUS with his favorite middle eastern car","MFW you see a bunch of youngsters gearing up for the next meme war.","Petition demanding that Archbishop Wilton Gregory “remove priests who promote the LGBT agenda from public ministry,” and who continue what many priests and bishops say is a “homosexual culture” within the Church that is at the root of the lies and cover-up of the sexual abuse scandal","MSM seems to have Skipped this","Navy brings back legendary 2nd Fleet to counter rising Russian threat - The Russian military will hold massive exercises next month with the Chinese and Mongolian armies. [Obama shut the 2nd fleet down in 2011...lulz]","Congress Dems Desperate: Vote for Us and We'll Give You Your Precious Marijuanas!","Two Illegal Aliens Killed a Geman. Germans Went to the Street to Protest. Angela. Merkel Condemned Them for Perpetuating Hate.","As Land Confiscations Loom, South Africa Rules 300,000 Gun-Owners Turn Over Their Weapons","The choice is yours...","Judge dismisses New Mexico terrorism case after Prosecutors (deliberately?) miss deadline","Top Google News Story: CNN Claiming Google News Isn't 'Rigged'","As an eastern european/american pede- this is why I voted Trump! Honor and love your country and its values! MAGA/ MAKE EUROPE GREAT AGAIN","🎶Cause I know there'll be no McCain, here in Heaven🎶","California passes bill eliminating fossil fuels by the year 2045 - HAHAHAHAHA - WTF are we going to use, spotted owl eggshells?","Jeff Sessions 'Justice' Department is the Worst in History. They are United to Impeach a President","\"Monkey\" - verb, mon·keyed, mon·key·ing. Informal. To play or trifle idly; fool (often followed by around or with). A racist word according to those who associate black people with monkeys.","Trump warns of 'violence' if Republicans lose elections. \"You're one election away from losing everything you've got.\" If Democrats win, they \"will overturn everything that we've done and they'll do it quickly and violently.\" REGISTER! VOTE! GET OTHERS TO VOTE! GET THAT PERMIT! GO TO THE RANGE!","Elder Lansing BANNED by twitter: Another conservative Trump supporter SHUT DOWN.","I didn't even need to click on the article to guess it was Shep Smith. Why is he even on Fox News when he likely couldn't even hack it at CNN???","Add Blue Check Mark guy. He’s finding a ton of them. These people mostly white, and all want to destroy the white race.","“We are not the enemy of the people.”","As the midterms approach...","CNN just got caught in (another) lie","Pentagon whistleblower confirms - with document evidence - that Obama admin paid Stefan Halper to set up Carter Page, George Papadapolous, and Mike Flynn","Well, NPR Just Delivered A Headshot To The Anti-Gun Left's School Shooting Narrative","Totally organic not paid for protest outside my work","Poor Melania. Clearly a prisoner of evil Drumpf.","Libturd UNBRILLIANT Minds reference an example of the Liberal Echo Chamber Media to argue against the existence of Mostly Negative on Trump Liberal Echo Chamber Media.","FINALLY SOME SANITY: White Rutgers professor faces disciplinary action for racist rants against other white people","George Soros, Tom Steyer Spent Big for Socialist Andrew Gillum in Florida","TEXAS: Democratic Challenger declines debate against Ted Cruz, instead schedules appearance on The Ellen DeGeneres Show","Don't expect a blue wave with these finances. The Russia narrative isn't paying the bills.","UK supports South Africa murdering White Farmers/Boers and stealing their property","Pewdiepies subreddit maga friendly?","Virtue signaling gun-ban from Dick's Sporting Goods backfires gloriously. Shares PLUNGE after horrible second quarter results.","Seems like it's always Broward County","CNN Smears Mike Pence, Says He's a \"Christian Supremacist\" Eager to \"Impose Religion\" as President","\"Do not try and bend reality. That's impossible. Instead only try and realize the truth: There is no \"two parties.\" There's Just One UniParty. The Swampfucker Party.","The third meme war has begun! Enlist now!","The majority of Europe’s leaders being childless not only symbolizes the death of Europe, but it demonstrates how leaders, having no hope for the future, have set the stage for a Muslim takeover","NYT sickos! \"Want to Protect the Right to Abortion? Train More People to Perform Them\" By Jody Steinauer PRO MURDER","On my Companies Corporate computer. This was not blocked a few weeks ago. I guess they decided to jump on the censorship train!","Stunning Canadian Trade Reversal Now Seems Increasingly Likely – Nervous Freeland/Trudeau Trying to Position for Political Face Saving…","Iz U Lurning Mrs. Clinton master?","Stop scaring the little liberals. We're trying to blend in here comrade bots!","Liberals admit to being terrorists on r/politics.","Here Are Horrifying Things From The New Mexico Terrorist Compound: \"The seizure of a DVD that describes how to build an 'untraceable assault rifle' at home and a book on the psychology of combat, and the picture of a group bent on a terrorist attack.\" WTF FBI &amp; CNN ???","Uh-Oh, looks like a struck a nerve with the 'enlightened' over on Red@cted, they are now brigading my post here.","MSNBCLGBTQHIV Can't Believe Trump's Approval Rating Has Not Gone Down. Also, GEOTUS Tells GFT They Better Watch Their Asses","In case you’ve ever doubted your president, meet John Miller: Expert on Anon Sources","FBI: No evidence proving Hillary Clinton's email servers were compromised","TFW you are the richest cuck in the world and get scolded by a communist beaver lord.","Judge orders Syracuse to re-enroll fraternity students who were punished for satirical videos","CNN - Day, after day, story, after story, after story...","Getting downvoted for telling redacted you need a source to prove something is TRUE, not that something is FALSE. Not their best, folks.","So the pope stands accused of turning a blind eye to pedophilia and CNN describes the backlash as a COUP","South African Architecture","Our new Trade Deal with Mexico focuses on FARMERS, GROWTH for our country, tearing down TRADE BARRIERS, JOBS and having companies continue to POUR BACK INTO OUR COUNTRY. It will be a big hit!","Looks like Dick’s is going limp.","Nellie Ohr's HAM License","The abortion procedure as presented by Dr. Levatino","Damn! Somehow they know!","Dicks Sporting Goods Blames New Gun Policy For Weak Sales...","This is how we as a country, should treat our vets!","California votes to force companies to put women on boards","Am I the only person who doesn’t even remotely understand how this was being construed as a racist remark? 😣","Pro-abortion LGBT Groups Fight to Shut Down Faith-based Adoption Agencies","This is the tolerant opposition in which everyone seems to praise so much. I don’t know if it’s just a keyboard warrior or this is someone’s actual mindset, but nobody wants to refute logic with logic, only stupidity. I know you all aren’t racists, it’s just sad some people are so ignorant to truth!","Now accepted in New Mexico","Chelsea Handler Predicts Trump Jr Will ‘Flip On His Father’ — He Flips The Script On Her Instead","Everyday Is A Good Day!","#memetoo","Garbage spew like the is why you'll NEVER eclipse Jordan, LOSER.","My little MAGA","\"We Have a Problem With Political Diversity. We are a political monoculture that's intolerant of different views,\" says a senior engineer at Facebook.","RACE-BAITERS BTFO: Desantis reveals who he was really talking about when he said \"Monkey this up\"","L.A. Renames Rodeo Road (Not Rodeo Drive) 'Barack Obama Boulevard' Can I puke now??","THESE PEOPLE ARE FREAKING STUPID. They fell for the bait AGAIN and I think this was the easiest one yet. Of course it wasn't compromised. It wasn't hacked. ACCESS TO THE SERVER WAS GRANTED!!!","Fake News Punisher","DRAGON ENERGY: Thank You Kanye, Very Cool! 🐉","So how many of these stars is Hillary Clinton responsible for? These brave souls served our country until she sold them out for cash $$$","Teen Arrested After Fight Over MAGA Hat","Here is Rod Rosenstein Saying He Would Not Appoint a Special Counsel During His Confirmation (Skip to 2:28)","MSNBC Can't Believe It. Dice. ( 3 years now of it is beginning of the end )","China Hacked Hillary Clinton’s Private Email Server - Where's the special prosecutor now?","(T(H(I)C)C)","In Florida, this song is now racist","Yeah, you bet they did.","STATEMENT FROM THE WHITEHOUSE","Liberals gonna be all threat level midnight on this.","Hello I’m “Beto” O’Rourke and I approve this message:","Spoiled women of Iran and Saudi Arabia should learn what real sexist oppression and tyranny looks like...","About time","r/Politics right now","Bruce Ohr: FBI Knew About Bias Before Getting a FISA On Carter Page. FBI was aware that his wife worked for Fusion GPS, but failed to disclose that to FISC; aware of dossier author's bias, but failed to disclose that to the secret court as well.","I’m going to eat Mexican food and maybe have a margarita in honor of the new deal that Trump got for us. Thank you Mexico, we will take our jobs back now.","Schumer Troubled By Americans' Reliance On GDP As A Measure For How The Economy Is Performing Because It Doesn't Address 'Income Equality'....? [VIDEO]","Minnesota: Ex-Muslim arrested, handcuffed over Muslim's complaint -- \"Not permitted to discuss religion in the Mall of America\"","The faces when Pantifa is more white than the NRA(which is actually very diverse).","South Africa withdraws farmland redistribution bill after Trump tweet","Trump administration shortens family planning grants to Planned Parenthood, other groups","I found a guy who was attacking Trump supporters on reddit of all places!","🤔","Foreign-owned White City spaza shop looted by angry resident, images shared on social media of the situation include what appears to be the lifeless body of the teen","Heres hoping he’s in a cage, in hell, being poked with sticks","The Evolution of Fake News (Why Nobody Trusts the News Anymore)","HuffPost: 'White People Food' Is Creating An Unattainable Picture Of Health","On Dec 12, 2016 Josh Earnest Obama's Press Secretary says, “the intelligence community unanimously agreed “CHINA” was engaged in malicious cyber activity to destabilize our political system\". A fellow reporter says, “you mean Russia”!","Obama threatens to cancel visit to Denmark if his contract becomes public - and he charges AT LEAST 115K USD","Who did this? Can't wait until GEOTUS gets his own dollar bill.","WTF: NM Judge Dismisses Charges Against Most of the School-Shooting Camp Jihadis","Hi. I’m Glenn Greenwald, one of the last real journalists alive. When I criticized the NSA I was always on camera. When I criticize the MSM I become a ghost. Go figure.","FakeNewsCNN's Don Lemon Defends Antifa: 'No Organization Is Perfect'","Thank You, Tiger! Stay Strong.","Sununu wipes the floor with Fake News CNN's Camerota. He even manages to trigger her by using the word \"cleavage\" to explain The Fake News' agenda. Magnificent!","White Genocide Worldwide has been removed.","clinton supporter eating his boogers on election night","10 Times Google's Far-Left, Anti-Trump Bias Was Exposed","Kris Kobach: Trump's Trade Deal with Mexico Will 'Add Jobs' in Kansas","Anyone catch this? Bhuddist majority country rejecting refugees but gets censored by facebook as united nations reports hate speech","Steven Crowder is outside the White House right now doing another segment of “...Change my Mind.” The subject it “Trump is not a Fascist.”","StopTheBias (youtube link)","We're witnessing history... don't forget it.","Boy those search suggestions went from nasty to normal real quick","Hey yall, do yall remember when that dude painted cum on Obama's head?","A team of mostly foreign born players,playing a sport not of American origins, Still manage to stand for our national anthem! Shame on you NFL!!","Just gonna leave this here...","\"Australia issues notice of plan to ban whistle-blower Chelsea Manning.\" Let's hope New Zealand bans this traitorous dude too!","Bill OReilly: President Trump is getting a breather this week as many “anonymous sources” are on vacation. Also, their enablers in the press are off, so the hate-Trump machine is suppressed for a few days.","WTF - Hillary Clinton Email Server","The Left HEARTS Lawyer Talk","RUSSIAN VOTER FOR TRUMP","Uninformed and righteousness are a dangerous combination","When your dad is a total cuck","Fake News: CNN Refuses to Retract Debunked \"Bombshell\" Story - Sara A. Carter","Let's give some love to this based supplement merchant","President Trump Awards an Historic Number of DFC Grants to Prevent Youth Substance Use","Why CNN is standing by a Michael Cohen story that his lawyer calls false","Pope Starting To Suspect He Might Be Antichrist","I see through your identity politics.","Student Arrested After Stealing MAGA Donald Trump Hat in Classroom, Striking Teacher","South Africa Withdraws Expropriation of White-Owned Farms Bill After Trump Tweet - Geller Report","CALL TO ARMS: Sign up to volunteer and help your local candidate win in November!! 600k boots on the ground would create a LANDSLIDE victory. Let's MAGA.","Why Muslim countries aren't criticizing China Uighur repression","Trump: White House counsel Don McGahn to depart in the fall","Planned Parenthood Clinic Loses Its License Because It Can’t Find Anyone to Kill Babies in Abortions","The State of Socialist Media in the UK Today.","WINNING: Dick’s Says New Gun-Sales Policy Dragged on Results","Facebook Whistleblowers Alert the World to their Massive Internal Political Bias","THIS WEEK IN REVIEW","My beautiful, and straight, daughter's first day in college at a fine arts institution. Admins asked everyone for their preferred pronouns, showed video clip of how to handle a bad lesbian relationship, many students warned her not to use xer \"dead\" name.","Alex Jones is under constant threats and attacks","LOOK AT THIS SILLY MONKEY","Pepe on patrol","Two rapists walk into a bar and get away with it scott-free. Rules for thee, not for me.","Gingrich: Primaries have set stage for red wave in November","By May, Hurricane Maria Had Claimed 64 Puerto Rican Lives; In August It Was 1,400; Now It’s 3,000.","I smile at Senators and others talking about how good free trade is for the U.S. What they don’t say is that we lose Jobs and over 800 Billion Dollars a year on really dumb Trade Deals....and these same countries Tariff us to death. These lawmakers are just fine with this!","Planned Parenthood jokes about the heads being stuck and dismembering babies","When someone says the military is a socialist organization....","Iran's inflation up 191%. Ayatollah Ali Khamenei is DONE FOR.","FLASHBACK April 2016: IRS Admits It Encourages Illegals To Steal Social Security Numbers For Taxes","\"It Was All A Set-Up\" - Pentagon Whistleblower Exposes Russia Probe Reality","Saw this pile of garbage today","“Facebook will essentially have complete control of the topics and narratives that are fed to their users in a clear act of social engineering, which will give the social media giant—and their political/ideological allies—the ability to directly manipulate people’s perceptions of any event.”","THE MORE YOU KNOW: James Comey worked for HSBC which was responsible for managing the Clintons international donations in Haiti before being hired by Obama as the director of the FBI.","You can hate him, but no other human has BTFO of BLM to their faces than this man, absolute evisceration... look at their reactions.. THEY AGREE!!","George Soros, Tom Steyer Spent Big for Socialist Surprise Winner Andrew Gillum in Florida [I hope Trump administration investigate Soros Foundation. They can start with Soros influencing elections domestic and international etc]","REVISIT FBI agent Peter Strzok testimony admits everything about Bruce Ohr!!!","CNN’s Don Lemon Defends Violent Antifa: ‘No Organization Is Perfect’","Tucker Carlson Tackles South African Farm Murders And Land Appropriation Efforts - Liberal Heads Explode","Ron DeSantis' opponent in November haunted by city's corruption probe","CENSORSHIP EXPOSED: President Trump tweets video exposing Google bias against his State of the Union!","Dana Loesch with a TRUTH BOMB","New law to make California first state to end bail","So this is happening","This is why Newsweek is FAKE NEWS!!!","The Muslim Refugee Rape Epidemic: Coming to America? | Michelle Malkin I...","MAGA hump day; saddle up","Report: Facebook Fact Checkers Claim to Be Harassed","Watch: Top French EU Parliament Populist Praises Salvini, Trump on Migration","Bono is a Complete Idiot","California schoolgirl arrested in Trump hat classroom fracas","story after story after story after story after story after story","/Redacted ❄️ “Some speech certainly needs to be repressed, squashed...” Mental gymnastics gold medalist for claiming to be tolerant while also advocating for a fascist govt that suppresses speech through fear.","Rapper who threated to kill trump over food stamps is arrested for possession of stolen firearms","Left knocks Schumer over deal on judges ahead of Supreme Court battle","Google isn’t bias...here’s the proof?","The Florida Primaries were a big win for Trump, and he knows it.","Fake News CNN tried to shit on Trump. Got BTFO by Sununu. Bahahahahahaha","GREAT AGAIN: Trump’s Tariffs Bring 550 High-Paying Jobs Back to This Crippled Kentucky Town","If You Want To Know Why Conservatives Don't Trust Media, Watch CNN","Martha McSally, running in the Arizona Primary for U.S. Senate, was endorsed by rejected Senator Jeff Flake....and turned it down - a first! Now Martha, a great U.S. Military fighter jet pilot and highly respected member of Congress, WINS BIG. Congratulations, and on to November!","New Poll - A majority of Americans think that John Brennan and James Comey should have their Security Clearances Revoked. Not surprised! @FoxNews","MISSING CUCK ALERT: If you see this cuck, please call the the National Center for Missing Cucks at 1-800-MIA-CUCK.","What in the ACTUAL FUCK","4.2%","A Sweet Deal!","Ron DeSantis defeats establishment RINO Adam Putnam...","TRUMP ROBOT","“Chinese company reportedly hacked Clinton’s server got copy of every email in real time” - Fox News (today).","INITIAL CHARGES AGAINST ALL FIVE TAOS COMPOUND DEFENDANTS DISMISSED.","This is what the left has become.","Damn white ppl and their *shuffles cards* education!","LeBum James says President Trump does not give a fuck about black people while LeBum gets 100k gold plated crocodile skin sneakers just because he wears shorts and puts a round 🏀 into a round ⭕️","Back in February ⁦Andrew Gillum⁩ used EXACT SAME phrase as ⁦Ron DeSantis to describe a problem:","Trump Democrats in Pennsylvania Call Majority of CNN’s Own Coverage A “S...","Should we tell him that the shooter bought the guns in Maryland?","😍SO ENRICHED😍","We Have Everything","FBI IS DIRTY: ISSA says that Ohr described having multiple “handlers” at the FBI who received his info on Steele. “Quite a list of names,” he said. They Just Broke for Lunch.. Gowdy, when asked how long questioning will continue, deadpanned, “They’ll be out by Labor Day,”","Battle Hymn of The Autistics","OpenSoy developer virtue signalling by updating license to \"ban ICE collaborators\"","Why does the Left not see China as much a threat as Russia?","California gov candidate backs universal healthcare for undocumented immigrants","Marc Elias, Hillary's Fixer and Partner at Perkins Coie - was added to the Nunes list of names to be interviewed..","Livestream: Fantastic News! CNN Announces Infowars to be Reinstated to Facebook, Google, YouTube, Apple","CNN got something correct. That is the correct date","French Conservative Leader Adopts Anti-Mass Migration 'Populist' Stance","The EU is too white – and Brexit likely to make it worse, MEPs and staff say","CYNTHIA NIXON thinks a cold room is sexist. She’ll make a terrific leader of an entire state. Yup.","Donald Trump gives one of his best speeches in his campaign for the Presidential post 2016 ~ TRANSCRIPT OF SPEECH IN FIRST POST","Brett Connelly? Never heard of her","Barf! Can't wait for this traitor to be buried.","Canadian Man Becomes a Woman to Save Money on His Car Insurance","Even President Trump Is Aware Of The Civil Unrest That Is Brewing","Looks like the Left really wants to make \"Black Gollum\" happen. Send him back to Mordor, Make Arda Great Again!","Sorry fellow pedes, I've changed my position. It really is time to abolish ICE...","A new study has found that strong global climate action would cause far more hunger and food insecurity than climate change itself:","The state of the left. Ol’ dude here insinuating supporters of Trump agree on every issue. Very hypocritical and weak.","Judge dismisses charges against 3 suspects in NM compound case","IF HE IS AN AUTHORITARIAN, DO YOU THINK WIKIPEDIA CAN PUBLISH THIS SHIT? AND THEY DON’T ALLOW EDIT AFTER THEY SMEARED HIM. FUCK WIKIPEDIA","Hungary: Soros University Suspends Programmes for Migrants","Sessions: From Day One, Trump's DOJ Has Focused On \"Dismantling Transnational Criminal Organizations\" | \"These institutions, these organizations, these cartels... are so powerful and so wealthy... that they threaten the very sovereignty of nation-states.\"","Daily Reminder","EATING THEIR OWN: Sparking More Calls for His Ouster, 'Utterly Useless' Chuck Schumer Cuts Deal With McConnell to Fast-Track 7 Trump Judges","I CALLED IT!!! MARVEL BTFO","NYCFC show respect for Police And Firemen of New York City.","2 Scoops 2 Coins 2 Terms","Democrats and CNN demonstrating the shear weight of the allegations against Trump.","WTF our Justice Department is messed up Judge dismisses all charges against 3 'extremist Muslim' New Mexico compound suspects","Why Hasn't U.S. Attorney John Huber Talked to Bruce Ohr Yet?","What MAGA means to me","Ending Racism by Ending Race","Coming Soon: Very Expensive Taxpayer Funded Healthcare For Illegal Aliens in California","Real Journalism","a bit of beauty in this world of crude","I wonder who else gets a “without citing evidence” it’s like they hate reporting news that doesn’t go along with their narrative...","...differences, they will be resolved in time by President Trump and China’s great President Xi Jinping. Their relationship and bond remain very strong.","Florida Dem who scored upset primary victory haunted by city's corruption probe.","London: Record number of Brits selling their homes in London and moving north. What could possibly be driving this trend?","Thanks Reddit","How long will the media stay silent?","\"I have one power. I never give up.\" - President Donald Trump","ICE Raids Texas Factory, Detains 160 Illegal Migrants","RIP: Fellow pedes, we lost an exceptional top-tier shitposter &amp; PEDE due to an accidental opioid overdose Monday - send prayers to his family please","CNN is getting ridiculous, argues that \"In Iran, 'death to America' doesn't always mean what it seems\"","Rotten Tomatoes To Diversify Their Reviews In Response Of Being ‘Too Male, Too White’","The entire US clandestine network in China was assassinated while Hillary's server was being hacked by Chinese.","Dick's Sporting Goods plunges after saying it saw 'significant declines in Under Armour sales' (DKS) | Markets Insider","That will tell em!!!!","SEARCH THIS! \"the tea party is the american taliban\"","CNN Analyst Says It's Racist to Criticize Antifa Because They're an ...","With all this talk about Google messing with search results, I want to remind everyone about their take on Abe Lincoln's party.","US Steel and EPA agree to $75M cleanup and restoration project in Minnesota!","OH SHIT: South Africa BASTARDS Rule 300,000 Gun-Owners Must Turn Over Their Weapons – GEARING UP FOR MASS SLAUGHTER OF WHITES &amp; LOOKING FOR EXCUSES TO MURDER THEM. WAR IMMINENT. ☭","Owners of Miami Pain Management Clinic Plead Guilty to Conspiracy to Distribute Medically Unnecessary Opioid Prescriptions","It's Happening Fellow Pedes.","Bruce Ohr or Lisa Paige has committed perjury.","Ohr speaks! (Behind closed doors)","DeSantis \"Monkey this up\" ..... VERBS ARE RACIST!","In over 500 posts on r/all, this is the only thread from T_D","Dave Smith ridiculing John Brennan's interview With Bill Maher","MLB star slugger stands by Hitler post, says he was supporting 2nd Amendment","Hahahahaha! Pending Court Decision in 60 Year Old Murder Case Case Could Block Mueller From Releasing His Report","Bahahahaha","Hi I'm ESPN's Max Kellerman, I got angry at Tiger Woods for refusing to attack the President because I believe Black people should think and act a certain way.","Senator Fraser Anning's Mission to Save Australia","Hey folks, can you do your thing. https://twitter.com/amyjamicowan/status/1034581832719773696?s=21","Prager says it best - Politics is the left's new religion","China spygate is only the beginning🇨🇳🇨🇳🇨🇳🇨🇳","\"Gays Against Sharia\" Group Considered \"Far Right\" By British MP #ThisIsEngland #TommyRobinson","Captcha","When you're a tech giant so you think you can get away with whatever you want, but the greatest president of all time is about to whoop dat ass","A Message From Ben Garrison","Christopher Steele Worked For Sanctioned Russian Oligarch- Oleg Deripaska While Composing Sham Dossier: Solomon","What Happened on Barnes and Noble","2016 study shows gun related deaths come in at less than half a percent Globally.","Haley on Countries That Oppose US at the UN: ‘Why Should We Give Them a Single Penny?’","Did God hack the election?","July 6, 2016 NYTimes Hillary Clinton’s Email Was Probably Hacked, Experts Say","This aged well","When POTUS gives the Stand-Too order","BWAHAHAHAHA! Blue wave is turning to a puff of smoke.","WSJ: Five Republican Senators Met With Sessions, Urged Him Not to Quit","DICK'S Blames New Gun Policy For Weak Sales","Taco Tibbetts edition","President Trump on CNN, 8 YEARS AGO: \"China thinks we are dumb SOBs\"","Conservative Facebook employees are fighting back.","The DNC is a SHIT HOLE!","University of Kansas Offers 'Positive Masculinity' Workshop","Carl Bernstein, Jim Sciutto Defend Botched CNN Report: 'We Stand ...","Funny how much change can come about from a tweet... fuckyou google","Trump 101: Say something they can REEE about, and all they'll talk about is you for the next news cycle :)","This paragraph in my econ textbook about Venezuela.....","This is CNN.","In honor of Mollie","How Social Justice Warriors React When Trump Brings Jobs To America.","He can’t even get his story straight...","CNN primetime ratings tumble behind Ancient Aliens. Ironic that they were beat out by a show about conspiracy theories. The Collapsing New Nutwork has also been beat out by Sponge Bob, Shark Week and The Food Channel","STOCK MARKET HITTING ALL TIME HIGH IS SPAM ACCORDING TO FB. CUCKS","Lawmaker Warns: Arrest of Iranian Spies in U.S. Just ‘Tip of the Iceberg’","3 Problems With NYT Story About How FBI's Trump Informant Was Outed","Pepe found in Pompeii!!! Even Mt Vesuvius can’t keep him down!","....results on “Trump News” are from National Left-Wing Media, very dangerous. Google &amp; others are suppressing voices of Conservatives and hiding information and news that is good. They are controlling what we can &amp; cannot see. This is a very serious situation-will be addressed!","In 2011, Hillary Clinton was having trouble with her unsecure, private email system. She joked with a State Department staffer that it \"Must be the Chinese!\" hacking her","Florida 7th congressional district was won in vote totals by Republicans. This district currently has a Democrat as it's incumbent and was not on any pollsters radar to flip. Make it happen pedes. Vote Mike Miller in November! Every house seat counts this year","A black socialist and a Yale and Harvard educated Navy SEAL war hero win Florida governor primaries FIFY","Today is my one year anniversary here at T_D and for Reddit","BREAKING: Ron DeSantis Involved In Production of Racist Air Bud movie Monkey Up? Next on CNN!","Starting Online College... First Post I see... FML","Due process is the legal requirement that the state must respect all legal rights that are owed to a person.","A former engineer for jet engine maker Pratt &amp; Whitney has filed a federal false claims lawsuit alleging the company knowingly sold \"flawed\" engines to the U.S. Air Force, which resulted in the likelihood of premature wear or even \"catastrophic failure.\"","Thanks Trump!","Republicans find conflicts in Bruce Ohr's closed-door testimony","FAKE NEWS MEDIA !!! NEVER FORGET! I Believed their bullshit and didn't vote.","Buzzfeed, With Nearly $500M In Funding, Asks For Contributions","Putin helped to elect Trump so he would sanction Russia and have American economy booming. This makes total sense to democrats and MSM. Let that sink in.","What Happened To The DNC Investigation Of Keith Ellison’s Alleged Domestic Abuse?","SHOCK POLLS! Trump’s Approval INCREASES After Media Bombardment!!!","Moron Trudeau is building new housing in Canada, with his own hands. As you can see, he hopes that what he is constructing will make housing affordable. Old stock Canadians can't afford to stay in cities, their children will never be able to buy a home, due to legal mass immigration.","Knees weak arms are heavy, muh legacy in tatters already mom's spaghetti","Trump has changed the game. We are seeing shitposting on twitter never thought possible. Gaetz drops the hammer!","Another case of Assault against someone wearing a MAGA Hat","Don't be shy ladypedes.","Wise words from Davy Crockett","I did this in 2011 ... no benefit in giving the rights of your most personal information to a for profit right-bashing platform monetising your data. If you want to connect with people CALL THEM, and MEET THEM in PERSON. fuck.","Firearm Discharged up to Every Six Hours in Gun-Free London. Londonistan is very safe!","South Florida pede checking in","Young, articulate defenders of conservatism are integral to expanding the base. Also, Candace is great at common sense reasons she supports POTUS.","Graham's Trumplove Tour Continues. Word On The Street In DC Is That He Wants Sessions Job.","Knock off your B.S. Montel","She looks like she just escaped from a turn of the century asylum.","Nolte: Half-MastGate Is Why America Hates the Media | Breitbart","AG Sessions meets with JTTF drug smuggling goons! Claims most overdoses due to illegal drugs from overseas giving a big pass to Big Pharma!","Isn't it interesting that only Democrats hear these racist dog-whistles? They F'd up and are desperate.","Please show some support for based Mark Dice before YouTube begins to censor him as well as other conservatives.","The Social Media Purge of Conservatives is a Giant Election Meddling Scheme","Just needs a few minarets","Neither one of us have even bothered to speak with Bruce Ohr. You know, the high ranking DOJ official who was the conduit between Fusion GPS, Glenn Simpson, Christopher Steele and the FBI. Silent executioner my ass","\"When you are Obama and you said on tv that US economy cannot grow further and if Trump has a magic wand to create jobs but then your voters credits you for job growth and economic strength under President Trump. You are like WTheck\"","HO LEE FUK!! Watch it take off!","I found a picture of the captain for Team USA's soccer team for the 2026 world cup!","The hypocrisy is real..","Andrew Gillum, Democratic candidate for governor of Florida, was unable to raise funds like his peers. Tom Steyr and George $oro$ stepped in and footed the bill. Their message is clear: It doesn’t matter the content of your character, only the color of your skin. They actually believe this. Sad!","Soros donated $250,000 to Democrat nominee Andrew Gillum, for Florida Governor in January. The election is now Trump vs Soros","The failing NFL is now paying Aaron Rodgers $33,500,000 guaranteed money. He's arrogant and injury prone. Go Packers! (not) In the meantime, fake black guy is still shilling for Kaepernick, who became useless as a QB.","Catholic leaders call on Pope Francis to resign","Atlanta School Replaces Pledge of Allegiance With Oath To Global Society!!","Cuomo received donation from Weinstein law firm before halting probe into his case","Big Man Tyrone and The Golden One Have An Important Message. No Porn","Oops! Perhaps the 2nd Anendment was more important than virtue signalling?","Napoleon Macron Declares War on Salvini-Orban Bloc, ‘I Am Their Chief Adversary’ Old Jupiter Better Remember Arthur Wellesly Soundly Beat the French Army in Spain Leading Up to Bonaparte's Exile!","Rent free.","The Left is Eating its Own","This just says it all...","Even if Trump Goes on a Firing Spree, Mueller Has a Secret ‘Parachute,’ Expert Claims","Clinton Foundation Linked to Red Dawn type of Event","Man your meme cannons, boys and girls. We have our marching orders from GEOTUS. On this day we post all of the ways google censors conservatives and we litter the front page with them. I am but one poster, but together we are a mighty faggot.","ARE EMAIL PROVIDERS ALSO COMPLICIT IN LIBERAL SOCIAL ENGINEERING BIAS?","What Blue Wave? - The Rush Limbaugh Show","DICKS IS COLLAPSING! IF YOUR GUNS ARE SO LOW MARGIN WHY DID YOU MISS BY A HUGE MARGIN, MORONS? WOMP WOMP 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣","The Saint versus Gollum. Soros's wrath will be terrible, his retribution swift. The battle for the White House is over. The battle for Florida is about to begin."]