["Shortest MIL Stories Megathread","A Post Covering: Mod PMs, OPs Don't JADE, Keyboard Diagnoses, and Llama-Centric Megathreads","Lardo and the Stolen Wedding Ring","Update: After 10 years, I've been tagged in.","Their biggest mistake","Princess Tantrum and how she can tell if something is real or counterfeit (Spoiler alert: she can't)","My FMIL is the archetypal helicopter mom who loves to play the hero at my expense - too bad her son doesn’t play those games","Nightshade and the CPS ordered visit","I’m so tired of hearing about drizellas dress for my wedding","My mother in law wore white to my wedding.","Ziploc Bandit wanting to do care during hospital admissions and Update","I can send a cease and desist to an eighty year old woman right?","An update, some validation, and a teensy bit more mental abuse (I think!) What a day! [Registered Carer]","Update to MIL wanting to move closer! Just a little llama nibble.","Evil does die, eventually.","Kanye Worst - Kids Take Care of Themselves, Right?","Blast from the Past; Mental Granny finds out I’m pregnant with DS.","Beach Bitch sicked her husband on me, DH seems to agree with them. Advice needed","The time that I had to admit I was abused.","Mom and the Cancer Capers","Part 2- My therapist supposedly attacks her","We had ONE boundary, damn it","MIL hides the truth","The Story Continues RE: Shit Creek and Her FMs","Mom is... actually going to respect my boundary?","That time my MIL hijacked our road trip and accused me of being a drug addict (Part 1)","Don't cuss it isn't ladylike.[current day with JNGM]","The Senate and The Check","Shit Creek, the whole story to now.","If you see something, say something","T-Rex and how to behave like a total ass at a funeral","St. Stalker is back, y'all","JNMILITW: Causing Insurance issues and potential fraud","Ansel still gets her photo of LO...","Alright y’all, buckle up... For a wedding with three narcs","On the road again","Introducing Weird, Bitchy and Hurtful (WB&amp;H) in \"F*ck You, You F*cking B!tch\"","Marla Hooch-Alternate medicine","Pint size VS birthday dinner","Going no contact","PlantageNOT and the day I found out ALL the backstory (this is where it gets dark, ya'll)","Language Barrier is at it again","Short Diabitch Update: The Photos of the Party She Wasn't Invited to","Godlizza doesn’t understand how police work.","So it begins...pre wedding MIL drama","After 10 years, I've been tagged in.","I should be happy MIL doesnt want to spend the weekend with us, yet here i am..","Let’s take a trip back to the first time I stood up to MIL","MIL (51f) decided she needs her son (27m), my (25f) fiance, during vacation","my (26/F) bf's (27/M) mom wants him to finance her bad choices.","Playing the Long Game","A bit lighthearted: My JYmum's little victory after BEC for twenty years from her MIL.","Saint Shitty and the event that started it all...","funny story about my exJNMIL","Carrie and FIL buy a vacation home. Carrie is upset we don’t drop everything to go see new house.","9. Hot Soup of Negative Emotions","When I Acted Worse than Emily Post (Part 1)","Lardo Sent DH a Letter","Update: Extended Stay is looking for a place… IN THE SAME BUILDING?? Also my mother is being… well, my mother.","Follow up on the post about my mom trying to destroy my marriage, or how my mom wore white to my wedding","Mother Dickens will have a conniption over a name. Again.","Pretty positive FMIL is a “vulnerable narcissist.” Do I tell FDH?","Help with boundaries","“Make his plate”","UPDATE: Boyfriend In Hospital","Clutchy Episode 4: My Animals (TW: Almost Animal Cruelty)","Cringey and FIL just told us they’re coming to visit....for two months","Time to start unpacking this tangled mess...","NeverHappy incapable of appreciating anything I do","Blue Grandma and her racism","Posted in Parenting and someone suggested I post here...Am I a terrible person?","Reestablishing the Exclusion Zone","MIL has her sister over for lunch in OUR home while babysitting... Didn't clear this with DH or I.","Brood parasite is late yet again.","How to un-salt the earth?","Its a trap!!!","Christmases with the Wedding Skipper (Super long post! Sorry!)","What Shitty/Weird Gifts Have You Been Given? And Mil is Ahab.","Creeper and Chanukah/Christmas","My dad says my MIL suffers from \"nobody's good enough for my baby\" syndrome, and I'm starting to agree. I feel like no matter how much I do for my partner, MIL isn't happy with me.","Narcissistic Nut bag says she has an attorney","JNMILITW: \"It's my baaaaaaaby's first day of school!\"","How do I protect SO from MIL at memorial service for grandpa plus conspiracy theory","Weird shit my MIL says","Keep dreaming POSH","I’m going to call my mom post partum rant because of how she acted after my DD was born. I had agreed to visit her this week but find that my anxiety is too bad. How do I cancel? I don’t want to mess up my brother’s visit any more than I can help. And how do I handle the fallout? I’m so anxious!","The Wraith steals a little girl from her father","Our first unsolicited gift","“my baby is growing up i’m so proud of him”","Coming to terms with my mom","The Blackguard vs Board Games (TW: Miscarriage)","The Queen of Bitchlandia's end and something a bit different from the past.","Beelzebaby and snake oil","The boundary stomping continues....","My MIL and the wedding show","This Group Has Opened My Eyes to the World of JNMILs","The time Neckromancer threatened suicide","Is This Stupid Wedding Over? BEC/possibly needing advice?","Update on dinner and a little drama snack","Hoarding MIL driving me crazy","Giving Dubiously Delusional Autism Ground Rules?","It’s BCE’s birthday and I just need to vent","GM now blackmailing uncle to borrow money for mom's health insurance with no strings attached","DS is a clone of SIL apparently","Looks like I've finally arrived at my moment of Reckoning.","SuccubusJezebel AGAIN!!","Part 1- why my therapist decided to have her come in","Update: A mothers caring text from Greige (LOL not...)","Daily little dramas","Just a ramble","The Time My Actual MIL Tried to Reel In the Umbilical and Won a Temporary Victory","Breaking the justno circle","The Goa’uld in “ I have medical proof that she’s unfaithful to you! ”","Asian mom / part 2","Hoping Whiny Wanda Cancels *fingers crossed*","I have a name for mom and a short llama snack","An introduction to my Mom","Financial abuse at the hands of my own mother?","Need help with being done.","JNStepMom murdered my brother and my dad rugswept the whole thing","So I just figured out that my mother has been actively trying to ruin my marriage for years","How to bring up in therapy","Mrs Tweedy's birthday bitchery - update","Weepy McSweepy is... being reasonable?","How Princess Tantrum fucked herself over, multiple times, in a manner of weeks","\"Countess Bathory\" is a racist, is in love with her son and sees me as \"the other woman\".","Lardo gives out DH's number to other women in attempt to break us up","Trunchbitch wants me to abort.","Mother doesn’t stop","Update to: [33m] My Wife [30f] and Mother [60f] Hate Each Other","The Ol’ Grandparents Rights Threat","PlantageNOT and the War of the Roses: Redneck Edition (aka all aboard the Crazy Train)","Ughhh","Update: That time she replaced my ziploc bags","We evicted my MIL from our house but she won't leave","Extended Stay: We told her and my mom that we're getting married, + some BEC","Cersei Bannister and the never ending food delivery service...","Mom says I owe her $400, legally, do I have to pay?","MIL arranged a family dinner to announce our pregnancy... without inviting us.","Entitled GMIL &amp; the baby shower, plus bonus nuggets for the llamas.","Linduhh wants to begin the healing process. Part 1.5","Part two: the confrontation and tackled by police.","FMIL Threatening to Not Come","ASS loved to torture me with the fact that DH had a short fling with their neighbor...the very beautiful neighbor who was 4 years older than he was (and who she despised when they were growing up).","WitchBitch claims she’s over her alcohol issues (spoiler alert: she’s not) [and a little update]","I was wrong, she proved me so with the entire wedding. Pre wedding/wedding related.","General Mee NEEDS her estranged cousins to be invited to our wedding or she WON'T TALK TO US","In which FGMIL tells FDH's entire extended family we secretly had a baby","Clutchy Llama Snack: Carrot Cake","Grandmother in law goes full JustNo. The racist bat.","The Hair Jar","Act Like You Love Her!","I (48F) have not spoken to my boundary-stomping mom (65F) in weeks","Marla Hooch-Medical Update a play","Last Year's birthday card from Mum. Words failed me then; they fail me now. [Registered Carer]","When Narcferatu tried to guilt me out of a gift... Or, When Vampires Want Jewelry","BEC FDHs Birthday Pt. 2","Sometimes I want to ice pick myself in the head.","Tentatively asking for advice, wont be disappointed if I don't get any, because this is not something I want to deal with.","Having a baby, MIL is on the warpath","Introducing the Sea Hag","Real subtle digs from my mil","I despise my “MIl”","MIL talking about me on social media","Squonk crops me out of pictures and other fun stuff.","I have no catchy title. My mother relapsed again, and I’m sick to death of her shit.","\"I think my mom might be a narcissist\" says DH","Bumble is an insensitive cow. [TW: animal death]","The Squatter, Christmas and how the dog is clearly more important","My mom can’t keep her spine shiny long enough (re: Blue Grandma) I’m so angry and frustrated","T-Rex and the hospice blow up","Epiphany about MIL","Black sheep","Whoop-de-do! It’s MIL’s Birthday","Finally admitting I've got a JNMom.","GM pissed I am \"wasting $100k\" (a phantom number they didn't pay) by refusing to finish my education in my home state","Drunkasaurus Rex and why FDW can't handle grocery shopping.","Negbert in “oh that’s nice but...”","Shasha Yaga mini stories","There's never a way to win and it's getting to me. I'm trapped until May.","I do not exist according to my MIL","One month of no Atila.","A mothers caring text from Greige (LOL not...)","Intro to my husband's MIL (AKA my own mother)","Catsitting: a suprise visitor","Advice please! Letter sign off for NC mother?","MIL pretends she is on her deathbed for GC's benefit, she's fine for everyone else","That time I tried to set boundaries regarding my debit card","It is not one grand episode I can wrap into a nice rant-post. No. My MIL just breaks my spirit and heart daily. My SO's worst qualities are directly inherited from her. He fights them, but all too often loses the battle. Is this all worth it? It is still early enough that I can walk.","My Mom Screamed At Me, At A Funeral (Long- Advice Needed)","The ILs Demand my Bank Statements: an intro to my exMIL's \"forgetfulness\"","Republimom in the ER","Boyfriend In Hospital","Gabhead's chihuahua just bit me twice for no reason. Her reaction? \"No he didn't!\"","The time my religious JNMom found out I had sex before marriage","Loveboming 2.0","We were blindsided","How my Great Grandma treated my JustYes Mother","She \"lost\" her hat","MIL you’re clearly too decrepit to babysit","I CANT STAND THIS SITUATION NOMORE ' MOTHER IN LAW' PLZ HELP","MIL and the War of the Roses: Redneck Edition (aka my MIL Strikes Back)","Introducing you to Carol: My JustNo Mother.","I just took a trip to NJ with my Mom and holy shit.","Please help me decipher this text from maybe EX JNMIL","The War Against Cobra: First Victory(?)","How to actually enjoy my wedding with a JNo Mom?","Poly invites herself on her exhusband's vacation.","Evil Lizard Queen...Public Pool","A weekend with toddler mom","SIL pre-baby shower party and blueberries","Why does she do this?","Just got back from ‘vacation’ with the in laws and they’re already up our ass about seeing our son!","Clutchy Llama Snack: My migraines.","Why do I feel guilty?","UPDATE: War Dialer demands we ignore a dying relative's wishes so she can micromanage the hospital and \"be included.\" Commence bridge burning and more sneaky tactics from War Dialer.","“I am going to buy it, yes I am!” (Short BEC)","Yoni Berra, One Year After LC, And The Hits Keep Coming","Second day of planning our elope and we already have to change plans thanks to Extended Stay. Anyone surprised? I'm not. FDH (kinda) is.","QOGT's scammer never showed","GMIL and the Yogurt.","JNMom visit snacks","JNGrandmother literally said \"BORING\" about her great grandchild...","We made it, y’all!!","My mom spent 27k of child support I didn't know existed on extravagant glass dildos","The Nose holds me underwater and somehow she is the victim","The weekend from Hell- an introduction","When JNOgma took my bed away","Crouching Tiger Hidden Dragon had a meltdown when we said no to being B1’s caretaker","Diaper Genie needs to cool it on the nose wiping (BEC?)","Forgetful Fiona Strikes Again","Inappropriate conversation. TW: Suicidal ideation","Cutting MIL from my child’s life","Twin Terrors MIL Acts Like a Toddler, Is Anyone Surprised??","Reaching the end of my rope after visiting Mum this afternoon! I am done! [Registered Carer]","The awful airport ride, featuring the selfie and the self-righteous attitude","Progress?","BrokeSnob in the 4th of July fiasco and the overnight stay act 2.","I told my mom not to come to my wedding.","My mum just chose an abuser over her own children.","The Blue Grandma and her hoard","39 weeks, labor pains and no boundaries","Mom incident","Aliens invading","*Sigh* As if I needed further confirmation... We've got a full Justno over here","The Notary and Therapy","CopyCatty. Ugh. BEC? Also an update","Is this just bad communication? Or is she being manipulative?","How to tell if a maternal figure is Just No","The time Photo Loco asked my kids if I was eating","Fireball is, well, insane. Let me tell you some old stories. Episode 1(long, but worth it)","Looking for advice to MIL’s passive aggression","Let me introduce my family to you all...","I must hate her cause she can’t stay at my house","Tamster playing favorites and just being a catty ol’ dick.","Moby Prick... Was NICE?!","Past Snack of JYM, JNMIL","A little bit of venting about ShaSha Yaga","JNMILTW: Hospital edition","T-Rex and the twin beds","JNMILITW: Summer at the Library Edition","I know I shouldn't feel bad, but I do.","Sometimes I wonder if my mom is JustNo, or if I'm just an ungrateful daughter.","What is this even about?","Is MIL threats real or just scare tactics?","She wrote a letter to my in-laws.","Nightmares","JNMIL IN THE WILD: No Wedding For You","My MIL and The War of the Roses: Redneck Edition","Wedding Planning with Lardo","Episode 3: The Wedding","JNMIL in the wild: Mommy doesn't want you. Grandma does.","Introducing Smearhappy Sourpus. Advice, please *long*","Queen Gordon Ramsay and my ink","\"I didn't raise you to be so materialistic. I guess family means nothing to you.\"","Test Results for MIL Came Back and...","MIL going nuts on our wedding yesterday - i regret that we invited her.","I try and regret. SO went all toldyaso about his own mom (Live)","Mom Volunteered Me for Church Event (I Don't Even Go There) - Why Did I Do This???","Vodka Priestess is gone","Husband's Spine SHINIER Than Thought! (LONG)","In-laws think I'm beating my wife because of a misunderstanding","YearOfTheDragon is determined to hang onto her attention. And my last troll wasn't such a troll after all.","Fresh llama feed: \"You're sleeping because of med changes so you're unreliable and have to move into the unfinished basement\" and other anecdotes","Extended Stay said she'll leave when we get married… so we decide to do it. Update and advice on handling my mom?","MIL Bonds with My Baby &amp; Family Ignores Me Post Birth: My Shit Show Delivery Part 2","Reposted from JustNoFamily — Mom went off on my after DD was born Pt 2. Link to Pt1 in post","Ohnatural and essential oils","I just offended The Perfect Mother over Peaches","Blue Grandma and my last straw","Blendergate: A tale of pettiness from ChickenLady, featuring my JNMom Downtrodden Donna","My mother, The Wraith","I was reminded about something my own mother does reading a story on here.","Morbid Maribel and Why She Thinks I Beat My Husband","I'm finally away from my BDP mother, thanks to my SO, but now I'm worried about mu brother.","Übermutter and her BF‘s dead wife","S.O.U.S. wants to be called Grandma","These shorts you guys","Reformed DH it can happen","Mil lying about weight loss for semi mlm","Storms here update","My mom and my wedding","Future in laws seem to be TRYING to make planning the wedding more difficult for no know reason","JNMOM tried to strangle me but she’s still the victim somehow","Shes coming","OMG its like saying Beatlejuice three times","Something Funny, and NC Reflection (Long)","Baby-talking b*tches","Lady Succubitch and Summer Camp","JNMIL insists I “must have triggered” JNBIL into cussing me out in my bedroom in front of my young kids","A Shoutout of everyone here","Birth of DS - part one","A very short one for all of you...","Small realizations, and other musings related to Hurricane Guilt Trip","Every time we get together I have to prep myself for at least a day","(33F) My MIL (58) fed my vegetarian child (5F) meat. Advice?","T-Rex and the surgery","Susie and toys being taken away.","DH has a lovely spine!","Cake Boss in \"Thanksgiving is ruined\"","Small Update: 8 Months Pregnant And Having Trouble Enforcing Boundaries With My Mom.","Chick-MIL-A confirms that I'm her golden child, had a heart attack and is dying of cancer (spoiler: she didn't and she isn't)","My JNmom threatens to move into my home.","Haole Hattie sent a package, and an update from Hawaii.","Mall Bitch refused to tell us which hospital fh's grandpa was having heart surgery in","SadTacos and my new fur baby, a work in progress","1/2 a day in","Why Twategraph was trying to apologize","My Mother does not remember what I own in my garage.","Extended Stay: \"I'll move when you two get married\"","Help needed!","MIL is in a Cult","MIL hoarding my child","Giada is racist.","Scented Tampon Lady versus The Three Gooses.","JUSTNOmom is insistent on being in the room when I deliver my firstborn. A rant/plea for advice (x-post from r/raisedbynarcissists)","They ask for an inch, you give an inch, then they sense weakness and suddenly want the mile.","Thanks, but no thanks MIL","The Smoking Sadist: Sure, my son/your husband is dying, but your house is a hotel, right?","Update to Lulu Lemon tries to sell Middle Sister an overpriced house","The Queen of Bitchlandia and just a whole mess of shit","Punkin just sent me a special poem","Small victory...but for how long?","BEC FDH's Birthday","Introducing...Looney Toon!","The time my mother met my husband and almost drove my car under a semi","How my mom ruined my anniversary","UPDATE: My future MIL wants to \"say something\" at our wedding","QGR and the job hunt","\"Soon it will be your turn to not mind your own business with your child, just like I am doing right now\" and the september visit issue","Had to drop NC with VodkaMIL for JustYesFIL’s memorial this weekend. Actually had to have a conversation w/ my DS about NOT getting in a car with her when she’s been drinking only to find out it’s commonplace.","Update on Bankrupt Psycho","Trigger warning, death. BiL has gone crazy. And MM is blaming me.","The Blue Grandma (long...)","MIL Blows Up small update and some understanding","That time my mom freaked out on me for losing my virginity.","Bipolar monster-in-law.","Progress or head games?","My Mother","Frosty the No-MIL and the Visits","Future MIL finally left","Jnmom is getting a small bit of karma back.","My Mother Is At It Again, This Time Trying to Manipulate My Best Friend","My baby’s heart surgery or how MIL needed Facebook sympathy","Help my mother in law wants to move closer to us!","Future MIL wants a house meeting and won’t tell me about it.","Mrs Tweedy's birthday bitchery","The first time I met T-rex","Small Snacks Can Make a Meal (Update to earlier posts and please help me with a name)","An Introduction to My JNStepMom - the Christmas Gift Fiasco","I want to go talk to my JNMom about her emotional abuse but I don’t know how to approach it","NMom is using anyone and everyone who has an emotional leverage on me.","MIL putting me off children because she constantly criticises the parenting of her other son.","My mother tells people my wedding is hers and thinks it’s funny.","Religious MIL and her advice","Future MIL thinks she can tell me and my groomsmen what we can wear at the wedding!","BIL meets the Outlaw Queen","Step-Mother: A saga about Clumpy - The Mother’s Day gift chaos.","An intro to Jabbering Jo","S.O.'s verbally abusive, narcissistic mother trying to split us up","S.O.U.S. and NC #1","Lardo and DD's baby shower","My MIL Fired My Doula: My Shit Show Delivery Part 1","Here’s another wedding story.","I’m gonna ruin my child with my negativity.","Penny Hostile and The Upcoming Anniversary","That Time My Mom Tried to Ruin Christmas For My In-Laws","I'm sick of not being allowed to be tired","Gozer Loses Her Safety Net","Every decision is MIL has a vote","Storms here","G.M I can plan anything for your wedding? are you sure you want to get married?","They dont need a birthday party every year","Frosty the No-MIL and the Cell Phone","Overprotective Future Mother In Law we want to take our first get away.","A little BEC about entitled GMIL and her do-over baby.","Takes the Cake and the Will","JustNoMIL in History","Quick and dirty coping skills for a JNM encounter?","MantoNarc and the stolen item","I felt (and still feel) rage that I never knew existed","I can't even go to the doctor to see about depression/anxiety meds because of Eyeshade.","Postpone your surgery til two weeks before the wedding? K","A short tale from my sister in-law's perspective","My Actual MIL - A Whole New Stash of Llama Snacks","“I generally try to avoid meeting my sons’ girlfriends, because I believe they still have a long way to go when it comes to relationships, if you know what I mean...”","B.S. Back to School Edition","is this genuine or foapology update","How she got her name","(Update) Youngest sibling still has a roof over their head, doomsday clock is reset.","JNM and my decision to no longer be her carer","GlowerFlower sends the Flying Monkeys. What does DH respond... if anything?","Dolores and the pawn shop and more cold water","I think Mum may have an actual delusion, and I'm out of my depth.","MIL story 2 : Money","My JNMom is furious that I’ve chosen to get a job","Cousin's MIL and the rehearsal dinner","JNMom and the Art Fair","Mother Texts After 3 Months of Silence","Husband doesn’t support me with his family","Is this rude or am I overreacting?","Coming to terms with my N mother, 30 years on.","How to Downsize Without Offending FMIL?","Feeling guilty about not inviting the Naked Monster to my wedding.","Negative Nancy and Food/Thanksgiving","Mother Hen is making DH the middle man","Feeling Hopeless","St. Mom the Martyr and the Miraculous Sun","We're seeing Elopia","My JNMIL might be racist","I’m glad my mother-in-law’s life is falling apart. She deserves it.","That time when MIL canceled and secretly rescheduled her wedding to punish me and DH","My mom guilted me for taking online classes","I told her she's an alcoholic, now what?","S.O.U.S. and my Dad's trip to the ER","Killjoy and the rescinded rehearsal dinner","Step Mother - The Meeting","How my mother wrecked my wedding, and will never know her future grandchild","JNmom Antics (&amp; some SO antics too)","UPDATE to Wreck It Ralph and the bathroom renovations","Bar Villa dropped off some shit today and a long over due update.","The Most Magical Nightmare - Part 1. Introducing...","My MIL is a classist, racist (expletive)","Chick-MIL-A is in the hospital, plus some more voicemails","Satanic Creature: Surprise Sister [Update 1]","Update on MIL who won't accept I have DH's last name","Pokemom sucks yet again.","Fendi can't unfold a stroller but she wanted to take my baby out of the country (not attempted kidnapping, just stupid)","Just no no no","We are finally moving away from my fucked up family. HOORAY!","JNMILITW: Student bookstore edition","Clear your calendar for June 2019","[33/m] My Wife [30/f] and my Mother [60/f] hate each other","Is this genuine for s foapology UPDATE","Cheap Mother in Law","Goodbye, Bipolar Betty. You have been cut out of our family.","Alexandria - Trying to Enlist My Friends","Pots &amp; Pans, The Desk, and My $10 Spine","I met a Dutch person in the wild and Republimom kind of lost it","I broke NC with Mental Yentl","Tsarina and the Art of Divination","I'm not giving up like you did","Purple Craze and the wedding","I think we’re finally done. I think I’m free!","Why my husband was nervous about having a pet.","How do I proceed with MIL after she stranded me in a different city?","8 months pregnant and having trouble enforcing boundaries with my mom.","The Schnoz's Cookies","My mom is freaking out over paying child support","It’s time to accommodate the Queen of No Fun","How my mil put a damper on our wedding","The sick grandchild","I was told to post this here by r/relationships. NMom controls me [21F], a first time mom, and probably won’t stay a grandmother for long!","Verbally abusive MIL blames me for my husband's weight gain.","My husband is SO perfect, MIL edition.","What is the meanest thing your mother/mother-in-law has ever said to you?","B.B. has no common sense.","The Imperfect Daughter and Her Perfect Mother - An Introduction","My Boundary Smashing, Major Enabler Grandmother","My mom, venting, and no contact","Introducing my mother, La Llorona","Out of the frying pan into the fire: left Evil Mom now dealing with Evil MIL","Pregnancy is giving me a shiny, steely spine. Are you proud?","I GOT THE NICKNAME FOR HER LLAMAS","ChickenLady, the fickle yet obsessive sports fan","Just Keep Laughing","JNIndianMIL","Need a Laugh - What are some crazy pieces of: Advice, Gifts, or words of wisdom your crazy MIL have given (to you or kids)","Baby Steps toward Control","How to destroy a relationship in 11 minutes","MIL casually shared this story that deeply disturbed me","\"You've lost your soul!\"","Double Dose: TROC and Molding Myrtle bring some BEC, Bizarroville, and Beyond!","How JustNo is this email from Mother?!","S.O.U.S. decides she knows our finances (or how she sabotaged us from buying my childhood home)","*sigh* Just my luck....","404mom on kindness","In which my judgmental lds ex-MIL wants me back in her sons life","Unhappy Hour and the time she left me on the side of the highway the day after my abortion.","Satanic Creature and holy shit you will not believe the atomic bomb she just dropped","JNMOM first post- “texting”","An introduction to, and the situation around the Drunkasaurus Rex","Introducing my jnmom","Zinnia and pets TW: animal abuse/death","Introducing Banana, and us","Dreading the meeting","I want to be petty so bad","Scimmia really is a cold hearted bitch","She becomes a grandparent and is bored. La peahen wants to be congratulated.","MIL freaking out because we plan on moving out","Nmom told people my wedding is cancelled... It’s not.","Roadkill and the sorting hat.","MIL finally says it!","The biggest reason I hate MIL","Atilas adventures in the world of deciet","My weight goes up every time we see the in-laws","How my mother taught me to live off only 5-6 hours of sleep a night.","Grandmartyr fails to guilt DH, so she goes after DS [Update]","First post of possibly many : the birth","Newly racist Taipei Typhoon gets the boot from nursing home #1 : My Father’s Death Part 4","How BUBBLE GRANNY turned me into a liar. (Trigger warning chat Anouilh medical treatment related to infertility)","Don’t cross a petty DIL. Plotting boundaries is my new hobby.","The one where PeePad got exFH to fund a safari (probably with money from stealing my furniture?)","The economy","MIL blows up","DC and the time I ruined her chances at Yale","Momopoly vs. Doors","Is this normal","MIL lies to her family about us and wants me to go along with it","So apparently QOGT's can't take a hint.","A bit of a Bitchfitty update","Where Mallory is more tolerable than Creeper.","Tips needed on how to talk to PD JNMIL","UPDATE to JNMIL and the Fallout From My Surgery","Darth Invader VS tattoos","Visit with MIL Mother B over the weekend","DasBitch and Why We Should Keep Her Hoard of Crap","Ansel’s wedding request, “but it would mean a lot to me”","Whatta Beach has landed :(","How to Soothe your frightened child, the Mocha Mix way!","“Too stressed to contribute” or A Hard Lesson Learned","According to Money Badger, DH is lying about ever having asthma","The Senate and Glasses","\"What are you ASHAMED of us?\" The Queen of Bitchlandia plus an update","What happened this weekend, after the \"Bill of Rights\" letter . . .","Memory loss and I think we got us a monkey in them thar trees!","Intro post: Dear MIL, I swear, you're the first MIL I despise","Snort Short Stories: Boundaries","[UPDATE]My MIL is coming to visit again to see my 8 weeks old son. She insists sleeping overnight at our place.","TrashDigger and a SIL update. HELP!!!!","2 mos NC w/ Preachy Paula = WE HAD A BLISSFUL SUMMER","MIL became very combative and territorial with me after years together","Why Mrs Tweedy will never look after my DD - Reason #3","Mad Hatter is Coming: Should I cancel on her?","Thank you to commenters - and a new story: Socialise my child? Why would I do that?!","Turd nuggets from the Shitshow","8 months of NC with MIL","So, I guess I'm going to post about my mom after all.","MIL has implanted a virus in my relationship","Porn, polyamory, and abortion- or how I exacted sweet revenge.","Faaaamily is supposed to be able to rely on each other.","Y'all aren't gonna believe what she said to my daughter yesterday!","Flashback: Burning smell [TRIGGER WARNING]","Props to husband for turning down the Harley, and bonus question:is this normal?","\"I could have a lot of fun with your dad\"","Psycho mother is psycho","RQ has a brain tumour","\"You didn't say Happy Birthday.\"","Hag has been hospitalized","Looking for ideas on how to interact with my Mother In Law","Why Mom?","Fighting out of the fog &amp; an introduction","Old Yeller and reliability (or lack thereof). Long rant.","Sympathy Pains? That Would Require Sympathy","The Toad needs a procedure","MIL: Captive Audience Edition","My Mom and the one about the body issues","S.O.U.S. and my 'gay friend'","This lady just opened my door like it was nothing.","Introducing The House Elf","Weird?","TBI MIL, current status","Had to get specific permission from DH to tell this ASS/JNBIL. The time it really JNBIL really did get physical with me...and ASS demanded we apologize to him!!!","Overbearing Granny tries to make me her Do-over-DIL","The Outlaw Queen and what will the baby call you...","justYESmil Megathread","I said no!","Princess glamdiva she devil staring in \"Stella got her grove back With dashes of Showgirls and silence of the lambs \"","MILITW: Waitress can’t see her baaaabies","I can’t even anymore","The MILs and the China","My stepmother got married. Awesome. So happy for her, really. And I have to vent.","I’m atheist. MIL wants to hold a religious ceremony at her home and has asked me to go (told DH to tell me). should I go?","The Goa’uld: “They did WHAT????? And they didn’t tell ME???”","Well, I made the call. Mum isn't my carer - it's official. Now I must be brave!","[Update] DH and my Schizophrenic lived-in MIL","Takes the Cake","What's the obsession with bathing grandchildren?","Lazy Susan Blew Her Chance","Wedding Pants and the Fine China (long)","Whiny Wino: Pads update, and Unrelated Ambush","Do I (f28) say something to my fiancé (m35)?","MIL says she hates me; what do DH and I do?","Cops drag Taipei Typhoon to the geriatric psych ward: My Father’s Death Part 3","WHY did I let MIL be involved in DD’s birthday party?? Part 1: The Gaslighting","Dependapotomus sent a birthday \"gift\"","My ex's mom and control","Alexandria - A Birthday Story 2018","Chachi is such a pathetic bitch","Live-in, broke MIL turning me crazy","\"I MIGHT NEED A HIP REPLACEMENT!\"","I’m not even engaged yet and my mom is being overbearing about the proposal/wedding","Why doesn’t she like me?","Motherdearest and my highschooler","My Mom vs kids with their own identities and flaws.","Black Hole and extinction burst number one, why Black Hole is in charge.","Baby shower","I just don’t know what to do anymore?","Helicopter/Nosey MIL Opened our Wedding Gifts","Dinner with the MIL","Unlike newborn me, Hairah can't let this one go.","GMIL in hospice, need tips for managing hospice visit and funeral on ILs home turf","Magoo and Some Shitty Birthday BECs","Update on greedy mil and house","I’m quietly fuming - she is now muscling in on first Fathers Day","Well, the move is fucked ALL because of MG.","I am furious. I’ve been nothing but nice to my MIL, and she sent me this. Final update.","A Strange Situation","Pokemom, my Mildlynomom and favoritism","The time my FMIL exaggerated my words to scare her son before his exam","My mother laughs at the death of a kitten TW","Am I Being Selfish?","How do you forgive your MIL for the unforgivable?","“DID MAMA HURT YOU?!” MiL’s first boundary stomp","Crimes Against My Sanity: Continuing Saga of Doobie","Skeeved Out - JNMom Wears My Bathing Suit","First time posting here, issues with future MIL","Woeful Wendy, a considerate woman. Alternatively titled, we saw her yesterday and no, she is not.","My LO had surgery and no one batted an eye, it took me years to realize the situation. (Space Invader)","\"But *you* had an epidural.\"","First time writing about my JNMom","Is my MIL justno, or am I really overreacting?","Fruits Basin Finally Has a Number (Brief Update)","That time she replaced my ziploc bags","Alexandria - Still Ruining Birthdays","S.O.U.S. is jealous of my dead mom","just one big sigh","The time we totally and completely embarrassed my JNMIL without even trying","She Drives me absolutely crazy!!","How to tell in laws they’re uninvited from our wedding?","Fendi flat ironed my daughters hair","Quick shut down for the \"late\" jokes.","JNMIL and my delivery room story","super stressed about FMIL's upcoming visit","I cut contact with my own mother, and she occasionally tries to reconnect. I refuse, but everyone around me tells me I'm being too harsh.","Atila the MIL","My JustNo mom was inconvenienced by my husbands heart attack","Quick Granny Greed Story: The Trophy Partner","Justno mil and her crazy lies","Forgetful Fiona and the time she swore she didn’t put her man first pt 1","I haven't been on in awhile, but something tells me that I'll be here more often... (long)","Sock Monkey moved her internet boyfriend in. SIL has a spine of steel.","(First Post) The Epic Saga of Life with FMIL, also featuring appearances from FSIL (aka the narcissister)","The time ASS and JNBIL cornered me and accused me of wanting to steal a grandfather clock.","My mom is insulting my BF and I need advice","JNMIL and 42lb of unsolicited hideous baby items","Update: How the hell do I even take this?!?!","Nopeflix Unchill's Mother Attempted To Get Me To Attend Ex's Funeral (Also, bonus JNGrandmother story at the end)","Cookie-gate update. [Chocolate Enabler]","a very generous offer","The time I was taken off the visitation list.","Thanks to you I'm prepared Update","Dubiously Delusional Can’t Be Human Enough For A Baby Shower","I'm waffling about asking, but I think I need help.","The $25 birthday card","[Update] Terrible relationship with mom","My Mother thinks my Fiance is gay and \"Turned me Trans\"","The Taipei Typhoon makes the moves on DH plus Adult Protective Services in ‘da house! - My Father’s Death Part 2","Maybe this goes in JUST NO FAMILY? Not sure. Smother May I is involved.","Leading up to our wedding day","Oh my god holy Fuck holy Fuck. She fucking killed herself you guys.","Such compassion, Creeper.","Period Panic! LTL FTP","Stormer and first contact in months","Mom’s Olive Branch, Part 2","The Time Mom Compared Being Gay to Burying My Brother (Long)","My MIL is coming to visit again to see my 8 weeks old son. She insists sleeping overnight at our place.","I Made the Mistake of Looking at MIL's Facebook Last Night","The Universe Just Flipped Upside Down","DH doesn't know how to help, I don't know either","First Post About my Mom aka the one where I'm an afterthought","First Time I Met Step Mom, a Wedding, and Some Trash","Over It!","A Pregnancy, A Miscarriage and how JNmum reacted","Just another crazy MIL","Need your Pettiest Tricks!","Overbearing MIL","Not sure when we'll see JNMIL again, probably within the month but...","My eyes have been opened to my JNMom","my puberty was too embarrassing for Colon Hands to deal with","Lord Beer Me Strength","Feeling a bit guilty &amp; FOGgy - need to firm up my resolve!","The Cara Mierde Pod Person Is Still Here!","Spawn of Satan got an upgrade!","My Ex-JNMIL’s Greatest Hits","She keeps calling my DH fat...","Nutcracker actually followed through on volunteering","Chick-MIL-a's crazy voicemails, plus small updates","Thanks for loving him as much as we do","Bipolar Better Claims She is Moving to the Middle East and Calls Me a \"Bigoted Bitch Who Ruined Her Bi-Racial Son\"","Guilt Trips EVERYWHERE","Relapsed mil update/continued shenanigans","Loud and The Big Move (Long)","The time I traumatized my sister’s JNMIL at her wedding","MIL taking over husbands birthday","JNMILITW: currently in the middle of her wedding speech","Panicking about my JNMother and our Table Plan","S.O.U.S. and my wedding (kinda funny)","Satanic Creature: Whore No More","MIL, the Consummate Nag","update: Ansel thinks I’m mean...","My JNM and my childhood (long)","Projection Princess was just trying to heeeeeeelp","Living conditions","Insight on MIL’s behavior?","My mom and my life long dream","World's Best Grandma and How She Learned to Love the Lovebomb.","I technically have no part in this, but I hate weddings. Some deviation towards the end.","Please help, my mother in law is a pain in the ass.","I suspect Narcferatu of Munchausen by Proxy, and I'm paying for it as I type...","MIL won't accept I have DH's last name","When Self-Addressed Stamped Evil Sued Me. (Warning: long)","Has she been a JNMom all along?","Bitchy Bella and her latest grandbaaby","We're in Counseling Because of Her: Ballad of a JNMIL called Doobie","And she drove away... laughing maniacally....","Just found out my Mom withheld important medication from me as a child","JNMILITW: The bridal registry edition","Going to Cross Paths with Chunty and need advice - Part 2","Boyfriend's mom used to snoop constantly, took screenshots of conversations and sent them to her friends....still paranoid","Straight from the horse's mouth: Her love has no boundaries.","How do I respond to Methany?","Blame game, Hypocrisy, and rugsweeping","QOGT's (just thinking about some things from my last post)","My JNmom is pocketing money meant for my sister","Coffee and flying cookies with CE. [We met with CE]","“You look okay except for your big, fat stomach” - Words of comfort from my mother - My Father’s Death Part 1","My MIL got drunk as shit at our wedding and pissed herself while passed out on our lazy boy.","Mom’s Olive Branch","Introducing my JNMIL and my pregnancy","Linduhh wants to begin the healing process. A surprise visit and probably but most definitely Part 1. Long, long, oh and long.","JNMILITW: Pediatric Ward Edition","I just told jnmother not to abuse my kid","Now I'm just going to start acting petty towards brood parasite","Part Two: Signs your MIL might be a narcissist","The 3 week old baby is going to crawl out of the bassinet (short one)","Evil actually does die and I don’t know what to do","Space Invader dropped major $$$ to take up DH's hobby.","My nmother drunk enough that you need subtitles to understand her.","Gabhead admits to it all - she just wanted to toughen me up + quick update","(old crackers) Helicopter Gothel and the maternity pin","CalligraMe and the Thank You","Cruise Control showed up again... in an effing disguise!!!","Granny Greed and the Love Bombs","My introduction to Plannosaurus and New Year's 2015 (TW: divorce and suicide)","My normally yes Mom is driving me up a wall","Grandmartyr fails to guilt trip DH, so she goes after DS.","Recently made my first post about my JNMIL, and now I feel guilty even though I know I shouldn’t.","Today is the day","Bucket and Chips","Working Together to Deal With the Milestoner","What??","According to JNM, I'm the way I am because I have no friends and am an old maid","I almost forgot, my own mother used to be a JNQ","Comatose Love-bombing","Grandma's table, grandma's rules?","The Messenger and the Error in My Ways","FMIL who wanted to be MOH is lovebombing. Y'all called it","Frosty the No-MIL's Kitchen Table","Update on \"Am I overreacting?\" No, I wasn't, but I eventually went ballistic!!!!","I Stood Up to my JNMom. Now What?","Chapter Two of the Excruciatingly Awkward Tale of JNMIL and her \"Baby Boy\"","Name shenanigans","PB&amp;J and Have Yourself a Jiffy Little Christmas","MIL tells me about her marital problems. Am I a bishe for being suspicious?","I feel a storm coming","Satanic Creature: Farm Edition","Why Mrs Tweedy will never look after my DD - Reason #2","\"The ESTATE\" or what I hope is the second to last meltdown we ever have with ASS, JNBIL and JNMILBF. It was bad...but it turned amazing.","Keeping up with us.","Giada's rules for the kitchen.","Cake Police and freaking out about not being invited to baby shower...that she has already responded to.","UPDATE: MIL choosing my Doula","Grandparent rights. They filed.","The lengths my MIL went to to avoid wishing me a happy birthday","A Stable Mabel Sighting","Nancy is trying to get full custody of a toddler","Intro to my EXNMIL (tales of how I married the GC and ruined EVERYTHING simply by being alive on the planet earth)","Pro Tip 10: Hire Elder Law Attorneys to put your insane bitch nMom in a nursing home (A PSA)","Full Metal Batshit and the Dick Move","Facing accusations of abusively isolating our child, my NMIL having an unhealthy entitlement attitude towards our lives and LO, and my 2nd pregnancy being affected by the stress. Help!","S.O.U S. And the insurance","Just No From BEYOND THE GRAVE","\"You're too alike.\" Me and RQ","Future MIL and her “right” to visit her grandchild in the hospital","Guys is there a temple to St. Luis i can pray at","MIL avoidance: I can't be the only one that does this","Problem Child and a Tiny Llama Snack","QOGT's sent me a message.","Still around like a cockroach","Updates on Methany, or: I can feel a storm a-comin'","My son’s 13th birthday party turning into MIL’s party","Afraid Big Christian Enemy might try to have me declared incompetent","What happened to my birthday and other JNMom BEC? (TW for brief mentions of pet death)","JNMILIW meets CreepyAsterisks","Insults for me, Orders for my FH","Update on MIL from Hell","[Meta] A thank you.","JNMIL and her \"baby\" boy","Small Update: JNMom’s Court Date","Asian mom / Part 1","Talked to the grandparents and drafting the \"not coming home\" email.","My Mother is Driving Me Crazy","[TW: child abuse] Holidays with Rebel Nympho: comforting your children with violence","X-Post: Relationships. My mother (50+) refuses to let my emotionally toxic ex-wife go, I'm M/35","MILTW Mom's Justno Friend","Megaphone and Her Definition of a Bargain","Hi! I'm The Homewrecker.","The worst thing that Hyacinth No Way has done (so far) - she forced her daughter to lie about her husband abusing her","Peanut Butter and Why?","First clue MIL is likely a narcissist...","Llama Snacks: My Family Gets a New JN, Granny Greed","advice needed!","Netflix icons... Jocasta or no","Feeling absolutely rubbish after a visit from my Mum...","We're meeting with CE tomorrow and I'm angry and nervous. [Bonus Classic CE story]","She's acting like it didn't happen... what do I do?!","Frosty the NO-MIL and the First Thanksgiving","Ansel dictates my uterus. Chapter 1. Give me grand babies.","Petty JustNo moments.","My narc mother’s MIL is v. JN. Llamas, I give you, the cycle of projection!","Update: FMIL wants to be my maid (lol) of honor","Mental Granny Update - She’s out of prison + general life shit.","FMIL wants an outdoor shower.","Went NC w/ VodkaMIL last week, waiting for her to catch on and freak out on the hubby! Also have a family gathering in two weeks, need advice!","NOlivia Benson: Minor Hat Drama","JustNoMIL with revisionist history..","JNMom stories. First time poster and wanted to share my story.","Silent Treatment from JNMom","JNMILITW just a random grandma dropping off her grandbabies at a campsite to fend for themselves.","Is this a big NO or is this normal?","But you already have a ring for that finger...","Why Mrs Tweedy will never look after my DD - Reason #1","No Acknowledgement Only Negativity","Update to two years NC With Woeful Wendy and FIL. Hashtag tis awesome.","ASS cried over her recently deceased husband during a job interview...her son's job interview.","I didnt take Space Invader wedding dress shopping and she was sooooo upset.","Money, get away","How do I handle this? JNMom pushing boundaries","Hellmark spreads the news of my non-existent pregnancy","I’m ruining the family","Birthday Mail &amp; Calls","MIL ruined Thanksgiving dinner with oil","JustNoMIL in Advice Columns","Warning signs of a JUSTNO?","Candy Cane was apparently serious","Wedding planning is for the birds, and small BEC.","Maximum Effort is taking us to c0urt for gr4ndp4r3nts' r1ghts.","How did you deal with Helicopter Moms/MILs?","A day without BV, and some justice","S.O.U.S. and the computer (plus a little extra story)","Misery Circus Update","My MIL is willfully getting scammed","Damn Jackie! And the bridal shower/rehearsal dinner","DH told of snag hag!!!!!","Another tale of “my children never did that”","How do I word this text about getting documents from Shiney Belt?","JNMom and the neverending complaints","A bit early I know but I'm already stressing about Christmas","MIL and Where is Everyone","A passive aggressive gift or just being nice....?","First post, MIL infringing on my birthday weekend","Worst Case Scenario is baffled by my boobs","Purdyhedgehog Gets Married: Rehearsal Dinner Edition","Choice words from my MIL","Yeah, not a messenger service (aka, stop calling my kid)","TrashDigger and brunch the Saturday after Uncle’s party.","LO’s New Gift from MIL","The time she agreed to meet us to see the baby, but didn't show up","Surprise! JNmom withholding Birth Certificate","Help! MIL insists on visiting us even when we say no","NC with gaslighting MIL who painted herself to be the victim","JNmom tricked JYNana into driving her over unannounced. And other updates.","The Amnesiac and Hypocrisy (Or, How To Destroy Your Chances At Grandkids) tw: CSA mention","Oh lawd she comin","The time Run-of-the-MIL tried to embarrass me at my bridal shower. Spoiler Alert: It backfired on her.","How to deal with the upcoming baby rabies","JellyBaby has a countdown (rant)","Wondering if I am too sensitive","Anyone else feel like their mum just doesn’t give a shit?","It's more important to take pictures to remember your grandkids then to actually play with them to make memories.","The final straw, or why I'm VLC","Silence of the Hound","Independent Martyr: Remote Guilt Buttons","Bitter Queen shows her ass (past story)","A vent about my MIL who isn’t near as bad as some that I read about, but is still about to earn herself VLC from me. Just ugh.","New to this. It's my GMIL. Hear me out..","More venting about JNM","So apparently not wanting to live in a smelly and disgusting house means I have OCD?","I know it’s August by my JNO MIL already has me stressed about the Holidays - Advice?","A taste of my FMIL's Crackers a week from my big day (14 short standalone stories and a rant). Advice appreciated.","Tamster Didn’t Like The Great Wall of Boundaries","The Red Wedding","You didn't invite me, so let me invite myself...","I can’t wait to get out of MIL’s house.","Introducing my JNMIL- Frosty the NO-MIL","The Senate and Sleeplessness","Like always, I’m the bad guy.","Stepmother and the time she forgot me in the car to smoke weed","Boundaries! How to establish and maintain them.","My mother's insanely disgusting messages to my long distance relationship. He blocked her immediately after.","Good grief MIL.","Random Llama Snacks","Mom Is Mad At Me Again","\"Girls can't get ADD\"","Fiancé's mom invited herself to be my maid of honor","Nightmares about my JNMIL","She just can't take a hint","I can’t stand my boyfriends mother anymore","Chapter 3.5 : In which Godlizza makes vague threats. (An update)","Bunny Boiler and Can’t Buy Me Love","I am not bending over backwards for you to see MY kid ON HER BIRTHDAY (which you ADMIT YOU FORGOT)","JNFMIL declares that we must immediately baptize the children and smear fresh blood over our doors in the middle of the night.","I got a tattoo and now my husband's future is ruined apparently","The time I wasn't sexy enough for her son","Mum's behaving oddly (again) - I don't know whether to worry or not!","Kleptocrite has struck again!","Ansel thought it was okay to teach our dog to eat plastic...","Thanks to all of you ... I'm prepared!","But *she* rang *me*!!","ASS called a 13 year old girl a \"hussy slut\" right to her face in front of 20+ people. An intro to the only people she's ever hated more than me: JNMILBF's kids.","Why she might be Like That. A follow-up(ish) to my last post.","Cobra Fumante's cross","S.O.U.S and the time we all got shingles","Cottonmouth wants to be called Gramma, DS has other ideas.","NC letter to PORKCHOP *short update*","JNMILITW: how self centered can a person really be?","JNMILs run in my family","\"You're not acting as a loving mother, you're acting as a loving gossip.\"","Shit has hit the fan: War Dialer demands we ignore a dying relative's wishes so she can micromanage the hospital and \"be included.\" Plz give me strength as I burn bridges.","Mom calling today. Support or advice appreciated.","Debt dumper","Republimom ignored the fact that I had a learning disability for fourteen years","Help with PTSD?","MIL, SIL, and The Wedding Isn’t Over","Sloth Stories: DH should have been a girl","Joking with my mom in front of Emily Postal - CBF galore","Stopping on the side of the HWY to yell that's normal right? A Space Invader story.","MIL and Where Are You","JNMIL and the Fallout of my Surgery","Mini Update On Joan Crayford's Recent Blow Up","If ignorance is bliss, then JNMIL is the happiest person in the world","Another heaping portion of guilt from Tuna Helpless","Is this a step into JN territory? UPDATE","Momopoly vs. My Hair","Betty Draper and my ADHD: a small victory for me, thanks to y'all","I think we made a mistake with MIL Childcare","Darth Invader and the passive-aggressive cheque","Petty Sulker upped the ante by making a scene in my work parking lot.","She-Demon's flying monkey","The Wedding Skipper sent DH a birthday card. Let’s decode it together!","Meet Wicked witch of the East &amp; Mother Barrone.","Things My MIL Thinks I Don't Know How To Do","Brief update and the story of how Big Christian Enemy used vandalism to... flirt? I think?","Future Step-Mother In Law Gaslighting?","PurdyHedgeHog Gets Married (Part 1/?)","My future mother-in-law is a nightmare","SIL1 is engaged (news to set some boundaries) and Wreckasaurus Waaah got fired...","In the span of a year-Badger won her den back, Married then Divorced, and back to dealing with Spotlight","If only she swept the rest of the house so well.","Bewildered Bavarian Is Trying To Invade Switzerland","OB shuts down BV and an update of sorts","EZ and the sperm doner know about my wedding"]