["Grandma inlaw(73F) wants my husband(24M) and I(23F) to adopt our niece(4F)","My boyfriend [22M] only tries to have sex with me [25F] at night. I'm starting to feel like an object and resent him.","Do I [28/M] forgive fiancée [27/F] for infidelity? (4 years)","My [F24] husband [M26] stinks and has bad breath. Communication isn't working, what's the next step?","My boyfriend read my diary without my permission","My [32F] husband [34M] is being kinda mean about my emotional keepsakes, calling them trash and me a hoarder","Me [23M] with my girlfriend [23F] of 6 years, breaking up because she wants to be the only female in my life that is not blood related","My [26F] friend's fiancé [27M] got drunk and assaulted my FWB [27M]. My friend is taking his side. Is this worth ending a friendship over?","I [29f] am on vacation with my husband [32m] and I intend to tell him I want to seperate when we get back.","My brother(17M) and I(20M) have not spoken in over a year and we sleep in the same room.","One of my [41M] old friends [40?M] is rude on behalf of his controlling wife [30s?F], should we end the friendship?","My [24f] best friend [25f] got incredibly drunk at my coworker's wedding and blamed it on me.","My [24 F] boyfriend [23 M] found out that I used to shoplift a lot as a child, and I still have stuff I stole.","I (M21) am uncomfortable with the way my friend's (F20) boyfriend (M20) seems to be hitting on me and I'm unsure what to do","I [18F] found out my brother [24M] revealed my plan to leave to my abusive parents after he offered to help me plan how to move out","My adolescent brother isn't taking his education seriously and I don't want him to squander his opportunities. I've been trying to help him but he's not letting me. What should I do?","My(20F) partner (22M) won't get a job.","My [21M] girlfriend [21F] left me for her best friend's brother","My(28F) boyfriend (32M) is supposed to be sober, and has been flirting/drinking with a co-worker without telling me.","My [25 M] grandma [65 F] doesn't like my GF [23 F] and won't stop talking down about her","My birth parents (30sM/F) recently attempted to get back in contact with me (16F)","Fiance [31M] came home last night from a concert bleeding and beat up.","My (27M) best friend (27M) retracted my plus one to his wedding after he heard who I was bringing.","Me [31F] with my sister [29F] I would like to go to a gig the night before her wedding","My [22M] GF’s [22F] parents are manipulative, controlling and trying to break us up. What should I/we do?","I [23 F] trust my gut feelings a lot, my boyfriend [27 M] thinks I'm being ridiculous.","The truth is cruel - I'm (35/F) struggling with how to help/dump ex-friend (36/F)","Me [31 F] with my co-worker [40 M] of 7 years, co-worker promoted and now causing major issues; Need advice on how to handle","Me [33F] with my Best Friend [33F] 20 years, I think she ghosted me?","I 27F am having a difficult time believing there's someone out there for me.","I [19F] am not my boyfriend's [21M] ideal body type. I feel dumpy and unattractive.","Me [24M] with my GF [24F] of 5 years, thinking I've been wrong about this one and ignoring a lot of red flags.","Me (25F) and my boyfriend (22M) of 1 year, 3 weeks into living together and I think he may not be the one","I (33F) needs to tell my (38F) ex-bestie that I can no longer attend her birthday celebration but I’m scared of her.","My (20F) friend (19F) is in a toxic relationship with a guy (24M) and he ordered her to cut contact with me","My(30F) BF(32M) owns a business but never works. He is always home 24/7 and around me all the time.","Maybe my [25F] husband [30M] is gay?","Friend [50M] wants me [45M] to have sex with his wife [50F]","Am I(M 30) selfish for not wanting to get engaged to my girlfriend(F 26)?","My boyfriend (22M) wants to break up with me to date other girls, but wants me to still be close to him? (21F)","I [27M] am having serious problems with a work colleague [34M] which resulted in him getting aggressive at work.","I, 28M with my 28F girlfriend of about 3 months, like her but have been wanting to date other girls in the last few days since we hit a slight hiccup in our relationship","I (23F) have a tic that causes me to smile during inappropriate times. This has been triggering fights with my boyfriend (24M).","Me [21f] afraid of “forever” with musician boyfriend[27m] after financial discussion","My parents' guilt-tripping is getting to me. Need perspective!","Am I[29F] being too controlling of my boyfriend[30M] when it comes to social media?","My (22m) roommates (both 22M) have essentially moved their girlfriends (both 20's F) into our university owned house, and it's causing issues.","My (24M) sort-of-girlfriend (22F) is depressed, addicted to drugs and doesn't want any help","I [32M] realized i had feelings for another woman and immediately cut things off. How do i rebuild things with my fiance?","Am I[24 f] with my boyfriend [26 M] of two months, wont let me break up with him and tension is building up. What do I do?","I (21M) wanna make things official with this girl (21F), how do I go about doing it?","I (24M) just found out my ex (23F) is pregnant after her IUD failed","Unexpected uncle death","Multiple friends have told me [24M] that they don't like who I am with my [24F] girlfriend of four years","I [23M] feel like I'm growing apart from my fiance [22F] (3 Years GF/ .5 Year Fiance)","Problems between M27 and F25 with regards to physical appearance","Define a healthy relationship? Tips for making the most of quality time?","My fiance (F25) just left me (M28)","I [22F] don't know how to continue a 15 year friendship with my best friend [22F].","I [m26] recently went on a date with a girl [25] I've had a huge crush on for a while and I'm not sure where we stand","Recently had a bad breakup with my [M 22] wife [F 21] because I found out that she has been catfishing me for two whole years since we first met","One of my (20/M) friends (24/F) is making me out to be a bad person for apparently leading her on a couple of years ago, even though I feel like I was only being a good friend.","Boyfriend [23M] says \"please don't cry\" when I [20F] am crying. Doesn't feel loving.","My(27F) boyfriend(29M) is very upset and disappointed with our mutual friend (27F) and I'm having difficulty figuring out how to handle the situation and process for myself.","Should I (31f) find it concerning the man I'm dating (35m) says is weakness is women?","(24/M) How do you deal with a break up?","I [27f] have a guy [late 20's] that continues to oogle me. Not sure really what to do.","Help. I'm living in a groundhogs day hell with my GF (M/33 - F27 of 1.5 years)","My [24F] boyfriend [24M] just phoned me crying incoherently and im 6000km away panicking","I (23F) am contemplating a break up and need to reevaluate my relationship with bf(24m)","False positive?","Overthinking when I really like a girl","My husband's [31/M] dark sense of humor offended a close friend [29/F] and she wants an apology; I [30/F] think they both have a point","Woman [25F] I [24M] am dating asked me why am I treating her so well if we haven't had sex yet. Really confused.","[19M] If she [19F] still loves me the same, why did she leave me? Is she confused?","My girlfriend [28F] of 1.5 years is planning on getting plastic surgery. She doesn't want any opinions/input but I'm [29M] really worried about the outcome. What can I do?","My [20M] girlfriend [21F] has been distant lately and I don't know what to do","boyfriend (21) never pays for me or pays me back (20)","Me [25F] with BF [28M] of 3 years. Slowly realising we might not be long-term compatible but the thought of breaking up gives me panic attacks","My online depressed friend 17/F has been ignoring my messages 22/M with a weird reason.Should I keep texting her?","Me [22 M] with my [22 F] 2-year, ex-FWB and emotional heartbreak","My [23M] sister [19F] is doing nothing with her life. I want to help her but she feels as if I’m attacking her.","My(27F) reaction to a breakup with (28M)","My [26F] Bipolar boyfriend [26M] scared me during an episode. I confronted him, and a month later he is still acting distant and not himself around me.","Is my girlfriend F[22] emotionally abusing me M[24]","Need advice on a 6 year relationship.","Did my[35/M] immature behavior betray my feelings for my crush[40/F] who rejected me?","Friends since he [28M] and I [28F] were 14. Dated in our 20s for 5 years. Now 2 years after breakup, I'm still in love with him and don't know what to do.","How do I (19F) tell this guy (21M) that I no longer want to talk because he makes me anxious?","Having a hard time coping with my [44F] daughter [20F] being a \"risqué\" model. Need help.","Have I (25M) made a mistake breaking up with my girlfriend (24F)?","Is it weird that I don't consider my SO my best friend?","Struggling to move forward after my ex [28M] dumped me [29F] while pregnant with his baby","I(F24) have fallen in love with a guy(M21) but I have a boyfriend(M25)","My [17M] family [47M, 46F, 22M] is making fun of me because I have a poor sense of direction.","My closeted ex has a very promiscuous past and yet can’t bring himself to tell me what’s been going on behind my back. Is there anything I can do to open up an honest discussion?","How do I (22/F) do one night stands?","Young couple (MF24) here considering open relationship where she will give girlfriend experience to one broker guy we met. Really anxious whether we should proceed but it's reassuring that he is not hung, not muscular and into gentle sex. Thoughts?","I can't find a present for my girlfriend cause she's rich","Is he [24M] lying about wanting to be my [24F] friend to get laid?","I (M26) feel like the girl (F27) I’ve been dating is only into this for the sex","I feel like i (26f) made everything about me when he (25m) ranted to me. Help me make it right?","[25F] How to deal with my fiance [24M] and his Instagram addiction","My autistic brother (19M) has become extremely violent and aggressive, but my parents (late 40s-early 50s) don't want to send him to a place with specialized care.","I’m (25/F) worried about my brother (23/M)","Heartbroken","How do I know if I'm being catfished?","How do I (23f) tell my ex(24m) that I know I don’t see a future any longer?","Me [16 M] with my Girlfriend [16 F] 1Month, want to know how to behave in a relationship","Boyfriend Unemployed - Help?","[24M] My best female friend [26F] is jealous of my relationship. I think she might like me. I'm not sure how to interpret this.","He [25] broke up with me [f/21] after his brother died. I feel lost without him and want to beg him to come back.","Me [29 M/F] Moving with my GF [30 M/F] to a new city. Decided to a long time ago, now its here Im scared!","My (20f) longtime friend (22M) allows his other friends to mistreat me","I [19m] cant seem to come to a compromise with my girlfriend [19f] about smoking weed","My [23 F] dad [54 M] won't let me have guests at the house..","I (23F) was dazzed and confused by the behavior of my date ( 24M)","Should I [M20] ask out a girl in driver's ed?","I'm [27F] starting to hate on a personal level my coworker [37F] but I don't think I can leave due to my criminal history.","Me [34 M] and my ex's [34 F] relationship, need outsider opinions on whether you'd consider it abusive","I (26M) just got engaged to my boyfriend (26M) of 6 years and now my mom doesn’t like the idea of us adopting his brother (10M).","I [22M] just broke up with my GF [22F] and the pain is killing me","I [19M] am uncomfortable with my girlfriends [18F] friendship with her ex that still has feelings for her.","New interest (41f/42m), when to share news about the ex","Boyfriend (M27) pushing me (F29) away"]