["AMA Announcement: Jim Thomson, former NHL player. - Friday, August 31st 1 PM ET / 10 AM PT.","Off-season: r/hockey's favourite player from each NHL team: Vegas Golden Knights (Day 28/31)","Devils name Martin Brodeur Executive VP of Business Development","Brett Connolly says he won’t be part of the Capitals’ White House visit.","Devante Smith-Pelly: Easy decision not to attend White House if Caps are invited","r/hockey Survivor: Grand Finale","With 35 days left, Anton Khudobin stands his ground against home invader Connor McDavid","Oscar Dansk wanted to honor those who lost their lives last October. As a tribute, DAVEART.com adorned Dansk's new mask with 58 Vegas Golden Knights logos representing each victim.","Our local club Avangard Omsk presented its new logo and jersey today (below) - how do you think guys, is it better than old one (above)?","Aaron Ekblad modeling for Panthers’ 25th Anniversary photoshoot","Winnipeg Jets corn maze celebrating the Whiteout","The Philadelphia Flyers have been the NHL's most decidedly average for the past five seasons.","Jamie Benn, Ben Bishop Virtual Reality: Walk the Plank (Benn hates heights)","\"It never went that far, we were interested in Max more than Marc was interested to let him go. He knows he has a good player in his hands.\" Luc Robitaille on Kings interest in Max Pacioretty","Swedish players union SICO in open letter criticizes CHL's player safety commitment, cites Paille incident","[Luke Fox] “I don’t think I have much to prove other than being the player that I am.” -Wayne Simmonds on entering contract year. Says talks with Flyers management on an extension continue.","A ranking of the 31 NHL teams’ No. 1 defenseman in 2018-19 | The Hockey News","Islanders get a Puppy for guide dog training","Who will be this year’s Dustin Brown?","OHL Adopted Notice of Motion: Effective September 1, teams will be allowed to trade OHL Draft picks a maximum 6 yrs into the future, transitioning to 5 yrs for the 2020 Priority Selection, then 4 yrs for 2021 and all subsequent drafts.","35 days til the puck drops, J.S. Giguere wins the Conn Smythe - on the runner-up team. Here's a snippet of his playoff debut and eventual run to the Cup Finals including a 7-0 record in playoff OT games","Jets sign JC Lipon to one-year, two-way contract worth $650,000","What prospect are you hoping cracks the lineup this year?","With 36 days left, here's a 36-year-old accountant making his NHL debut as the emergency goalie","What was it like watching Bobby Orr play live?","Just had a little fun while testing the graphics for the new season.","If the Hockey Hall of Fame required players' plaques to show the players in the jersey of the team they retired with, which ones would be the weirdest to see?","Martin Brodeur Interview - \"For Me, New Jersey is Home!\"","Phil Kessel hasn't missed an NHL game since the 09-10 season.","What are you favorite hockey interview clichés?","When is Vegas releasing their throw back jersey?","Picking the best players by hockey analytics [NHL Tonight]","Anaheim Ducks will have 9 different Tribute Night Jerseys to celebrate their 25th anniversary","With 35 days until the season starts, here's #35 Tristan Jarry in his NHL debut making a save against elite sniper Tanner Glass","Stajan joins Red Bull Munich [In German]","My favourite shootout ever: 2007 IIHF U20 Canada vs USA","Former Leaf and Flame Matt Stajan will be heading to Germany to play next season","Top 100 NHL players of 2018–19: 30–11","Marc Bergevin on the front page of TSN.ca today.. has he been working out? Making Patches look like a little kid here.","The Halifax Mooseheads' History -- The CHL Import Draft -- Post 2000","TIL the Panthers attempted to draft Ovechkin in the 2003 Draft, even though his birthday was two days after the cut-off . Rick Dudley, the GM of the Panthers, claimed the pick was legitimate, claiming that Ovechkin was old enough with leap years taken into account.","2014 throwback highlight: filthy Gaudreau tape-to-tape pass to Monahan","From '86-'03 the Detroit Red Wings led all teams with 116 playoff wins. During that same time frame Patrick Roy had 151 playoff wins.","Leafs' Defenseman Timothy Liljegren on Rasmus Dahlin: “I’d have to say I’m the better player... he’s got talent in hockey but not in PlayStation.”","r/hockey’s favorite uniform/jersey from each team: Atlanta Thrashers (Day L1)","With 35 days until the NHL returns, here's the Bulin Wall with a desperation save","[Johnston] Henrik Zetterberg tells @sportbladet that his back issues will force him to miss Red Wings training camp and the start of the season: \"I have not been able to train and I can not play NHL matches without being well prepared, especially not at my age.\"","31 in 31: Vegas Golden Knights 2018-19 season preview","[Meta] Do we really need a new thread about every player who chooses either to visit or not visit the White House?","With 35 days remaining lets watch Pekka Rinne use his knob to make a save.","Scouching's Eastern Conference Prospect Preview Pt. 2","Tod Leiweke offers updates on Seattle NHL expansion process: meeting NHL Executive Committee in early October","I need yall’s help.","[Luke Fox] \"Absolutely. Oh, gosh, yeah.\" —Ryan O'Reilly on Jack Eichel being ready for the Buffalo captaincy","Milan Lucic took Tyler Tofolli to Disneyland yesterday","Detroit Red Wings' Henrik Zetterberg: The pain has gotten worse","Fantasy Team Names","When do NHL pre-season camps end ? (When will my team KHL team have a chance to sign some leftovers) ?","An OHL team employee tells me some players have been advised to scrub Fortnite references from social media accounts. Some NHL teams consider the video game a major distraction/obsession.","Tyler Seguin just said repeatedly that he’s “disappointed” he doesn’t already have a long-term extension signed with Dallas.","With 35 days remaining, here is Jason Chimera scoring on #35 Steve Mason from center ice","Oilers Vs Leafs (20 Goals Scored) - Jan. 8, 1986","Oilers sign D Jason Garrison to a PTO","If you had to bet one player to score in a match from each 31 teams, what would be your list now?","r/hockey’s favorite uniform/jersey from each team: Boston Bruins (Day 3)","[Fox] NHLers weigh in on video game culture, all that Fortnite rage","OHL players told not to mention Fortnite on social media. (The Hockey Guy)","[Serious] What’s a nice thing you have to say about your rival?","35 days left till the season starts!!!","Per Sergei Shumakov's agent - his client has not signed with the Washington Capitals and the report appears to be false.","Michael DiPietro's new Canucks mask with a Humboldt Broncos tribute","Report: Capitals sign Sergei Shumakov, a top 20 point-scorer from the KHL","[Fox] Seguin says “negotiations” is a funny word. There was talk at the draft between sides and nothing since.","Tom Dundon tells Hurricanes fans the team needs a third logo and wants to see the fans ideas","List a player in the comments and repliers have to guess how many points they will get this season","Lavoie: Max Pacioretty confirmed that their is no talks for a contract extension as of right now with Montreal","Report: Brodeur taking role with Devils - TSN.ca","NHL 19 – Top 10 Rookies Ratings","r/hockey Survivor: Round 30 (Finals)","Brandon Davidson signs PTO with Hawks, per report","Winnipeg Jets 3rd Jersey Unveiling on September 14th","What current player this season do you think will be playing their last?","[Strickland] Martin Brodeur told me several weeks ago he will keep his family in St. Louis as he takes on new role with #NJdevils","Blues GM Doug Armstrong on Bill Armstrong's promotion to assistant GM: \"I think with Billy's experience, he's earned the right to take a bigger role. I could see him being a (general) manager in this league one day … I don't think this is the last promotion he's going to get.\"","Eeli Tolvanen or Kristian Vesalainen? Who has more potential?","Sean Shapiro on Twitter Just spoke to Stars GM Jim Nill on Tyler Seguin's comments: \"No update. We continue to have dialogue. I'm not gonna negotiate in the media. It's a process and we continue to go through it.\"","The Blues have made several changes to its hockey operations staff, including promoting Bill Armstrong to assistant GM. Martin Brodeur will leave the organization to pursue new opportunities.","Pittsburgh Penguins Offseason Hub","[Old Highlight] Toews fends off Subban","Shane Doan to be pallbearer at John McCain’s memorial","[2015 WCF HIGHLIGHT] Jonathan Toews Scores 2 late in the 3rd to force OT","Kyle Quincey has signed a one year contract with Helsingin IFK (Liiga)","Which player on your team are you most excited about this season?","[Serious] If you could ask your GM any question, what would it be?","With 36 days left, here's 5'7 Mats Zuccarello reverse- checking Xavier Ouellet into the bench","\"I still cannot seem to get my head around the fact that there will be no #NHL Guide and Record Book published this season. Just cannot process it.\" [Steve Lansky on Twitter]","Who is your team's trade BFF?","Garbage Goal #7 - \"Smile\"","Season Highlight: Giroux dangles around Anderson on a breakaway","Martin Hanzal will wear No. 11 this season per Stars PR. He wore 10 last season.","Anyone do any hockey summer reading?","With 36 days remaining, here is John Gibson absolutely robbing Alex Tuch.","Rutherford: Kevin McDonald has been named GM of San Antonio Rampage and will be a pro scout for the Blues ... Barret Jackman has stepped down from his position as development coach and will be replaced by former NHL defenseman Glen Wesley.","Off-season: r/hockey's favourite player from each NHL team: Vancouver Canucks (Day 27/31)","Youtuber demonstrates the significant strategical similarities between hockey and high level rocket league","A fun game: write the first player that comes to your mind from these words","36 days left: Jussi Jokinen wins Game 4 with 0.2 seconds left","Connor McDavid wants to get faster","Trailer - Making Coco: The Grant Fuhr Story","Refs Are Funny","Who gets more points this year Matthews or Tavares?","If you could ask any hockey player any question and they had to be 100% truthful..","Season Highlight: Ryan Callahan freezes Gostisbehere and puts away a gorgeous short-handed goal.","Sophomore Slump: Who's vulnerable and who isn't? | The Hockey News","Ted Leonsis will give Stanley Cup championship rings to approximately 500 employees","Top 100 NHL players of 2018–19: 50–31","\"It’s obvious by now that the Vancouver Canucks have a better chance of trading for Elvis Presley than Erik Karlsson...\"","Need an entry level hockey announcer for club hockey in Bloomington IL","The NHL got big stadiums but the DEL (germany) got the fans! (Part 2)","Who are the next generation of NHL stars?","Troy Brouwer signs a 1 year deal with the Florida Panthers","2009 Trade Deadline newspaper article from the Toronto Sun.","Classic compilation: Jay Bouwmeester punching his own goalies","Jacob de la Rose while training: Yup, that hurt as much as it sounds","These are the 14 remaining RFA's left to sign for their respective teams","Tenderfoot Tuesday: Ask /r/hockey Anything! August 28, 2018","Winter Classic tickets on sale today - Bruins vs Blackhawks at Notre Dame","Which players have been the most singular or unique talents in the history of the game?","Connor McDavid on Scottie Upshall coming to #oilers camp on a tryout: \"Really, really excited. … He’s done PTO’s the last three or four years now and he got a contract every year. I expect nothing less.”","Also with 35 days until hockey, here's Dobby stoning Oshie.","31 in 31: Vancouver Canucks 2018-19 season preview","Philadelphia Flyers Offseason Hub","The Calgary Flames: Professional Hockey's Little Brother Complex","What storylines are you most excited to follow in the 2018-2019 season?","I'm going to Europe for a couple months and I want to watch a hockey game there just to see what the atmosphere and the level of play is like. Which league/teams do you suggest I watch?","WWE Superstar Elias on John Tavares's recent move(Hockey relevant at 0:00 and 3:10)","With 35 days to go I present to you Vesa Toskala basically ending his hockey career","Dallas Stars in spot light with camp looming. While they remain in the hunt for Karlsson, word is Seguin/Stars contract talks are at a standstill and have been for quite some time. Long term remains priority for Seguin but the Tavares route becomes viable option as time passes.","Awkward moment as Canadiens head office shows up late to Pacioretty's Golf Tournament","Luca Sbisa has received a PTO offer from an undisclosed NHL team, however agent \"confident that a new deal will soon be signed.\"","Useless Factoid of the Day #1: Most birthdays scored on","According to Sport-Express, two KHL teams, Avangard Omsk and AK Bars, are trying to sign free agent defenders Slava Voynov and Alexei Emelin.","With 37 days left, here's the Anaheim Ducks scoring 3 goals in 37 seconds","NHL 19 Player Ratings: 10-1","Russian hockey journalist Igor Eronko names Caps as a possible landing spot for Sergei Shumakov, a 25-year-old Russian RH LW that had 40 points (17G+23A) in 47 KHL games for CSKA last year, with 15 min. ATOI. CSKA &amp; Shumakov recently agreed to a contract termination so that he could sign in NHL.","Leafs legend/Hall of Famer Johnny Bower's 1965 children’s Christmas song “Honky the Christmas Goose” sold 40,000 copies — then a Canadian record. It became the most requested song on Toronto radio, displacing the Beatles’ “Day Tripper/We Can Work It Out.”","Rangers' Traverse City Tournament roster includes G Jeremy Brodeur, son of Marty","A New Blog Entry: Making the Case: The Hall Fame Candidacy of Alex Mogilny","(x-posted from /r/NBA) If you were to take someone who knew nothing of hockey, and show them solely the highlights of one player, who could you make them believe is a top-5 player of all time?","$10,000 well spent: The quirks of outfitting an NHL goalie","Best Regular Season NHL Teams Graphed","r/hockey Survivor: Round 29","Who the handsomest player on your team","With 37 days left, Tim Brent (TOR) sacrifices his body multiple times during a 5-on-3 kill versus the Canes","NHL will add 4 new on ice advertising positions for all games next season","[Kristen Shilton] Nazem Kadri today on William Nylander’s ongoing contract talks: “He wants to stay in the city of Toronto, he loves it here. He’s a tremendous player and he’s going to get a contract one way or another...with negotiations, you just have to stay patient and he understands that”","Best NCAA Active Roster","NHL.tv vs GameCenter Live. Can I sign into NHL.tv with a GameCenter Live account?","Off-season: r/hockey's favourite player from each NHL team: Toronto Maple Leafs (Day 26/31)","Why Quality of Competition doesn’t matter to analytics experts anymore","Ads in the corners of rink at TD Garden","Kalle Kossila (ANA) tricked us all, here's his real rating","With 37 days left, here is the Rick Rypien tribute honoring #37","Vancouver Canucks announce roster for 2018 Young Stars Classic | Sportsnet","Avangard Omsk (Bob Hartley's team) and AK Bars (Andrei Markov's team) are trying to sign Voynov and Emelin, but Emelin is practicing in Montreal, seems to be hoping for a PTO somewhere","Mike Johnson selects his All Underrated Team","Make the two best line ups you can. Underpaid vs overpaid","What trades made zero sense from the moment they happened?","Craig Anderson: \"I'm too old for drama ... Ottawa, I've been there for eight years now &amp; that's my home &amp; I got no interest in going anywhere else as long as we can clean up what was going on this summer\"","The KHL has introduced a new point system for this upcoming season to match that of the NHL. Previously a regulation time win gave three points. The goal is to make the league more competitive.","Has a UFA or RFA ever left to sign with a major rival?","Elite player's point percentage of team goals for 2017/18 season","Blues 3rd jersey revealed","What’s a significant team record that someone on your current roster could break?","Sergei Samukov has cut ties with CSKA","Jeff Veillette (/u/jeffler) makes a good point about Zetterberg's injuries","Top 100 NHL players of 2018–19: 100–51","Who are the most overrated young players (U23) in the NHL?","projected ufa/rfa contracts","[NHL Network] Top 10 Goalies: Recap","Oilers' Nurse optimistic new deal will be reached before training camp","I own a Borje Salming game used stick autographed by Bobby Orr (Pics and Story inside)","Who is the RHD GOAT?","With 37 days left, here is a Patrice Bergeron compilation showing why he is always a Selke finalist.","What are the most overused memes here at r/hockey?","The San Antonio Rampage today announced that J.J. Daigneault and Daniel Tkaczuk have been named assistant coaches and Ryan Ward has been named video assistant coach.","TSP: 2018 NHL Organizational Prospect Rankings","McQuaid still provides punch to Bruins lineup","Was/Is Hockey Night in Canada how they project it to be in the commercials?","With 37 days left, here's #37 Adam Burish making a great kick-pass to John Scott, who snipes his first goal in 37 games during his Sharks debut.","Adult Ice Hockey Tournaments in Chicago?","What are some good team-centric podcasts?","Top 10 2017–18 NHL Regular Season Comebacks (credits to YT Conyo 19)","Name 2 players in a comment, and people who reply try to guess who’s taller","When a tryout is not a tryout: Survival tips for hockey parents | CBC Sports","Look for some Hollywood creativity from ‘Mr. Blockbuster’ Jerry Bruckheimer in Seattle’s NHL team","With 37 days left, here is a compilation of now #37 Andrei Svechnikov's 2017-2018 season","NHL source says Slava Voynov has NOT been cleared to return to the NHL.","Chicago Blackhawks: Is this team ready to bounce back?","What Players on your Team do you believe will over perform and under perform?","Downvote please, but has NHL.com all players tab of their statistics been very unreliable lately with constant \"There is no data to display\" errors and it often just not loading at all?","NHL Tonight : Hockey analytics: Breaking down the use of hockey analytics Aug 24, 2018","Sources: Martin Brodeur is leaving the Blues","Shootout Tournament ---- Make Your Move | 2018 Edition |","Actual Minutes of \"Ball in Play\" for Major Sports - NHL=60, Soccer=57.6, NBA=48, MLB=18, NFL=11","Subreddit Picture of the Week: Make your submissions &amp; votes","#NHLJets have agreed to terms with 2017 first round pick Kristian Vesalainen on a three-year, entry-level contract worth an average annual value of $1.492 million.","With 38 days to go until the start of the season, here’s #38 Vernon Fiddler doing his best Kevin Bieksa impression","Anyone else think McDavid was robbed of the Hart?","Chicago Pro Hockey League Playoff/Championship coverage video","Best place to buy NHL Posters in Canada?","The crossover logos have been popular lately. Our friends in New Zealand have gone too far. I present an actual inline hockey team called the Wellington Capital Penguins","Sharing a wealth of experience – Patrik Elias wants to give back to Czech hockey [Elite Prospects]","With 37 days left, Patrice Bergeron has a career night, scoring 4 goals against the Canes","Scouching's Eastern Conference Prospect Preview Pt. 1","Zetterberg has not be able to train during the offseason","Canadian Manner Mondays - August 27, 2018","What are some hard to swallow pills for fans?","Connor Murphy robs Pekka Rinne of a sure goal","[Mark Masters] Auston Matthews says talks are continuing, but he's in \"no rush\" to sign an extension:","Larkin's penalty shot","Which elite forward is the biggest defensive liability?","Splitting Season Tickets","Scheifele calls Josi one of top five NHL players","[Khan] Jeff Blashill said it doesn’t seem likely Henrik Zetterberg (back) will be ready to play, and if he’s not he’s not likely to play at all this season. Will know more when he has his pre-camp physical in mid-September.","Strickland: Martin Brodeur will remain in St. Louis with his family. Role with Devils expected to be focused on business side.","Off Days - Evander Kane","What is your favourite non-NHL jersey?","European hockey fans, how did jerseys become massive billboards?","Claude Giroux 2017-18 highlights","As the NHL continues to review the Slava Voynov situation, if they decide to allow the Russian Dman to return, he will probably face a suspension from the league once given approval to play. League, Union and Agent all involved in the process.","All You Should Know About the Hockey Hall of Fame","NHL Network: Top 10 Goalies","I need help from the boyfriends and women of the subreddit.","Are we going to see another rookie with 100 points again?","We often claim winners and losers in trades or that they’re win win. What are some examples of lose lose trades?","Desharnais scores twice including GWG in KHL Avangard Omsk debut [French text, Russian Audio]","What Trades Helped A Team Win The Cup?","Young players who will have a key season","Off-season: r/hockey's roast of the National Hockey League","Who’s a player who only played for your team for a little while, didn’t have much of an impact but you still love them?","30 best games from 17-18 to pass the offseason time","How the Maple Leafs sorted through scouting job applications to find the best candidates:","How much do guys in the LNAH or similar senior leagues in Canada make?","Which players are older then what you think and vice-versa?","What are the worst big name free agent signings/trades that were supposed to work out great for a team but ended up failing?","Whoever runs the Hurricanes twitter forgot how to count","Habs prospect, Jesse Ylonen, showcasing some nice hands and speed in the shootout","r/hockey Survivor: Round 28","[Семён Галькевич] Deputy chairman of the SKA board of directors Alexander Medvedev announced this evening that Slava Voynov got permission to return to the NHL","Off-season: r/hockey's favourite player from each NHL team: Tampa Bay Lightning (Day 25/31)","Hilarious Hockey player name game played by two fisherman","If the NHL had Christmas Day games, what matchups would you want featured?","Russian site at Allhockey Source NHL dock \"Kris Versteeg does not move to KHL's Avangard Omski\"","If signing Voynov guarantees that your team wins the cup this year, would you do it?","TBL coach Jon Cooper during a presentation: “Embrace the struggle, encourage adversity. You put these mini super teams together that go 45-0, what are your kids learning and what development is happening there? Players need to face adversity/figure out how to grow from it”","Who are some under appreciated coaches and trainers in the NHL?","What Panthers third jersey would you like to see?","What is the best starting lineup of players can you make that ever play for your organization post 1967?","Ottawa Senators Offseason Hub","[Michael Augello] Some of the best young prospects at Mastercard Centre for this year's #NHLPARookieShowcase","Stars and stripes benefit game","Vernon Fiddler falls down but recovers to score a shootout goal","Should Brady Tkachuk play for Ottawa this season?","What was the best playoff game (or series) that your team lost?","OFFICIAL R/HOCKEY WEEKLY BEST OF!! - August 26, 2018","Steamer - Short Piece on Stan Smyl","Garbage Goal #6 - \"1C\"","With the Pokemon tournament in town, Gnash is giving away “Hockemon” cards","Stanley Cup Finals ticketing question","Red Wings remove Hockeytown logo from center ice","With 38 days to go, here is #38 Jan Hrdina in a tangle with Bobby Holik.","American Hero Timothy Jimothy Oshie with a Metro Card","Max Domi with a huge stick save to rob Scherbak","Is this Dominik Hasek watching Donald Trump at WWE?","Which teams do you forget exist?","With 38 days remaining until the regular season, here’s former #38 Viktor Arvidsson sending the Predators back to San Jose for Game 7","Need help on how to watch this season","Would the NHL Benefit From Adding Its Own \"Players' Weekend\"?","Lets play hockey at the Bell Centre in Montreal!","AIHL GDT: CBR Brave @ Melbourne Ice 4pm AEST (11pm Pacific/2am Eastern)","What, in your unbiased opinion, is the best logo in hockey?","With 39 days left until the season starts, here’s #39 Logan Couture with a spin-o-rama goal","Who are your 2nd and 3rd favorite teams, and why?","Is Mario a HHOF builder?","$78,432 raised last night for Compassionate Care ALS from BC and BU Alumni, members of 19 NHL teams","With 39 days left until the season starts, here's #39 Dominik Hašek sending Gaborik airborne","The NHL Team Tier Pyramid","Alex Lyon has another horror themed goalie mask, this time with a bleeding Flyers logo","What's your top 25 under 25?","With 39 days left until the season starts, here's Sabres Legend #39 Dominik Hašek's Beyond Blue &amp; Gold","Who's the best (non-active) player to never have his jersey retired?","Here is Bovada's lines for this season for points. Would you bet the over or under on your team?","Fantasy: Power-play unit rankings for 2018-19","Draft Wayne or the rest of your team in their prime?","Avangard Omsk (KHL) have signed forwards David Desharnais and Maxime Talbot to one-year contracts.","Boston Bruins: Who will step up and in what roles will they perform in?","F Drake Rymsha Signs Three-Year Entry-Level Contract with LA Kings","r/hockey Survivor: Round 27","Someone Posted Earlier That Chandler Stephenson took Stanley to Humboldt. Here's a Photo of The Stanley Cup at The Humboldt Memorial","Another Day, Another Blog - The Top 15 Goalies For the 2018-2019 Season","Who was the most obscure player to come out of nowhere and put up big numbers?","Capitals Jersey Comparisons","If you were a GM starting a team and you had a choice of tavares or draisaitl right now who would you take?","Son of Golden Knights owner Bill Foley dead at 31","Off-season: r/hockey's favourite player from each NHL team: St. Louis Blues (Day 24/31)","The West Auckland Admirals are crowned New Zealand’s newest Birgel Cup champions [Highlights]","Beauty League still collecting sticks for Zucker's Stick Drive","How do you guys feel about fighting in the NHL?","Can someone explain WAR to me?","2018-19 NHL Best Bets: Which teams to put your money on","Columbus Blue Jackets release new logo","Hockey Jersey Etiquette: what do you wear when your team isn't playing at the game you're going to?","Write a haiku about your favourite team","In defense of using WAR in hockey: A Q&amp;A with statistics professor Michael Schuckers","What the NHL has to say about Habs first round pick, Jesperi Kotkaniemi","Impressive photoshop job by the Senators","Confirmed: Hallsy still a beaut.","Elliotte Friedman: Erik Karlsson reached out to say: it is not accurate that he is unwilling to sign long-term with a Canadian team.","The Hockey Guy - The Career of Dominik Hasek","[Rosen] Spoke to Noah Hanifin tonight about his contract situation with the Flames. He's an RFA still, but said he's \"super close\" to signing and has no worries about not being signed before players report Sept. 9. He said he feels he can take his game to \"the next level\" this season.","Feeling some hockey tonight! First time in 2 years","WHOSE LINE IS IT SATURDAY? AUGUST 25TH, 2018","Sibir goalie shows that some goalies can do more than just stop 'em.","found on bardown's instagram","if $5000 is raised for the Bruce Oake Recovery Centre, Elliotte Friedman will shave his beard","Ryan Suzuki roasts his brother, Nick Suzuki (VGK)","Tobias Enstrom has been named captain of MODO of the Swedish HockeyAllsvenskan, the team he grew up playing for","Trick play - Legal or not?","Which team do you hate the most from each division?","TIL The Minnesota Wild rotated their captaincy for their first 9 years","31 in 31: St. Louis Blues 2018-19 season preview","What is the worst marketing gimmick, past or present, that the NHL has tried?","AIHL GDT: CBR Brave @ Melbourne Ice 5pm AEST (12am Pacific/3am Eastern)","New York Rangers Offseason Hub","A Little Blog I Wrote Ranking the Top 50 Players For 2018-2019!","Bruins and Blackhawks going back to vintage 1930's look for Winter Classic","Bruins going with a real throwback logo for ‘19 Winter Classic","Which Forward is leaving New York?","My son was selected to the comet team in Fairbanks Alaska","NHL 19 Player Ratings Top 50: 20-11","Boomer on the FAN960: “Hanifin signing not imminent, but close to being done, will be ready for the start of camp”","TIL Patrick Roy and Mario Lemieux have the same birthday: October 5, 1965","Flyers goaltender Alex Lyon’s new mask (created by DaveArt) features an homage to The Sixth Sense","The all-too-predictable disappointment of hockey Twitter in the offseason","Has there been trade rumours as intense as the Karlsson situation only for nothing to ever happen?","Reminder, CHL starts in a week!!","Who will be the top 5 scorers in the league that have not scored 50 pts in their career yet next year?","T. Enström reportedly in agreement with MoDo Hockey, presentation expected at 3pm local time","The Cover Up: Some Players Will Do Anything to Gain the Edge","Off-season: r/hockey's favourite player from each NHL team: San Jose Sharks (Day 23/31)","r/hockey Survivor: Round 26","THE WEST AUCKLAND ADMIRALS HAVE WON THE BIRGEL CUP!","Over the past five years, participation in youth hockey in Arizona has increased 109 percent.","With 40 days until hockey season, here is #40 Alex Tanguay with the Stanley Cup winning goal in 2001.","Chandler Stephenson takes Stanley Cup to Humboldt","I made something for when the season starts!","An analyst at TI8 in Vancouver is wearing a John Tavares jersey.","Who has received enough praise that they can no longer be considered underrated?","Canadiens alumni to play game to benefit soldiers, veterans, first responders","Are there any scandals in Junior / College Hockey, similar to the \"Bag Men\" in College Football?","OFFICIAL FRIDAY TRASH TALK THREAD - August 24, 2018","Where do I start ?","If there was a draft where every active player was 18, what would your top 5, knowing how their careers pan out?","Capitals Stephenson brings Stanley Cup to Humboldt Broncos","Ève Gascon will be the first women goalie to play in the Quebec midget AAA league","40 Days, Here's 40 year old Chris Chelios scoring a playoff goal against Vancouver on his way to his 2nd stanley cup. Chelios would win another cup 6 years later at 46 and retire at 48.","Which team do you like the most from each division?","With 40 days left; here’s Dubnyks day one “save of the year”.","Elmer \"Moose\" Vasko 1961 Stanley Cup Champs Chicago Blackhawks","With 40 days until the season starts, here's 40-year-old Matt Cullen scoring a shorthanded goal in the playoffs","Belief around the NHL is Panarin wants to join the Rangers","Point totals in the NHL.","With 40 Days till the start of hockey season here's number 40 Henrik Zetterberg with a Conn Smythe Shift","With 40 days until the start of the Hockey season, here is Rask robbing Grabner for some #40 on #40 action","Who’s scoring the Stanley cup winning goal for your team this year?","Leafs announce they have hired Hayley Wickenheiser as Assistant Director of Player Development. One of a several personnel moves this morning.","Strickland: Word is Erik Karlsson does not want to sign an extension with a Canadian team.","IS IT HOCKEY SEASON YET?!?!?","[Nikita Kucherov] Vasy and I showing Artemi Panarin how good it is to play in Tampa","Game Thread: NZIHL Birgel Cup Final Game 2. West Auckland Admirals (1-0) @ Southern Stampede (0-1)","With 40 days remaining until the season starts, here's Michael Grabner (#40) scoring two shorthanded goals in 48 seconds","Major milestones, NHL records within reach for these 12 players in 2018-19","Canucks are undecided about naming a captain for next season","First look at Cam Ward’s new Blackhawks mask by Eye Candy Air","I am the founder of EliteProspects.com - AMA","Phillip Danault, Mark Barberio and Pierre-Cédric Labrie visit a boy at home recovering from brain cancer (FR)","Bruce Garrioch: Vegas/Dallas/SanJose have all circled back in recent days and are having talks with OTT for Karlsson. Traction in these talks could mean he's gone before the start of the season.","Daniel Sprong has the worst autograph of any NHLer.","With 41 days remaining, here's #41 Craig Anderson earning an emotional shutout against the Oilers on his first game back after an extended leave to tend to his wife while she underwent treatment for cancer","Viktor Antipin´s father: @BuffaloSabres offered a new deal to Viktor, but he used to play for championship (with @MetallurgMgn in KHL), not for 29th place in NHL. So, he came back to Magnitka.","If all NHLers were loaded into a Mortal Kombat or Injustice-style game, what different players' special moves be? Who would be OP?","Who will be the most overpaid player in 4-6 years?","Noelle Needham becomes first female Amateur Scout in the NHL","TheHomie123's Season Previews are changing a little bit","With 41 days until hockey season, it was 4-1","Panarin spending some quality beach time with Kucherov and Vasilevskiy &lt;3","THROWBACK THURSDAY: Aaron Ekblad in Grade 7, playing for a youth team called the Panthers","[Hornby] Zach Hyman on Hayley Wickenheiser's hiring as Leafs asst. director of player development: \"I haven’t met her personally, but she obviously knows the game really well. If you’re qualified you deserve to be here and she’s obviously over-qualified.”","You have to switch all your players and prospects with a non-playoff team's players and prospects (missed playoffs last year)... Which team would you pick and why?","I went on a hunt to find the NHL team that Dives the most","Ex-Wings No. 1 pick Joe Murphy living homeless 'for many years' -The Detroit News","What young, under-the-radar player on your team is going to have a breakout season?","Living with Asperger’s, Brady Boudreau following in his dad’s hockey footsteps","Which Team Will Have the Most Interesting Third Line This Year?","Only days after joining his new team, the Cardiff Devils, Tom Parisi is retiring from hockey","Barry Trotz riding a horse with the Stanley Cup in his hometown of Dauphin, Manitoba","With 41 days left until the season starts, here's the NHL DOPS video regarding Raffi Torres' 41 game suspension","Canucks COO Jeff Stipec confirms the Skate jersey isn't the 3rd jersey of the Canucks. They will announces an actual 3rd jersey in the same season (19-20)","Erik Karlsson trade to rebuilding Vancouver Canucks unlikely","Stephenson taking Stanley Cup to Humboldt to help town heal","[CPHL] Patrick Kane's backhand is filthy.","NHL 19 Player Ratings 30-21","Playing NHL 19 vs Mat Barzal","r/hockey Survivor: Round 25","Who are your teams best prospects that were drafted in the 5th-7th Rounds?","With 41 days left until NHL hockey, here's 41 year old Zdeno Chara fighting Jamie Oleksiak after a 2 minute PK shift","Who is the worst skater in the league?","Who are your team's best undrafted prospects?","Who is the next young backup to get dealt?","Off-season: r/hockey's favourite player from each NHL team: Pittsburgh Penguins (Day 22/31)","Scheifele's Top 5 NHL players today","What’s a trade between two teams that would make both better, but neither fanbase would be happy about it?","With 40 days left, Tuukka Rask takes exception to Cory Conacher.","If you were to bring any NHL legend into today's league at this point in time, who would you pick and why? (excluding the obvious answer of Wayne Gretzky of course)","Operation Land Erik Karlsson","Which NHL draft pick has been traded the most times?","If a bald guy with a toupée goes to a hockey game and his favorite team scores a hat trick, is it acceptable for him to throw his wig onto the ice?","Coyotes' Alex Galchenyuk excited for chance to play center","I have a stupid question about buying tickets and rows.","Why isn't the title of this subreddit \"The best game you can name\" instead of \"The best game on earth\"?","Who is the Coach or GM that has never won a Cup that you would like to see win one?","What is the doomsday scenario for the 2018-2019 season for you, personally?","With 41 days until the regular season, here's #41 Mike Smith letting in the strangest goal he's ever allowed.","Who are your teams best prospects drafted in the 4th and 3rd Rounds?","If a college hockey team played a full 82 game season against NHL teams, do you think they would win at least 1 game?","With 66 days left until the NHL'94 World Championship III, here is Mario Lemieux winning the Stanley Cup in 1991, NHL'94-ized - \"Game 6 The Movie\"","With 41 days remaining to the start of season her is #41 Mike Smith scoring a goal in All-Star game","General Discussion Thursday - New and Improved","Number 41 Jason Allison with a Hattie","What have been some of the biggest contract negotiation blunders that cost a player a lot of money?","Garbage Goal #5 - \"Negotiations\"","Patrik Laine's rating and highly embellished beard reveal for NHL 19.","Frequency of Final Scores During the 2017-2018 NHL Regular Season","r/hockey’s favorite uniform/jersey from each team: Arizona Coyotes (Day 2)","Looking at league rankings using stats","First picture of the big new Canadiens logo on Bell Centre center ice","There is a sense today that Erik Karlsson trade talks have picked up in the last few days. Most likely destinations appear to be Western Conference. There is also a belief VAN has stepped in to see if it is a match.","Raise Up! by Petey Pablo will be the Hurricanes' goal song this season","Autographed Don Cherry suit just went for $6,750 at Bruce Oake Recovery Centre Auction","Allan Walsh defends Jason Chimera: \"He’s NOT 40, he just turned 39. 20 goals in 2 of the last 3 seasons. Can still fly! As for PTO’s, you told him conversation was OFF THE RECORD. Disappointing....\"","#Canucks Benning on peddling 2019 draft picks (with draft at home): 'that's a non-starter. I'm not trading next year's draft picks'","With 41 days until the regular season, here is #41 Breakaway Byron with a last-second game winner","Which Player Does r/hockey OVERRATE the Most?","Quick conversation with Canucks' GM Jim Benning, says there is no truth to the Canucks being in the Karlsson trade conversation.","Lokomotiv released Desharnais because they didn't realize he was a center","Looking For a Fun Conversation About All Things Hockey? Check Out The \"Light the Lamp\" Podcast!","Canadian golfers honour Humboldt Broncos at LPGA event in Regina","Boeser bats it out of the air.","Why the Lightning are the only team that makes sense for Erik Karlsson","Patrik Laine plays Fortnite - \"I'm better than Matthews and Eichel\" (TSN)","Karlssons partner with Ottawa organization for launch of anti-bullying charity","What would expansion past 32 teams be like in the NHL?","Morning Bagger Hockey Podcast Going Bye Bye","[Murray Pam] Per source #Leafs D prospect Rasmus Sandin will not return to the Soo. Sandin is currently with Rogle #SHL. However, #Marlies remain an option.","Russian charity game featuring Datsyuk, Kamensky, Malkin, Radulov, and THE FINNISH FLASH","Flyers say Sean Couturier will miss four weeks with what is reportedly a re-injury to the MCL in his right knee.","TSN Original: Finding Murph","For all you Thrashers fans out there...","Hey R/Hockey - What's the best stick for ball hockey","With 42 days remaining, Here is #42 Tyler Bozak with one of the prettiest first career goals you'll ever see","Pietrangelo vs Subban","[SPORTSNET] Erik Karlsson Trade Talks Heating Up w/ Elliotte Friedman | Prime Time Sports","Off-season Compliment Thread 23/31: Anaheim Ducks","(Dreger) Clinging to remaining holidays, however, sources confirm teams with interest in Erik Karlsson have stepped up of late and talks are moving.","Barry Trotz gets street named in his honor.","Who are your teams best prospects drafted in the 1st and 2nd Rounds?","With 40 days left until the start of the season, here’s Tuukka Rask robbing Tyler Bozak with the stick","Historical powerplay % by franchise. One franchise seems to stand just a little above the rest...","Bruins’ Zdeno Chara Could Play ‘Four Or Five More Years,’ Bruce Cassidy Says | Boston Bruins","With 42 days remaining, here is #42 Joel Ward ending the Bruins hopes of repeating as Stanley Cup champions","With 40 days left until the regular season. Was this #40 Henrik Zetterberg’s last goal as a Red Wing?","New York Islanders Offseason Hub","Jets RFA Morrissey confident he'll sign soon - TSN.ca","Emerson Etem will be in Kings' camp on a PTO.","Which players have exceeded expectations the most?","Sean Couturier back in South Jersey after reportedly re-injuring knee","Cossacks on horseback, Ukrainian music accompany Stanley Cup through Dauphin","Strangest Place You've Seen an NHLer/Ex-NHLer?","Why do pro hockey players have such slight builds?","As opposed to overrated or underrated, who is pretty correctly rated?","r/hockey Survivor: Round 24","[TSN] Humboldt Broncos' President steps down.","Bruce Garrioch : With camp set to open Sept. 13th at the Canadian Tire Centre, interested teams are engaged in serious discussions again.","Good sources for NHL news?","Should the the NHL playoffs format be changed in anyway?","The Vegas Golden Everybody","Off-season: r/hockey's favourite player from each NHL team: Philadelphia Flyers (Day 21/31)","From a rink in Michigan","With 42 days until the season starts, here is Vin Scully at the Dodger Stadium outdoor game telling a story about being challenged to a race on skates by #42, Jackie Robinson","Made this when I moved from Pittsburgh to Tampa. The Lightguins","With 42 days remaining, Here is #42 Nathan Gerbe with a spin-o-rama backhand goal that tied the game and sent the Sabres to the playoffs (2011)","What is your top 10 ranking in term of NHL teams with the best/deepest prospect pool?","Jay Beagle picked up the cup in Calgary, driving his 1986 GMC Jimmy","Question for advanced stats people.","With 42 days left, here's #42 Kyle Wellwood dekeing Chris Mason out of his pants after a turnover","Without saying what the category is, what are your top five? (stolen from askreddit)","The Vancouver Flames","Why did Coffey and Murphy move so much?","42 days left, so here's #42 Josh Manson streaking in all alone and showing some deft hands as he undresses Bobrovsky and tucks it home","31 in 31: Philadelphia Flyers 2018-19 Season Preview","Good hockey history book?","With 42 days remaining, here’s Joel Ward scoring the game-tying goal in game 3 of the Stanley Cup finals","Stanley Cup windows: Pacific Division","NHLers answer: Biggest Pet Peeve in Life?","[Westhead] No one reason for the fall of ex-players like Murphy","Top 10 High Scoring Games 2017–18 NHL season","TheHomies123's Season Preview 7 of 31: The Ottawa Senators","John Scott Cup Finals Right Now!","Devils release 3rd jersey design","With pre-season being under a month away... What are the most memorable pre-season moments?","Carey Price on last season: 'I can play better than that'","40th - 31st highest rated players in NHL 19","[Mendes] Senators announce that assistant GM Randy Lee has resigned. Club announces a search for his replacement is underway.","Matthews/Laine have the same rating in NHL 19 of 89 as Giroux: Fair or not?","Is there such thing as a 'scoring' defenseman?","The Anatomy of the Break-Up between the Coyotes and director of amateur scouting Tim Bernhardt","Linus Omark shootout goal with the lights off and an LED stick","How (I think) the draft should work: with data!","WAYBACK WEDNESDAY: Don Cherry gets fabulous at a 1991 playoff game in Los Angeles (Ron with the zinger at the end)","A friend of mine asked me to draw Phil Kessel, I took some creative liberties.","Why is Nico Hischier so underrated?","Stanley Cup windows: Central Division – TheHockeyNews","Who Won That Trade? Wednesday","This upcoming 2018-19 season is the halfway point of Ryan Suter and Zach Parise's 13 year contracts.","Stick Choice- play to strengths or assist in weaknesses?","r/Hockey ‘s favorite uniform/jersey from each team: Anaheim Ducks (Day 1)","Fox Sports on SlingTV?","The Hockey Guy's award predictions for 2019","alex galchenyuk doing shoutouts for $10","Edmonton Oilers offered a PTO to Brandon Davidson, who declined. Looking for a contract offer.","r/hockey chatroom?","Erik Karlsson in a commercial for a recovery drink","Vernon Fiddler is joining the Stars coaching staff this season in a skills/development role.","Montréal Canadiens are going with one logo at center ice","The Winnipeg Jets have signed RFA forward Nicolas Kerdiles to a one year, two-way contract at a league minimum $650k AAV","Ryan O'Reilly v. Jeff Skinner","TIL that the average NHL ticket price in 2001 was only $49.86","[Spector's Hockey] Former NHL forward Michal Handzus will officially announce his retirement as a player this Friday. He last played in the NHL in 2013-14 with the #Blackhawks and spent the following three seasons playing in Slovakia.","AMA Announcement: Johan Nilsson, Founder of EliteProspects.com - Thursday 12 PM ET / 9 AM PT / 5 PM CET","HC Severstal (KHL) with some stylish team photo","What is the worst trade your team has ever done?","Fort Wayne Komets(ECHL) announce affiliation with the Vegas Golden Knights.","What would your team look like today if you only had the players you drafted?","With 43 days left until hockey, here's Tom Wilson and Brayden Coburn dropping the gloves in Game 7 of the Eastern Conference Final","You are a mad hockey scientist. You can absorb one distinctive quality from five different \"one hit wonder\" players - players with one distinctive quality and not much else -, and then transplant them onto Tanner Glass. How do you make the best Glass possible?","Mount Rushmore for each NHL team, what do you think?","r/hockey’s favorite uniform/jersey from each team - INTRO THREAD","Ilya Kovalchuk's unRetirement confusion?","With the recent trend of teams bringing back vintage jerseys as alternates, what's a jersey you'd like to NEVER see used again?","50th - 41st highest rated players in NHL 19","What are some of the greatest ‘answers’ in NHL history?","With the recent trend of teams bringing back vintage jerseys as alternates, what's a jersey you'd like to see be used again?","Statement from Randy Lee","Lokomotiv will terminate deal with David Desharnais","r/hockey Survivor: Round 23","Which jersey number could currently ice the best starting 6?","ELI5: Why did the NHL change the jerseys (at home from white to color) and Why doesn't color vs color exist?","What would happen if a player got an injury while being suspended?","Boston Blades (CWHL) moving to Worcester","With 43 days remaining, here is #43 Tom Wilson saving a goal and scoring on the same shift","Turkmenistan goalie Rahman Muratov makes a grave mistake at the 2018 IIHF Ice Hockey World Championship Division III Qualification vs. Kuwait","With 43 days until the regular season, here's the Kadri and Thornton \"beard\" fight from last year","The Calgary Flames have signed UFA winger Anthony Peluso to a 1 year, 2-way contract (NHL Salary: $650k; Minors Salary: $125k w/ $150k gauranteed)","Top 3 teams furthest from winning a cup?","NHL Comparisons: Nico Hischier vs Nolan Patrick","Is the western states hockey league good?","What's your best free information sources for your hockey pool?","Columbus Blue Jackets name Jim Corsi goaltending development coach","Senators alternate governor Sheldon Plener named Lawyer of the Year 2019","\"Be patient!\" A hockey story of Radek Koblizek, player of Kärpät in Liiga. Originally published in Czech Players' Tribune -like site run by ex-NHLer Radim Vrbata","Anyone else into goalie mask paint jobs?","Malkin has set a new world record: 120 passes before scoring a goal","Does Erik Karlsson need to be Traded? Why not Duchene or Stone?","The San Jose Ducks","Oduya: Ottawa don't have the same stability or tradition as other clubs, if something minor happens then the house of cards fall apart really fast. Big difference compared to other clubs I've played for","Highlight from last year: Connor Brown gives Maple Leafs lead in required win to make playoffs a season after finishing last. Huge saves by McElhinney including Crosby open in front and Matthews scores #40 in rookie season","Tenderfoot Tuesday: Ask /r/hockey Anything! August 21, 2018","Offside?","Off-season: r/hockey's favourite player from each NHL team: Ottawa Senators (Day 21/31)","Dave Andreychuk’s Stanley Cup win with Lightning was cherry on top of Hall of Fame credentials","Full schedule released for 2018-19 Rogers Hometown Hockey tour","With 43 days left until the start of the season, here's Tom Wilson downing his hometown team in OT","What are some teams with a good trade history?","When I was younger my dad went to the rink every week and got broken sticks, he built a half wall. Pretty cool if you ask me","With 43 days left until the start of the season here is #43 Darren Helm scoring the series clinching goal in the 2009 Western Conference Finals","The Flames have acquired forward Kerby Rychel from the Montreal Canadiens for Hunter Shinkaruk","Scouching's Western Conference Prospect Preview Pt. 2","Who are the top 10 goalies in the NHL right now?","Offseason boredom got me reminiscing and curious. Here's the Iginla vs Lecavalier fight. What other Captain vs Captain fights were there?","Which KHL team is going to win the Gagarin Cup this year?","Just got my tickets for the NHL game in Shenzhen, China. Boston Bruins and Calgary Flames will meet on 15 September.","Maven's Memories: Birth of the Boys from Uniondale","A hockey team question","Beer league team alt logo I designed for a buddy. Grand Rapids Brewsaders","[Da Beauty League] Boeser somehow regains control and beats the goalie","Seattle Sockeye Concept &amp; Variations","Transaction Alert: The #Flames have signed forward Kerby Rychel to a one-year contract.","[Da Beauty League] Jason Zucker goes bar down on the breakaway","Problems with figure skaters at public skate?","[Da Beauty League] Alex Stalock with an incredible diving save","Devils sign 2018 1st rounder defenseman Ty Smith to entry-level contract","With Kerby Rychel joining the Flames, 7 first rounders from the 2013 draft have played/joined the team","Which playoff caliber team(s) will get off to a slow start in 2018-19 and why?","NYR have agreed to terms with free agent goaltender Dustin Tokarski on a one-year contract.","The Oilers have signed Jakub Jerabek to a one-year contract.","Canadiens agree to terms with Hunter Shinkaruk. $650,000 at the NHL level and $80,000 in AHL salary","Did the 2013 lockout solve a lot of problems?","Max Pacioretty and Anson Carter playing hockey with Max’s kids in the basement of their home during Sportsnet film shoot","Sim League Openings (Free to play)","New Jersey Devils Offseason Hub","Late Night Hockey: Why the NZIHL’s Birgel Cup Final should be on your radar. No, seriously, lock it in.","[TSN] Joe Murphy was a 1st overall NHL Draft pick, a Stanley Cup champ, but is now living homeless. What can be done to help? ‘Finding Murph’ airs Wednesday on Sportscentre","Who is the best forward in the NHL that has never scored a hat trick?","INTERESTING STAT LINE: Craig Billington, worst starting goalie ever?","New Scoreboard for Golden Knights at City National Arena","HC Sibir goalie, Krasikov, takes penalty shot.","With 44 days left, here's #44 P4GE4U scoring 4 times against the Rangers","r/hockey Survivor: Round 22","With 44 days before the season begins, here's #44 Kimmo Timonen finally hoisting the Stanley Cup","Part 2 of modern NHL players as retro hockey cards, via BarDown","With 44 days left until hockey, here's #44 Morgan Rielly taking out the trash","I've been saving my broken sticks for a few years. Today I did something with them","With 44 days left, here’s a video of Chris Pronger sniping Wardo for the first and only penalty shot goal in Stanley Cup Finals history. Go Canes though.","The Calgary Canucks","NYI 2nd Round Pick Bode Wilde signs with OHL's Saginaw Spirit","Best player of each number?","Exclusive: Carey Price gives first look at CCM NHL-Spec Chest Protector - InGoal Magazine","Carey Price is now featured in BC Sports Hall of Fame's new, permanent Indigenous Sport Gallery at BC Place","Anyone have a full recording of a Foster Hewitt RADIO broadcast of a game?","With 44 days left, here's 44 doing his best impression of 4","With 45 days left, here’s Brock Boeser saying “you know” 45 times in a single interview.","[HC Spartak Moscow] defeats WEV Lions (3rd tier Austrian side) 23-2 in a preseason game. Five Spartak players had hat tricks including a four-goal performance by Gleb Shashkov","Favourite Referee?","Fan vote for top 20 wingers in the NHL.","Three time olympian, bronze medallist and tournament MVP in 2014, Florence Schelling, to become an assistant coach for Switzerlands Women's U18 National Team","Take an existing franchise and move it to a city that has a team already","18mins of Drake Batherson dominating the QMJHL (2017-18 Highlights)","Off-season: r/hockey's favourite player from each NHL team: New York Rangers (Day 20/31)","Who did you wanna be like growing up?","San jose arena and Las vegas knights arenas","31 in 31: New York Rangers 2018-19 Season Preview","Stan Fischler Joins NewYorkIslanders.com","What's with the Ducks?","In The Neutral Zone - Podcast","With 44 days left until hockey, here's Chris Pronger scoring on Patrick Roy (ft. Al MacInnis and Uwe Krupp)","With 44 days left until hockey, here's #44 going coast-to-coast for a beauty","44 Days Left: Here's Brooks Orpik scoring the first SCF GWG in Caps History (and his first goal in 2+ years)","Why were Ovi’s Capitals always considered perrenial chokers (before this year) instead of Thornton’s Sharks?","Biggest Ryan Reaves Hits of 2018","Scouching's Western Conference Prospect Preview Pt. 1","Could a goalie be awarded a penalty shot?","Ovechkin definitely surpasses Gordie for 2nd all-time goals (imo), but does he even come close to 895? If so, how old would he be once he accomplished the feat?","Nicklas Backstrom’s mom did a Cup stand","TIL Mike Babcock was the Paul Coffey of the British Hockey League scoring 132 points in 36 games.","Halifax goaltender silent no more about how hockey left him mentally crippled","Weekday Matinee Games?","With 43 days left, here's elite caps winger, Tom Wilson, with an early deflection during game 2 of the 2018 ECF.","Merging two of your current’s team players","Sum up in one image how the last season went for your team","With 44 days until hockey, here are all of Dennis Sedenberg's redline goals.","TSN Original: Finding Murph Trailer","Some pre-season games from the EIHL, for those of you who really need some hockey.","NHL Top Players: Top 20 Wings","Kronwall says this season with Red Wings could be last in NHL","Which player is going to make the biggest jump?","Oilers sign F Scottie Upshall to a PTO","With 43 days left until start of season, here is #43 Val Nichushkin crushing Marc Methot","Recommended offseason podcasts?","Can anyone recognize the players on this video game cover (released in 1993)?","What are some franchise records a player on your team could set in the 2018-2019 season?","Hockey Shots with Super Tacks | Roh97","Victor E Green has been hitting the karaoke bars lately","The Ottawa Canadiens","what’s your “oops I didn’t know you were a professional hockey player” story?","Who is an elite fourth liner in the NHL?","Canadian Manner Mondays - August 20, 2018","What team (other than your favourite) do you want to win the cup this year?","Nashville Predators Offseason Hub","Pro Hockey Media Relations 101","Saved some floor space in the garage and came up with a DIY pvc hook system for the hockey gear.","Coyotes and Director of Amateur Scouting Tim Bernhardt have mutually agreed to part ways.","r/hockeycards isn't the most active sub. Does anyone else collect?","R/HalifaxMooseheads Finally Active For Junior Hockey Fans","Prospects and their archetypal players","For fans of their hometown team, if your team and your most hated rivals switched cities which team would you support?","Cities you'd like to see an NHL team in (besides Seattle)","Witch team across the world of sports can out crazy the other?","Who is the consensus 3rd best current player in the league?","Thought I'd share this; the arrival plate into Toronto Pearson has some interesting way points!","We often discuss the hockey gods. Who are these mythical deities, and do they have as many weird origin stories as the Greek pantheon?","Which player on your favourite team that will be a UFA in 2019 do you think is most likely to depart?","r/hockey Survivor: Round 21","I made a Tableau dashboard to visualize the nationalities that make up the NHL and each team","Guy Lafleur and the 10-Year Contract: Part III — L’Affaire Lafleur","Off-season: r/hockey's favourite player from each NHL team: New York Islanders (Day 19/31)","31 in 31: New York Islanders 2018-19 Season Preview","500 Goals: Who's Next?","With 44 days left, here's #44 Josh Morrissey cross-checking Eric Staal in the head (which had no effect on the outcome of the game)","Subreddits for hockey prospects?","Matthew Barzal | The Kid","Sidney Crosby and Nate MacKinnon take a break from practicing together for a picture","Sharks goalie prospect Antoine Bibeau gives mask the 'Jaws' treatment","Japanese Bootleg Ottawa Maple Leafs cap","Alex Ovechkin and Nastya Ovechkina welcome their first child, Sergei Aleksandrovich Ovechkin","The New York...Rangers?","With 44 days left until the start of the season here’s a couple of goals by the greatest #44 in NHL history Todd Bertuzzi with an amazing go ahead goal and a great shootout goal against Dubnyk and the Oilers in 2012","The Chirizolina Hurryotawks","Roberto Luongo and family, 1997","OFFICIAL R/HOCKEY WEEKLY BEST OF!! - August 19, 2018","Crosby’s fast hands","Is NHL.tv worth it?","If a rookie goalie happens to win the vezina do you think they should also win the calder?","The Philadelphia Penguins","The time has come","Flamin' Buffalo Wings.","Crosby's 2005 Draft Media Guide Bio","What other players in the league just need the opportunity like William Karlsson had?","Hits per game in the 2018 playoffs","With 46 days remaining until hockey season. Here's number 46, David Krejci getting smashed in the head by a falling pane of glass after a fan knocks it down.","As an expat living in Hong Kong for years, I am beyond pumped for this! NHL Hockey in Mainland China!","You can place one 8.5 x 11 piece of paper on the desk of your team's GM so that he sees it when he sits down at his desk Monday morning. What does it say?","Let’s settle this once and for all. Is Alex Galchenyuk a center or is he a wing?","Former Leafs enforcer and advocate for retired NHLers, Kurt Walker, dead at 64","Blue Jackets' media team taking no shit","That time Ovi almost decapitated himself and mike green.","Why Your Team Needs to Acquire Brendan Leipsic","TheHomies123's Season Preview 6 of 31: The Toronto Maple Leafs","The NHL is now just a series of line brawls. What team do you think wins the cup?","With 46 days to go here's Jared Spurgeon batting it out of the air","What are biggest examples of \"if this guy was on any other team, he'd be a captain\" situations -- past or present?","What’s your fantasy NHL lineup? Retired, active, doesn’t matter. Mix it up...","Do we know yet when the NHL Player Media Tour is this (upcoming) season?","Canucks tell youth lacrosse team to hand over customized Johnny Canuck jerseys","Who's That One Player From YOUR Team That YOUR Own Fans Dislike?","AIHL GDT: Perth Thunder @ Melbourne Ice 4pm AEST (11pm Pacific/2am Eastern)","With 45 days left, Arron Asham's knockout of Jay Beagle","[IDEA] International outdoor games for bad/struggling teams.","Which hockey AMA would be the most interesting?","Part 3 of S7 and KP8’s Colour Rush jersey concept series: Metropolitan Division","What 3 numbers did Bobby Orr wear through his junior to nhl.","Who didn’t get punished enough for their actions?","The Great Goalie Debate: Ranking the NHL's 31 starting netminders in 2018-19","Montreal Canadiens Offseason Thread","I made a subreddit about Czech hockey, feel free to check it out!","Can a forward be registered as a defencemen on the score sheet, and have their stats count towards defenseman stats?","Garbage Goal #4 - \"Dobby\"","r/hockey Survivor: Round 20","Whose going to win the Vezina Next Year?","Question about player stats","The Calgary Oilers","The Montreal Bruins","18 years worth of broken sticks totalling way more money than I’d like to know, but at least they’re getting a second life","Stumbled upon this office in Seattle today","What risky draft choices were the result of lots of scouting?","Which team do you think has the best coaching going into this season?","100 days with the Stanley Cup - Each of the Caps’ “day with the Cup” (so far)","Off-season: r/hockey's favourite player from each NHL team: New Jersey Devils (Day 18/31)","When did TV timeouts first become a thing in hockey?","If Wayne Gretzky hadn't retired in 1999, and never scored another point, he would have only dropped below 1 Pt/GP this past season...","Ahead of the NHL Network reveal, who is on your top 20 wings right now?","7 Teams with Captaincy Vacancies. Who do you think will/should fill the openings?","Hall of Famer Eric Lindros' idea to eliminate body contact from NHL should be commended","2018 Stanley Cup Documentary?","The Edmonton Flames","WHOSE LINE IS IT SATURDAY? AUGUST 18, 2018","Here's an glorious freeze frame from an Islanders-Sabres game this year. What's favourite photo like this one?","Spotted in Ottawa","Why Miro Heiskanen believes he's ready to make NHL leap for Stars","Oscar Dansk has a message for William Karlsson after Karlsson started hanging out with Pierre-Édouard Bellemare","Teemu Selanne, Patrik Laine, Teppo Numminen, Sami Niku and Veli-Pekka Ketola finishing the Liiga alumni game in Jets jerseys","Want to ask Gerry Cheevers some questions?","Draisaitl confident Oilers will rebound","Chad Johnson's new Blues mask","This show. I want more. Watch \"Road Hockey Rumble - SEASON II TRAILER!\"","Besides choking, what's one thing you hate about your team?","Why did the Jets move to Pheonix in 1996?","[Video] Aaron Ekblad discusses his off-season training on synthetic ice","What changes would you like to see in current NHL uniforms?","#Isles President and GM Lou Lamoriello on @SiriusXMNHL on analytics: “You have to be very careful with it. It can get in the way.”","Eric Lindros suggests drastic rule change to save future NHLers from concussions: Ban body contact","Throwback: Gretzky throwing on the brakes and changing direction while faking a slapshot followed by a slapshot goal for his ninth career playoff hat-trick.","You can bring back 3 retired players (in their prime) to help your team who you taking.","Interesting Statistic: Since winning the Stanley Cup in 2014, the Los Angeles Kings have only won a single playoff game","What are some hard pills to swallow for teams fan bases?","You guys like this new Canucks Jersey?","NHL Tonight: Central picks: Mike Johnson breaks down his Central Division picks Aug 17, 2018","Who would win between these combination teams?","NHL 19 Franchise Mode Scouting Reveal","AIHL GDT: Adelaide Adrenaline @ Newcastle Northstars 5pm AEST (12am Pacific/3am Eastern)","Kotkaniemi and Koivu meet for the first time. Canadiens past and future.","With 47 days left here’s Hampus Lindholm scoring in OT after r/hockey’s #1 voted most ENTERTAINING OT of all time.","\"I'm having a hard time believing this is true but it seems like it might be. The Oilers were -4 (outscored 4-0) in the ten seconds after a 5v5 OZW last year. Next worst team of this decade is the 2012-13 San Jose Sharks at even.\"","Poetry","NHL charity event in my town!!","If you were being forced to trade your captain for another captain in your same division, who would you trade for?","With 47 days left, here is Komarov being Komarov","Top 5 players your team can't afford to lose to injury?","Would your hockey watching habits change if you knew your favourite team would never win another cup in your lifetime?","NHL Tonight: Atlantic picks: Mike Johnson reveals his Atlantic Division picks Aug 17, 2018","Are there any hockey players who have decided not to play in the NHL because of issues related to immigration?","[Mirtle] Thoughts with former Leafs tough guy Kurt Walker who is in intensive care and battling for his life due to a sepsis infection. Walker has been a big advocate for former players struggling with post-career injuries.","Versteeg headed to Omsk of KHL","Stats about arena volume?","Elias Pettersson flashing the wand at Växjö skills comp.","Why is stopping more effective than turning?","NHL Tonight: Metropolitan picks: Mike Johnson selects his Metropolitan Division picks Aug 17, 201","NHL Tonight: Pacific picks: Mike Johnson makes his Pacific Division picks Aug 17, 2018","r/hockey Survivor: Round 19","Why were the Vegas Knights so dominant throughout the playoffs till they got the SCF?","For your Arguing Pleasure, The Hockey News Experts give their predictions for 20 categories","Flashback Friday:Ryan Miller vs Jean- Sebastian Aubin in a Yo Mama contest in a commercial for AMP Energy","With 47 days left, here's Radulov falling on a SO, recovering, and scoring.","Which European teams have the best crowds?","(Probably already been done but...) who is a player from a despised rival team that you shamelessly love to watch?","With 47 days until the season starts, here’s Torey Krug blasting into the NHL with 4 playoff goals in 5 games.","Ryan Dzingel makes an 'Appreciation Post' for Duchene","Off-season: r/hockey's favourite player from each NHL team: Nashville Predators (Day 17/31)","Do any teams do fan throwback nights, where fans dress of like fans of bygone eras?","What each NHL team does with the hats thrown on the ice during a hat trick (via Hockey News Magazine)","ScotianCanadien43's 2018-2019 Montreal Canadiens Season Preview","Make Your Team's Prospect Pyramids","First live game, where should we get seats?","5 in 5 out","OFFICIAL FRIDAY TRASH TALK THREAD - August 17, 2018","With 47 days left, #47 Torey Krug snipes it to tie the game 4-4 against the Leafs in Game 7.","Darryl Boyce retires from playing to become Coordinator of Hockey Operations &amp; Player Development for the Moncton Wildcats.","Joining a hockey league","For anyone who works nights, the Australian Ice Hockey League streams their games in great quality including commentary.","Five years ago, for their 60th anniversary, CBC's Hockey Night in Canada dropped probably the best intro to a hockey broadcast ever.","Would you rather: Lose a season or a key player?","Ryan Ellis: “I'm getting paid more than enough to play hockey... It was just about coming across a fair deal that would work for both sides. We have other guys that need to be signed in the future, and I had to do my part to keep this thing going in the right direction.\"","Can someone explain how the expansion of a new team can affect each team?","Every Hockey Player from ESPN's Body Issue","Help, need some advice. Son has abandoned hockey and prioritizes gaming.","Share your favorite hockey wallpapers!","will luongo make the hof","When was your team's last hat trick? 2017-18 edition","What an NHL Referee Job Post Looks Like","Mike Johnson ranks the best non-playoff teams Aug 15, 2018","NHLers who have played in 4 different decades","Elias Lindholm in a Flames jersey for the first time","Tampa Warriors hockey team helps injured vets [The Athletic - Non-paywall]","4 Most Hated Teams","KB3's instagram post about Rypien","Old photo of mine on Excelsior Bay - Lake Minnetonka, MN. Fish were visible through the ice. The puck ran for seemingly miles.","Who is going to win the stanley cup?","AIHL GDT: Melbourne Mustangs @ Melbourne Ice 7:30pm AEST (2:30am Pacific/5:30am Eastern)","[TSN] The Leafs are actively shopping Calvin Pickard","With 47 days left until the season starts, here's #47 Alex Radulov channeling his inner Forsberg to put the Habs up 3-0 on the Rangers","A Little Blog I Wrote About the Top 2019 NHL Draft Prospects","TIL: After starting his career as his backup in Chicago in 1990 and dueling with him in the 1999 Finals, Dominik Hašek also faced Ed Belfour in the first shootout in league history in 2005.","Kris Versteeg very close on a deal in the KHL","Australian Ice Hockey with Biznasty","John Bartlett joining Sportsnet, will call HNIC and Leafs regional games. Paul Romanuk out.","Interview with Dale Mitchell - Former Windsor Spitfire, Oshawa General, and Toronto Marlie. Talks his jr. and pro career, and the jump to international play","With 47 days left - AK47 Alex Radulov First Goal for Stars","Bryan Berard suing NHL over concussions, brain injuries","Who are some players that vastly exceeded their initial projection?","Laine: 'There's no rush' to sign contract extension","Who are the biggest trade targets in the NHL and where do you expect them to go?","[Comeau] The one defenseman most ignored in the NHL Top 20 rankings: Jaccob Slavin","Aho, Hurricanes discussing contract extension","Nylander says 'no extra pressure or urgency' to sign with Maple Leafs","Nico Hischier recovered well from his wrist injury, ready for Global Series","Would a Hockey Version of Ice Cube's and Basketball's \"Big3\" League work?","At the groundbreaking for the new St. Louis Community Ice Center, the Blues announce they will contribute $100,000 to the new rink in Chesterfield and $10,000 annually to 11 other community rinks.","Predict the top 10 of the 2019 draft","I need your help","Stockton Heat’s “Super Hero” themed jerseys to be worn this upcoming season","With 48 days left until hockey, here’s #48 Tomas Hertl scoring a beauty for his 4th of the night as a rookie.","The Current Minnesota Wild Will Never Have a Cup Window","[Serious] Is this the best interpretation of hockey in a music video?","Dumb Team Names","With 48 days left until hockey, here’s #48 Daniel Briere scoring a double overtime winner against the Flyers","Greatest team in the NHL?","Bovada Hart Trophy odds for the 2018-2019 season.","[Yost] An analysis of how the league’s best forwards score goals","Evgeny Kuznetsov Brings Stanley Cup to Traktor Ice Arena","Lets Take a Look at Brad Marchand","Coyotes, Glendale, and AEG Invest in State-of-the-Art Center-hung Video Board","Who is the second best female hockey player of all time?","Color combos","Behind The Gear PODCAST Episode 1: Bo Horvat","Off-season: r/hockey's favourite player from each NHL team: Montreal Canadiens (Day 16/31)","r/hockey Survivor: Round 18","Minnesota Wild Offseason Hub","Hayley Wickenheiser: Why I'm donating my brain for concussion research","Which forward has the best slapshot?","China just released a mini-app game to promote the NHL China Games in September. Top 10 ranked users will receive free tickets to the games.","Hypothetical Erik Karlsson trade. Tell me how dumb I am","Glendale/Kanata/Sunrise: Why did these NHL teams leave the Big City for the suburbs?","Ryan Reaves on Winnipeg radio: \"if you can't play hockey hung over, then you probably shouldn't be in the league\"","Project your team's starting lineup in 3 years","Sportsnet announces 2018 NHL pre-season broadcast schedule","NHL Top 20 Wingers - Honorable Mentions","You don't see a lot of fights like this one in Jr. B anymore","[Serious] I want to write my dissertation on hockey - any ideas?","Lambert: What's with Canadian teams and awful GMs?","General Discussion Thursday - August 16","2017-2018 GSAA in 5v5 Close and Shorthanded situations","Ducks Sign Kase to Three-Year Contract","Goalie Gets Rocked in Beer League!!","Got my Canucks T-Shirts turned into a blanket","With Zetterberg’s future uncertain, Red Wings ready to go all-in on youth movement","If Czechoslovakia reunited, how would it's hockey look like? (discussion)","Golden Knights' Deryk Engelland and NASCAR driver Kurt Busch switched sports for a day","Why is criticizing David Poile considered a faux pas when he's been a NHL GM for 36 years and has zero Stanley Cups?","Serious question about anomaly","Evgeny Kuznetsov eating traditional dumplings out of the Stanley Cup is peak Russia","[Canada] Rogers no longer offering free NHL Live subscription with Share Everything wireless plans for the 2018-19 season","What is the worst lineup an NHL team has had to field recently due to injuries?","Seven years ago today Rick Rypien took his own life","#47 Torey Krug had to fight twice for this clean hit on Andrew Shaw","Anybody know what Canadas goal song was at the Hlinka Gretzky cup?","Former Penguin, Coyote and St. Louis Native Joe Vitale is the new St. Louis Blues Color Analyst","Brock Boeser scores with an assist from Nate Schmidt!","Ryan Miller, moved to action over U.S. border policy. [The Athletic]","Your favorite hockey media?","$50K interim payments approved to survivors and families of Humboldt Broncos bus crash victims","A Day In Stockholm With William Karlsson And Oscar Dansk","NHL Trade Rumours: Andrew Nielsen has removed the Toronto Maple Leafs from his bio and has now just followed the Anaheim Ducks. Potential Anaheim-Toronto Trade coming?","[Da Beauty League] Hudson Fasching with some silky smooth moves to create space, then taps home his own rebound","67s send puck to Ireland for Ethan McClean, a nine-year-old boy battling Duchenne Muscular Dystrophy","Big Bo Horvat looking like an absolute unit in the Summer","Rangers prospect Vitali Kravtsov (9th Overall, 2018) with a nice deke in the offensive zone for Traktor Chelyabinsk","Paul Postma Signs In KHL (Ak Bars Kazan)","What two players are the most similar?","Wayback Wednesday - Howie's Heartbreak","Besides your home team announcer, who has the best emotion when their team scores a goal?","Most memorable goals from all 31 NHL teams (YouTube/SportsNet)","With 49 days left until hockey, here’s #49 Michael Leighton with an absolutely robbery","Most overrated top 10 draft picks?","TIL Chris Thorburn has \"CANNONBALL\" embroidered on his gloves - who else has weird personalization?","r/hockey Survivor: Round 17","Toby Enstrom has been practicing with MODO of the SHL this summer, and is reportedly strongly considering signing with them. [Article in Swedish]","[Paywall]Dellow:How Mike Babcock (and others) are sheltering defencemen while playing them against top opposition","Liiga Alumni All Star Game rosters announced","Off-season: r/hockey's favourite player from each NHL team: Minnesota Wild (Day 15/31)","Which players under the radar now are poised for a breakout season?","Which player would make the best team if the entire team was just duplicates of him?","The Florida Panthers have been the most mediocre team since the 2000-01 season, according to this new Mediocrity Index","Nhl Trade Talk: Projecting a Torey Krug to Edmonton Trade","Theoretical question","Pre season tv schedule","The St. Louis Blues will announce their new radio analyst at 2:05 p.m. today","TIL about Choi Kwang Hyouk, who escaped North Korea, was homeless, had his foot run over by a train, had it amputated without anesthetic, discovered sledge hockey and won bronze at the 2018 Paralympics","Why do NHL players get contracts much longer than in other sports?","How long would you leave your starting goalie in before putting the backup in during an extended OT playoff game?","Last game at the Joe! Very emotional.","Looking at the President’s Trophy Curse","Should hockey have “mini championships” like in soccer? Like a Canada cup, Super Cup, etc.","With 49 days until hockey, here's Rich Peverly with a sick breakaway goal in the 2011 SCF.","Make the best team possible, with all the last names starting with the same letter","Andrej Sekera underwent surgery to repair a torn Achilles tendon. He was injured in an off-season training session and will be sidelined indefinitely.","[The Player's Tribune] I’m Not Connor McDavid","Elias Pettersson scores an amazing goal.","Local Artist Expresses Love for the Caps","Wanna know how poor the Flames' playoff record is? The last three Flames to score series-winning goals are Matt Stajan, Martin Gelinas... and then Doug Gilmour in 1989.","Expiring NCAA Draft Rights","Im sure this has been posted before but I can't wait for the hockey season. Hockey: What It Takes To Win (HD)","Defenceman Ryan Ellis has agreed to an eight-year extension with the Preds. AAV of $6.25M. Extension kicks in for the 19-20 season.","Are refurbished/repaired sticks any good?"]