["Here is where every Congressperson and Governor stands on marijuana issues","Warren: If Democrats take Senate, they'll vote on marijuana bill","Filled most of this bin at one of my favorite smoke spots. Let's leave nature just a little bit better than we found it. #StonerCleanupInitiative","Printed up a shirt to spread the word. What do you guys think?","My friend just got himself the pipe of destiny","#Stonercleanupinitiative in my favourite beach in Turkey [7]","The Trump Administration Has Secretly Launched an Anti-Weed Committee","If you cant function properly. You shouldn't be smoking before or during work.","Cave and Bake","12 of the 24 are over 7’5”, the rest are between 6’-7’. Starting to think we are gonna get a shit ton of bud 😂","Just found out my grandchild is scheduled to be born on 4/20! Think I should hand out blunts in lieu of the typical cigar? 😎","Trump tasked multi-agency committee with countering pro-marijuana message: report","All the edibles I made last night","Had to make an account to show this. Heard r/trees appreciate high art. Heh.","When you're not entirely sure where your lungs put all the smoke.","Wednesday Wake and Bake [0}","I went to Taco Bell","Roommates 5th time trying to grow. I think he nailed it this time.","Trump’s marijuana task force ordered to ignore data that shows positive impact: reports","Got my nectar collector. Dabs ahoy. [7.8]","Unfortunately my first glass piece was dropped and shattered shortly after my bday celebration. At least my friend got some good pics of a nice rip I took before the tragedy. Smoke one for my loss, frients. 🙏","Greetings from morroco! Xoxo","If Florida wants to make headway towards the legalization of Marijuana we need to rally with the Democratic Nominee for Florida Governor Andrew Gillum!","I just wanted to share me representing this sub","My brother, who's in Germany, just sent me this picture.","Local zoo knows what's good","I'd like to introduce, Madame Blueberry","Recently tried to kill myself and me and the homie are smoking. It feels good to be alive ents!","Check out the size of this bud! Nutella for scale.","Parents found my water pipe","Blasted (OC)","When you want to smoke a joint , some hash and some sauce and only have a lighter and some paper","First solo hike. The view was absolutely stunning[4]","You liked the last one, so I made you this at a [6}. Chill long and prosper!","When you finally get home from a long day of college when deciding to go back at 31.","Coming out of dankrupcy is the best feeling out there","2month T-break. Already at a (7) and still have this much left.","The coziest smoke spot with my husband","smoking a joint on a morning trip","I’m next in rotation, right?","My first online purchase was a success. Can’t wait for my SO to get home and we can smoke this.","Is there any better combo to start the day?","1/8 of Sunset Sherbet for 20 from Southern California","My Pops retired this year and is currently driving 8 hours to help me renovate my cabin over the next week. I figured this might help him relax from the long drive","Bois and I said goodbye to a good friend tonight","Inside The Trump Administration’s Secret War On Weed","To Combat Opioid Overdoses, Illinois Allows Medical Marijuana as Painkiller","Nevada reports more than a half-billion in marijuana sales in its first year","My 300mg .lemon haze capsules.","My friend grew this weed and it came out looking crazy","Can’t beat your own living room and your own music for a good smoke.","I don't normally post but I thought r/trees would appreciate my setup.","Found this in a ceiling at work today. I had planned to buy one after work too.","Nug","Having a Mighty time","thankful for this sticky icky (zoom for good kush karma)","The best way to enjoy a few days off from work. [3]","10/10","My bar/stash","I love my job","Drug test bot for r/trees?","Some Australian Purple Haze","Brownies w/ freshly made Banana ice cream","Smoked the bong","Bug bro waving for the camera after he joined me and my gf's sesh!","Half my weed was gone by the time I got home :(","Homegrown bud looking like candy","Just got off space mountain, riding front and high as a kite.","Denver hikes marijuana tax to fund affordable housing","Personal Garden: 2018 Grow season","Dear medical marijuana, thank you for letting my live a life not ruled by lupus and shout out to this new beauty I got today!","Y’all don’t know the old me. She was cool too, but in a bad place. This new me is way better.","It’s been 5 minutes and I still don’t feel the edible. Should I eat 2 more?","customer service mood while high","My italian marble chillum .","Well guys RIP me","Just moved to Oregon from Utah and the first thing I bought was $ .89 pre rolled local grown joints","Just had my first experience and thought i'd share","after work essentials: locked in","U ever taken a shower while high?","Dense nugget","\"Rehabilitation\" cannabis inspired drawing!","Todays SmokeSpot","SuperLemonSkunk 😍. From da westside","The moon and the city. Last spliff before bed","clean bong + lime rinds + blue dream + 🍋 haze =","\"Cannabis is not a cause of schizophrenia\" says biggest study yet","Pineapple Skunk (gLeaf Maryland)","Hmmmm which one should I smoke?","throw back to my closet grow around '09-ish. First time growing. Random bag seeds. Got about 1oz from the 3 girls.","A stash me and my friend had a while ago","Smoking after 120 days off","About a week ago on a road trip through the Pacific Northwest. They say don't bring sand to the beach but it was nice not having to buy weed at all in Oregon.","Ent Clean Up Initiative, for us that want to help with the clean up but aren't fans of the Stoner label.","Nevada collects $69.8M in marijuana tax, exceeding expectations","This beautiful nug. An 8th of Infinity.","Could Florida's Next Governor Make It the 10th Legal Cannabis State? | Leafly","A quick scrub-down of my girl, Bubbles. If you haven’t cleaned your piece in a while, here’s your reminder!","Homage to Wiz 💨","I’m tryna think all the words that mean high, help me out?","Need some advice fast","Much needed stress relief from fighting for my identity. #GG4","InspiroBot delivers.","High Times 2018 2nd place best product - Exotic Genetix Mint Chocolate Chip Seeds, Guicy Banger • r/exoticgenetix","Comedian calmly explains to bigot who erected offensive billboard reading \"Marijuana OR God\" and \"Bibles Back In Schools\" that Cannabis is in the Bible and created by God, according to the Bible. Genesis 1:11. Man has no coherent response and blubbers \"Dandelions are also medicinal\" as his defense.","[7] holy shit guys i just snuck out onto the roof to smoke","I’ve been working in the MMJ industry for almost 10yrs now. Started bud trimming and slowly worked my way up to managing my own delivery area. I’m finally working with a good company who owns their own products. Never been paid better in my life and now I’m going to start my own edible brand!","Monster nug of Skywalker OG, Bic for scale.","His &amp; Hers","Wax. Anybody else smoking the FNH with me?","Twenty past four in the afternoon","When tobacco and cannabis make love (Sherbet Kush ft. Diamond Swisher) (8)","Tomorrows my birthday - tonights send off","Late night doober by the sea, Helsinki","My first ever edibles! They turned out well, made with a fuck ton of coconut oil and some Northern Lights shatter!","Looks like my cat needs to blaze some trees","Beto calls for legal marijuana","Something I guess we all just grow out of","5 o’clock banger to the dome","I'm going to smoke my last joint for 6 months tonight. What should i do to make the most of it?","I posted one of my indoor girls yesterday, thought I’d show you guys one of my outdoors! She’s early on, hoping she finishes up by end of September 👸🏻","Pot Industry Wants to See 'Stoner' Stereotype Go up in Smoke","🤤🤤","About to have my first shot at working in the cannabis industry!","2.5 for 20 of Holy Grail from Southern California","one of my favourite things is when i get high enough fast enough and can leave some for later.","I am a relatively new smoker and I am fucking loving weed","Last nights smoke spot. Took this one a year ago. Couldn’t seem to get it right this time.","Haute Pot: How High-End California Chefs Are Cashing In On Marijuana","High times best weed of 1977","Trump Administration has been secretly plotting against cannabis reform according to reports","I made a corn one .","Michigan Considering Medical Marijuana Home Delivery Service","guess that pipe!","I use an Arizer Air 2, so i have temperature control, i know there are different cannabinoids, my question is, how is the high of each one of them? is there really a difference vaping in different temperatures? please i would like to know ALL THE POSSIBLE EFFECTS","Along the Naugatuck River, Naugatuck CT. #stonercleanupinitiative","#StonerCleanupInitiative","Some amazing deadhead og med MD","First attempt at joint","A colder smoke spot than most I’ve been seeing on here, greetings from Australia","Marijuana: Safer than Peanuts!","I wish you all could experience this moment, but I hope this picture is enough","Looks like I just struck gold!","Bad morning. Good evening.","Stoner clean up initiative in Charlottesville. 10/10 would recommend to a friend.","Some Canadian Universities Will Allow Marijuana On Campus","[10] I added shredded cheddar onto the bun before the hot dog and it changed my life.","Anyone else get higher when they smoke outside and come back in as opposed to smoking inside?","Budtender was so high he charged me $30 instead of $50 for a 1/4 of this OG Kush. (Toronto)","Here's my smoke spot of the day","It is Wednesday, my Ents","(6) Cups of Liquid Num-Num ;-)","I love r\\trees","Feeling guilty about smoking for some reason","Long time vaporent, just bought my first pipe! Meet Old Toby!","I found this sweet little drug lock box at the Wal, and it perfectly fits my whole setup and I don't have to worry about those fuckin' child proof cases. Bonus puppers.","Connecticut adds eight conditions to medical marijuana treatment list","A gram of Agent Orange shatter for 19.20$. Now about to play some Rising Storm: Vietnam.","I just realized this emoji 😄 looks like a really high person being really happy. I don't know why I'm sharing this with you all, but it's been a rough few months and I'm really trying to hold on to the few things that make me genuinely happy. I hope you all had a wonderful Tuesday😄 [8]","Gov. Rauner signs landmark medical marijuana legislation","The force is strong","Riding out the thunderstorn with some home made thc ice cream and a doobie. Thunderbuddies for life.","Cleaned a spot. So many beer cans.","*Lie about how I didn’t just spend 20 minutes framing this shot*","Got an email from my dispensary about upcoming legalization, huge disappointment if true","Trying to get my mom to understand weed isn't as harmful as the tabloid newspapers percive it. Does anyone have some decent reputable articles/studies that show the real facts?","Need help identifying this bong!","This is mildly infuriating.","I get to break my one month T break a week today, I am excited","TIL - that Canadian Blood Services accepts blood donations from Ents!","Dumb Question on Possession of Cannabis","Wake and go tf back to sleep [8]","Tweed Shindig 2018 overview (Smith Falls, Canada) Canopy Growth Corporation public party","I smoked with my dad","I passed this test right?","First post and brand new Grav Labs pipe ✌🏽","Does anyone else get depressed/feel empty the day after smoking?","Since I bought weed online, I wanted to compare it to my local dealers weed. Homegrown / White Russian","how much do i fill this bong???","Has anyone tried Blue Alien?","Six Shell Super Spliff","Beto O’Rourke calls on Texas to decriminalize pot, stop arresting so many students","Our lord and savior","A toast to my last night in Hawaii after three months of working here!","How to reach a [10]?","History of Marijuana Laws in the US in the last 45 years in a simple slider","when you’re dankrupt so you fill the void with art","I had a bunch of friends over for my birthday last weekend, and some drunk idiot tried to smoke an entire nug.","A good way to start the day. Cypress OG and some Lemon Larry THC-A.","Today's Smoke :)","I haven't smoked weed in about 5 years, found some old stuff in the shed and now I'm high lol","This is amazing. I hope it spreads. Beautiful","Weed transport, CA to OR. Legal way to do it?","The ultimate slab dab","Not Top Gear, but Clarkson at top form anyway","Cannabis is not a cause of schizophrenia, says biggest study yet","My new favorite budtender.","Question for Growers/Sellers in CO and CA that went through the legalization transition, Help!","Cant let the workout go to waste when the muchies hit","The lady and I did the extreme north loop in Vietnam the last 6 days. Our third day consisted of 200km on dirt roads through corn fields that smelled a little funny. Can any one tell me what I’m looking at here? 🙃🙃","Yesterday I was high for the first time in my life. I slept like a baby and woke full of energy first time since ~5 months.","Spliff Chat... High-Man-Being VS Hu-Man-Being","Need your advice for smoking in my dorm","How to make chilli lime weed butter.","Anyone know if this is okay to use as a hemp wick?","Smoke spot on Rock Lake in Algonquin Park 😍 [6]","Smoke spot of the day feat. 2 wonderful kitties and and 1/8th of GG. I love house sitting","Dreams after quitting weed","Tower of Sour (diesel)","First piece","Fallen Angel (Ontario) 😍","Advice?","Feds approve controversial roadside test to help cops catch high drivers","It is SO HOT in my smoke shack [8.2]","blowing my mind so much. i love it","Dealer said it was lemon og, thoughts?","Hash on a T break","A while ago i posted my first joint i ever rolled. This is how they look now.","Any one else here think wax pens are too complicated?","Making cbd vape liquid","Synthetic urine -Does it really work?","your preferred way to store weed with no smell?","My buddy works for a tree service and found this shirt. Seemed appropriate","i love this picture","About to head out on the ocean for a 3 hour whale watch. I'm an [8], and woah.","I just greened out, then I started looking into it online and everything I read terrified me","Chemdawg - favorite strain","Just picked this sour D up in an illegal state 😍 [7}","Just ate one of these 0.7g hash muffins and I am lying in my bed with a toothpick listening to (Now by Young Thug and 21 Savage/ this is no promotion for the song I just wanted to tell you) [9}","Forgot how clear my bowl piece was finally cleaned it 😂","Mixing weed (THC cartridge that’s terpene infused 85% cannabis) coffee, and mangoes?","T-Break","What kind of vape is this? What quality?","Not a bad way to enjoy a bowl","Gentlemen: Serious sex health question: Erections (see text)","Legalizing cannabis is a Western World phenomenon. We are SO LUCKY. Look at what's happening in the Philippines, and the context it's being discussed.","One in seven U.S. adults used marijuana in 2017","Anyone appreciate a quick hit vid? This live resin is tasty.","Thoughts on CBD edibles?","A glimpse of my girl 3 weeks into flower! #masterkush","Marijuana under electron microscope.","Nevada far exceeded its marijuana tax revenue during its first year of adult-use sales. The tax collections totaled $69.8 million for the first fiscal year, about 140 percent of what the state expected, according to a news release from the Nevada Department of Taxation.","im dankrupt and don’t get paid till next wednesday","Not every day you blaze on the Great Wall of China","Progress","Looking to make some oil from male plant trimmings.","My guy is out of town for a few days and I ran out. Got into the roaches Ive been squirrelling away and came up with 11.3 grams. Plenty until he will be back!","Silly frugal habit","Does anybody else find themselves more attractive when they're stoned?","First time smoking live resin, radical dude","Awakening your spiritual side is really what artists do. When you hit a groove, it's not you; it's the spirit world. - Tommy chong","More Ceramic Bong questions","Low Effort Curiosity Grow","How long do cartridges last for?","So I may be doing a drug test...","StudENTS, we now get Spotify Premium, Hulu, AND Showtime all for $5/month! [4]","[Germany] Overview of the \"legal amount\" you are \"allowed\" to carry you","Midnight sesh","U ever sleep on cotton mouth and now ur dying?","I just turned 20 and I'm at a 20.","Brother always asks “What do you do in your room all day?”","Fairly new smoker, low tolerance, need some help?","Going for a job interview today!","Weed preventing sleep!?","Best or fastest way to use Hash/Hashish?","Tolerance Break maybe?","What are your go to sites for products?","Most cost affective way of making edibles?","Fully charged pen not hitting correctly on this new cartridge. Any idea on what I can do?","In Pennsylvania, running a man over with a bulldozer is an appropriate response to growing 10 marijuana plants.","medical refuge found paradise in california","I’m not from a real interesting town, so taking a nice hike and smoking a joint on a nice ass view is what I live for.","When the day is finally over","E liquid","Gov. Bruce Rauner (R–Illinois): We have a new weapon against opioid abuse. Medical pros can now prescribe cannabis instead of opioids for pain management. Science wins again. Substantial evidence that cannabis produces clinically significant reductions in pain symptoms. Signed SB 336.","I think I was given spice, instead of kush.","Drug test in 24 hours, freaking tf out!","So I started writing down my vivid thoughts when I'm high, and they are really something","Milk shot of my Jetpipe","How do you roll your joints?","What do you guy do with your stems?","I don't normally get to smoke around this type of scenery... It was a nice treat","This cracked me up for some reason 😂","Love having my own backyard. Cracked piece and all.","What to do with grown plants ?","Florida, your time is now! Mayor Andrew Gillum just won the Democratic nomination for Governor of Florida. He supports fully legalizing marijuana in the sunshine state! Get registered to vote. Here is the link to do it online. Takes just a minute.","Ceramic Bong, is it safe?","Vape noob looking to purchase a pen - I'm excited!","I started painting some storage jars for some friends!","Last night I posted a picture of my first day I moved to Oregon, here's a picture I took a few weeks ago while still looking for a house","Cannabis use associated with Schizophrenia.","A good bowl and Netflix I’m glad I dug this old bubbler out of storage , I needed a water pipe and forgot I had this","New favorite budtender.","Just finished to sand it !","Do you guys ever change your password while high and forget about it when you're sober?","Lump in my throat/throat feeling tight when high","What are your methods for hiding urine prior to a drug test?","Can you smoke the oil in cartridges?","\"CBD infused\" herb","What my bathroom looks like when the cable guy is coming by","Does this looks like spice?","I already treat it like its legal","Maine Weed Festivals?","Can anyone tell me what strain this is? Or at least if it’s an indica or sativa or hybrid? I’m just curious as to what type of bud I just picked up as I’m in an illegal state","Days like these I thank goodness for the rainy day roach jar! Who else rolls roach boats when they’re dry?","I lost the magic of weed for the last few years - it just didn't do much for me anymore. This weekend I decided to literally dust off my old drawing tablet, smoke a big bowl of Jack Herer, listen to Medasin's new album, and get lost in making this for two hours. The magic is back!","Nice after work dab😴","My girlfriend and I just picked up some beautiful Golden Pineapple","Question from someone new to pieces","Going without tree is hard","If I smoked every day","A beautiful afternoon hike with some pitstops.","What’s the most you’ve smoked in one day?","Beto O’Rourke calls on Texas to decriminalize pot. Your vote matters!","never used these before was wondering if I just wrap them like I would a blunt","1/8th of some Grand Master Kush. dense af","Rolled my first cross joint today","Listen to this while high","Looking for advice: I want to start vaping prefilled THC oil carts. What's a good vape pen that doesn't break the bank?","\"Dont adventures ever have an end? I suppose not. Someone else always has to carry on the story.\"","Noob question: Weed losing smell?","Mag Landrace in Maryland","Oil extraction gone wrong","This mornings wake and bake spot. Sunrise in Mass","Me and my friend's smoke spot today. Mt. Lemon Tucson,Arizona","newb question, hash oil....","Best \"long-term\" detox?","Hair test question - advice appreciated","1.5 million dollars from application fees made on the first day for oklahoma.","Tobacco roll-ups vs weed","Its taken me a long time to transition after 14years of smoking, been smoking most ofthe time I’ve had this vape to for the past year and a half, but it’s been a few weeks since I’ve rolled up and I’m enjoying it more everyday, wasn’t even about the joints, the enjoyment of a smokingwas overpowering","Finally got some green crack lol","Is there someone you know who Hates the smell of Cannabis?","Oops.","Michigan advances toward home delivery of medical marijuana","Think for a minute how futuristic our world is compared to like the first humans who lived in caves. We have cars that we zoom around in, they wouldn’t even know what a car was [8.9]","Fruit punch in an illegal state","Ah, I see you're a man of culture as well.","Loving this home grown gorilla glue","My mom’s friend legit uses a bong as an incense burner.","Someone Please Tell me if this is a scam or not","Could anyone tell me if the one on the right is real?","All I need for the night","This Forbidden Fruit I just snagged is awesome!","Have to take a break, but you guys are helping me through it","Buddy was selling a quick sac to a friend and didn't have a bag on him so he used an envelop","About to get my first vape pen","Tecumseh officer of the year chokes own son in restaurant over argument about weed. \"You're f**king dead to me!\"","America’s most famous cannabis prisoner finishes parole","Reddit meet Vincent and Cthulu.","My first hand-carved pipe ever. Done with mainly just a pocketknife and a screwdriver","Sunset Bud","The woes of living in an illegal state. Had to flush a dime.","These are the special kind of screwed up people we must denounce and disassociate from responsible smokers!","Autorollers, do they work and should an ent get one?","What temperature should I use on my vape?","One of these things isn't like the others","PSA: Stay as far away as possible from cartridges like these. They have a silica that is extremely toxic.","Very casual user and eScreen?","Potentially have a drug test coming up and smoked recently. How long will the THC stay in my system?","I just realized that there are multiple 4:20's around the world and that means different people have a different happy time and that makes me happy [7]","Low Tolerance","Weed increases estrogen in males?","you guys i love you [9]","The new smoke spot","T-shirt activism for a Washington State Grower","My girlfriend wants to try edibles (first time trying weed), I think it’s not a good idea","Some music to go along with my keif bowl.","Not a bad night","‘You’re f****** dead to me!’: Tecumseh Cop On Leave After Strangling His Own Son Over Marijuana Discussion (The folks will never let go of the Drug War)","Only started rolling a week ago, how's this?","House work finished, last day off, let’s get it done right [soon to be (10)]","Blue cookies has me on the moon {10}","I'm looking for that post on this sub with the trippy colors when you move your finger across the screen but I'm struggling [8} can someone please help?","Not sure what this is! Canna got stolen out of my car the other day and told my dealer and he hooked me up with 10g for $50! Wooo","We got on an abandoned dam and smoked a joint after climbing a dangling fence lol, adventures are fun!","Legal Weed Is a Reality in America, but Congress Refuses to Admit It - As New York moves toward legal recreational cannabis, the failure to enact nationwide reforms is becoming more glaring.","Taking a T-Break, and missing the nightly ritual.","Half way through a 2 week t-break feeling awesome, had a date tonight for the first time in 6 months!","Clementine","Question about T break effects","My application for medical cannabis just got approved, I have a job interview tomorrow, and I can’t wait for the next few months.","Illinois Gov. Bruce Rauner ready to sign medical marijuana expansion bill allowing drug as painkiller alternative","LoFi “Study” Beats, yea I’m studying the effects of cannabis on my mind.","Weed \"hangover\"?","Large batch of butter coming. Cap for scale 😘","Nice hammock sesh out back after a long day","Tales of woe from a doofus","High when I wake up...","Tv Shows To Get Baked To","As a designer my friends often ask me why there isn't a tool to crumb hasj yet. And the answer I always give them is that there already is one. It was patented in 1875 by Valentine Fogerty under the name \"nail clipper\".","More gorilla glue (U.K.) 🦍","Starting senior year off right 👌🏾 1 1/2 oz. of local grown Alaskan Thunderfuck","Sour Diesel from my local dispensary","How often do you smoke and why so much/little?","Water taste good (8)","Some Alien OG and my new grinder.","Damn, gurl! We must make beautiful music together. Because I am Chopin this weekend.","Last years baby’s flashback! Smoking a 10 gram joint with them.","does it just look cool because I’m high?","Crown Royal Whisky Maker Eyes the Cannabis Industry","Diamonds for days !!!!!! VVS","Gotta love when your work partner is your plug.","Gov. Bruce Rauner signs The Alternative to Opioids Act","Denver Will Open a Second Cannabis Social Use Club, But Only for Vaping","Recently single father. 1 week into t-break and I’m saying fuck it cheers ents.","New piece day. G13 topped with kief and a nice cold Tecate.","Acid and weed","What do you guys think, objectively?","Hike up Mount Muscoco, Co.","Is this weed moldy? Or an I paranoid?","First time growing ! Any tips greatly appreciated or links to places that can help more !","Sleepless, Anxious, and Depressed","Can anyone recommend me a good dab rig on the cheaper end?","different bongs = different highs","New product line we're testing...Has anyone tried this?","Guy in front of us is screaming Wonderwall, and it’s pretty fantastic. Happy toking everyone!","7 Hospitalized, 2 Fire Departments closed, Town Hall closed over Marijuana Vape Pen in Alabama","Smokespot in Oregon a few weeks ago.","I need somebody to help me determine whether or not this guy I met at the hotel is a serial killer","Drunk and high","it is not weed making you forgetful!","Does anyone else have a problem with sharting when baked?","Shoutout to all my fellow ents smokin on mystery weed in an illegal state 🤘🏼","This GDP has so many orange hairs you can't see the purple","Have you ever smoked with your family?","og kush","Guys there is a lot of science saying extensive or excessive cannabis use leads to mental health problems regardless of predisposition to it. I only smoke if I can afford too these days but I remember being a feen for this shit back in the day. Lol what are your thoughts?","TOHQ Super Lemon Haze, 8/10","[7] Disabled people with service dogs must have some of the best relationships with them.","Any gamer ents play fortnite?","Recent smoke spot. Some tree to help admire the trees.","Here’s some magic for my fellow ents","Tips for grad school as a stoner","Looking for some advice!","New piece, what do I name it?","I had an amazing week in Amsterdam","Rant: Tired of the game - I just want to give you my money","These boulders tho !!!!!","My smoke spot of the day!","Blunt sized joint","Tonight's Smoke Spot","[4] bouta start the night right","Awesome jar I picked up for only 8 bucks at Wild Bills, holds about a 1/2 oz","Does this Xtractology oil look authentic?","Anyone else see a darkspot like this before?","Imagine being high on trees watching this","Why hello there little nugglets","Sunset Strip joint","A few of my favorite things","Smoke spot from back when I was backpacking through Switzerland.","It’s hard for me to find good stuff in Texas. This was nice.","I have a question?","anyone else here gay* as FUCK","Morning medicating. Enjoying my last days back home before I go back to school in the east coast.","Smoke break during the study sesh","Hi people I was wondering if 155$ is a good price for a zip. I’m from D.C. Virginia area of USA","When you re-up, but forget to get a lighter.","[Northern Lights] 2 1/2 weeks into flower.","TIFU by making vaporizer leftover oil","Very early morning smoke spot","Investing","Toured a growing facility that has around 1250 plants per cycle. Here’s one of the many, many rooms. (Yes, we’re holding our breath so that we don’t taint the plants.)","Back to joints it is","In Military Time, it’s 14:20!","Seen an interesting colorful trippy painting in Amsterdam, by Keren de Vreede","Allergic reaction and such","How can one successfully hide vape smoke inside?","First time smoking after a month long T break","Some local homegrown, not amazing but got one hell of a deal!","‪Listening to a podcast is like inviting company over, but inside your head. ‬[7]","Got made redundant a few months back, I miss weed :(","Some purp in the ole grindskie bud","I never understood why people get drunk and online shop unintentionally or even without they don't remember it. However, I can absolutely understand why people do that while stoned. (7)","Candidate for US House of Representatives in MA District 8, Brianna Wu, talks about her marijuana usage as a PTSD treatment.","Good thing Marijuana is in prison now","The view of my smoke spot.","F'd up, at a [8] at class","Some prefer a drink to wind down after work. This is my preferred method.","Kiwi, banana, basil and mint shake, infused with homemade, illegal so no idea on mg, cocunut oil.","Coping when dry?","Where are all my Christians at who smoke?","Panic attacks when I smoke weed","i got a new grinder and the colors are super cute","My friend's first joint","Not much but i bought a new bowl the other day","Start calling it by its scientific name: Cannabis.","Morning smoke spot in the Unitas :)","I bought this but have no idea how to use it","In 2020 april, it will be 420 for a whole month 🤔","New to Reddit, found r/trees and my life is now fulfilled","Mormon church intensifies opposition to Utah’s medical pot plan","thats my spot (: Marseille - france","Newbie Questions","I love waking and baking, even if I just woke up and its noon.","Happy bday to me and everyone who is also alone on there bday","Does anyone else ever get a guilty conscious when they smoke?","I can’t twist my 7pipe twisty glass blunt?","Terrapen White poison 18% thc- Pa Medical","Are purple strains different from green ones?","People cared more when snoop tried to make Reggae","My favorite way to start the day! ❤️","How many stoners does it take to change a fire alarm","Does having a real carb cap help your dabs?","Pregnant and Nursing Women Shouldn't Use Marijuana, New Guidelines Say - There's limited research on marijuana but doctors say enough concerns exist about both short-term growth and long-term neurological consequences for children to recommend against it.","Skunkberry 4 days","Getting busted with edibles in Arizona","This one got really pretty, wasnt expecting it","Why do greeners make me cough way more than a chop?","Snoop Dogg's New Cookbook Features Everything You'll Want to Eat When High","Does this BHO look properly purged?","Today’s smoke spot!","Broke last night. Will be doing a fix with food grade silicone :,( Wish me luck","Morning smoke spot. Hiking in New Mexico, the sky just goes on forever.","Vape Pens","At a 7 and was suddenly hit with inspiration","Watch The Brave Little Toasted high. You’re welcome. [9]","know about who uses cannabis in Canada, and how","My mom and I had a wonderful time being legal in Las Vegas","Just copped these bad boys. Excited to try them out!","Thoughts on a daily smoker continuing daily use after a traumatic brain injury?","A bag of sunshine","Smoking on Gelato a.k.a Larry Bird","Totem series dab rig","Banana split nug rug. Amazzzzing","How come I just get more anxiety when I smoke? I thought it's supposed to help.","Human eyeballs [9]","First filter","Why are some medical shops 21+?","I smoke with this dude everyday","This has been getting very exciting","Vermont Democratic Party endorses weed taxation and regulation","Perfect start to my morning","Freshly acquired. Thoughts?","Old hair salon rolling cart turned weed station","2 gram blunt. Happy Tuesday everyone!","\"More punch than a bottle of juice\" 8/10","Gods Gift to me","Gravity","Upset with this edible i ate!","Got a new piece and have a quick question about it. I’m having a hard time figuring out how much water to put in it. Thanks guys!","Alaskan thunderfuck is...","Crystals","First time in a non-legal state in a while","Smoke spot...made due cause the trail to the waterfall was closed :(","Intense visuals","Any advice for sleep aid?","I really miss smoking","One in seven U S adults used cannabis in 2017","Typically grey Danish weather at the new smoking spot.","This cold thinks it can win against me!?!?? HA! Laughable","I'm so fucken high (10)","USPS lost my vaporizer","This morning's wake &amp; bake in a suburban backyard","Gonna listen to some pink floyd and have a great night","What a beautiful day to be alive","41 day t-break","Inspiring mastergrower illegal state","Yall ever go completely numb???","Real serious doubt","Is this video an accurate representation of what weed does?","Anyone else have troubles with wax carts?","Spending a night wishing I was smoking with my friends","Washed my papers with my pants.","Legal Weed Is a Reality in America, but Congress Refuses to Admit It","Go to 3:30. Right in the feels. Jimmy Kimmel stereotypes guy and mocks him for being an artist. Reddit should find out how to buy Bobby's art.","Safe to hit dab pen?","I moved into an apartment with random people. All 3 of them smoke.","When you share a blunt with your girlfriend...","If I smoke meats using weed will it get me high?","No name but ⛽⛽⛽🔥🔥🔥 [8]","Idea: User Flairs","Pick ups. I think I’m good for now. [7]","Smoked for the first time, didn't feel too different","What is your go to meal at Taco Bell?","Why is my “Ooze” weed oil pen not working?","I like to get high and then fly my FPV Racing Drone","A day in Dublin. Summed up in one photo, GZA was sick live!","That time Bart bought a bong thinking it was a pencil holder.","White Castle. Experiences? (Canada)","I literally just realised what “frigging” means.","Arizer Extreme Q or Volcano for desktop? I have been using an Arizer EQ for years. I have had to replace it once already and I need to replace it again, as it’s out of warranty and cracked. Do I bite the bullet and buy a volcano? Is it that much better? Price gap can buy a lot of weed! Lol","What I have to do after the last one exploded from \"pressure changes\"","Ive been wanting to smoke again fpr a while now but im a good month sober and i feel fantastic. Everytime i ponder abput smoking again, i remeber how sluggish and lazy i used to be. Can some fellow ents help me decide on whats best?","Made it one month without weed, about to smoke in a couple of hours","Decided to colour my smoke box in with crayons while I was tripping. 10/10 fun times","How To Talk To Your Doctor About Trying CBD Oil","Nightcap w/ Córtez [7]","My very first roll! Definitely still learning but for a first try, I'm happy.","T-Break Dialogue: My Story and Your Thoughts {8}-(dabbed first time, sweet baby Jesus)","Any good edible recipes?","Fat Medical Wax Dab/ New Rig","Found a joint on the sidewalk. Does the bud inside look fine? It smells good, although a little peppery","First check test","just got high for the first time in a while {10]","Worth $30?","Bong on a plane","People from countries where weed is highly prohibited or really hard to buy. How do you handle to get high and what are risks of getting caught?","I 3d printed this pipe holder","Blunt. (Grants -4 Dexterity and +20 Charisma upon consumption. Effect lasts 3 hours.)","Repotted with soil and compost","Had to retire a Reddit Exchange gift I've had for about 5 years today. RIP.","Infused Coconut oil question","Just became a homeowner, so I got myself this little housewarming gift. Meet Bee!","I thought this was a trees' fanatic rerdit. I'm not disappointed, but well, you know","Easily falling asleep without smoking weed?","Denver to increase affordable housing funding with cannabis tax increase","I find that when I’m high, I will upvote and comment no matter how old the post is, or how many the upvotes. [7.7]&lt;—I just realized how important this is here. (Actually a [12]).","Oh ya. Finally happening. Keef, hash, weed. Green crush weed at 26%. Here we go","Anyone see these dab carts anywhere? Dealer sent this to me…","What is your go-to candy?","Just stopped by the dispensary with my grandma. This noon bowl is about to knock her out lol","on last nights munchie menu we had gnocchi,,, delicious","Worst scenario for every stoner","Made this earlier today, first time doing double filter. Kinda looks like a tampon but oh well [7]","Coincidence? Legal Weed States Have Great Donuts","Love the fact that DC accepts Florida MMJ card holders.","Best dry herb vape for public use?","Bear OG Sauce by Bear Extracts","Marijuana Users Being Turned Away From Cannabis Industry Jobs","Don't drive high or you might get arrested for almost hitting a jaywalker in the middle of the street","A catchy little tune [4]","Just cleaned and organized my weed drawer. Loving it!","How i feel after smoking a j in the morning and going for a walk.","The more I light my lighter","white ash from liberty haze","HEY!!!","Anyone know what this could be?","Does what I'm looking for exist?","What is the best dry herb vaporizer?","UPDATE: Yesterday I posted a pic saying that I was afraid my glass pipe would turn brown after using it, originally this pipe is totally crystal clear with yellow stripes, after heating it up this colors showed up... pretty nice","Good OG or nah? It’s very purple on the inside!","Dog got into my 750mg shatter bomb cookie. Hes pretty comfy.","My chat with DANA LARSEN, Vancouver-based cannabis activist, author and businessman - topics: the upcoming legalization of cannabis in Canada; Cannabis Day; Overgrow Canada","Help me beat the heat","Gas","What’s your favorite strain?","Had a thought...","T-break is over today. Dispensary haul: 3.5 g Purple Punch, preroll Purple Hindu Kush, 1 g Gorilla Glue #4 BHO.","It's almost time","Anyone else not a big fan of edibles?","Had to spruce up the smoke spot. Reminds me of Narnia #stonercleanupinitiative","In November, my state will be voting to legalize marijuana. I’d like to capitalize on this and start a dispensary or grow operation. Being that it’s currently only legal for medical use, how would I go about finding out what kind of laws I need to follow to be able to get started on or near day 1?","What's an 8th cost you?","MJ testing &amp; developers in Seattle?","If you had a bowl of cbd only weed and a bowl of normal weed which one do you smoke first?","New piece I ordered online. Had to wait over a week but it was well worth it.","How much would you guys pay for a quarter pound of high grade medical.","Up close &amp; personal 😋🤓","Any QuickFix 6.2 Tests/Users in DFW, TX?","What kind of lighter do you prefer?","Orange cookie 🔥🔥🔥🔥 Zoom in 👀👀","Update, well into week 5.","I get high with a little help from my friends...(my best friend found a great deal on concentrates--&gt;$50 for 3.5g)","Growth","My smoke spot :(","What did the frog say to his friend after packing the bowl?","Eye drops","Big shout out to the reliable dealers","My friend’s rendition of a gravity bong","If edibles don't effect me, will thc tinctures?","Budgeting can be hard some times, but there are worse problems to have!","After a two year term of prison, my friends welcomed me home properly.","W o o d s","In 2020 it’s going to be 420 for a whole month","I took this pic of a tree while in Africa","Memory loss, derealism, stutter","Yeah","California Lawmakers OK Free Cannabis | Leafly","Can you smell/taste edibles?","Can indicas and sativas influence how you are even when your not high?","What happened to the two joints dude","study shows whole plant cannabis helps epilepsy patients more than isolated CBD","How to get leftover oil from out of a dozen+ cartridges?","Crosspost /Science","YUMMY IN MY TUMMY OG","Laundry day","sorry if someone has posted this link already. I am so happy that the LDS church finally doesn't have full control over this issue. What do y'all think about this article?","There’s currently a spider being hotboxed under that very pot.","Are trees going extinct? Is tissue paper on the rise? Has the world exhausted it’s entire glue supply!?!? When I was a kid zigzags used to cost 75c What’s with this $2.19 bullshit?","Thought you guys would like the coconut bong I made this morning","Bought a strain and found this excellent review on Leafly.","NJ Arrest","Top of grinder stuck?","Had to clean out the resin in the bowl after the first hit, decided to flip it. (10/10)","Guerrilla warfare for weed","One in seven US adults used marijuana in 2017, with smoking being the most common manner of consumption, according to a new study in the Annals of Internal Medicine.","My new baby","Ents who get migraines, has weed helped you?","Are we doing waterfall bongs now?","El Weedado","Medical Cannabis vs Opiate Addiction","They really should make the warning paper with a gumline so it's not a waste of space","Beto O'Rourke Fights for common sense","New icon?","Did a triple combo of Purple Velvet, Jack Herer wax with some Maui Wait crumble 😵","Does anyone know where I can find one of those soda stash cans that’s Big Red.","Brass Knuckles (8)","Made a little hash ball","Gin n juice blunts 😍","gonna be gooood","Birthday cake ft. Doggo","S. O. S. T break isn't possible but after using dab pens my tolerance is fucked and I no longer feel flower.","Nice little wake and bake and my 3rd ever roll","Going to take a t break for a fat minute since being high almost everyday since graduation this year","ELI5: Why does some smoke taste stale or more harsh than other smoke?","Is it okay to smoke weed while taking antidepressants?","Sometimes cannabis can be too good. A cautionary tale.","Just picked up some blue dream gonna have a good night.","Which is more cost effective, vaping dry herb or vaping THC E-Liquid?","Took a 40mg THC pill last night.. It hits me NOW for some reason?!","How do you keep your munchies under control?","Looking for strains that are good for seizures. Anyone have any experience with this or any recommendations?","Homemade thc infused cream puffs","Super lemon haze","Online shopping! Post your recs!","Just married!","what is your favorite dry herb vaporizer?","(Searching for) Cannabis Resesrch Universities","Looking good this morning","My glass piece broke so this was my immediate fix","Bought my first bong today for $26! With a student id discount 💀","My beautiful new cones ♡ bought specifically for CBD so I can tell the joints apart.","Keep smell out of car?","Orange kushhh","For everyone that says the mflb doesn’t make big clouds","What age did you start smoking at ,do you wish it had been later?","The true story of Scooby Doo. (As I see it.)","Weird “side effect”?","Any other ents out there named after weed?","Do percolators remove the visibility of smoke?","Why is the road sky tambourine?","Smoke spot by the river","Chee","Where to buy QuickFix 6.2 online reliably?","Cooking with cartridges","Thought you guys would like these papers.","Loving it :)","Too many ways to smoke","Some new growth","If I make cannabis tea can I use peanut butter instead of normal butter?","This is my mom telling everyone her mouth feels like cotton candy lmfaoooo first time smoking with my mom. We got all the neighbors over too. One big smoke sesh. Good times.","Unwinding with a good book &lt;3","Weed reviews!","Amateur macro of a nug of Gorilla Glue","Today my small southern town newspaper is actually trying to run a story that THC-CBD oil made 7 people sick.","PSA: Marijuana found in breast milk up to six days after use.....Lets stay informed.","Finally! My first successful cone j. After a decade of smoking bud and never rolled one of these correctly!","Anyone else save the biggest bud til last?","In terms of pipes, what is the difference and significance of a percolator, honeycomb, or multiple of them in a single pipe? Is all they do just filter the smoke and multiple, they just filter it even more?","I (Almost) Got Busted by the Police Last Night","I'm a solid 10 right now and feel like sharing a photo of the reason why, my Keef collection.","People who quit weed then started again, was it worth it?","Strange effects from this strain","Abv beginner dosage","2 gram of the best Cheese I had, probably my favourite strain.","Made this while enjoying some Green Crack the other day.","For use only by adults 21 and over...","Help I wet my weed !","Pain relief strains","I always wanted to make comics but i never really gave it a good go until now , presenting my first ever comic [7]","Anybody know where to buy this lazer bong?","When you thought you ran out of weed and you find a little bottle stashed. Thank you past self !","Concerning smell","A fresh ounce and my best girl, Stella Mozzarella","First time buying weed legal, currently in Amsterdam. So Nice! 5g Super Silver Haze","Cannabis Innovators Growing Billion Dollar Companies","Royal Dwarf Auto at day 50 (headphone alert)","Newest purchase","Stoner pro tip: when you're high and your lighter goes out, try toothpicks!","Am I the only one who can’t have a wee when they’re high?","Twins","Weed consciousness, awareness","my friend smokes stems","How much time can you storage the kief?","Will a spliff do permanent damage?","You jelly?[8] ;)","Really hating my college guys, year 2 is just as stupid as year 1 [4]","Need help. I didn't smoke for almost 8.5 months. But now have smoked almost 0.5 grams of thc liquid carts over the past week. How long will it take to get clean again?","CBD for anxiety: how does it help?","Using oil pen after wisdom teeth removal","Anyone know the artist of this dab rig? Been looking all over for this. Has Banksy on one of its nubs. It's UV reactive too.","Baked","Had to clean her for maximum taste","I couldn’t get myself to clean my room so I thought it would help if I smoked weed and now I‘m just sitting here high still not feeling like cleaning my room","Left bowl in dresser for 2 weeks, now like this. Why? How to clean?","I finally paid off a huge medical bill that has been haunting me for years so I decided to treat myself","(9) I’m elevator","Relaxing Monday Afternoon","Never have been or will be a part of the stoner clean up initiative.","Contact high wipes out community #thinkofthechildren .","My Girlfriend tried Space Cakes fo4 the first time in Amsterdam. Can you spot her?","When you just need a time nuke.","What are the Best cartridges to buy?","Sensi Seeds Amsterdam last week","I want to grow just one plant.","Getting high as hell before hitting the sack","Trying to bring a convenient high to market.","It’s a beautiful day to go diamond mining.","Zip of some Gorilla Glue in an illegal state. It's not bad.","What's your \"I'm gunna be the first person to overdose on marijuana\" story?","🍍I love smoking with my family🍍","The question is always am I stoned enough to sleep or should I take another hit?","Herbal Dispatch statement on legalization.","Billy Ray Cyrus and rapper Lil Xan smoking weed together","Missing Weed While Pregnant (advice?)","Payday is best day💘","Skrrr","Greetings from ME","Juicy Jack (zoom in)","Halp with vape cartridge!","Thought my fellow money-conscious Ents here might appreciate this.","I feel like visiting a dispensary the first time will be like What's This from Nightmare Before Christmas [7}","It's a wonderful time of year on the farm. Fall is just around the corner. Welcome to the field of dreams...","I just caught a charge.","Friend broke his thumb, found this as the best medicine in an illegal state.","Tried some cannabis infused absinthe tonight","Nug Shot","Stoner students of reddit, advice on where to smoke on campus?","Just the tip makes me high af","Moon joint!","Pro tips on improving smoking experience","My friend in his dorm was looking for his keys. When he couldn’t find them, I said “wanna borrow mine?” [8]","What do you think about how we roll joints in Spain with the cigarette","Bowl or munchies?!?","European Cannabis","Bye my girls! Time to date with other girls.","Last shot of this Space Dawg that was grown by a friend. Had to crack it open and see what’s inside. Zoom in a little or see my last posts to have a look.","First day back at university. I guess I deserve the reward for working so hard today. Shout out to my stoner collegents","Newbie help","Gorilla Glue Holding Up To Its Name","Weed food (NPR article)","[6] Tonights spot. Hammock under a massive magical tree","Picked up a half oz of this Purple Punch💜","Justbsaw this and thought id spread it around because its just outrageous. Alabama cracking down hard on cbd.","Saw my anti-weed aunt for the first time today in years","Fresh PB&amp;J","DAE Not get the munchies?","Dr. Jeff Chen UCLA Cannabis a gateway herb in NYC","Canna coconut oil assistance","A humble bouquet of homegrown flowers","Smoke spot by the lake","#6 Strains of Tuesdays - Money Maker","Cute little bowl I picked up at the local shop","Will I failed a hair drug test if I vaped only once this past year, over 45 days ago?","Smoking Weed in Woodworking Class","It’s about to get weird boys","Friend made a castle with a draw bridge","To the Moon! Top shelf, dipped in oil, rolled in kief.","different experience","Rolling when using a glass filter...","Southern Oregon has been stuck in a ton of smoke, but today it cleared up! Decided to go find a hilltop somewhere and do some reading.","I broke my glass whip. Instead of trashing it, I sanded down the broken part and its now a great steamroller style pipe. Works great, and feels even better not to have 'completely' broken yet another piece. [7]","California Medical card, worth it?","Here's to more pain-free days. My first dispensary purchase.","I love this plant.","Dont know whether to post this grade a purp here or r/marijuanaenthusiasts","I discovered time travel!!!!","My New Piece","Describe the moment you realized that you were a “stoner”","All geared up for a good day. Thought y’all would like my piece.","To r/trees","the tomato sandwich","How the heck did you get in my indoor grow?!","high right now, sup","For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life.","Lastest pickup-Australia","Hey guys, did another video. A potential replacement of my other initial video. I would love feedback. This is an important issue for me, and a lot of people. Emotional abuse.","Finally got my hands on some Durban Poison","Totally wasn’t gonna smoke tonight, but work sucked, so cheers!","Love our dealer (9/10)","I never wear hats at all. Super high me sitting on the couch instinctively went to take my hat off","How much weed does it take you to get high?","I challenge everyone whos been putting it off to clean your bongs. If for no other reason do it for the mary jane. She deserves it.","Can’t argue with that","I took off my pants to put on sweat pants but started putting on a different pair of pants.","Grand purp in bloom","Nothing like a full grinder for a Monday morning Wake n’ Bake!","Anyone who smokes weed and likes colorful animation/visually stimulating tv shows.","Can I pass a urine test?","The wife just started back night school today... Where do I even begin?","I call everyone bud","Fuck the for profit diversion industry","Went for a walk [7] after playing Skyrim with the Bruma mods. Georgia reminds me of Cyrodiil","That mad grav hit got me itching to make one for myself this morning","My Smoke Spot","My cat is fucking with me","Did not expect to find this in the in-laws garden","New piece, blue dream, [8]","My little plant","Homemade hash","Going to miss these sunsets when I leave for university next week.","Tonight's Smoke Spot (Brownies count, right?)","Good glass online","This strawberry cough was frosty asf","Does milk/dairy stop or diminish your high?","Purdy Nurg, no?","Sequoia Smoke Spot","Sfv Og Diamonds.....","What do you pay?","Why is medical marijuana not covered by insurance?","Smoking dope, sipping dope. Life’s good.","Yesterdays smoke spot. Lake Sequoia national park","[8] Just typed reddit in the search bar","Is it better to smoke loud?","My happy place","Looks to be a good night 🍋🌲⛽","Help I'm dankrupt","What do you think? Picked up half an ounce of mystery weed today. I think it looks good other than some spider mite webs","Does anyone have great highs and bad trips all in one smoking session?","Cannabis Cravings - Help","Anyone wanna talk can’t sleep","Reupped on some Blue Dream again","Buckeye Purple","Good places to smoke undisturbed in Phoenix, AZ?","It’s pack-man!","I think Mike &amp; Ikes are just long jelly beans 🕵🏽‍♀️ [6.5]","Mosquito buzz? (6)","Anyone Else Recalls Old Memory's Listening to Music While High?","Fell asleep at a (7) then woke up at 4 am","What are your top 3 favourite strains?","Getting that thermal hot.","Rolled a little AK joint for some friends (x-post from /r/ArtOfRolling)","Stockbroker Smokes 115,000 Joints... Legally and gets supplied by the government. (USA)","Golden Nugget","5g nug of some Mother of Berries from right here in Maine :)","Liberals approve first saliva screening roadside test for marijuana","Ammesia x Cookies imported from 'dam [7]","I got high and took a walk.","Approved for MMJ in Oklahoma!","Is vaping safe for my toddler?","Illinois on verge of vastly expanding Medical Marijuana - Tuesday deadline for Gov. to sign/veto","marijuana and driving","I think im getting the hang of this","Gift for an Ent friend?","Is there a reason my wax/oil tastes like dirt?","I surrender!!","So I got this new pipe but I need help!! How do I clean it? How can I avoid it to turn black or dark brown and how often do I clean it? put it in hot water or something?? Help I don't want it to turn black","Just a kiefy lil bowl 😁","Bargain of the century","My Parents found out I smoke","Trees ft. trees","Cleaned up my favorite steam roller. I love the grip-style carb action on this.","Boyfriends dad gave this to me from his plant","Disneyland Adventure Caution Tale to Fellow Ents","Pineapple Express + Making Beer = My Perfect Day","Just smoked a couple bowls of cookies n cream. I don’t really post here lol","Smoke spot","First Joint!","Problem with buying bongs online?","I am in trouble.","Please watch what you're smoking","Early morning bong rips on the porch some Jack Herer to get going. She thinks she’s a lap dog after running then swimming through a mud pit! Also best idea put a recliner on the porch.","Your bucket list smoking locations? ( Don't up vote )","Thoughts on this cherry gelato?","Went to China last month and noticed this beautiful tree on a hike","Who's up for a dab?","Master chief defending the package","Hairy Sour D nug from Montreal","A friend 💕","California: Teen Marijuana Use Declines Post-Legalization - NORML","Quitting weed is boring as hell","When you only grow once a year, this is a nice sign of the yield!","What’s tropical fish poop good for? Growing trees of course!","Some “regu” 30 dlls oz"]