["[General Discussion] Around the Horn - 8/29/18","Your team's season in MS Paint: 2018 edition","Phil Hughes hates Fenway and Wrigley, calling Fenway a \"trash can\". Asked why, \"The same reason your really old car was bad.\"","Tyler White walks off the A's with a solo home run","[ Brian McTaggart] Jose Altuve has struck out four times in a game for the first time in his career.","[Andy Slater] JUST IN: Marlins announce that they encourage fans to bring \"musical instruments, flags, and more\" to Marlins Park next year in newly-named outfield section \"Comunidad 305.\"","[Flanagan] Royals have traded Lucas Duda to Atlanta for cash considerations.","[Berman] MLB sources: The #Astros will announce tomorrow they've signed manager AJ Hinch to a contract extension.","Zobrist walks off the Mets","Wilson Ramos unsuccessfully attempts to stroll his way from first to third","Joey Fuego takes a liner to his Joey Huevos","In the Mets first inning removed from scoring 1 run over 10 innings for deGrom, Todd Frazier hits a gran slam to put them up 4-0 over the Cubs","With Tyler White's walk-off HR for the Astros, MLB sets record for walk-off dingers in a season with 81.","[Post-Series] The Astros win two-of-three against the Athletics in Houston","The last back-to-back Inside the Park Home Runs were hit by Texas Rangers’ Toby Harrah and Bump Wills in 1977","Kyle Freeland has 6.7 bWAR and is in the top ten of best bWAR seasons in Rockies history.","Luis Urias first career homerun overturned after questionable review","Lance Lynn screams a good ol’ “F**k you motherf**ker” after striking out a batter.","[Grant Brisbee] Shout out to the guy who yelled, \"HEY, BLUE. CHECK YOUR VOICEMAIL. YOU MISSED A FEW CALLS\" loud enough for the television audience to hear.","[WaPo]The Orioles’ biggest fan these days is a raccoon named Frank","Jacob deGrom against the Cubs: 8.0 IP 10 K 1 BB 8 H 1 R (1 ER) 109 pitches. He's also 2 for 4 with the Mets only RBI, and gets the No Decision.","Ramon Laureano makes a great running, over-the-shoulder catch","Two qualified fielders have not committed an error this season: Mike Trout and Salvador Perez","If the Baseball Hall of Fame had a rule that forced players to wear the cap of the team they retired with on their HOF plaque, which would be the weirdest ones?","[Heyman] josh donaldson came through last night's game fine and is going on trade waivers today so he can be traded on Friday's waiver deadline. #STLCards and #Indians seem like logical spots, but sources suggest there are other teams showing some interest.","Padres' Luis Urias begins his MLB career with a web gem for the first out of the game","[Post-Series Thread] The Padres sweep the Mariners in the San Diego leg of the Vedder Cup, 2-0","Highest 2nd half SLG%'s: Yelich .727, Acuña .716, and Chapman .707","Michael Conforto has broke the record for the most strikeouts in a month by a New York Met.","Luis Urias singles to right for his first major league hit","[Davidi] Hearing Josh Donaldson won’t be in the lineup at single-A Dunedin tonight due to soreness in calves and legs. #BlueJays","Jacob \"Fine, I'll do it Myself\" deGrom puts the Mets on the board with an RBI 1B","Neil Walker's walkoff home run Tuesday night was the 80th walkoff home run this season league-wide, tying the all-time MLB record set in 2004.","(Meisel) The Indians have placed Andrew Miller on the DL with a left shoulder impingement, which is not what you want.","Kintzler tries to make a play on an infield bloop, but Bote butts in","[Morosi]#Braves acquire Rene Rivera from #Angels via waiver claim. @MLB @MLBNetwork","Jansen makes an incredible no-look behind-the-back grab and throws into a game-ending double play","WSH@PHI ends on a flyout where Vince Velasquez is called out for leaving early for 3rd on a tag up","[LAAngelsPR] - Medical Update: Albert Pujols underwent successful arthroscopic debridement of his left knee earlier today. Surgery was performed by Dr. Neal ElAttrache in Los Angeles. A general timetable to return to playing following this procedure is 6-8 weeks.","[Edwards] Cubs Payroll Set to Soar with Potential TV Deal","[Cut4] Poor bat dog gets confused","Just thought about how good Kurt Suzuki has been for us: in 166 games, he’s batting .272/.338/.478 with 28 HRs, 89 RBIs, 36 BBs, and 72 Ks","Neil Walker crushes a walk-off home run to beat the White Sox.","White Sox rob another home run from the Yankees this time it's Avi Garcia","David Price exits in 3rd against Marlins with apparent wrist injury.","[Longley] Dunedin #Bluejays game tonight has been postponed due to inclement weather. They'll play a douebleheader tomorrow when we'll see if Josh Donaldson is fit to continue his rehab assignment.","Ken Rosenthal: Ohtani's Rookie of the Year Case","If you took just one SP from each team, which division would have the best 5 man rotation?","Last play from every World Series 1980-2016","As of Today, half of the top 10 teams ranked by payroll are out of a playoff spot.","[Andracki] Cubs still not sure when they're getting closer Brandon Morrow back","[Kaplan] The Astros are now placing Charlie Morton on the 10-day disabled list. Jeff Luhnow says the team expects him to miss only one start.","Gorkys Hernandez walks off the Dbacks, driving in the only run of the game","Evan Gattis's long road back to baseball","[Spaeder] Cole Hamels is the first in season acquisition in baseball history to allow one run or fewer in each of his first six starts with his new team.","[Mariners] Edwin Diaz &amp; Scott Servais with the same haircut","Who is watching the continued Mets game from last night?","If the Hall of Fame had a rule that forced players to wear the cap of the team they debuted for on their HOF plaque, which would be the weirdest ones?","[Sherman] #Mets have traded Jose Bautista to the #Phillies","[Trivia] What do Ken Griffey Jr, Sparky Anderson, Tom Seaver, Babe Ruth, Rube Waddell have in common?","Big G hangin' with Big Al","WaPo Analysis | Baseball players are famous for cliches. Here are the ones they actually use.","The Red Sox walk off the Marlins on a Miguel Rojas error.","Sportsnet.ca: Roberto Osuna speaks out: ‘Everybody is quick to judge me’","WAA Calculation question regarding how BBref calculates WAR","[Longley] Sources familiar with the situation confirm there is definite interest in Josh Donaldson from multiple teams. #Bluejays third baseman scheduled to play a second rehab game tonight in Dunedin.","Padres rookie Jacob Nix: 8.1 IP 8 H 1 R 0 K 0 BB 79 P","[Post-Series Thread] Kansas City Royals sweep the Detroit Tigers in a 2 game series","Matt \"Matt Chapman\" Chapman robs Gurriel of extra bases","Willians Astudillo blasts his first career homerun!","Nick \"Make it a Double\" Martini launches one to right center off Roberto Osuna to give the A's a one run lead in the top of the ninth.","[Kluber] has shaved his beard for the first time in 10 years","TIL that Nolan Ryan never had a season with a WHIP below 1","Ahmed gunned down at the plate by Duggar-to-Crawford-to-Hundley to keep the score tied","Aaron 🍆 Hicks pimps a game tying 2 rum blast in the bottom of the 8th","FiveThirtyEight: The Pittsburgh Pirates are having the most average season in sports history","Umpiring School!","[MASN] after being ejected for arguing a bad strike call, Mark Reynolds throws his batting gloves and is ejected again","Baseball Positions Are Starting To Lose Their Meaning","Baseball-Reference adds a Daily Batter vs. Pitcher Matchups to Watch page","[Nightengale] The #Stlcards will announce that Mike Shildt is now their manager, stripping away the interim title","LaRussa talks the state of the Cardinals, Matheny/Schildt, and the amazing influence of George Kissell","[Jeff Jones] The #stlcards in-house graphics crew has made an adjustment to Matt Carpenter’s scoreboard data.","Why does MLB void games that are suspended before 5 complete innings? Under what theory is it \"fair\" for a large early lead to be erased just to start over?","Best baseball game for PC?","The Mets (3rd worst record in NL) are as close to being the best team in the NL as the Rays are to winning their own division.","Jack Flaherty tonight: 7 IP, 4 H, 0 BB, 1 ER, 5 Ks on 88 pitches. Hasn’t allowed more than 5 hits in a start since June 27th(11 starts).","Anthony Rendon hits a go-ahead 2 run homer off Pat Neshek in the top of the 9th","[Cut4] Narrator: It was at this moment that @Mariners skipper Scott Servais knew he made a mistake.","At 42 years old- Barry Bonds was an all star, led the league in OBP, had 3.2 WAR and did not receive a contract offer the following year. At 44 years old- Bartolo Colon had a 6.48 ERA, 0.6 WAR and another contract offer.","Quick Statistical Analysis of the AL West Division Race","Question: If Degrom has better numbers across the board than Nola why is Nola’s B/War higher?","[Dan Kurtz] The Kansas City Royals announced that they signed Global Vision Christian High School pitcher Jin Woo-young.","[DiComo]NL Cy Young candidates tonight: Max Scherzer: 5.0 IP, 4 H, 3 ER, 0 BB 5 K, 2.22 ERA Aaron Nola: 7.0 IP, 4 H, 1 ER, 2 BB, 8 K, 2.10 ERA Jacob deGrom: 8.0 IP, 8 H, 1 ER, 1 BB, 10 K, 1.68 ERA","Jack Flaherty's Case for NL ROY","Rules Question: If a ball is hit and bounces in the outfield before an outfielder inadvertently knocks the ball over the wall, is it still a ground rule double?","[Mariners] Two cities a mere 1,255 miles apart battle for the right to call an all-time great musician their own. Tonight, the rivalry resumes. The Vedder Cup is back on.","The Marlins have batted around against the Red Sox in the top 8th","Ohtani disagrees with strike 3","The inside story of how the Cubs landed Daniel Murphy","[Puma] David Wright heading to Triple-A Las Vegas for Rehab","Jakob Junis tonight: CG 9IP, 6H, 2ER, 0BB, 7K","Do other teams have a song like “Meet the Mets?","Aaron Nola tonight: 7IP, 4H, 1ER, 2BB, 8K","Harrison Bader: Rookie of the Year?","Cole Hamels with 5 more scoreless innings (8 K 3 BB 4 H) against the Mets brings his Cubs ERA to 0.69 and FIP to 2.28 through 6 starts and 39.0 IP","Best season by a starting pitcher?","[Goold] Cardinals giving contract extension to manager Mike Shildt","[McWilliams] Rotator cuff tendinitis for Manaea. Melvin said the team hopes to get him back but said it’ll be a while. Unsure if he’s back this season. Another huge blow.","[Adler] Brett Gardner's triple today was the fastest by a Yankee since Statcast started keeping track. 10.92 seconds, at 29.6 feet per second.","Foul Ball gets lost in Minute Maid Park's rafters.","Bob Costas reportedly in discussions to leave NBC after nearly four decades","With the recent Phil Hughes comments on Fenway and Wrigley, how long do you think those two stadiums will last?","Yelich hits a 3 run jack just inside the fair pole, his 25th on the year and 2nd HR of the day. That makes it his 7th long ball in the last 9 games.","Strike Zone Question","Fewest Players to Before 1900?","Batman At Bat fan project sends the Dark Knight to the baseball diamond","Odubel Herrera takes Max Scherzer deep for the 2nd time in as many games to give the Phillies a 1-0 lead","Nightly Pick 'em Game for August 29th","Matt Olson demolishes a three-run bomb off of Morton","[Lee] Eloy Jimenez has been so dominant, Durham decides to defend him w FOUR outfielders. Durham 2B Micah Johnson makes the catch up against the wall..","Carlos Carrasco tonight: 7.2 IP, 4 H, 2 BB, 0 R, 11 K on 104 pitches","Marlins hit back to back home runs to tie the game at 4 against the Red Sox","Freddy Galvis with the spectacular dive and throw to save a run","TIL - Players cannot change their uniform number mid-season (unless of they’ve switched teams) unless they are willing to buy up all existing merchandise with that number on it.","Eloy Jimenez is on a tear since Michael Kopech got called up","Competing with somebody","ROTY: Ohtani vs Andujar","Noe Ramirez today becomes the first Angel to start a game the day after earning a save. [Angels Twitter]","Rookie of the Year frontrunner Miguel Andujar launches homerun number 22 to put the Yanks on the board!","Matt Andriese was optioned to Single-A today, he is also turning 29 years old today","What’s the longest a game ever went before either team got their first hit?","So my Uncle got VIP tickets to a Yankee game on friday. Never been to a baseball game other than a Long Island ducks game. What can I expect?","Pitching matchup tonight: Hamels vs deGrom","Let's assume at the end of the season, J.D. Martinez wins the Triple Crown, Jose Ramirez enters the 40-40 club and Mookie Betts and/or Mike Trout have 10+ WAR. Who would you vote for in the AL MVP race?","Progressive Field becomes the first MLB stadium to be sensory inclusive","What is your own personal unwritten rule about baseball?","What was it like having the World Series in New York in 2000?","Tonights Cubs-Mets game features a pitching matchup between Jacob deGrom, the MLB's season leader in ERA, RA9-WAR, REW, and HR/9, and Cole Hamels, the MLB's August leader in all of those same stats.","Braves To Extend Tyler Flowers","First baseball game","Who are some players you were surprised to learn weren't as good as you thought?","Shows that follow the team throughout the season","Chris Davis' is batting .168. He has 166 strikeouts and 16 home runs. If he were to hit a home run in every single game the rest of the year (41 games), would he be the AL MVP?","If for some crazy reason this whole \"opener\" trend continues...","1968 World Series, Game 1: Tigers @ Cardinals","[Jon Morosi] Brett Anderson placed on DL with strained left forearm. He’s the second A’s starter to be idled by injury in the last several days.","Is anyone else having problems with At Bat saying it cant find your subscription?","[Matheson] Interesting new variable with Josh Donaldson and his rush back to trade eligibility ... it's raining in Dunedin. And there's rain in the forecast each of the next two days. #BlueJays","[Fangraphs] Lucas Giolito Is Saving His Season","[Bernardino] Pineda has a torn meniscus and will not pitch this year","Shohei Ohtani hits HR #15 vs Colorado to put the Angels up","My calendar at work today. Coincidence? Or full-fledged conspiracy?","[Davidi] In Dunedin, Josh Donaldson with a walk in first PA, RBI single in second trip up (EV of 110 MPH). Also one 5-3 in the field so far.","Local Knowledge","Jon Lester fucks the DH with a go-ahead two-run single on a 98mph Thor sinker after a disrespectful intentional walk","[DiComo] Breaking: The Mets will not call up Peter Alonso this season.","[DVS] “Carlos Rodon is 4-0 with a 1.84 ERA in 9 starts since he stopped wearing an undershirt. September posing possible threat.”","/r/baseball Players of the Week - Week 21: Blue Jays' DH Kendrys Morales hits homers in 7 straight, one shy of the MLB record, Braves' right-hander Kevin Gausman is enjoying his time in the National League, and Athletics' trade acquisition Mike Fiers dazzles in his first 3 starts!","How Maple Bats Kicked Ash And Conquered Baseball","Highest Batting Average in Single Season - Gary Redus .462 in Rookie Ball - never hit above .288 in majors","Did Anyone Make the LED Scoreboard Posted here in the Preseason?","With ~30 games remaining, 11 teams (7AL, 4NL) still don't have 62 wins","Do or die game for the US Women at the 2018 Women’s World Cup against Japan. Streaming live now on YouTube.","Jon Lester picks off Amed Rosario","What is the worst team that you can make out of overpaid players?","James Shields Trade Possibility","‘It’s Enrico Pallazzo!’: The inside story of ‘The Naked Gun’ baseball game","[StatsbySTATS] The @Orioles snapped an 8-game losing streak tonight. They have now completed a \"single-digit losing streak cycle\" - at least one losing streak of exactly 1,2,3,4,5,6,7,8, and 9 games. Only 3 other AL teams have done this: the 1904 Senators, 1939 Browns, and 2003 Tigers.","Despite his best efforts, Josh Reddick makes it to 3rd on a line drive to left.","Home Run #31 for Mike Trout","Why were there so many balks recorded around 1988?","Another post got me wondering. What are some of your accomplishments as a young ball player?","[Sam Miller] From 6-4-3 to 1-2-3: Ranking the 17 types of double plays","Alex Bregman clutch 3 run HR in the 8th to give the Astros an 8-4 lead","A.J. Reach &amp; Co., Philadelphia","Kendrys Morales ends his homerun streak in consecutive games on 7 games, by going 0 for 3 against the Baltimore Orioles","TIL of all the pitchers who are both in the Hall of Fame and threw a perfect game, Randy Johnson is the only one whose plaque doesn’t mention the perfect game.","Question about national perception of the 2018 Rays","Brandon Crawford with an insanely athletic play to rob Goldschmidt.","Waiver wire explanation please","From 2007-2015, the Rockies paid ~$40 million for ~40 WAR from Troy Tulowitzki. Since then, the Blue Jays have paid $60 million for less than 5 WAR.","Michael Conforto destroys a Jon Lester pitch 472 feet to the batter's eye","Phillies designated right-handed pitcher Mark Leiter Jr. for assignment","Ballpark App tickets","David John LeMahieu cranks a go-ahead Grand Slam in the 8th inning.","Is it wrong to like two teams? For example: I’m a Braves fan first and foremost, but I like the Mariners as well.","Gleyber Torres hits a 444ft bomb that not even Adam Engel can reach. 6th Yankee with 20 HR on the season.","If a pitcher commits a balk but releases the ball, and the batter hits said pitch. Would the hit still count?","Jon Lester snags a comebacker to finish off his weird start","What is the opinion on here of Brian Kenny","Tony Gwynn had less strikeouts over the final twelve seasons of his career than Aaron Judge did in his rookie season.","Retiring the No-Hitter Bot","Umpire grants time in the middle of Daniel Mengden's windup","Eric Young Jr helps the Angels retake the lead with a go ahead two RBI single in the 8th!","Chris Stratton vs. Diamondbacks: 8.0IP, 5H, 0BB, 6K, 117 pitches.","Maddux vs. Gwynn, Both 1st Ballot HOF, Faced Each Other 107 Times. Mr. Padre Was Never K'd","[Cassavell] The Padres are calling up Luis Urias tomorrow, as @sdutKevinAcee said. Urias is the No. 22 prospect in baseball and is hitting .296/.398/.447 at Triple-A this season. He's the Padres' presumed second baseman of the future.","[General Discussion] Around the Horn - 8/28/18","ESPN+ with SmartDNS get me always MLB blacked out","A Radical pitch to save baseball","The 2018 Yankees are the first team since the 2008 Reds to have 2 rookies who hit at least 20 HR","The Angels game tonight is a prime example of why pitcher wins are almost meaningless","[Andrew Baggarly] Buster Posey is resting comfortably in Vail, Colo., after undergoing hip surgery today, the Giants announced.","Charlie \"-2.7 dWAR\" Blackmon makes a catch on a 83% hit expectancy line drive","According to ESPN, the Dodgers have the second best odds in the NL to make the playoffs despite being tied for the seventh best record in the league.","[Rosenthal] Phillies have claimed Mets’ Jose Bautista on revocable trade waivers, sources tell The Athletic. Teams discussing a deal, would need to complete it by tomorrow. Bautista slumped badly at start of August, but has .738 OPS in last 14 games.","A's Analytics: Davis and Chapman turn it on, Manaea's velo...","A thought on the (non)existence of some offensive statistics.","Rules Question Regarding Replay","School Project with payroll in mlb","[Slusser] Sean Manaea to see renowned orthopedist Dr. Neal ElAtttache tomorrow.","best place to sell baseball cards?","Tyler White singles in the go-ahead run for the Astros","What was the greatest moment in your little league career?","Matt Chapman demolishes a 46-degree home run into the Crawford boxes to make it 4-0.","AAA Louisville Bats recreate famous Sandlot scene.","Who is the biggest flop in mlb history.","[MLB] Tim Anderson showing off that RANGE.","JD Martinez over the past 365 days: 54 HR, 146 RBI, .346 BA. All three lead MLB over that span by a wide margin (JRam 48 HR, KDavis 122 RBI, Altuve .324 BA)","Flashback: Why was Nelson Cruz in RF defending a 2-run lead in the David Freese game of 2011 WS?","Marcus Semien demolishes a two-run bomb off Cole to open the scoring","Sorry if this isnt the place - But need advice for my swing. Thanks! (15yr Canadian)","Rhys Hoskins bounces one off of the moon.","MLB Graphical Standings - August 27, 2018","[Cubs] Anthony Rizzo is your NL POTW","State of the Baseball Subreddits - Week 22 2018","What’s your current favorite TV announcer’s home run call?","[Frierdich] Little Cardinals fan at Coors giving Harrison Bader a tater tot","Is Yadier Molina a HOFer?","Have any team in history done this?","[Hunter] Lourdes Gurriel Jr. unveils \"Kendrys cam\" as Morales chases a home run in his eighth straight game","Tanaka escapes a bases loaded no outs inning with a ricochet off the mound","[SABR] Oakland A's 3B Matt Chapman leads all qualified AL fielders in #SABR Defensive Index rankings through games of August 19.","2018 r/baseball Power Rankings -- Dodgers Slipping While D'Backs / Rockies Rise, Rays Ride the Waves While Reds Sink, Will Cardinals Continue?, Will A New Player Disrupt AL Hold on Top 4?","The most overlooked player on each team","[Baseball Reference] Michael Kopech is the only pitcher since 1908 to start his first 2 MLB games and give up 1 or 0 runs and 0 walks in both","(Baseball) Homer Bailey is averaging nearly $8 Million per win the past four years. If Corey Kluber had been paid the same rate - he would have earned over $500M the past four years.","[Shusterman] Kendrys Morales is on the cusp of history, but the winding road he took here is just as interesting","TIL that Billy Wagner ended his career as a Brave","Urena truly grand during three-homer game","Anyone know the difference between these 2 MLB passport books? Reviews/recommendations appreciated.","Who would you rather on your team for the next five years while in their prime? Ichiro or Vladimir Guerrero","Tagging up question","Who is your teams \"unofficial\" rival?","[Diamond] After a challenging offseason, the @MLBPA has hired veteran labor attorney Bruce Meyer to be the lead negotiator for the next CBA. He will work alongside executive director Tony Clark.","[670 The Score] Cubs will go their own way in a television venture starting in late 2019","Proposed change to League Division Series schedule.","Carlos Gomez gives bat to young fan before yesterday’s game between the Rays and Red Sox","Is Harrison Bader the real NL ROY?","MLB Shower Thought: Shohei Ohtani is probably the first person in MLB history who, if you had 25 of him, you'd be by far the best team in baseball!","Purchased a copy of The Bill James Baseball Abstract 1985 on E-Bay. A previous owner left an uncast '85 All-Star ballot inside.","Is my sinker good? Be honest, I picked it up recently and I’ve been working on it.","Nightly Pick 'em Game for August 28th","The sheer amount of joy this kid has over catching a homerun ball.","From 1978 to 1987, 10 different teams won the World Series in that 10-season span. It's the only time that's ever happened in MLB history. Will it ever happen again, in your opinion?","Ideas For MLB Expansion &amp; Realignment","TIL of the 1899 Cleveland Spiders, the worst team in baseball history","Power went out at Dodger Stadium last night, someone had a great edit (x-post r/SquaredCircle)","Hawaii beat South Korea 3-0 to win the Little League World Series","With Kendrys Morales homering in 7 straight games, now’s a good time to remind everyone that the first guy to homer in 8 straight, Dale Long, was once traded for a guy named Dick Oder.","Do ageism laws apply to the mlb?","[Post Series Thread] ST PETERSBURG, Fla. -- Florida Men Viciously Beat Unwelcome Guests With Broom.","Does anyone know why in Ken Burns' Baseball, they show a clip of Happy Chandler singing \"Take Me Out to the Ballgame\" before the \"Bottom of the Sixth\" segment?","Justin Turner since the all-star break: .402/.480./.724 with 20 RBI in 23 games.","In 1927, Babe Ruth had the 9th best OPS ever while Gehrig had the 14th best OPS season ever","Batters with Helicopter Swings","Were the Braves expected to be a contender this season?","The Boston Red Sox have been swept for the first time this season. It's Players' Weekend. Last year, the Red Sox were swept for the first (and only) time all season on Players' Weekend.","According to ESPN 4 AL teams have a 99.8%+ chance of making the playoffs with the A's at 85.2%. In the NL only the Cubs are higher than 69% with 7 teams between 37%-69%.","Are these good pitch selections?","Which team would have homefield advantage in World Series?","(Pitching Ninja) Blake Treinen, 99mph Fastball Path.","Books about pennant chases and seasons","The Cardinals beat the Rockies 12-3 to win their 9th straight series","Advice for new bat for 8 year old","[Post Series Thread] The Yankees sweep the Orioles in a 4 game set in Baltimore","Morales hits his 7th HR in a row! One away from the league record.","I found these pennants at my dad's house and I was wondering if anyone knows what years they are from","Blind baseball team defeats opponents, and stereotypes(short article)","The Tampa Bay Rays have won 8 in a row","Jerry Cantrell throws a strike at Safeco Field","[Passan] 10 Degrees: Baseball's attendance woes have MLB and owners rightfully spooked","Matt Carpenter has gone 4/5 with 4 doubles through 7 innings.","Dancing in the Dugout ft. Roñald","The Washington Nationals have a +73 run differential to go along with a losing record of 65-66","Does anyone still believe there's nothing wrong with Chris Sale?","Do you think Nick Markakis can reach 3000 hits?","David Bote hits his first non-game-tying or -go-ahead home run 451' onto Waveland","Is the Cardinals first round draft pick (19th overall) this year, Nolan Gorman, already a top 20 prospect?","Make the best line up and pitching rotation using only players who you've seen live at the ballpark","If it’s the Little League World Series, why is the US automatically in the finals every year?","Blake Snell’s last 15 starts: 86.1 IP, 1.36 ERA, 0.96 WHIP, 11.2 K/9.","[General Discussion] Around the Horn - 8/27/18","Postgame Thread ⚾ Yankees 5 @ Orioles 3","[Post-Series] The Astros have swept the Angels in three games at Anaheim","[Sullivan] Chris Archer, Pirates: 5 GS, 22.1 IP, 6.04 ERA, 4.68 FIP Tyler Glasnow, Rays: 5 GS, 23.2 IP, 3.80 ERA, 3.24 FIP","Anyone remember MLB.com exclusive games?","MLB ERA \"leader\" Lucas Giolito (5.85 ERA) reached 10 wins on the season last night. 2 more wins than MLB ERA leader Jacob deGrom (1.71 ERA) at 8 wins","Kevin Gausman since being traded from Baltimore to Atlanta: 5G, 32IP, 21H, 6R, 7BB, 22K - 1.69 ERA, 0.875 WHIP","ESPN Power Rankings 08/27/18","TIL of Dick Wantz, a Pitcher for the Angels who Threw 1 Major League Inning and Died a Month Later","Michael Kopech's first full start: 6IP, 7H, 1R, 4K, 0BB(2HBP)","[Rome] Max Stassi thought about using \"Stasshole\" for Players' Weekend. Major League Baseball had different ideas.","Jason \"Dirtbag\" Kipnis hits an inside the park homer for his fourth hit of the day and his 100th career homer.","Auckland Tuatara officially unveiled as New Zealand entry to Australian Baseball League","LHP Austin Gomber bats in two runs on an infield single against the Rockies in the first inning","Rays Threepeat Bullpen of the Week","Paul Goldschmidt crushes a 3 run HR, his 30th of the year.","Astros pitcher Justin Verlander says viral, '$1 million' lunch bill was comped by hotel","Matt Carpenter hits his second double of the inning as the Cardinals score 6 and bat around in the 1st","[Johns] Edwin Diaz becomes youngest player in MLB history to reach 50 saves in a season ... a mark only reached 16 times before. He has 32 games left to try to reach Francisco Rodriguez’s record of 62.","Jesus Aguilar takes an at bat with Swedish Fish in his helmet. #1 suspect is Orlando Arcia.","What are some of the best things to say that will put the opposing pitcher off his game?","Homer Bailey is making $21 million this season. Homer Bailey is 1-12","[White Sox Talk] \"I was almost crying when I was running around the bases.\" Kevan Smith reflects on what it meant to hit his first HR of the season wearing a jersey that honors late best-friend and White Sox pitcher Daniel Webb","Suzyn Waldman's response to John Sterling talking about his cold: \"I had it at the beginning of the year, sounding like an adult film star for three days.\"","[Post-Series Thread] Cubs sweep the Reds in four at Wrigley","Ronald Acuña Jr makes a superb diving catch against the Marlins","Beltre with the long off-balance throw, smooth as ever","What league uses Perfect Game brand baseballs?","[Post Series Thread] Dodgers sweep the Padres at Dodger Stadium","Detroit Tigers honor Alan Trammell, as Lou Whitaker get his due, too","Ronald Acuña's 2nd half: .338/.421/.744, 207wRC+, 14HR, 8SB, 2.5fWAR","Stephen \"MOMO\" Piscotty demolishes a lead-off HR to Right Field in the 6th to put the A's up 4-0","Christian Yelich since the all-star break: .352/.395./.711 with 25 XBH","[WhiteSox Strike Zone] Yolmer Sanchez takes a strike","Birthday present for baseball player brother?","Tyler Anderson´s final line against the Cardinals: 0.2 IP, 7 H, 6 ER, BB, K .","After 32 innings, the Nationals have finally scored","Mark Reynolds swats a grand slam to put the Nats up 15-0","[Kelly] Pete Rose. Ty Cobb. Neither was able to get 1,000 Minor League hits, hard as they may have tried.","The Pittsburgh Pirates have the third lowest ERA in baseball over the last 2 weeks. They've gone 3-9 in that time.","Lights go out in Dodger Stadoum at the Dodger vs Padres game 4-4 bottom 12th","Mike Clevinger's colorful and Bold (As Love) Jimi Hendrix - inspired cleats","Puig does a classic Puig move.","The Toronto Blue Jays and the San Diego Padres are the only teams in the MLB without a position player with 2+ fWAR in 2018!","Matt Chapman sees Tyler Austin's two homer game and calls, demolishes his second home run of the game to center.","Kelvin Herrera carted off the field after appearing to tear his Achilles","The Nationals Score 8 Runs In The 8th Inning Against The Mets, Shortly After Breaking Scoreless Streak of 30+ Innings","[Post Series Thread] Seattle takes two out of three from Arizona at Chase.","August 26, 1939 First Televised Baseball Game. Announcer Red Barber called the Game for New York Station W2XBS between the Cincinnati Reds and Brooklyn Dodgers at Ebbets Field in Brooklyn.The Reds won the first game, 5-2, and the Dodgers took game two, 6-1.","Game of the Week 8/26 ⚾ Yankees (82-47) @ Orioles (37-93) 8:05 PM","Jed \"JEDI\" Lowrie demolishes a HR in the 7th as the A's hit back-to-back HR's and expand their lead 6-2","Tyler Austin Hit's His Second Home Run Of The Game. He Now Has 6 Home Runs In 12 Games With The Twins","[Nicholson-Smith] Josh Donaldson asked #BlueJays staff to pack his locker so he has his things. \"I want to play soon and wanted to make sure I have everything I need to do that,\" Donaldson said via team spokesman","What Does Japan Know About Women's Baseball That The U.S. Doesn't?","Who would you rather have as an ace on your team while in their prime, Pedro Martinez or Randy Johnson?","Diamondback's Brad Boxberger Emoji jersey.","Tyler Austin crushes one to the catch area for a solo homer","Billy Hamilton slips in center-field, leading to a J-Hey RBI triple","PSA: Today's MLB.TV Free Game of The Day Is: Every Game!","Who in your opinion is the current best player no one has ever heard of?","Matt Chapman demolishes a HR to Left Field in the top of the 1st to put the A's up 1-0","[Buffery] Tulowitzki acknowledged that he's done for the year but expects to be healthy for spring training","Nightly Pick 'em Game for August 27th","The Dodgers have batted around in the bottom of the 5th","[Cubs] Could Anthony Rizzo hit Anthony Rizzo?","Game Thread: Hawaii vs South Korea | Little League World Series Championship | 3:00PM ET","Brandon Crawford diving play (Rangers @ Giants)","[Slusser] A's put Manaea on the 10-day DL.","What is a good way to learn how to keep score?","[Fletcher] Angels’ injury bug strikes again. First round pick Jordyn Adams is out with a broken jaw. It’s wired shut.","[Post Series Thread] Brewers take 2 out of 3 from the Pirates at Miller Park","[Post-Series Thread] The Royals take two out of three from the Indians in Kansas City","[Cut4] @MLBReplays is excited to announce their newest hire, Yolmer Sanchez","Tulowitzki: If someone's better, I'll go home","[GIF] Edwin Diaz hands the game ball to Scott Servais after his 50th save. Servais now has to get a haircut of Eddy's choosing since he reached 50!","Rhys Hoskins and Carlos Santana go back to back to put the Phils up 2-0 (Santana in Comments)","[Padres] It was nice of @La_Mole_13 to provide power to Dodger Stadium today. #PlayersWeekend","What is one thing you like about the teams you hate the most?","Matt Holliday hits a go-ahead pinch hit home run to break the scoreless tie!","[mlb gameday] 2 innings after ending a 32-inning scoreless drought, the Nats send 11 men to the plate against them Mets, adding 8 runs","Ohtani hits HR #14 vs Verlander","Who is the next great play by play announcer?","MLB on pace for fewer than 20 qualified .300 hitters this season.","The Washington Nationals have been shut out 3 games in a row.","[Postgame Thread] Edwin Diaz defeats Scott Servais's hair with his 50th save of the year","With tonight's win the Yankees will finish their 26th consecutive season in a row with a record above .500.","In the first pitch since the Power Outage, Justin Turner walks off the Padres in the 12th!","Ohtani shows Altuve good sportsmanship after being beaned by Osuna","[Rockies] Haters gon say it's fake 😏","Maikel Franco launches a ball into the Estratosphere for a 2-run homer to put the Phillies up 5-0 over the Jays","Why doesn't MLB a flexible scheduling system for Sunday Night Baseball like the NFL does with SNF?","In your opinion, what’s the most emotional or chilling thing to happen in a major league game?","Can any of you think of any player nickname improvements?","TIL that Cleveland Indians pitcher Ray Caldwell was struck by lightning while pitching in 1919, but regained consciousness to record the last out of his complete game","Rockies send 14 to the plate, score 8 runs","Down to their last out Kyle Seager slaps a Two Run double to tie the game in the 9th!","Denard Span splashes a Solo Home Run into the Arizona pool to give the Mariners a lead in the 10th!","Nolan Arenado barehands a ball as it goes foul and throws out Yadi, just because.","The Rockies have caught the Diamondbacks and will finish the day tied for first place in the NL West","Ji-Man Choi hits the first triple of his major league career, proceeds to show off his dance moves","Austin Hedges ties the game with a bomb off Jansen in the 9th","[Sharp]Dellin Betances has 33 straight relief appearances with at least one strikeout, the longest such streak in AL history.","[General Discussion] Around the Horn - 8/26/18","The Kansas City Royals are the 29th team to reach 40 wins","What teams won't have their current managers at the start of next season?","Rockies hand the Cardinals their first multi-run loss since July...when they lost to the Rockies","Someone threw back an apple at the Reds/Cubs game instead of Preston Tucker’s Homerun ball","I work for the Cubs - Thought you might appreciate a different perspective!","Nine fans all reach for a foul ball at the A’s/Twins game, no one gets it","Cedric Mullins robs Stanton of career Home Run #300.","With His Passing Today, Here's McCain's Narrative With Obama On Baseball Before The 2008 World Series.","The Dodgers have scored the most runs in the NL and allowed the fewest yet currently sit 3.5 games out of playoff spot","Dansby Swanson makes a miraculous play in deep short with Derek Jeter in attendance","Tommy Pham hits a Phamtastic blast for his first HR in a Rays uniform","Hunter Renfroe hits a line drive off of teammate Wil Meyers to end the inning.","Kendrys Morales hits a HR for the 6th consecutive game, trying the Blue Jays franchise record.","Mike Fiers since being traded to Oakland - 4GS, 24IP, 4R, 14H, 28K, 3BB","What are some of the best nicknames people had from players weekend?","Max Muncy DOMINATES a ball for his 30th HR of the season on his 28th birthday","Oh look, it happened again - Daniel Murphy hits a 2 run HR to the centre bleachers of Wrigley.","[Mayer] Zack Wheeler in the month of August: 33 IP, 23 H, 4 ER, 8 BB, 34 K, 1.09 ERA","Yolmer Sanchez wants to be a replay official when he retires from baseball.","[Rose] John Gibbons expects Blue Jays Troy Tulowitzki to be done for the year","If the season ended today, how would this scenario play out?","Miguel Andujar launches a go-ahead 3 run shot, his 21st HR of the season.","Some (probably) odd questions from an Englishman who just got in to Baseball.","[Braziller] At a time when #mets should be prioritizing young players, they continue to give as many at bats as possible to veterans with no future in organization. It just doesn’t make sense.","Miguel Sano sends a ball into orbit for a solo homer","Will Smith's reaction to getting pulled in the ninth","Not bad for $6. Northeast Delta Dental Stadium Manchester, NH","Nolan Arenado is on a Hall of Fame trajectory and no one is talking about it!","Simmons makes a spectacular spinning throw","4 teams in the NL have at least 72 wins. 3 of those 4 teams are in the NL Central.","[Little League] South Korea advances to LLWS championship on stellar double play","[Gurnick] Roberts says Urias will be a September call up","JD Martinez has overtaken Mookie Betts in the batting race (.338 vs .335 after tonight’s game) one day after Khris Davis overtakes him in homers (39 vs. 38).","Which team do you like the most from each division?","Simba plates Trout on a triple to dleep left","This Day in History: August 26, 1939: First televised Major League baseball game","Which team do you hate the most from each division?","Lucas Giolito goes 7: 3H 1ER 1BB 6SOs 72GSC","Kendrys Morales before his pitching debut on May 20th: .163/.248/.279, 3 HR. Since then: .303/.379/.550, 16 HR","Mitch Haniger crushes a 441 ft leadoff home run to give the Mariners an early lead.","'El Mago' belts an opposite-field home run, 28th on the year","[Flanagan] Matias out for year after cutting thumb while loading luggage","Aledmys Diaz hits a bases clearing double in the 8th to give the Blue Jays the lead","[Phillips] My sources indicate that Josh Donaldson is likely to start a rehab assignment in Dunedin on Monday which explains the empty locker in Toronto. GM Ross Atkins has said previously he didn’t expect Donaldson to need a lengthy rehab assignment.","Last night, Chris Davis recorded his first 3-hit ballgame since August 14th -- of 2017.","[Brett Phillips] Everyone talking customs this #PlayersWeeekend Well here’s a peek of the customs I made myself. Just a few of my favorite things around the clubhouse. #Crafty","Didi Gregorius paints his own custom cleats for players' weekend. Here's what he made this time around.","Could a pitching staff built around guys who throw 88-mph balls succeed in today's MLB?","Following today's loss to the Blue Jays, the Phillies have won only 1 of their last 9 series","Yelich hits an opposite-field solo shot, his 5th HR in the past 7 games.","Charity helping Baseball grow in Kenya is a hit.","[Guardado] Mike Trout is wearing a jersey with \"A. Cox\" on the back for Players Weekend to honor his late brother-in-law, Aaron Cox.","Brian Anderson blasts a pinch hit home run","For anyone that has the time, here is the entire bottom of the 15th of yesterday’s Brewers vs. Pirates game","Potomac Nationals' Matthew Crownover just completed a no-hitter against the Lynchburg Hillcats","With the Home Stretch now upon us, what level of confidence do you have in your team's chances to win the World Series?","Dad stops a loose bat from slamming into his son’s face.","A young Blue Jays fan was so happy to catch a homer that he was nearly in tears","Why are alot of the jerseys btwn teams the exact same during players weekend? Eg dodgers, royals, cubs, bluejays or padres, pirates etc","[Hernandez] I don't have SportsNet LA, but my At Bat app captured all of the excitement of the walk-off victory. #Dodgers⁠ ⁠","[Mitchell] It’s pretty amazing how Morales has turned his season around. On June 5, he was slashing .188/.260/.312 with 4 homers. Now, that’s up to .262/.340/.477 with 20 homers and he’s putting together one of the most productive seasons on the roster. #BlueJays⁠ ⁠","After going into the bottom of the 15th inning down two runs the Brewers walk-off the Pirates after being down to their last strike.","Introducing a New Stat - $/Pit","On Asian pitchers, and their injury histories.","If one runner is thrown out on a double steal, to end the inning, does the other runner get a stolen base?","Ichiro makes a catch, cuts down Wong at home","You guys think there'll be docu series about MLB teams in style of All or Nothing / Hard Knocks?","[SB Nation] The World Cup made me miss The World Baseball Classic","Historical perspective on the long-term (lack of) success of the Reds?","Nightly Pick 'em Game for August 26th","Kevan Smith hits his first home run of the year!","Adam Jones is wearing your grandpa's Nike Monarch cleats this weekend","Baseball Statisticians Unveil New Analytics Model Measuring Precise Amount Of Joy They Suck From The Game","Jose Altuve takes advantage of David Fletcher not running out an infield flare to turn a heads-up double play","I found an old birds-eye view of the Polo Grounds and Yankee Stadium and juxtaposed a current view.","TIL that 3 of the best 4 regular season winning pcts of all time didn't even win the World Series. 2 of em didn't even win a WS game.","Johan Camargo pretends to be scared of an upset Ender Inciarte.","Edwin Diaz has set the Mariners single season Save Record at 49!","Justin Verlander getting trolled at a Beverly Hills hotel","[Rockies] So, Matt Holliday gets to the park yesterday and he did not have black cleats. His gear order was due to arrive today. No one had size 14s he could wear for the day. As it turns out, there was an old pair of Matt's 2007 spikes in the Rockies archives","Mike Trout hits a triple in his first AB following a DL stint and the passing of his brother-in-law","On Players’ Weekend, Royals’ Drew Butera honors kids from local hospital","Matt Holiday gets his first hit in a Rockies uniform since 2008, in front of both Rockies and Cardinals fans","The fountains in Kauffman stadium have started flooding the field. The game is currently in delay.","When was the last time a left-handed fielder played 3b, ss, or 2b? Also I might just be dumb but is a catcher who catches lefty not rare as well?","Joe Mauer is now second on the Minnesota Twins' all-time hit leaderboard with 2,086!","Miles \"Lizard King\" Mikolas hits his 2nd home run of the year to put the Cardinals up 4-0","David Bote Walks off the Reds","Strained Colon Going to DL","Which MLB all-star looks the least like a baseball player/professional athlete?","Win probability of Brewers vs. Pirates (FanGraphs)","Dick Mountain vs. The Dads: 6.0 IP 2 H 0 ER 1 BB 8 K on 89 Pitches","[Sherman] Relievers can blame themselves if free-agent paydays dry up","How Climate Change Will Affect The Future of Baseball","[General Discussion] Around the Horn - 8/25/18","Mike Trout in his return from the DL - A triple a single and a walk","Cardinals turn a routine 7-3-5-2 double play to get David \"Baby\" Dahl out at home","[The Athletic] Buster Posey schedules season-ending hip surgery, hopes to be ready by Opening Day next years","Luke Voit has hit 2 home runs tonight in Baltimore","The A’s have bunted for a hit for the first time all season","The New York Yankees have become the second team to reach 80 wins","MLB Network Presents documentaries","Help with Jersey Size","After Being Saved By A Joe Panik Error, Rougned Odor Hits A Game-Tying 2-Out 2-Run Homer Into The Waters!","Max Muncy DESTROYS a ball to put the Dodgers up 11-0!","In trades Involving a \"player to be named later,\" does that part of the deal ever get traded somewhere else before they work out which player that will be? Alternatively, do the teams involved ever make a second trade later and decide to cancel that part of the deal as part of a different deal?","Dansby Culberson and Charlie Swanson warming up 💪","With his walk in the 6th inning against the Astros tonight, Mike Trout is the first player to reach 100 BB this season.","Matt Chapman demolishes a ball into the second deck","Any player in live ball era that had a high BB% and a very low K%?","Chris Davis homers off Zach Britton and Britton's double agent status is blown","Hunter Dozier goes back to back with Ryan O'Hearn off of Cody Allen to walk off the Indians","How to get a bat at a major league ballpark?","Daniel Murphy hits his first HR for the Cubs - a solo go-ahead shot to right in the 8th","Marwin Gonzalez hits a 2 out grand slam to give the Astros a 5-0 lead!","Yelich murders a poor ball just trying to do its job to put the Brewers up by 2 in the first..","[RaysBaseball] Moment of Silence for this fellow man.","Dee Gordon scores from second on a delayed steal to put the Mariners on top in the 1st.","Which team has the best Player's Weekend uniforms?","Astros TV crew and Astros Radio crew have a little fun at the end of tonight's game","[PawSox] Brandon Phillips with the 80-grade bat flip","[SFGiants] McCutchen getting warmed up for his lead-off HR","Rays OF Mallex Smith hospitalized due to viral infection","Video of the whole 15th inning of the pirates brewers game?","Aaron Nola now has 8.9 bWAR this season. He’s now accumulated more bWAR in a season than Cliff Lee, Roy Halladay, Curt Schilling, or Cole Hamels ever had in a single season in a Phillies uniform.","TIL The 1990 Mets led the league in run differential and failed to make the playoffs","Kendrys Morales homers for a franchise-record tying FIFTH straight game","What is the record for most consecutive scoreless innings for a team in a game where that team still won?","[MLB.COM] Trout expected to return to lineup tonight","Race to the Bottom: The Orioles and Royals have been separated by fewer than 2 games since July 27, and 3 games or fewer since June 6.","TIL Sammy Sosa hit his first career home run off Roger Clemens over the Green Monster","The A’s Changed Baseball Once. They May Be Changing It Again.","Joe Mauer HoF or HoVG?","[Cubs Twitter] Could Javy tag Javy?","Moose homers off Moose","Guesses for AL rookie of the year?","Javy Baez attempts to steal third with 2 outs, down by 1 run. Out by a mile.","The Rays have an active payroll of $23,000,000. The Dodgers have an active payroll of $147,000,000. They share the same record of 67-61.","Alec Mills in his first Cubs start: 5.2 IP, 3H, 1R/ER, 1BB, 8K","Worst/Best players weekend names?","Jay Bruce hits a 2-run homer in his return from the DL","What do you think is the most unbreakable Major League Record...that never gets mentioned.","Yonder Alonso hits a towering 2 Run HR, his second of the night, to put the Indians ahead of the Royals 4-3","What is your opinion on players weekend?","The Dodgers have been the anti-Mariners","Bryzzo Souvenir Co. shows off their custom bats for Players' Weekend [Bryant]","What is Minnesota's plan with Byron Buxton?","Where do you think the Nats would be with Dusty as the skipper this year?","Baez hammers one 481 feet out of Wrigley","Cole Hamels 2018 splits: 6.41 ERA in Globe Life Park in Arlington, 2.12 ERA everywhere else","Nick Martini makes a great diving grab","OFFICIAL FRIDAY COMPLIMENT THREAD","If, \"Homer at the bat\", came out today, what would be your line up?","Eugenio \"Nicole\" Suárez ties the game with a solo blast in the 9th.","The other side of call ups: Today I saw Garrett Hampson, who had just been sent to AAA to make room for Matt Holliday, carrying all of his stuff to an Uber.","[Blue Jays PR] Lourdes Gurriel Jr. has been activated from the DL. He currently has an 11-game multi hit streak as a rookie","Max Scherzer has gone at least 6.0 IP in his last 25 starts","What kind of belts do players wear?","Has a team ever gone a full season without being swept in a series?","Nightly Pick 'em Game for August 25th","Mason \"Mase\" Williams just barely misses a homerun as it ricochets off the Wrigley railing","Posted this in Chicubs but... Verlander for the 2017 Astros: 5 G 34.0 IP 1.06 ERA 2.69 FIP Hamels for the 2018 Cubs: 5 G 34.0 IP 0.79 ERA 2.63 FIP","Is there a website that lists a certain players entire injury history?","Acuña Gets HBP by Guerra, Gets Pissed","Brian Sabean explains why Giants can't add power hitters in free agency","What is the longest an all around no hitter/perfect game has been preserved?","Cole Hamels tonight vs. the Reds: 9.0 IP 8 H 7 K 2 BB 1 ER 114 Pitches","(Serious) During the season, how often do you wash your jersey/shirt/apparel? What are your superstitions?","On what percentage of plays, roughly, does an error occur?","[Orioles] #PlayersWeekend @SimplyAJ10 pays tribute to Tony Gwynn #StayHungry #Birdland","The Kansas City Royals have been eliminated from playoff contention.","[Fegan] Cease shut down for the rest of year. Not injured.","What do you think are some lessons MLB can learn from other baseball leagues?","The Decline of Complete Games","Ronald Acuña Jr. hits his 21st home run of the year","Hoffman and Rivera Awards","Chicago Dog's manager gets ejected and hits a home run with this tirade.","At what age did/should your son commit to a college baseball program?","Acuña has officially left his “mark” in Marlins Park. This is where his 432-foot HR hit. #Braves [Wingert]","[Jim Allen] RHP Shumpei Yoshikawa (23) expected to go high in NPB draft in October, has signed a minor league deal with the Arizona Diamondbacks. Yoshikawa is the 2nd Japanese marquee amateur to skip NPB and sign overseas.","Ball that clearly hits the chalk is ruled foul after replay. MLB Replay is an absolute embarrassment.","[FanGraphs] What Buster Posey’s Hip Surgery Could Mean for His Future","The Red Sox are the first team to 90 wins in 2018. No other club has 80.","Scooter Gennett's Awesome Dale Earnhardt Cleats for Players Weekend","[Crowley] Madison Bumgarner's last three hits have come against Jacob deGrom, Clayton Kershaw and Zack Greinke.","Khris Davis crushes his major league leading 39th donger of the year","Major League Baseball’s Improving Demographics (from May)","104 year old grandpa threw out the first pitch today at the Detroit Tigers game.","Question about the Player Weekend bats?","Data to support/refute three true outcome mentality?","How the Tampa Bay Rays can make the 2018 playoffs.","Brian Anderson gets hit by Newcomb, warnings issued.","Ian Desmond belts a 2-run walk-off HR to win the series against the Padres!","The Rays walk off and eliminate the Royals on an error by Ryan O'Hearn.","TIL on July 25th, 1956, Roberto Clemente hit the only walk-off, inside-the-park grand slam in baseball history giving the Pirates a 9-8 victory over the Cubs.","Matt Holliday is in the starting lineup for the Rockies today and fans in Colorado can't watch it.","[General Discussion] Around the Horn - 8/24/18","Kanaashi Nogyo receives heroes welcome at home after finishing second in the Summer Koshien tournament, they are the first highschool team from Akita Prefecture to reach the finals since 1915.","Javy Baez makes a terrific leaping grab on a soft liner to short","[Rays] Insane breaking stuff from Chaz Roe...","What's up with the sleeves today?","Aaron Nola blows a 95 mph fastball by Bryce Harper with 2 men on, 2 out in the 8th to finish his outing and pick up his 9th K","Aaron Nola vs Nationals : 8 IP, 0 R, 9 K, 1 BB, W","David Price pitching line tonight: 8.0 IP, 3 H, 0 R/ER, 0 BB, 1 HBP, 7 K, 101 pitches.","[Carrabis] David Price has the lowest ERA in the American League since the All Star break (1.09), which is second lowest in the majors.","This Oregon corn maze is hyped for the big leagues","Culberson's 2-run blast","David Price since moving to the first-base side of the rubber: 8 GS, 5 W, 52.2 IP, 42 H, 12 R/ER, 8 BB, 51 K, 4 HR, 2.05 ERA. His ERA prior to that was 4.28.","[Post-Series Thread] Rays sweep Royals at the Trop in four-game series","Ryan Zimmerman Is Precisely As Good As Babe Ruth*","Nightly Pick 'em Game for August 23rd","Cole Hamels faced four batters in the second inning, on four pitches.","Who are your Top 25 favorite MLB players of all time?","The US Women's Team has scored 10 runs on the Netherlands so far. They only have 4 hits.","Madison Bumgarner vs Mets: 8.0 IP, 5 H, 1 ER, 0 BB, 8 K","[McCalvy] Brewers option former closer Corey Knebel to AAA","Max Kepler clobbers a solo homer off of Blake Treinen","[Saunders] #Rockies reunion with Matt Holliday is imminent. He will be called up from Triple-A today and could be at Coors Field for game vs. #Padres","Only 3 players have ever had a .300/.500/.700 line over a full season","[Lyons] Rajai Davis has his hemorrhoids outed on live TV","I'm not quite sure people understand how insane the end of the season could end up being","The Latest Threat to Pitchers’ Arms Could Be Fortnite","[Mikaotx] Translation of Yu Darvish's 8/22/18 blog post regarding his injury this year and the pain he felt throughout.","Giants’ Brian Sabean: ‘Total rebuild’ unlikely despite disappointing season","Quite the pitchers duel right now if you can catch it: Scherzer v Nola.","Odubel Herrera blasts a 2-run homer upper tank off Max Scherzer to give the Phillies a 2-0 lead in the 7th.","[Post-Series Thread] Indians and Red Sox split a four-game series in Boston","Blake Swihart makes a slick bare-handed play at first base to get the out on a tough throw from David Price","What would you rather watch? A slugfest, or a pitchers duel?","[FanGraphs] What the A’s Have Done With Mike Fiers","Kolten Wong: If I don't win the Gold Glove, there is something wrong","Albert Pujols scored 100+ runs in 10 of his 11 seasons with the Cardinals; he has never scored more than 90 in his 7 seasons with the Angels.","Paul DeJong hits a go ahead 2 run homer in the 9th off of Jansen to put the Cardinals up 3-1","Kieboom unleashes a perfect throw to gun down Hernandez at 2nd","[Post Series Thread] Cardinals sweep the Dodgers in a 3 game series in Los Angeles","Oakland A’s hire design-forward architect to oversee new ballpark","Jack Flaherty stats for the month of August: 4 starts, 3-0, 25 IP, 10 H, 3 ER, 9 BB, 33 K, 1.08 ERA, 0.76 WHIP, .125 BAA","Thoughts on Statcast?","Team USA Opens World Cup with Dominant 14-0 Win","[Henning] Believe the Tigers were about to get big bites on Shane Greene -- until a non-contender blocked him on the waiver wire. That's legal, but front offices don't forget the obstruction. Among non-contenders, it's viewed as a low blow.","Some absolute savagery from Yahoo Sports in re: the Mets (final sentence of article)","I'm Ready | By Eloy Jiménez","Since he was acquired at the trade deadline, Gausman has pitched 27 innings, posted 2.00 ERA, a 3.16 FIP, and a .239 OBA against.","[Daren Willman] Animating every MLB team's 2019 schedule...","Jack Flaherty has the 4th best strikeout rate in history for a starting pitcher aged 22 or younger","[Shapiro] Matt Holliday shares his thoughts on touching home plate in 2007","Ronald Acuña Jr. Lead-off HR. #20 of the year. Let's having some fun!!!","It’s been six years since a player joined the 30/30 Club. Jose Ramirez is about to end that streak","[Serious] Division Discussion Thread - The Centrals","Who are considered to be the best pitchers in the MLB at the moment?","Has there ever been a pitcher in baseball who after more than 25 starts had an ERA of under 2.0 and had a losing record?","Game Thread: Little League World Series, New York @ Georgia - 7PM ET","TIL the last pitcher to lose 20 games, Mike Maroth in 2003, put up a positive war for the season","Twins catcher Mitch Garver suffers from extreme, sudden bout of narcolepsy while participating in a bases loaded rundown, EVERYONE IS SAFE.","How the Tampa Bay Rays Reinvented the Concept of Starting Pitching","[Keri] Happy Youppi! Getting Ejected Day! Please enjoy this rundown of the dumbest game in MLB history!","Feeling washed-up? Site shows who was the first player to debut who was younger than you, and the last active player who was older than you","Jordan Hicks strikes out the side (looking) to earn the save against the Dodgers","[Daren Willman] Flowing out all of Max Scherzer's pitches this season by plate appearance, count, result of that PA, and colored by pitch type. Circles and count connections grow by raw pitch counts throughout the season. [Tyler Chatwood animation for comparison inside]","Ryan Zimmerman hits his 11th career walk-off home run with the help of replay","Angels Play by Play announcer Victor Rojas: \"But it was a very good song\"","The New York Mets (56-70) have a better run differential than the Seattle Mariners (72-56).","The Atlanta Braves have swept the Pittsburgh Pirates over a 3 game series.","Here's how to solve any NL Wild Card chaos","Notable international FAs who probably would've gone #1 in that years MLB Draft?","[ESPN] Acuña Jr. (20 HR) &amp; Albies (21 HR) are the 1st pair of teammates in MLB history under 22 with at least 20 HR in a season","Hiroshima Toyo Carp rallied for 4 runs in the 9th, Seiya Suzuki walks em off via batflip homerun.","Amphibious pitcher Pat Venditte (LAD) back to the majors","In 2013, Starling Marte was walked unintentionally 23 times and hit by a pitch 24 times, in 510 PAs. Mark Lemke had 3664 PAs and was never hit by a pitch.","Dodgers Bullpen since Aug 7: 2-8, 1/7 in save chances, 5.08 ERA, 1.20 WHIP","TIL the Dbacks have 7 players with initials of the same letters","Tyler White and the Houston Astros with the best HR celebration I've seen all year.","[Jackson-Evans] Most pickoff attempts by MLB catchers in 2018","[Willman] Breaking down every teams @mlb wins by game number this year. Cool seeing all the different division races going on.","STL rookie Dakota Hudson has played in 11 games in his career. Cards have won all 11","Paul Goldschmidt hits his 96th career home run at Chase Field, passing Luis Gonzalez to become the all-time leader in that category at Chase Field/Bank One Ballpark","Walker Buehler vs Jack Flaherty Vol. 1","Pujols falls down, can't get up, but can still make a fantastic play at 1B","What is your favorite pitch in baseball?","Kevin Gausman has an ERA of 2.00 with the Atlanta Braves over his last 4 starts.","Venters Records His First Save as a Brave Since 2011 After a Close Call w/Polanco","Bumgarner: deGrom deserving of Cy Young","Little League World Series spot an honor for umpires, too","Seattle FD Tugboat as the Mariners Bullpen Cart (1982)","Clay Buchholz pitching line: 7 IP, 4 HITS, 0 R, 0 BB, 7 K.","Fake pick-off attempt works in American Legion Championship game last night","Bryce “210” Harper is now hitting 250 for the first time since May 5th","[General Discussion] Around the Horn - 8/23/18","Cubs legend David Bote hits a 2 run HR giving the Cubs more than 1 run in a game since last Wednesday","[Hoch] “It’s frustrating. It sucks to suck.” - Greg Bird","The Battle Between Payroll and Parity","Jose Ureña drops his appeal. Will miss the upcoming series against the Braves during his suspension.","I see so many reports , articles , opinions about the games best player Trout or Betts . Why doesn’t JRAM ever get mentioned as the best ? Everyone says he’s great but frankly I think he’s is almost nationally underrated by how little we applaud his skill .","[Braves] Hilariously introduce the 2019 schedule is here","[Svrluga] Stephen Strasburg's velocity has fallen off precipitously, and he is now shaking his right arm after each pitch.","Xander Bogaerts hits one completely out of Fenway to tie the game at 2 in the 4th","When baseball lets you down: After several players’ offensive tweets surfaced, fans from historically marginalized backgrounds are left wondering about their place in the game","Walker Buehler vs. St. Louis Cardinals: 7.0 IP 0 ER 3 H 2 BB 9 K on 104/71 pitches","Who do you think is the best current broadcaster in baseball?","Who do you predict will win each playoff series and WC game?","David Peralta hammers a 111 MPH home run to right center","Is Fernando Rodney a HOFer?","[Bastian] Francona: OF Leonys Martin will not play baseball again this season. No setbacks. He’s recovering well, but doctors want him to focus on a return to full health rather than returning to Indians.","[Post-Series Thread] Diamondbacks sweep the Angels in a two game series.","Daniel Murphy in his Cubs debut - 2 for 5, 1 RBI, 1 Run","[StatsBySTATS] The @Pirates over their last 7 games: 1.0 runs scored per game &amp; 1.9 runs allowed per game. They are the fourth team in live-ball era to average 1.0 or fewer RPG and allow 2.0 or fewer RPG in any 7-game span along with the 1938 Phillies, 1968 Cubs &amp; 1992 Cardinals.","Good weekly MLB podcast (iOS)","[Sam Miller] The 20 rules for creating an MLB nickname (and what yours would be)","Do people in the bay area root for the A's and Giants or do they only choose one team?","Coach Rhome (Romeo) Calhoun amazing trick shot LIVE at Trenton Thunder baseball game.","Julio Teheran tonight: 7 IP, 2 H, 1 R, 5 K, and 1 BB","Edwin Encarnacion in his first AB since coming off the DL, smashes a pitch over the Monstah to put the Indians up 2-0 in the 1st.","Jesus Aguilar has a belt malfunction","Commentators Comment on Wailing Banshee during ATL-PIT","[Jeff Sullivan] It’s Not Entirely Clear What the Rockies Are Doing","Xander Bogaerts goes to the opposite field for his second solo home run of the game!","[Olney] Sources: Giants would like to find a deal to move Andrew McCutchen before the Aug. 31 deadline.","Edwin Encarnacion's second 2-run homer of the night is a towering fly ball over the Green Monster in Fenway","Orioles rookie CF Cedric Mullins recorded a HR yesterday in the box scores for both the Orioles and the AAA Norfolk Tides.","With the return of legendary amphibious pitcher, Pat Venditte, here is MLB's all-time amphibious team","Buck Showalter now has a .500 career record with the Orioles","Sneak peek at 2019 Cards schedule: Pujols will play at Busch on June 21-23","The Cardinals are 24-12 since firing Mike Matheny, and are 17-5 in August.","Jackie Bradley Jr. makes a great throw to second to Nab Gomes trying to stretch a single into a double.","[Post-Series Thread] The Houston Astros (77-50) take 2 out of 3 against the Seattle Mariners (72-56) at Safeco Field.","Kolten Wong makes a diving stop on the SS side and throws out the runner","[Wagner] Rockies-DBacks, Reds- Cards and Angels-Astros will each play a series in Monterrey, Mexico in 2019","[Dodgers] had Utley's sons say \"It's Time For Dodgers Baseball\" including Kiké Hernandez","Miguel Rojas hits a clutch 3 run homer to put the Marlins ahead of the Yankees!","Two future aces dealing in Cardinals vs. Dodgers. Tune in!","Rosell Herrerra with a game-ending TOOTBLAN at home","(Lin) In San Antonio tonight, Andres Muñoz, 19, struck out the side on 11 pitches. He did not throw a fastball below 100 mph. Here is his final pitch, clocked at 103:","[Pavlovic] Andrew McCutchen, who leads the Giants in games played, is not in the lineup. I guess we're on Hug Watch.","Thomas Pannone in his first career MLB start for the Blue Jays: 7.0 IP 1H 0ER 2BB 3K","The Astros have batted around in the 4th vs the Mariners, while connecting on 6 consecutive hits before recording an out.","The Twins and White Sox are Allegedly Playing Baseball","Maikel Franco does his best to block Wilmer Difo's view in a tag-up situation","Cano makes a slick backhanded stop in his first career start at third.","Found this in my moms basement is it game used?","[Post Series Thread] The Marlins and Yankees split a 2-game series","Glayber Torres Flashing the Leather and his Cannon from the Left Field Grass","Independent League Manager Butch Hobson simulates a home run swing and trot around the bases after ejection","The Blue Jays have the longest winning streak against a single team this season: 10 and counting against Baltimore.","Baseball Ask Ouija Thread","The MLBs YouTube channel has an entire playlist devoted to weird baseball","What are some cool baseball stories/moments that you want to see made into a 30 for 30?","If a team underperforms their Pythagorean W/L, is it usually because of the bullpen blowing games?","Who is the lowest Career WAR player with the highest single season WAR?","Salute To Wrestling Night here for the Red Wings (MIN AAA). Walk up tunes and player photos have been replaced with wrestler themes and wrestler photos respectively","Cubs make room for Murphy, put Russell on DL","White Sox escape a wild rundown","Is 'winning percentage' the same thing as 'win per game'?","Post 2 on Kevin Gausman's Success in Atlanta","How can you not be romantic about baseball?","The 2019 schedule is out. Here are the highlights","[Christopher Kamka] Starters with the most starts of 5+ innings and 0 or 1 runs: 2016-Present","Khris Davis' home run spray chart with Oakland.","[Post Series Thread] The Athletics take two of three from the Rangers in Oakland.","Solarte and Cashner have an entire conversation in mime - anyone's guess what they're saying","In honor of Matt Adams returning to the Cardinals...","Pat Burrell breaking the all-time home run record is apparently a major part of one of the MEG book sequels?","Who are your Gold Glove picks for this season?","Aroldis Chapman placed on DL with knee tendinitis","Mitch Haniger makes an incredible diving catch to take a hit away from Reddick.","Please educate a newbie - If you live in Chicago, what determines whether you’re a Cubs or a White Sox fan? Is it usually a family thing, a neighborhood thing, or something else? Same for New York and Mets vs Yankees.","Anthony Rizzo introduces new yoga pose, Downward-facing Dong","The Cardinals have won 8 consecutive series","What are some stories about Latin players adjusting to life in America?","As per tonight’s broadcast, the last player for the Red Sox to lead the league in batting average was Wade Boggs in 1988","[Post Series Thread] Brewers take 2 out of 3 vs. the Reds at Miller Park","[Phillies] Phillies Acquire LHP Luis Avilan from Chicago White Sox for MiLB RHP Felix Paulino","Team USA women’s baseball players describe why America won’t let girls play","Khris \"The Real MVP\" Davis demolishes his 38th HR and 101 RBI as the A's extend their lead. 9 HR for Davis against Texas this season!","[Simon]Since July 30, the fearsome foursome of Edwin Jackson, Trevor Cahill, Mike Fiers and Brett Anderson has made 15 starts for the A's. The result? 93 IP, 1.26 ERA.","Nation Would Be Totally Fine Just Doing World Series Now","24 year old european pitcher","Francisco Arcia violently doinks Steven Souza Jr.","What is the greatest example of a player getting revenge after getting beaned or something else dirty?","Giancarlo Stanton receives ovation in return to Miami","Will the Cincinnati Reds ever be America's baseball team again?","[GIF] Michael Kopech's first Major League Changeup. 91 MPH. Absolutely filthy.","Ozzie Albies and Dansby Swanson collide at second; Albies cracks up","Can someone make some sort of team chaos tracker to see how close we are to X NL teams tying?","Chris Iannetta launches a ball deep into the night in the bottom of the 9th!","[Murray] #Cubs acquiring Daniel Murphy from the #Nationals, sources tell The Athletic.","Anyone ever play club baseball in college?","Minor league schedule","TIL the Mets chose Blue and Orange as their primary colors to honor the Brooklyn Dodgers and NY Giants","Has Anybody Stolen Home This Year?","Every Team's Path to World Series Champs in 5 Words","Japanese high school baseball team gets into final 4 on a walk off 2 run suicide squeeze","Ruben Rivera yankees signed baseball bat","Blue Jays RHP Sanchez comes clean on suitcase injury","The Women's Baseball (not softball) World Cup starts today at 10 AM Eastern Time!","Michael Kopech's first career strikeout","[OC] Dissecting Rafael Devers's 2018 Season","Big welcome back for Matt Adams in St. Louis. Never gets old seeing these guys get so hyped for a sport they dedicate their lives to","Greg Allen makes a phenomenal over-the-shoulder grab in Fenway’s triangle to rob Mitch Mooreland of extra bases","Giants’ Buster Posey likely to have season-ending hip surgery","Kevin Gausman tonight at Pittsburgh: W 8IP 4H 0R 2BB 5K; lowers his ERA to 3.99","[Sherman] Based on what has happened to the Nationals this season, Dusty Baker should be the 2018 NL Manager of the Year.","Michael Kopech’s Debut: 2 IP, 3 H, 0 BB, 4 K, 1 HBP","[General Discussion] Around the Horn - 8/22/18","[Jane Lee] A's shut out the Rangers again. They've won 42 of 56.","Reds bizarrely score 4 runs off the Brewers in the 4th without a ball leaving the infield","How good of a defender does a player need to be to offset bad offense in today’s game?","[Passan] Sources: Nationals are dealing Matt Adams to the Cardinals.","My chalk art tribute to Ken Griffey Jr.","Carlos Martinez takes a sharp comebacker to the ribs","Dansby Swanson hits his second 2-run homer of the night to give the Braves a 5-0 lead over the Pirates. This is his first career multi-homer game.","Big Al shows off how he hits dingers","Kyle Higashioka throws out Isaac Galloway at second to end the game in the 12th!","Melky Cabrera hits his 6th HR, his 3rd in 3 games, to put the Indians up 3-0 over the Red Sox","Ozzie Albies and Ronald Acuña keeping up with reddit.","Does the 1st or 3rd base umpires ever disagree with balls and strikes but don't say anything because there was no appeal?","Aroldis Chapman leaves game after 0.1 IP with apparent injury","Trevor Bauer, CIA Nanites, and Remedies for Misunderstood Satire","[St. Louis Cardinals] Such a nice swing! Marcell Ozuna collected his 16th HR and 69th RBI on this 🚀","[Carrie Muskat] #Cubs Darvish out for the year with stress reaction on elbow","Slightly Interesting: The Dodgers' Spanish announcer has been with the team since 1959","What are some of the best \"all's well that ends well\" seasons?","For the 5th straight game, the Chicago. Cubs have only scored 1 run off of a Solo Home Run. They’re 2-3 in that span","Yan Gomes golfs his 12th HR over the Green Monster to put the Indians up 6-3 in the top of the 8th","Arizona's Nick Ahmed makes an incredible throw to retire Eric Young Jr.","[McTaggart] Astros have grounded into a franchise-record six double plays.","Shit the Bedrosian with the super rare triple FARTSLAM walk off.","What would your nickname be for Players Weekend?","Brett Anderson's line tonight vs TEX: 7.0 IP, 1 hit allowed, 0 ER, 1 walk, 6 SOs","[Stats by Stats] Blake Snell of @RaysBaseball struck out 11 batters while giving up just one run against the Royals today. He is the second pitcher in the live-ball era (since 1920) with 160+ K and fewer than 35 runs allowed through 24 starts, joining Bob Gibson in 1968 (168 K, 31 R). #RaysUp","In their 126th game of the season, the Houston Astros starter is Brad Peacock, their 6th different starting pitcher of the season.","[Jon Heyman] sources: waivers have expired on Bryce harper. he is staying with nats.","Koshien baseball tournament runners-up 'Kana-no' remain hot topic across Japan","TIL in 1970, in addition to winning the Cy Young, Bob Gibson batted .303 with 2 home runs and 19 RBIs in 109 ABs. He also had an OPS+ of 100.","ExtraInningsUK is providing a rundown of Europeans playing baseball in American Education. 19 European countries are represented in the list so far with several posts left to go. Includes interesting prospects like Italian Matteo Bocchi at Univerity of Texas-Austin.","[RealKentMurphy] What coaches really tell pitchers during mound visits 😂😂","Public buses in Mexico have MLB logos adorning them. MLB is alive and well in CDMX","Redmond’s Emily Tsujikawa plays Baseball not softball, and she wants other girls to join her.","The Baltimore Orioles have clinched a losing record for the month of August","The Rays are the first team in the live-ball era to record consecutive shutouts with their starting pitcher going two innings or fewer in both games","Victor Martinez shows off the speed and bunts against the shift for a base hit.","The case for Nick Ahmed to win the NL Gold Glove","Khris Davis knocks in his 100th RBI of the season. This is 2nd in the league only to JD Martinez","Baseball fights are still stupid, awful, and extremely watchable","The Marlins pull a NOBLETIGER in the bottom of the 11th against AJ Cole","TIL the first known example of a picture of a person 'flipping the bird' was performed by baseball pitcher Charles 'Old Hoss' Radbourn, during the 1886 Boston Beaneaters' team photo","Scooter Gennett takes his former club deep to give the Reds the lead in the 9th","[Pitching Ninja] Overlay of Michael Kopech’s Fastball and Breaking Ball","In Only His 27th Major League Game, Jeff McNeil Has His 2nd 4-4 Game","If all MLB players suddenly became AAA caliber players, do you think the average fan would notice the difference?","The Rays Have Pitched 23 Consecutive Scoreless Innings","Matt Carpenter wants to bathe Matt Adams in salsa","Dansby Swanson is the first 8-hole hitter with two 2-run homers against the Pirates since Tom Prince on July 23,2000","[Carig] Chapman’s knee has flared up again.","Billy McKinney Hits his first HR in the Majors","Have the Dodgers been the 2nd biggest disappointment this season?","[MLBRosterMoves] @Astros activate 2B José Altuve from 10-day DL.","Who are everyone’s 2 favorite teams and when your 2 favorite teams play each other who do you root for?","Andrew Stevenson and Wilmer Difo go back to back to give the Nats the lead, Difo replaced Murphy in the lineup after he was traded and Stevenson was called up for Adams.","Nightly Pick 'em Game for August 22nd","Schoop's first HR for the Brewers is also his first career pinch-hit HR, bring the Crew within one.","(Fletcher) \"The Angels are placing Justin Upton on the DL with a left index finger laceration...Jabari Blash has been recalled.\"","[Merkin] Jose Abreu underwent successful outpatient surgery on lower abdomen/groin area at RUSH University Medical Center. He will be able to return to baseball activities in approximately two weeks.","[Berry] Steamer currently projects Vlad Jr. as the 18th best hitter in the Major Leagues","Matt Chapman is hitting better at the MLB level than he ever did in the minors. Someone explain","This locker tag has been passed down to me from my grandfather. It was from my great uncle, Charles Pfirman. He was an umpire for the yankees during Babe Ruth's fame. I've yet to prove this is actually one of his locker tags as google images do not correspond to this tag. Any ideas?","Ross Detweiler in his first major league appearance since 2016 6 IP 8 H 3 ER 2 BB 2 SO","Who do you think is AL manager of the year?","Stage is set for White Sox’ Michael Kopech","Are there any old school rules/baseball ideas that you wish would die off?","Chad Green escapes the 9th inning after putting men on 1st and 3rd with no outs","With Matt Carptenter having an mvp year. How often does it happen that an mvp candidate wasn't an All Star?","Is today's Astros mariners game the first game were both teams used modern openers?","Umps screw the Brewers for the second time in the inning by deflecting the ball from Shaw. Scores a run","NL West:Road Warriors","[Nightengale] The #Yankees place SS Didi Gregorius on the 10-day DL with left heel contusion and recall infielder Luke Voit","Cleveland Has Taken The Fly-Ball Revolution To The Next Level","[MLB Stat of the Day] \"Birthday boy J. D. Martinez has done serious damage this season.\" Here's an animation breaking down all his plate appearances this season. [h/t: Daren Willman]","Mitch Moreland with a great defensive play to rob the Indians of a run at home plate","With Anthony Rizzo’s solo home run, the Cubs last six runs scored going back to 8/15 have been solo home runs.","Giants take the lead in the 13th one of the most lolMets plays of the year","Rule gurus: Shouldn't this pick off have been a balk? He never stepped off the mound and his front leg moves before his back...","Nice article in Forbes about the Oakland A's success this season","Let’s Improve the Wild-Card Round","The Nats are a let down in this season that's long, at least Andrew Stevenson hit his first career dong","[Murray] #Nationals calling up OF Andrew Stevenson, sources tell The Athletic.","Johan Camargo stretches at 1B","/r/baseball Players of the Week - Week 20: Yankees' Ace J.A. Happ is liking his time in New York City, Mets' All-Star Jacob deGrom continues his dominance with a pair of wins (finally), and Future Hall of Famer Ronald Acuña Jr. takes the baseball world by storm with a historic week!","A letter to Nationals fans from Mark D. Lerner","In his 47th MLB PA Ryan O'Hearn goes oppo off Snell for his 5th homerun","What Players on Your Team Don't Have Their Number Retired But Deserve It? (And Who Does Have One Retired That Shouldn't?)","Anybody know how teams know when another team has passed on a player in waivers?","Verlander and the 200 Win Club","[McTaggart] Jose Altuve kept the ball from his first Triple-A hit, which he got Sunday in Tacoma. When he was called up to start his career, he was in Double-A.","Matt Carpenter hits his 34th homer of the year and goes back to back with Jedd Gyorko off of Jansen","Robinson Cano hits a clutch three run bomb to right center to put the Mariners on top in the 8th.","Babe Ruth touching home at the Polo Grounds, 1920. My Colorization.","Austin Dean ties the game with his first home run at Marlins Park.","[Daren Willman] Here's another fun animation breaking down all of Barry Bonds' plate appearances in the 2001 season.","Looking for suggestions of baseball films I've missed.","[MarinersPR] Edwin Díaz equals the #Mariners single-season club record with his 48th save of the season, matching the record set by Fernando Rodney in 2014.","ELI5: How are parameters set to determine who a PTBNL is in a certain trade?","Hypothetical situation that I have a question about involving August waivers","Major League Baseball Team Rankings - Visual Rankings","[Barstool Carl] Yu Darvish is done for the season","Khris Davis demolishes his 37th homer of the season off of the suites at the Coliseum","[Sullivan] “Khris Davis has one HR for every 7.07 at-bats against the Rangers... 26 in 184.... that is the best ratio for ever one player against one team... minimum of 150 at-bats”","Barry Bonds HR stat","Smoltz Calls for Changes in Baseball in the Analytics Era","Can someone explain to me the thought process behind an opener, like the Rays are doing?","Jedd Gyorko's Pinch-Hit GW Homer off Jansen in the 9th","[MLBRandomStats] How many times each final score has happened in MLB history","Osaka Toin wins the 100th Koshien (x-post r/NPB)","[STL@LAD] Wong's diving double play saves the inning","Down to their final strike, Jansen Kenty, hits a 2 run home run to tie the game and keep Peachtree City, Georgia alive in the LLWS.","EDWIN DIAZ HAS 100 SAVES","Max Muncy ties the game with a base hit off a 103 MPH pitch out of the zone. That is the hardest pitch that resulted in a base hit this season.","How cool would a little league world series baseball video game be?","Braves get lead off man on in six of nine innings, score just one run, beat Pirates anyway","Greg Allen hits a 2-run go ahead dong to give the tribe the lead over the red sox","[Cut4] Acuña helping out the boys in New York.","Bryse Wilson in his Major League debut: 5 IP 3 H 0 R 3 BB 5 K","Help me find the Most Unexpected Season Season of all Time (30+)!","\"Razor\" Ramon Laureano demolishes his second career HR with athority as he puts the A's up 7-0","Stephen Piscotty demolishes a second deck homer to put the A's up 8-0","[Daren Willman] \"Just for fun... animation breaking down all of Mookie Betts' plate appearances this season.\"","[General Discussion] Around the Horn - 8/21/18","[ESPN] Khris Davis has hit 25 home runs against the Rangers over the last 3 seasons. According to @EliasSports, Davis joins Alex Rodriguez as the only players in the Expansion Era (since 1961) to hit 25 HR against one team in a 3-season span (Rodriguez - 25 vs Angels from 2001-03).","[Braves] Ronald Acuña Jr wins ÑL Player of the Week.","Khris Davis leaves (and receives) lasting impression with special fan","Paul Dejong gets the Cardinals out of the inning with an excellent diving stop and throw","Today's Mets broadcast showed a 1950's video from when the Giants left NY.","Glory of Their Times and other books","[Sullivan] Beltre on his future: \"If I feel like I can’t hit anymore, which sometimes this year I’ve felt that I can’t hit anymore, if I can’t compete with the young guys, yes, I’ll pack up my bags and go home. Right now, I’m not at that stage yet. I might be there at the end of the year.\"","[Fish] There are two guys with the name Wilmer Flores in the Mets clubhouse today. This is Wilmer’s brother, Wilmer. He has another brother named Wilmer as well. All 3 of them are named after his father, Wilmer Flores. #Mets","Mike Fiers vs Texas: 7 IP, 1 H, 1 BB, 8 K's, 0 R","\"Razor\" Ramon Laureano demolishes his first career HR to opposite field and puts the A's up 3-0"]