["Weekly Quick Questions Thread - August 29, 2018","I'm Aaron \"Aero\" Atkins, head coach of the Dallas Fuel and Team USA, Ask Me Anything","God, are you there? It’s me, Reinhardt.","Standing on the hanging tyre/tire on Lunar","A friend of mine finished her Blackwatch Moira cosplay just in time for DragonCon","I shouldn’t be alive: Ana edition","Leaked upcoming Roadhog mid season changes","no u","Guys, I found him","The colors on Pharah's Mechaqueen skin are out of whack in her Kneeling victory pose.","Noticed a couple on point so I figured what the heck","I see your team wipe DVA bombs and raise you this.","So-Called Professional Gamer Not Even Racist","D.va's Game On emote should have her drinking a Nano Cola when her Nano skin is equipped.","Best spray art work you've seen in game?","What playing Roadhog currently feels like...... PepeHands","Useless information: the D.Va NC spray is based on this celebrity","So close, yet so far","Winston's guns in different skins, Catcher's is outrageously large!","If I stand completely still... they cant see me.","With the relevance of Sombra and Lucio, I think this is worth pointing out...","When everyone thinks they avoided your ult, but then they die","Just to be clear about the new DVA drops: We have to watch people saying fuck you to each other and calling each other pussies to get the new DVA sprays.","It's been almost 2 months and Wrecking Ball still has no low health indicator","Hammond so thicc he can take a sleep dart from BEHIND Ana","Blizzard, it's NOT fair to send out an update 5 hours before the comp season ends, forcing disconnects and -50 SR on players.","The gift of Overwatch!","Zarya's guns in different skins","Strange dash/punch interaction","I found a old screenshot of /r/Overwatch taken 2 hours after the announcement at Blizzcon 2014","I accidentally the whole enemy team","Go to sleep, Tracer ♥","Hippie Roadhog that I drew and wanted to share","729 MB PTR update just dropped.","Jeff Kaplan congratulates Seagull in-game for reaching 100k concurrent viewers during D.va stream promotion.","Blizzard patches the game on the last day of competitive season and crashes everyone's games","D.Va Nano Cola Challenge | Overwatch","They gave Tokki it's own garage!","The endorsement system is bugged","Unaware Team is Unaware","D.Va's ponytail on her new skin is the same as Widow's ponytail for her Talon skin.","I would love it if the Tracer/Mei disappearing ult changes were reverted.","So I had a match that lasted one minute and thirty seconds...","Brigitte's VA playing Brigitte and reacting exactly how I'd expect Brigitte to sound if she played Overwatch","A previously removed Junkrat exploit has re-appeared recently.","We need more challenges like that","Just gonna make sure I angle this just right.","When you clear the Hammond Ult","My Luckiest Hanzo Shot: Shooting Tracer out of the Sky","Not one can hide from my sight","Introduction to Team USA!","enemy Winston had more objective time than the match's length","Get in the hole!","When you roll Genji in MH, spot a Widow, and manage to finally do the thing.","When the mei wall goes down","Wrecking Ball / Hammond Voice Line Idea: \"GG EZ\" Conversions Spoken by Mech.","Watch them run.","Not today, DEMON! Begone!","Possibly the most artistic way a spray was used","New FIGMA D.Va statue now available for pre-order.","After 250 hours of Genji i finally deflected a grav that sucked in more than 1 person","They could have replaced Lucio ball with Junker racing!!!","Got this mechanically intensive play of the game today, please dont judge im new!","First little clip I've done!","Mirage Reinhardt Ult from downtown","“Use that teleporter guys”","I literally can't join team chat","Overwatch Zero Hour: A lore-heavy fan comic aimed at expanding the Overwatch story. Issue One now finished! Feat. Moira &amp; Zenyatta.","Since we have a \"Please buff Roadhog!\" thread now, what about McCree?","Sombra can't reload while translocating...unless she's invis. Inentional? Why?","Hugely Funny and Competitive Game Mode","Cruiser D Mon along with her friend cruiser D Va!","Nothing feels better than denying a ress.","Just some fun as Doomfist","Lucio thought he had an easy boop...","I think I broke our Torbjörn","Dallas Fuel eyeing new players this week","OWL Caster's and Analysts Rematch Tonight","\"Avoid Teammate\" is why I got new all-time SR this season","Ana should have a voice Line that flags sleep dart hit (similar to ultimate lines, group, under attack lines etc)","Why the roadhog nerf?","Overwatch Q&amp;A w Mercy, McCree &amp; Zenyatta @ Paradise City Comic (Lucie Pohl, Matt Mercer, Feodor Chin","Mora/Rein 2020 \"Hammer Down\"","Priorities During Earthquake","I finally did it Orisa Valskaya","Didn't know Bastion had a \"Mortar Mode\"","a candidate for the worst Bastion's POTG","Several dozen event lootboxes later.","Pilot over to the Blizzard Gear Store to pre-order your #Figma collectible today:","Just a tip","Fix the Charge before Earthshatter!","Mission: Impossible - Sombra's Retribution","Team wipe D.Va bombs? How about an entire compilation of Symmetra teleporting team wipe D.va bombs!","I made King from the Meka Squad in Lego!","9 million IQ Ana","The best Mercy POTG you will see","Triple Shutdown Boop","D.Va Nano Challenge was a cancerous journey","How much does Rein's hammer weigh?","Suggestion: 30 Minute Warning Timer Before Releasing Patch","What do you mean \"lucky\"?","I accidentally fired while looking around and got the flickiest headshot","Worlds best high noon","Jeff Kaplan Still using his old EQ name \"Tigole\" as in Tigole Bitties","When life give you concussion mines, shut down McCree.","Does Ana’s Ult have travel time?","Brigitte's voice actor can SING; she NEEDS a singing easter egg in Busan's karaoke room...","There should be a campfire emote! Thoughts?","How to not get banned in Overwatch?","Is anyone else experiencing fps drops in the latest patches?","Suit Up For D.Va's Nano Cola Challenge!","Cyberwave Zarya (fan skin)","Three saves in a row!","[Padilla] The Dynasty's Overhaul Isn't the Last We've Seen this Off-Season","How Did This Happen?","Why did I die","I put this on my car because fuck Hanzo","D.Va's Nano Challenge could mean a lot for Overwatch!","6 on point, one hammer boi to the rescue.","Enemy team rolled a trio of Anas in mystery heroes that was driving us crazy. Something had to be done.","When does summer game end exactly?","Overtime Champions Season 6 Starting Soon!","Torbjorn Rework - Eltorro64Rus","Junkrat main determined to learn Bridgette or other support during offseason. Any advice?","At this point, I feel bad for Hog players","Ana PotG","I heard some growling and so I (panicked) striked","Can we get Moira’s “I heard you” as a voice line?","The new D.va spray with her eating popcorn may be refrencing the \"Moira eating Popcorn\" meme","Have you ever watch a POTG from the bottom of King's Row?","Apparently You Can Be Trapped By Junk While Ulting As Doom?","Old Mercy main wanting to know what changes has happened to her.","Can we have Doomfist nerfed in Total Mayhem. Put his abilities on a 3 second cooldown","Initial OVERWATCH","Why doesn't Blizzard follow Riot's example when it comes to patches?","How to link your blizzard account to twitch ( for PC and Console ) especially with the current event","Best feelings as a support main?","[Volamel] Fusion University Elk: “I think language barriers make complex strategies really, really hard […] Overall, I think it can be overcome, especially in competitive environments.”","Massive FPS drops and lag.","[Jake] The Caster Life","The things I do as a support main...","If you kill a Training Bot as soon as it spawns, it never spawns back.","Does Blizzard do Help-the-lower-skilled matchmaking?","about the New dva Sprays","What is the exact timestamp for when the summer games end?","WELP. I deserved it.","Pharah's guns in different skins","Lag","Overwatch Patch Note - 28 August 2018","Question about past event skins","Denying Flanks 101","I play Overwatch with one hand due to some hand complications, but I was able to get POTG using TWO hands for the first time in over a year!","Is there any way to get raw PNG's of the new D.Va sprays? (Nano Cola challenge)","OWL Talent Rematch Tonight","Im not at my real rank","D.VA: Arial Combat Spin Off Game Poll","What a top 500 console lucio looks like on pc","Wrecking Ball mech in Overwatch Cinematic Trailer","I see your DVAs bombs and I raise my great mechless POTG, I guess...?","Everyone Complains about the Rein bugs, everyone complains about the Mei bugs, but have you ever seen this Mei + Rein Bug?","TFW I saw a truck of this company","Lucio ball","It's way too late genji, they're all dead!!!","I see your Hanzo Main, and raise you Hanzo himself.","Question about the Nano challenge","Best golden weapon","Overwatch music score appreciation thread.","Selling skins for gold in game","Busan for PS4","Someone already made Busan :O","Is there any chance a chat room can be created for this sub?","When you have the high ground... rare Ana potg","GTX 970 i5 4690k 8gb DDR3 1600mhz","Even D.Va himself didnt expect the bomb to go successfully.","Game chat broken on Ps4?","What's up with all this recent lag on PS4? Some games are absolutely unplayable","When you get your main in Mystery Hero","Widowmaker HS only M̸̞̲͖̲̔̍̍̀̍̕ȏ̴͉̾̐͛̀͘n̷̥̉̽̆̆̍t̷̨̼̤̲̳̽̅͐̈́a̶͓̯̖̅̄͑̐̾̌g̸̛͔̠̿̍̾e̵͓̋̇̋͊͝","So I was gifted a Balance Card","Can someone please explain...","Are OWL tokens dropping on Mirage's stream?","Am I the only one who doesn't get the two day off-season?","[BUG] Season 11 top 500 spray disappeares after 8 seconds (does not happen with other top 500 sprays or the regular season 11 spray)","I finally understand why Widow is such a cold one. A (cold) shower thought.","Mercy resurrect bug in Mystery Heroes: Rez cancels if target respawns.","Orissa New Passive Idea","Soldiers weapon accuracy question.","I’m very disappointed in the nano cola challenge...","Downvotes are for people who don't add to the discussion, not just for Mercy mains.","I feel like this is more revelant than ever right now","Calvin and crew cyberbully Roadhog","Mirror - Pacific Genji Montage | Overwatch","The King of Undeserved POTGs","[Amos] Contenders Australia Season 2 Finals Preview: The Final Four","First good D Va bomb in ages","Thanks for the coffee, amigo","Nano Cola Challenge Bug","I made D.va's hat from \"Shooting Star\"","Jebaited hard","Asp Pharah by Marc Martinez","Random Skins","Mystery heroes no longer informs hero changes","what do i need on my PC to run overwatch?","Seagull is close to having 100k viewers right now - dva spray drops unlocked.","That awkward moment when you nano at the end of the fight.","I wish everyday in Overwatch Competitive was like the final day of the season.","Where else can I find a list of eligible streamers for the event?","Decided to try Overwatch on my i3 laptop is no dedicated graphics... thoroughly surprised myself!","What are some heroes you thought you'd hate, but played them and ended up loving them?","How to counter Genji ult","How do I unlock the Nano Cola sprays on my PS4?","D.Mon by Zeronis","Overwatch Theory; Siberia and Gwishin; Not as disconnected as we think?","How do you link Blizzard account to Xbox one?","\"You'll get the d.va skin when country roads starts\"","Does summer games 2018 end when Aug 30th starts or at the of the day on Aug 30th?","Rising Apricot is so fucking broken","Quality of life changes Blizz need to make for Arcade mode","Wrecking Ball (Hammond) - Château Guillard Instant Death Bug","Sigh, even competitive Lucioball season 2 still has all the same competitive problems","We need something new to spend comp points on","making Reinhardt go places he was never meant to go","I need your help,","Who wants to see Moira in the style of Matt Groening?","Hero Gallery Idea: Inspect Mode Changes","D.Va Hunts a Rat, forgets the objective is a thing","New D.va sprays","Unable to download the latest update","Anyone else get disconnected from overwatch?","So this happened to me today. I swear I don't hack.","D.Va from Shooting Star - Artgerm","Puckett is Marketable","100k Viewers On Stream! Seagull Plays Tracer And Widowmaker! - Overwatch","Endorsement bug?","Top 5 Best of Reinhardt Earthshatter | Overwatch League Season 1 | Akshon Esports","200 IQ Low Grav Outplay","Anyone on here switch from console to pc at a way later time?","My aim turned trash, so I decided that it was the only way.","Discussion on Tracers place","Fitzyhere Interviews Carolina Ravassa (Sombra) [57:13]","Genji, Widow, Hanzo","Beautiful boy make beautiful puns","Is the D.Va Nano Cola Skin 100%?","Next talon tank?","Botched D.Va bomb results in quad after the buzzer","Console to PC Tech?","I cooked the enemy team in a 1v5 and stole their flag.","Is there a site which shows who of the Twitch Drop Streamers are _currently_ streaming Overwatch?","Nano cola?","Sorry If this has been asked, but about the the sprays.","#ProReinhardt #TotallyCalculated #I'mTheBest","Something I noticed about a Soldier: 76 voice line.","I have another doubt hahaha","Has anyone got transparent/no background images of the new sprays?","OMG, as a freshman, on my first day, I just met some senior that was Top 12 in comp a few seasons ago and is now hopping in and out of Top 500 and Grandmasters. I’m a silver. wow","Need help for console (xbox one)","Is Moira’s dedication to science really unethical, and is it religious or cultish?","Question about ranking up in comp.","Issue","Due to them only now handing out late OW league tokens, I think Blizzard should let the Atlantic and Pacific skins to be bought again for a day or 2.","Hero 29 Name","Mulan - Elo Hell [Overwatch]","Saw that EMP coming","[Copa LB 2018] Placed at 2974. Climbed to Master going 50-30. Highest rank I've seen since Rank 60 in Season 1.","I did all my FFA placements with mercy","Dr Crafty! - D.Va (Overwatch) VS Mechanica (ARMS)","Keep connecting to PSE1 instead of PSE2","'Overwatch Daily Console' is releasing its first video: Fearless Jjonak of Console! God Zenyatta Hippin Lippin!","Endorsement loot boxes not being given?","getting back into overwatch is more difficult than anticipated","If each OWL were an NBA team, who would they be?","In which my friend loses his shit.","help on buying the game","That Torbjörn wasn't broken, he was just headbanging to some HARD ROCK","Please fix Roadhog.","Just wondering about something...","I just don’t understand how mood/emotion effects the game","A Topic Probably No one Cares about: Multiplayer Bots and their problems and what needs to be added.","Probably my best goal this season","Some of Overwatch's best moments","Nano cola challenge not unlocking sprays for watching Twitch, even with a linked account.","The Gridironhardt Reinhardt's earthshatter voice cue is substantially shorter and quieter than the default line","Possible Talon Member","Nano stream drop question","I heard Wrecking ball is getting fall off damage on his pile driver?","[PS4] College Internet Blocking Voice Chat","Short hanzo video","Mysterious Character Art Hidden in Patchnotes","A PlayStation Players view on PC Overwatch [rant]","Rein needs new voice lines","PS4 Discord Community","What are some good games you can jump ship from Overwatch and have a fun experience?","I'll never strike this shot again in my life.","Add a Deaf Mode for deaf Overwatch players?","Widow makes a grand exit","Meta team comp?","At what time will Copa Lucioball end?","Weird bug on Volskaya second point, enemy Wrecking Ball saves the day","Seagull reaches 100k viewers","Accidental Dragon Ball","Buying the game","Update: From Bronze to Diamond (Masters) [Orisa Main]","D.va should have a D.mon spray","Orisa Deconstructed- An Illustration I Made As Part of an Overwatch Series [OC ART]","New category idea to replace Damage: Precision and Control","I have a victory pose I shouldn't be able to have.","The V.A. of Brigitte made this video and All is Well With The World &lt;3","Anybody else getting massive frame rate issues on console after the Nano Cola patch?","Your History Holds You Back: An SR Rant","If a ally die the video ends - Overwatch","wtf Moira?","I know she has a shield but I like to think I saved her","What's Better? The CE Sourcebook, or the LE Art book?","MEKAnic by Sean \"Raiko\" Tay","Edorsement glitch?","Winning by spectating!","The dreaded Coccofist","Mirage's Graviton Deflect","Lucio got you!","Best Hiding Spot on Rialto","Player icon sorting?","Come at the king, you better not miss.","Undocumented/Unintended Zarya Nerf","Anyone else got OWL Tokens from Seagull's stream?","D.Va by Fahmi Fauzi","I swung my flail so hard that I knocked off Roadhog's head","Are Servers Down?","I'm going to miss lucioball :(","Can we give Hanzo louder footsteps?","Lucioball desperately needs to be placed alongside or replaced by a new summer gamemode","More Challenges","Wish I knew what the text says...","PTR Roadhog Changes","Fire in the hole!","Doomfist bug rant. The Slides.","Something I've been thinking about regarding Blizzards OW merchandise","10 types of overwatch support players - which type of support player are you? (Updated)","Let's continue discussing Roadhog! Maybe this particular change on his Scrap gun would make the difference?","Contesting point bug in Volskaya Industries. Why coundn't my Symmetra capture the point?","Etiquette/Morality for leaving a hopeless match?","Nano cola challenge making my games better","Offseason Comp","So I'm currently watching the V.A. of Brigitte on her first stream and....","Found an interesting quote about the name Mei from a film called Another.","Alley Oop","Nub's scrub question... Am I playing the game right?","Have been getting an interesting bug since the patch... my HUD will disappear and I can't tell who is who randomly sometimes. Have to restart the game to fix...","After almost 500 hours of overwatch, my best highlights so far.","Bring the noise, Bring the ruckus!","You can get the Nano skin while AFK by spectating someone","The Doomfist Mating Dance","It's not over until it's over","Can we stop bitching about Doomfist?","Overwatch: Highs and Lows of D.Va's Animated Short - Culture of Gaming","[Seoul Dynasty] \"We are excited to welcome KDG as the Head Coach &amp; Changgoon as the Assistant Coach of Seoul Dynasty!\"","Now where'd that Hamster Ball go?","High risk ultimate and clipped team wipe","Audio only on Twitch?","What happens to Arcade MMR during Off-Season?","If you are not getting sprays from Seagull's stream, check in game for the sprays!","I've peaked as a tracer main","I finally got my first Ana POTG... With bad aim and a lucky nano. :D","Looking to make some friends on PS4","I came in like a wrecking ball?","Just Received Overwatch League Tokens","Nah D.Va you can't just 'Nerf This', you actually have to 'Nerf This'.","Ah yes, the wonders of low gravity","I have a doubt...","Rip tire is the most powerful ult in game. Change my mind","A Good Old-Fashioned Showdown","It took me a second to realise I wasn't dead after all","Sometimes death cam can be wonderful","You vs the girl","Mini Events - Improvement Suggestion","Any easy easy to transfer my profile settings to alt acc?","Why the Overwatch Meta is an Obsession That Needs to Die","Team Kill: There were so many different variables for this to go wrong","Dva Game on by Derrick Chew","so i just got this boop...","Could be better designed...","Dangling Hamster gets put to Sleep","Sens for a palm gripper?","Never queues as a dps duo","Update issues since yesterday: a never ending update cycle","Does your butt also always clench when you play Lucio?","With the next hero most likely being an attack hero, I think it would be cool if their ultimate immediately charged another characters ultimate of their choice.","Does it matter what region I link my twitch channel to?","Brigitte Balance Idea","Change Sombra’s Talon hack terminal to red?","[Quiz] Guess which hero that the phrase","What's your tip for getting better at competitive?","Console frame drop","u/chuiu suggested this edit so I made it in to a video (my first video edit ever)","I love Rein but this is why I hate Rein","Wiped out the training bots","Sombra needs a nerf","I am the underrepresented: I love current Mercy except for one thing","So, are we going to do anything about 75%+ lifetime winrate Widows on console yet?","Derankers, DCs and Throwers for next season","Glad to see Rein's shatter has been fixed.","Reminder that Sombra can still hide into payloads and ruin Comp games","OWL Atlantic Division Press Conference | Overwatch League All-Star Weekend","Seagull reaches far out to kill Pharah","1, 2, Steeeeeerike, D.Va Bomb Out!","Trying to hide from D.Va's bomb ? 哈哈哈","Shower thought: Option to disable rank points showing in Comp UI?","Seagull, plz heal him!","I like to Hanzo. Welcome to QP.","Calculated Grav POTG ft. a nice amount of average energy","This is for all my D.VA mains.💖","Twitch badges and emotes, overwatch themed","FPS Drops on console","Is anyone getting drops from Seagull's stream?","Stand Out: A Lucio Montage @_@","If you feel compelled enough to be toxic in Lucio Ball it's probably time to re-think some life choices.","Felt pretty satisfying.","Did I Do the Right or Wrong thing?","Small suggestion that may be pointless but can we give Ana at least 50 shield within her health pool","Playstation on Twitter posted an interview that sheds some light into DVa's lore","So this new D.VA challenge is cool and all, but I think a community challenge would be way cooler.","New Mei beekeeper voice line; \"Mess with the bees you get the freeze\"","That was a close one. Thanks for not taking the small pack","Never knew what hit him","Endorsement Rewards?","I love Symmetra!","Thanks Junkrat! I knew it was too early for high noon","70 hours in Tracer and I still suck.","When you're a Lucioball god, sometimes it's hard not to score...","Seagull does not play Mercy. Headphone Warning!","I call this one The Oblivious McCree","I leveled to the same endorsement level twice?","Overwatch Coaching: 3.9K(SR) team Southern Bombers Nepal","What do people think about Mercy's current state? (with poll~)","i did it, Reddit!","Win Did Not Count Because of Update?","Flanking Rein caught in the act (he had earthshatter)","I found the most broken character yet!","Can we please have a discussion about the reporting system","august 28, competition season11 Korean servers 1,460 players were suspended for 'account sharing'","Genji Express","LA Gladiators will be hosting open tryouts for both OWL and Contenders","When Mom says its bedtime...","[suggestion] Make an OW Bronze (or worse) League!","In regard to hiding spots on Rialto I like to chill here.","Is it ok to gift myself OW?","Most Damage per Game","Anyone else experiencing severe frame-drops on Xbox One after installing the patch?","Seagull gets executed","Worst POTG in History","He reported me because of this sleep dart","\"Does anyone know how to deal with Tracer?\"","Double take. It's fun watching yourself work from a different angle.","No endorsement rewards this week?","I didn't want a shield anyway &gt;:(","So I haven't played since Season 6, can someone hit me with a TL;DR?","Well, thank you Orisa!","Why the sprays are DVA only ?","Through my first 10 games/2 hours, I am getting absolutely throttled in quick play. Do I just delete the game?","During my 5th watch of the DVa animated short, my girlfriend came in and called me weird for watching them many times. Am I crazy? Do y’all watch the animated shorts multiple times?","when your enemies really want to kill themselves","Does OW run 4K on PS4 Pro?","My best prediction hook","Team was too busy fighting to push payload... I got POTG for pushing payload","Starting picks on supports don't count for anything, apparently","Why can't I win one game without losing at least 5?","How do I even get these damn sprays","The 2018 All Star Weekend Review","Is this Symmetra exploit reportable? Or intended?","Blizzard removes paid loot boxes from Overwatch and Heroes of the Storm in Belgium","Weird Audio Grid","In three weeks I'll play a lan tournament, any advices, resources for a silver player?","What twitch channel are we supposed to watch for the nano cola rewards?","I accidentally bought a lot of sprays...","Zarya needs a major buff in Deathmatch","What does freezing a shield do?","Roadhog alternate fire damage falloff: LIVE vs PTR","Nano Cola Challenge","So, I got a few \"funny\" clips I want to share here. What's the best way to do it?","When do the new OWL skins come out for the all access pass.","D.va Nano Cola Challenge!","Paid Loot Boxes and Loot Chests Disabled for Players in Belgium","Question About D.va Sprays/Twitch/Battlenet","Blizzard Support is terrible when it comes to unlocking your account.","Everyone got disconnected because of a patch so me and the 2 enemies decided to draw","DVa Nano Challenge and Mobile Twitch","Hi I'm a Junkrat main, and I fill in comp......","how do i get in 4th place in deathmatch?","Overwatch disconnecting for anyone else?","Dva nano cola","Tracer tips?","Is the Lucio Dance Party emote purchasable?","Highlight: What's a man gotta do for good games!?","When genji hates your guts","What if there was a card for crucial switch?","Readyyy.... Steadyyy... FIREEEEE!!!!","New Overwatch patch brought some great Graphics","Ana satisfaction : 9000%","Headshotting an invisible Sombra is so satisfying","Opinions on the morals of your favourite heroes?","Smurfs on Console","Looking for an oddly specific clip of Kabaji","Bull and a Madator","d.va lineart fanart","Overwatch feels like vsync is on","OWL Pacific Division Press Conference | Overwatch League All-Star Weekend","I Later got the Winning Goal","[Overwatch] Diamond Ranked Competitive Lucioball Shenanigans","Gamebreaking Rialto Glitch","DOOMFIST glitch, slam was too long, punch didn’t insta kill when he hit the wall, bullets did no damage( I did hit him I checked in slow motion)","[Column] The Overwatch League needs more events like the All-Star weekend","How “Shooting Stars” should have possible ended","Post-game card system remake suggestion","Unplayable bug regarding S11 Spray","Sanjay Korpal","\"Need healing\" is throwing your games.","Doomfist hate?","Lucio Ball &amp; Discord","New Sombra Glitch On Kings Row with Translocator.","Searching Off Tank Youtube channel","A video I made about D.va friendzoning her friend, daehyun (Earrape Warning)","What happened to LFG?","Why are the summer skins so expensive?","Best Rein Eu","The Photobombing Moira","My mouse cursor (the one from the main menu) stays on the screen in game and acts as a cross hair but shoots straight up to the sky and I’m unable to aim at all. It jitters and jumps around but I don’t have any real control over it. [PC]","How often do sales happen? When is the NEXT sale?","Are the servers lagging because of the Nano Cola thing?","Wait for the Zen to drop","Does the event end today or the 30th?","Unexpected Karma","Horrible rubber banding","Did Blizz forget to turn of Free Week?","Please bring back 3v3 elim","Lucio Ball Goalie Selection","How do you get the dva twitch rewards on console?","An Overwatch video that I feel deserves more views : )","Tips for a gold Rein main?","Spawn Room Renovation","I, a player who has been stuck in the silver-plat range since season 4, got to Diamond after seven seasons as the season expired. (Part 1 of 2)","XIM/Keyboard and M has ruined console Overwatch.","Jeff Kaplan's Overwatch name","Meteor strike","Hilarious Hack Kill From Tsuku during 4.2k Scrims [Casted by Broadcast.gg]","OWL all acces pass says that it comes with 21 skins but it shows 22?","Hammond suicide spot in Château FFA","I need advice on how to play tank.","Why the f*ck does LUCIO heal more than Mercy now?!?","Made a Lucioball Montage before the season ends","DVA Items for Playing and Watching","Is the free weekend over?","When you're tired of tracers in deathmatch.","Sneaky boi Hanzo. (Sorry for the bad quality, I was playing at an Internet cafe)","Game sound","LFG is dead on console and no one seems to care.","I need help choosing my next golden weapon taking a vote?","Was Sombra really in the Ana and 1st Summer Games Reveal?","Let us be able to get rid of skins we don’t want for gold.","Everytime I'm pushing point I think of this video","Roadhog has left the chat.","Is Reaper bugged?","I made a Overwatch GMV please check it out!","TIL clicking \"cancel\" on the queue timer at the last second counts as leaving a game, and just reduced my endorsement level.","MMR Ruins All Competitive Modes","Talon (Evil) Tracer by Allison Gaughan","Has streams ever been this high for overwatch?","Solo team kill","When you get tired of your team not dealing with the Widow","What counts as “leaving a match?”","OWL All-Star Weekend Recap: Atlantic Division triumphs, Surefour crowned 1v1 champion","New D.va glitch with Mei on Volskaya.","Hit and Run Piledriver","Pool Party in Ilios!","first time i ever felt useful as a widow tbh","Ps4 players that live in a college dorm, is your NAT type preventing you from joining voice channels in Overwatch?","Why \"Need healing\" is throwing your games.","The strees this game puts me through is making me re-evaluate my life...seriously!","JJonak makes Zen sit","You... Are Already Dead...","When Widowmaker jiggles to the music.","Ok Sleep Dart","How not to dragonblade","Blizzard should allow us to do placement matches during the off season","For your safety, please move behind my barrier moments","Bring back D.va's \"Bang!\"","“Looks like the party is over” ;-;","[Reaper] Fun Play: Pharah Shutdown, Blossom, SS BombDodge, Wraith the Tire","Case Closed.","\"I miss the good sex Blizzard\" -Dr.Riku","Not so fast Moria!","An even bigger reason to hate mei","Whats wrong With lucioball?","Logging in bug","A Thought About Lucio's Boop","[Progression Highlights] 1: Humble Beginnings","Question about game sharing","Blizzard patch malware","Damn i didnt know the event ended today","Team: \"We're pushed up, now what?\" Me: \"8-ball corner pocket\"","I, who got to diamond after seven seasons of hard, raunchy, sweaty grinding, am here to tell you that ELO hell absolutely exists. (Part 2 of 2)","2 steps on how to be MLG at Lucioball","To the Junkrat who countered the Genji ult... heres my way","Is overwatch fun solo/Without friends?","Low Hanging Fruit - Phara Enviro","Echo heroes/Alternativ heroes for existing heroes","This is the peak of Doomfist gameplay!","How many licks does it take to get to the center of a Tootsie Pop?","What to do when you're bored in Overwatch.","When all you have is a hammer...Reinhardt PoTG on Eichenwalde (Cross-Posted from /r/ReinhardtMains)","Option to remove border decoration","Should i buy Overwatch: Legendary Edition","It doens't make sense for the attacking team to also have increased respawn time in overtime","This year Summer Games event should be themed Asian Games","what Mercy nerf?? THIS is the meta","Mercy's damage boost is concentrated angery channeled through her staff","Always Defend On Point(Hanamura)","Present Time Lore-wise Concern","Paid Loot Boxes Removed From Overwatch In Belgium.","Reminder that this sym bug is still here","Thought the Mei wall was going to mess me up and then this happened.","Custom voice line request for ults","Question about when Dva is put to sleep.","Trust nobody. Not even yourself.","Most satisfying feeling in this game for me. What's yours?","D.va bomb with 2 seconds left to win game","Nice try Rein.","Brazil vs Germany Worldcup Finale ( 2014, luciorized )","Feedback about D.va Meka Headset Microphone from those who've used it?","New web-app to manage your esports team","Belgian players can no longer buy lootboxes in Blizzard games with real money","Popular DJ nearly dies to attain pixel art","The joys of Swift Strike.","Hero Concepts I'd like to see","No aim, no brain, winston main, pharrah slain","Get, PUMPED!","When you try so hard to kill baby dva and block her bomb but your just nano seconds away.","Eastern D.va by Axsens","Last week I tried comp for the first time. Today I finally got Play of the Game!","Killed by friendly Ana &amp; wacky physics?","Symmetra gives POTG to other people for 2 minutes","Idea to give Ana anticipatory heal back","Am I the only one extremely dissatisfied with the current state of Overwatch?","I'm making a montage &lt;3","I try to not call blizzard incompetent","Always been a trash Hanzo, got some advice to change my reticle and this was my very next game!","This Genji had been raging in the chat at me after I'd shut his Dragonblade down a couple times. I must say, this was the single most satisfying thing I've ever done in Overwatch.","When people ask how do you get POTG, I say just press Triangle","My first time ever play D.Va in comp. I just kept yelling “I’m Poko” as we took the point back.","Why am I alive","Is sniping too easy in this game?","You might not want to tell your friends about that.","Oh they have a sombra? Hold on, I got it","Would like to leave a skirmish without leaving queue","What EXACTLY do I get for purchasing the owl all-access pass in-game","What is one Overwatch skit, you would all like to see? I'll make it happen :) Call it, the Overwatch community skit!","Finally Made Diamond","Free loot box with purchase of some Kellogg’s products?","D'MON Yuna Overwatch by Paul Kwon","It should not be possible to have two of the same character on the same team in mystery heroes.","For the last couple of months, I have been receiving lootboxes for seemingly no reason periodically.","Team work makes the dream work! [Lucio/Rein POTG]","I feel like they need to fix the suspension system","Im a Zarya main and these are things i need to know, send help plox","Satisfying Rein charge","Competitive currency in off-season?","Don't play on edges with an angry Rein","OVERWATCH EDIT [ft. Lil Mosey]","Some Genji art I did way back around launch that I just found and wanted to post it somewhere","\"If I'm going out, I'm taking you with me!\"","Liao/lacroix","Mekanic D.Va Skin - A mechanic skin inspired by Shooting Star","Corsair Ana still doesn't have the bird on her shoulder in game","Couldn't do that again if i tried 100x (MAX VOLUME)","What are your 3 favorite heroes?","3rd game in arow where we lose because the enemy has a Bastion in Mystery Heroes","Duplicates","Now that Reinhardt's shatter has been fixed, I think its time for his charge.","I've watched this several times and I'm honestly confused how I hit the mines. Aren't I above them or am I missing something?","Every Hero Hit by a Car","Purchasing lootboxes disabled in OW in Belgium after gambling report from Belgian Games Committee","Who do you want for the Blizzcon hero?","Mickie On Receiving Blizzard's Dennis Hawelka Award","PTR Reinhardt's Earth Shatter has a dead spot on inclines","First Ever Torb Hammer Kill during OWL All Star Weekend","The salt in mystery. Kill everyone","Oh no you don't!","How does ddosing work in Overwatch?","Please don't abuse your Ana for Nano boosting you at the 'wrong' time","Received Mercy statue today, needless to say she is beautiful !","Throw another ball at it to get it out?","talk about good timing","Ideas for overwatch - There should be a pirate themed arcade mode where you either defend your ship or hunt down treasure like the junkenstein's revenge/ retribution game modes.","Sometime trigonometry just fails you","I'm a tank main; really didnt know what I was doing.","FFA needs to be fixed","Never really been one for watching Twitch","I'll take it","Most expendable category of hero","The flick of the century","Pulled off the greatest DF play of my life","Mercy and her endless nerfs, A Letter to Blizzard.","The enemy of my enemy is my friend","Spiderwidow","LFG and endorsements started strong but faded fast","Anyone remember the little lore text on some skins?","High turret focus, low environment awareness","Pink Mercy charity icon and sprays I unlocked are now suddenly locked??","Teach me how to Valkyrie","My weirdest POTG ever?","Competitive mystery heroes?","T-Shirt Ideas","Anyone else notice an increase in junkrat t-poses","Just hit Q, and you win","Which Achievements Do You Think are the Hardest to Complete?","My brothers gift giving skills 10/10","Frame dropping for the last month","Why Does Lucioball Still Feel Off?","Poor Mei Dies While Inside Iceblock?","The genji proceeded to flame me for hacking... and here i am just a scrub with a lucky shot and a POTG","Who should I play?","It's Golden Weapon time - who to get?","What the stun meta feels like...","I think the D.VA challenge should have been more challenging","D.Va 5, teleporter 0","How do I get my name like this?","How to piss off a Bastion","Are the All-Star skins still available or will they be back at any point?","Symmetra's bomb guidance system is top notch, would recommend!","First time I made someone rage quit as DoomFist, sorry Tracer!","Red enemy outlines are a little flawed","Any watchable pro Hammond streamers out there?","[Alonzo] Overwatch League's All-Star weekend was a ton of fun","Console Quick Play","Who should get POTG? A Bastion double kill or this?","*Chef Kiss*","nononoyes","Mei's ult feels super cheap sometimes","Possible Mercy Buff...?","4k Ps4","GF vs BF - 1v1 elimination","This Week in Overwatch | August 20th - August 27th","Has anyone been getting the older Summer Games skins in loot boxes?","Lijiang Tower: Spawn to Asserting Dominance","Concept: Mario Kart mode but with mechs!","DMV local outreach for OW","Making an Overwatch Tier list based off the communities opinion - Part 1: Supports!","Junkrat 100% intended","Did the endorsment hype stop ?","Playing tracer for the first time because of the Atlantic skin be like...","Just a lil \"oof\"","Why does the matchmaking put me in games where the defeat sign is shown the moment I pick a hero?","Brigitte or zenyatta","Uh what is this?!!! also sorry for the quality","How is everyone so shit on the last day of comp?","Has it always rained in the Lijiang Tower map? [Xbox One]","How did i die? seriously?","Are Brigitte’s attacks hard to read for anyone else?","Weekly Trash Talk Thread - August 27, 2018","Will we ever get a D.Va replacement?","Does this happen to anybody else???","When you're top 500 but want to play 1 more game to secure your spot","A One-Trick in Rehab: Harassment From All Sides","Nuttiest Widow shot in my life","When no one kills the snipers so you have to do it yourself","Can't leave toxic games because I don't want my endorsement score ruined.","An early winter is coming to Los Angeles - Team Norway","Sombra more popular now?","Is there any way to get summer skins(mercy's one) after summer games"]