["Stevie Nicks after a concert in Amsterdam. (April 1977)","Academy Award nominee Gene Tierney, 1940","My great aunt (graduating from nursing school) looking like the epitome of the 1960's","My attempt at colourising (New Zealand woman circa 1930s)","My dad aged 25 in 1978, photographed by my mother.","My friend, Trekkie in training, Early 80's","Bob Ross 1961","Freddie Mercury on the shoulders of Superman, live 1979","Iggy Pop and David Bowie, 1986","Dolly Parton (Late 60s)","Isla Fisher, 1990s","Just a dude giving his sheep a ride on Eid al-Adha, 1937 Constantinople","Mom hired as actress for lobby &amp; intermission for Gone with the Wind re-release in theaters in 1967.","My mom in the late 80's","Probably would not meet modern safety standards [1970]","My grandmother meeting Walt Disney on a visit to Disneyland in 1956","My parents in March, 1945, just after their engagement. Dad was in the US Merchant Marines in WWII.","My uncle and his two awesome friends. Long Beach, 1988","Marilyn Monroe 1952","Fred Rogers 1946","My grandma on her wedding day, 1960. She made her own dress!","Marilyn Monroe, 1950s","Marilyn Monroe early to mid 1950s","Brittany Murphy, 1990’s","A Colt 38 with a small camera that automatically takes a picture when the trigger is pulled. C. 1938","My dad, Navy fighter pilot, 1968","My great grandfather and his twin brother in 1894","Indian family(circa 1970). My mom to the far right","My super-natty grandparents. Circa late 1940’s.","Red Cross nurse and rescue dog, WWI.","Painters suspended on cables of the Brooklyn Bridge, 1914","Michael Jackson, Eddie Murphy, and Iman as the epitome of black royalty in 1992 for \"Remember The Time.\"","My Grandma circa 1930's/40's in Bedford, England. She set a few time trial records in the BRCC. At 94 she still talks about her love for the sport.","Miss Hurst Golden Shifter and the Hurstettes around 1968","Becky McFarlane, 1940s","Dad in his GTO , California desert 1965","Brittany Murphy in 90s ❤","Carol Burnett &amp; Lucille Ball (Mid-1970s)","Marilyn Monroe early to mid 50s","I Reached The Peak Of My Coolness In 1991","My grandfather with his sister-in-law, early 1970's","I also reached the peak of my coolness in 1991","Young Japanese at local pop concert, Tokyo, 1971","Nipper the cat (from LIFE mag, 1951)","My grandma and her dog around 1940 - she swears she never taught him how to ride like that!","My Grandfather bartending at the Playboy Club Chicago, IL 1970's","Finnish army pilot 1943, stripes on plane represent amount of enemy planes shot down","The march on Washington 55 years ago today","My parents on a Triumph during their road trip, 1991","David Gilmour - Echoes (1972)","Pops at the Monterey International Pop Festival, 1967. Came with his two VW bus mates.","Betty Grable, 1937","My Granny in 1947. Have spent hours going through all your photo albums, and although you say you’re “posing”, you look as cool as ever. I miss you","My Grandmother posing for a photo in downtown Toronto (May, 1968)","One of the first times my brother and I saved the world back in 1988","My grandfather keeping it cool, 1967","My Dad as 'Dustbin Hoffman', 1983","90s couples were a weird mix","My beautiful grandmother on her wedding day circa 1950","Gene Tierney - Film/Stage Actress (Early 1940's) - Colourised","George Bernard Shaw: Surfing at Muizenberg beach. South Africa, March 1932","Parents on wedding day 1961","Gene Wilder and the cast of Young Frankenstein (1974)","My Great-Grandmother and her Girlfriends, circa 1920-1933","My dad in 1983, with his dog Jazmine","Mary Pickford and her cat, 1916","1923 great grandpa in a dress...and gun","My crystal blue eyed mom with her best friend in 1968.","My dad and my sisters mom on their first date at High School Prom, 1965 (RIP Dad!)","It's no use, girls - NYC, 1953, photo by Elliott Erwitt","My Dad (far left) Somewhere in Northern California in the early 70s","Me in 1996 sitting on my godfather's bike. My parents in the background.","Stevie Nicks performing a concert in Afghanistan. (April 1977)","Michael Jackson, ca 1984. Happy 60th birthday!","Evelyn Nesbit, ca. 1900","My Grandfather, testing Dan Gurney's tyre degradation, on an Eagle racing car, Goodwood, 1966.","My Pépère Albert sometime in the 1940s. Québec, Canada","Coolest kids in Frankfort IL. 1991.","Various stars attend the Paramount Pictures 75th anniversary party, 1987","My Great Grandfather, 1953. He moved from Sicily to Australia to work on a farm","My cousin &amp; I playing Ghostbusters on my Grandpa's Commodore 64 in the early 90s","Giovanna Ralli in a movie from 1966","1940","Is that you Willie Nelson? Grand Ole Opry 1965.","Today would have been Michael Jackson’s 60th birthday. Here he is in 1971.","George Bernard Shaw, by Yousuf Karsh (1943)","Grace Lee Whitney, with Kirk and Spock images on her platform shoes, appearing at a science fiction convention, 1975.","The finest moustaches in what is left of the British Empire. Royal Marines, 42 Commado, after re-capturing South Georgia","My Dad with his late 1970's Camaro before it was traded in for a wood pannneled station wagon","Danish Special Forces officer Helge Meyer took this highly modified Camaro across the numerous battlefields of the bloody break-up of Yugoslavia doing supply runs to shelters, schools and hospitals. Vukovar, 1991","Grace Jones and Dolph Ludgren 1980's","Michael Jackson and SEGA's Yu Suzuki (creator of Virtua Fighter, Shenmue, etc.) [1990s]","My grandparents, 1939","My mom and her cat Abigail, sometime in the late 1960’s.","Nirvana: 1993. Before Charles Barkley left the band and ruined it.","hank in the eighties","My Aunt and Grandmother taken in 1930s.","A sailor gets a tattoo on his arm in Virginia (1939)","My mom and aunts ready for a neighborhood cruise on my grandpa’s scooter (Early 1960s)","Full House Pilot Rehersal (1987)","G-ma in her 20s (I think) in the ‘20s (I think). Marcell was dope yo","Lyndon B. Johnson and John F. Kennedy, 1960","The first picture ever taken of my aunt and uncle together, early 70's.","One of my (Distant) great uncles, William Ellis Corey, President of US Steel from 1903 to 1911","My great grandfather, the artist. 1940s","In the 90’s, my big brother would hold my beanie babies hostage, sending VHS tapes of them being tied to chairs and held at nerf-gun point. Sometimes I also got random letters from this mysterious kidnapper, always signed - The Phantom","Classic Sears family portrait; circa 1994.","Michael Jackson in 1971. Would have been 60 today.","First day of school, sometime in the early 90’s. Super high socks and whatever those shorts were.","Steve McQueen Anchorage , Alaska 1972","Me and my cousin styling it out in ultra 90s fashion.","My Grandpa Served on a Submarine in WWII, including during the Battle of Leyte, the largest Naval Battle in the History of the World. Despite that, he was a happy and gregarious his whole life.","Eve Eden, 1960s","Michael Jackson &amp; Freddie Mercury. (1980)","My dad on a sailboat with some 80's shorts. Alamitos Bay, CA c.1984.","This recently discovered photo of me. Were the 80’s great or what?","Stevie Wonder having a drink at a club (1967)","My grandparents wedding in 1929 in Kenya. My grandad is pretty dapper","My grandpa sailing around the Virgin Islands in the late 1970s","My Great Grandma The Rum Runner 1873","90's Hipsters in Chicago","Child of the 80's - Double denim and rollerboots (circa 1988)","Shakira Caine, 1970s","Bud Spencer, mid. 60's","My Great-Great grandfather Cecil who was a deaf coal miner at Roslyn, WA. [1908]","My mum in the 80s visiting Pisa","Arnold Schwarzenegger behind scenes on the set of T2 - 1991","My grandma as Marvin The Martian in her 30s or 40s (she's 70, now sorry it doesn't fit in with the black/white theme)","My friends dad was a stud in the Yugoslav Navy in 1981.","The 90's in one picture","My very 80s parents. My mom was visiting my dad in Montreal, circa 1987.","Blade, \"The King\" of graffiti in the 70's","My grandmother on her Coca Cola (coke) tray 1940’s","My mom’s headshots from the 1960s","Ed Vedder and Chris Cornell sometime around the early 90s.","Weight Watcher Aerobic Home Exercise Spring Action Exerciser Box - approx 1980s","My Great-Great Uncle (Witkowski) US Army Bombardier posing with his crew June 5, 1944","The lighthouse worker's band at Måholmen lighthouse, ca. 1910","Michael Caine with his wife Shakira and daughter, 1973","My too cool for school husband 1989","(nsfw) Janis Joplin, 1968","My small town farming grandparents dressed up for the \"big city\". Saskatoon SK Canada. They were in their early 30's. Est. date 1955-1958.","\"You\" Princess Diana meets comedian Rowan Atkinson(Mr. Bean) while greeting the cast of the ‘Royal Variety’ show in 1984","Ann Margret holds all the aces in “The Swinger” 1966.","I see your coolness and raise you my nightmare in 1992","Nurse from the 50s.","Led Zeppelin (1970)","Yvonne De Carlo, 1941","Albert Einstein and Charlie Chaplin at the premiere for City Lights, 1931","My grandma (white shirt) in 1959 with some of her art school classmates","Ernest Hemingway boxing in Africa, 1954","My Papa in front of a truck he built himself and my uncle, 1978","Betty Brosmer, 1950s","Stan Lee was a charming man (1939)","Eve Eden, 1950s","Grace Kelly in Rear Window (1954)","Panasonic \"CD Sound\" Commercial (1986)","My grandfather sitting on the wing of his A-36 Apache during the 1944 Rome-Arno campaign. He flew from Corsica to Orte, Italy where he was awarded the DFC","My family, pre 9/11","In honor of Weird Al finally getting a star on the walk of fame, here’s him in 1983 on the set of ‘I Love Rocky Road’.","A painting of Cary Grant in Alfred Hitchcock’s 1959 film “North by Northwest”","Lorna Patterson, aka Randy the stewardess from Airplane (circa 70s)","My grandparents enjoying the rare snow in SC, 1950","Not sure if cool, but is interesting-1969","An image of my grandfather [Arthur Oldfield] who was a paratrooper in WW2 and served in North Africa","Jodie Foster photographed by Patrick Jarnoux, 1977","1981 Pac-Man Video is of myself playing. It’s how to get a Perfect Score on the 🍎 Pattern :)","My brother and I in Gettysburg pa 90's","Cast of In Living Color 1991","1945, my grammy. She was a beautiful child, about 4 here.","I was the kid your parents didn’t want you hanging out with (1993)","My mother in the 70's","Check out my youngest sister in her Go Go boots circa 1968","Found a picture of my Mom doing a literal kegstand in the 1980's","Cool personified 1960's","Kate Bush photographed by Guido Harari, 1985","Michael Jackson in 1983, he would have been 60 years old today","Flor Garduño, El arbol de Yalalag, Mexico, 1983.","James Brown, 1967","James Hetfield and Kirk Hammett of Metallica at a sleepover at Kirk's mom's house (1983)","Drew Barrymore (90s)","Lucy Marlow (1955)","Protesting HS dress code that banned slacks for girls - Brooklyn 1940","My grandfather and his 1950's baseball team. He's the one holding the bat","@u/TopS3cr3t- wanna team up? (1993).","Scene Connery and Noel Coward filming Doctor No. [1963]","My brother had no idea how cool a sister he had in 1984.","Today is the fifty fifth anniversary of Dr Martin Luther King Jr’s legendary, ‘I Have a Dream’ speech (1968)","Marvin Gaye with his Rolls Royce ahead of the Notting Hill Carnival (London, 1976)","My Dad in Vietnam 1969","1963 - Hugo Gernsback demonstrating his \"Television Goggles\" (original VR?)","Johnny Depp in Ted's in Limerick in 1991","My parents super stylish wedding 1982","My brother and I were way cooler in 1989, than we have been at any other point in our lives.","Bathing beauties, 1944","Doris Roberts on Remington Steele, 1980s","Texting old school early 50’s","My grandparents, circa 1950, El Paso, TX.","These taekwondo pictures in the 90's","There's THIS GUY Who Peaked in 1991 with the TMNT then faded into Obscurity","Kevin Nash on the set of Teenage Mutant Ninja Turtles II: The Secret of the Ooze in 1991. He played the Super Shredder.","My mom is 90's maternity splendor.","My brothers and I mid 90s. We're all enlisted for real now.","I also peaked in 1991 with a TMNT (shiny bc I had it blown up to poster size for extra coolness in my room).","1970's beachwear: cut-out swimming suits and tons of tanning oil","Rush on their debut album tour with fans, Columbus, OH, 1974.","My nan rocking a beehive in the 60s (and my mum finding it hilarious)","Shirley Temple's daughter Lori Black playing bass with her boyfriend at the time Buzz Osbourne in The Melvins (1989)","Hulk Hogan &amp; Andre the Giant (Early 1980's)","Kid n Play's haircuts in the 90's","My grandpa(right), two of his brothers, and his mother in 1960","I peaked aged 3, 1990 was a simpler time","The Ramones - first gig, Newport RI, Nov 12, (1976)","Thanks to Mom I peaked at 3 years of age (1992)","Harrison Ford, Mark Hamill, and Carrie Fisher share a London cab (1980)","1986","Andy Warhol and Nico posing as Batman and Robin for Esquire Magazine, 1967","Uncle looking rad back in 1979.... I’m the baby and just cool by association.","63 Pontiac Tempest ad.","My photogenic dad and his Afro got voted Prom King in ‘77","My grandma tending bar sometime in the 50’s looking like a bad ass.","Jimi Hendrix, 101st airborne, 1961-1962","My old man teaching me to use the family computer. England, Circa 1991.","Mom &amp; Pops going to the Prom 70’s style","My Grandad Looking Too Smooth in the Early 80s","My grandpa in his 20s circa mid 1950s.","I was ready for anything the world had to throw at me (1981)","Best tux 1994 had to offer","Rare picture of Alfred Hitchcock showing actors how to walk correctly, on the set of the movie The Paradine Case, 1947","Mrs. Rhoda Abbott, the only woman to survive going down with the Titanic, 1911.","This menu from the 50’s from a bar at the end of my street had a “Jelly Omelette” and a 1 dollar steak!","My Mum and Dads Dogs in the 80s","I Too (Too) Reached My Peak Coolness in 1991 (I am having a blast, my cousin ... not so much)","c. 1990. Relieved to know that for at least one fleeting moment- I was Cool.","My grandparents in 1951, back when they were dating, sitting in the parlor at her parents' house","Harry Houdini jumping off the Harvard Bridge into the Charles River while chained and manacled on April 30, 1908","Hokkaido, Japan. 1954.","My dad's senior pic in 1972 (lookin' like he could step right into today and open for Beck or something).","Yeah I was pretty cool in 1999","My grandma and grandpa (who turned 90 this year) most likely either right before or right after he served in Okinawa during WWII.","My grandma looking a bit like a young Adrienne Barbeau (sometime in the late 20s/early 30s). She was such a great woman. I named my daughter after her.","I was a cool 90s kid (1993)","My old high school janitor duelling Johan Cruyff during his time as a professional soccer player [1982]","Dr J arrives at Nassau Coliseum prior to game - 1976","Mark Hamill, Carrie Fisher, and Harrison Ford trying to replicate the poster art for #StarWars \"A New Hope\" in 1977","My grandpa and grandma on their wedding day 1954","Found this awesome picture of my dad and a side of him I didn’t get to know (far right). He was in his 20’s so it has to be from the late 1970’s.","Eugene Jacques Bullard, The First African American Fighter Pilot, and his monkey, WWI , 1910s","I’m not Batman but I took a pic with his car in 1992! Dork isn’t even the word...","\"Human Fly\" George Willig scales the exterior of the World Trade Center's South Tower in 1977. Completing the climb in 3.5 hours, he was arrested at the top after signing several autographs, and was fined $1.10 by the city - a penny for each floor he passed. [2000x2901]","1978 Dad and Me. He was brushing my hair 3&gt;","My grandparents (right) at my great aunt and uncle’s wedding in the 50’s in Brazil","One of my favorite pictures of my Great Uncle back in WWII, unknown location.","David Bowie, Vogue 1978","Mid 1970s. The girl in the red t shirt is my mom.","My great grandmother circa late 30’s, early 40’s.","Great Uncle “Bud” 1960’s","New Yorkers stop to watch the \"Seinfeld \" finale in Times Square - May 14,1998\"","My grandparents as part of a wedding party late 1950s.","\"Easy company\" enjoying Hitlers wine at the eagles nest - 1945.","My grandad and Mum at the beach in Devon, Westwood hoe 1977","Joachim Peiper was hot for a \"war criminal\". (1945)","Woman washing clothes in river, Nice, 1908","Santa Claus, my sister, and myself -- around 1956-57","I bought a house that used to be a clam shack on the first floor. My neighbor gave me a picture of Art Carney eating there in the 1940’s","My great grandma and grandpa cross dressing in the 1930s","He served his country honorably. (May 24, 1973)","My brothers looking fly sometime in the mid 90's","The baby is my Poppy in the year 1928. He just turned 91. Help me wish him a Happy Birthday!","Top Gear [1969]","My Aunt meeting Wayne Gretzky - 1981.","My dad working at WGBB Long Island (1986)","My mom looking fly in Jamaica (1992)","Couple in Central Park with their chimpanzees, NYC, 1967, photo by Garry Winogrand","5 Generations. 1982. Im the cheeky baby.","Gala magazine from 1961","Kurt Cobain and his Sister circa (late 80s early 90s)","My grandfather’s beach attire in 1954","My great grandpa in central Vietnam (1940s)","Liv Tyler, 1990s","My grandfather in 1959. 101st Airborne Infantry, Screaming Eagles.","My Parents, 1975, 2 years before I was born","My grandparents before they were married, sometime in the 40s.","my aunt with her dog in 1989","This is my Grandma from 1955 wearing a dress my grandfather brought back from Korea.","24 year old Paul McCartney mobbed by fans. 1966.","Turing Award-winning computer scientist and statistician Judea Pearl in 1953","Carrie Fisher done up as a playboy bunny with Hugh Hefner on an episode of \"Laverne &amp; Shirley\" in 1982.","Kaiser Wilhelm II in exile in Doorn, Netherlands with his 2nd wife and daughter (1931)","My grandfather playing the accordion with his band in the East End of London, 1950s","My brother and I rocking the 70s threads (1978).","It’s my birthday! Here’s a photo of me with my aunt, brother and cousins back in the early 90s. I’m the one in the yellow dress.","John Frusciante &amp; Anthony Kiedis of the Red Hot Chili Peppers on stage during the Mother's Milk tour (1989)","My great uncle in the late 1800s","I really thought I was going to be able to live underwater with this gear (circa late 1990s-early 2000s)","Kurt Russell 1966 in a Disney film called Follow Me, Boys!","1863 My great-great-great grandfather looking like a badass.","Hunter Thompson and his 'attorney' Oscar Acosta, circa late 60s.","Howlin' Wolf and Muddy Waters relaxing and having a beer together circa 1960","California Piano Supply Company [1930s]","1995 I was getting a head start on my college days.","My sister and I, North Conway, NH. Circa 1992","Installing the forest floor exhibit at the American Museum of Natural History, New York City, 1958","Martin, American socialist. Around 1968","My mom at a costume party - 1984","My great uncle during his time in the Greek Army with my great aunt and great grandmother. Mid-early 1950’s.","Mom Unearthed These Old Photos Of My Grandparents (circa 1940s)","1915 My grandfather, great grandfather, two great great grandfathers, and great great great grandfather (civil war vet)","Bob Ross an Airman in the US Air force, early 1960s","Steve Jobs and Steve Wozniak with the Apple-1 computer, Apple's first product, April 1976","Alamo Frat Keg-roll (1986) San Antonio, TX","Honey Comb \"You Never Know What You'll Imagine\" Commercial (1985)","My dad (with the camera) and my grandparents on their trip to East Berlin. (1979)","Marilyn Monroe posing for The Seven Year Itch, 1955","My brother and me (1990)","My great grandpa, 1930s enjoying a pint like a boss on the stairs of his job in West New York, NJ","Ian McKellan, 1960s","1965:This is a Telegram my grandparents received for their wedding. \"As holy happiness unites you, holier happiness may lead you\"","My mother and grandmother in the mid 60s compared to them a few years prior... (USSR)","That’s me, rocking a fedora circa 1957. An original hipster.","Elizabeth Taylor, 1951","My home town in 1928","Vespa girl, end of 1960's","Sophia Loren photographed by Alfred Eisenstaedt, 1961.","My Parents, 1974, the year they were married.","My Grandmother (1940s)","1994, my beautiful mother in all of her permed glory. I'm the baby in the photo.","Luckily Grams passed on those gams! 1951","My uncle back in the early 90s/late 80s, he got a dad bod now","Nothing says comfortable like a 2 yr old in a suit! 1989 year of the mullet","1981 Pac-Man. Video is of myself. 80’s Full video in comments","Sylvester Stallone 1951 at the age of 5","Surprises during exploration of Africa [1860]","Girl on the tram, USSR, 1962","My grandparents getting married in 1944","Dolley Madison ~ 1848. Really old school. I had no idea a photo existed of her.","A sausage eating contest in Munich, Germany, November 19, 1952","Joey Ramone Finding the first Ramones record in store at the time of release, 1976","My Great-Great Grandma and Grandpa somewhere around the 1940s or 1950s.","My grandpa, in the middle, with his brothers in the 1940s. They all worked the family farm in Nebraska. He’s the only surviving child of 11.","My Great-uncle Buck as the Incredible Hulk (late 1960s)","The wedding of my great grandparents, Cyprus, 1932","Construction of the Lincoln Memorial, 1914-1922.","My Dads Passport Photo late 70s - The Stache is on Point","My friends Grandpa when he was 15.","Ernest Hemingway kicking a can of beer, 1959","1981 - Father and Son and Space","My Grandfather - Czech Army circa 1945","My Grandpa in the 2RAR sniper section during the Korean war on hill 159 testing an experimental night vision scope 1952/1953","My Grandfather's deployment to Antarctica on an icebreaker in the early '60s.","My grandmother’s “glamor shot” from the 1940/1950s.","My Mexi-Irish family at my aunt’s wedding. This is how you did 1974. My parents are on the far left.","My grandma back in 1994 outside a porno shop/peepshow in Holland","My great-uncle Jimmy of the Seaforth Highlanders, early 1940s","Surfing, Kirra, 1963.","My maternal grandmother. Sometime in the late 40s/early 50s.","My grandfather (left) and his band “The Kids” New Years Eve 1985","Former heavyweight boxing champion Joe Louis making his professional wrestling debut, March 16, 1956","Nice shoes, nice car and dark shades! My Dad. Circa 1990.","Henry Behrens, the smallest man in the world dances with his pet cat in the doorway of his Worthing home, 1956.","Stevie Ray Vaughan, performing live, (late 1980’s)","My great grandfather during the Vietnam war. Circa 1970","My Dad’s family in the 70’s","My grandpa working as a customs officer, Cyprus, 1953","Shannon Hoon and Chris Farley, circa 1993.","My grandparents on their wedding day in 1967. 51 years ago today!","Only existing photo of my nana (1860s)","Diana Rigg - Mrs Peel in the 1960s show The Avengers","Katharine Hepburn photographed in her driveway by John Bryson, 1985","Maggie Smith (1960)","My dad rocking a pretty awesome clean shaved look. Mumbai - late 80s","Diane Sawyer, 1960s","My cool Dad. Early 70’s bowling beast. RIP 1939-1996","halloween A Vaudeville performance based on the old English ballad “Death and the Lady”. Photographed by Joseph Hall, 1906","My Aunt and cousins (Caribbean island, 90s)","My Dad being your typical nerdy southern California surfer c. 1979","US &amp; USSR Sailors in Alaska celebrating VJ Day/End of WW2. Taken on 14-August-1945","The Taylor Sybron thermometer my parents gave me when I moved that still works circa 1970","My Grandpa in Kraków Poland during the 80s walking his dog.","Waylon Jennings and Charley Pride with his kids, 70s","Professional wrestler, Gene Kiniski aka \"Canada's Greatest Athlete\" (1971)","Boating With The Kids, 1969.","Not sure if this qualifies but here is a lunchbox from the 1960s","My grandma, who‘s now struggling against 2 cancers, in her shiny days (1973)","My grandparents looking fresh in the 50s.","My mother in law (2nd from left) reading, 1930s, Glens Falls, NY. She's still alive!","Papaw Jack doing a well done cool guy pose (probably to impress my very beautiful grandmother) -circa 1970 Southeastern Kentucky","Grand Bend, Ontario - 1951","My uncle with his niece(right) and sister in law(left) at an amusement park in 1980","Homey D. Clown, Damon Wayne's, 1990","My dad and the other lifeguards on Fire Island, mid-1970s","This pic of my great-great-great grandparents in 1861 is in the Library of Congress. Story in comments.","My great grandfather before being shipped off to France in 1917. His name was Acle, he went by Ace.","My grandpa's theory of golf talked about in the Boston Herald (1950)","My maternal grandparents looking very much in love. Last days of WW2","My top three favorite things in 1985? 1) My dog. 2) My dog. 3) Overalls.","Gillian Anderson and David Duchovny on the X-Files set, mid 90s","The cast of Cheers on the tonight show after the finale, 1993","George Burns and Gracie Allen, 1930s","Johnny Depp 1973","A bear that threatened the livelihood of many ranchers, on my grandfathers late 70’s VW Beetle","My grandma sent this to her family when she got engaged to my grandad (Feb/1967)","My Uncles softball team the “Nads” found this when helping my Aunt pack up her place to move cross country! (~1980?)","Dad and his army buddies stationed @ Fort Darby, Italy. [1991]","Keanu Reeves / River’s Edge (1986)","These cool band uniforms from 1939. Glens Falls,NY","Post WW2 Certificate of Appreciation to my Grandpa circa 1947. Signed by Henry \"Hap\" Arnold!","Rue McClanahan and Betty White on the set of Golden Palace, 1993","Painting of my Father when he was stationed in Germany in the 70s","Fire Marshall Bill, Jim Carey, 1990","A young Isabelle Huppert, 1970s","Berlin Wall coming down, 1989","Alicia Silverstone, 1990s","Sigourney Weaver \"Reebok X Aliens\" cross promotion ad, 1986","Frank 'Cannonball' Richards taking a 49kg (104lb) cannonball straight to his belly. (somewhere in the 30's)","Canadian $1 bill from 1973, on the front is a portrait of Queen Elizabeth II and on the back is a picture of Parliament Hill from across the Ottawa River, with log driving activities taking place on the water","John McCain with his squadron, 1965","Post Magazine 1963","Ladies and Gents, I give you the culmination of a decade (1999)","The Rich Man Transported to Hell 1554","My dad looky cooler than ever in early 70s","Kiki de Montparnasse, by Man Ray (1920)","Marilyn Monroe Drawing A Heart In The Sand 1946","My father playing pond hockey in Massachusetts. 1980","Found this \"drinking ID\" going through my mom's old purses. Pennsylvania Liquor Control Board. 1963. A couple months shy of turning 22. Love the glasses.","Found these old promo pics from the funk/soul/disco bands my dad played in during the 70's and thought you all might enjoy!","Still glamorous at 90","My great grandma and her dog Pico returning to the US from a vacation in Greece in the 1950s","My great grandmother (right) and her sister with their dogs in 1915.","Vietnam’s last empress consort - Empress Nam Phương (14 December 1914 – 16 September 1963)","Red Radio 1985","Moe Howard and Larry Fine of The Three Stooges, 1973","Carrie Fisher hanging out with Ringo Starr and John Ritter (1978)","Walt Whitman 1887","The Beatles and Muhammad Ali, 1960s","Another of my uncle's pictures of people in and around Hong Kong in 1961, converted from Kodachrome slide.","found a picture from the 1950s with my step grandpa in the background!","Cameron Diaz at Cannes Film Festival , 1990s","Stefan Lorant “Our Lily and Arum Lily” 1937","My grandpa (far right) drinking with some buddies in the marines ~1950s","My grandfather in 1947","They're on a Mission from God, 1980","Finnish F1 driver Keke Rosberg at the 1982 Dutch Grand Prix","Dick Trickle, 1987","My grandfather looking cool on top of a chair with his mother (left) and godmother (right). Portugal late 20's","A diner in Nevsehir/Turkey, 1970s","My grandfather on left. “ Pretty sharp,eh?” (1945)","My uncle and his boat, I'm guessing late 50s here.","My Grandfather riding on a horse. Late 60s","My dad in San Francisco circa 1953.","Eating rice in China. 1904.","Baby Wolf Blizter while living in Germany in the 1940s","Pam Dawber and Robin Williams, 1978","Lambretta vs. Vespa 1964","Estelline Pike demonstrating her sword swallowing technique to children at Ward Hall's World of Wonders Sideshow in 1961","Alicia Silverstone by Peggy Sirota for Rolling Stone, 1990s","1952 - My great grandfather (right) and his brother at the beach in Durban, South Africa","My grandparents on their wedding day in the late 1950s.","My gram the old school model ‘37","Raise the Titanic, great book not so great movie, 1980","Carl Weathers BBQ Advice | Action Jackson (1988)","Clint Eastwood in the 60s","My dad (far left) and his bent Mini after a friend rolled it at Harewood Acres around 1968/69.","Piasecki VZ-8 Airgeep prototype being operated by the U.S. Army around 1961","My Pops crushing at lacrosse in University (1970s)","Kim Basinger, 1980's","Michale J Fox in Back To The Future (1985)","My great great great great grandparents at their Missouri homestead, circa early 1900s. They came to Missouri by covered wagon in 1880 from Indiana in a trip that took them 30 days.","Henryk and Józefa Ożóg. The Polish Couple that helped save my Great-Grandparents and my infant Grandfather during the Holocaust. 1940s. http://db.yadvashem.org/righteous/family.html?language=en&amp;itemId=6952137","Sylvester Stallone on the set of Rambo III (1988)","My grandma in the early 70’s","My dads wrestling team in 89’","Finally visited the North Bay cenotaph, erected in 1922, with my grampy’s name on the survivors plaques!","Sylvie Vartan and Françoise Hardy, 1963","On this day in 1969, Elvis famously lost his cool and started laughing during a performance of “Are you lonesome tonight” because he spotted a gentleman in the audience remove his toupee and start swaying to the music.","A police officer stops traffic so that a mother cat can cross a street with her kitten. NYC, 1920s.","My grandpa looking extra handsome rockin the unibrow. 1950's Tehran, Iran.","My grandfather, 1930s","Jason Statham, member of the UK National dive team, 1987","Theodore Roosevelt was shot mid-speech in an assassination attempt in 1912: he proceeded to continue his speech and compared himself to a bull moose while he was at it.","My Grandpa &amp; Dad on the family 1967 Chevelle SS. [1976]","Meryl Streep, 1970's","My great grandfather in the 1960’s wearing a leather jacket","The great Robin Williams, circa 1980","Found a box in the attic... my great grandfather and grandmother’s engagement photo in the 1930’s.","Rate my battlestation (1990s)","Grandparents back in the early 50's","Harry Houdini jumping off the Harvard Bridge into the Charles River while chained and manacled, Cambridge, Massachusetts, April 30, 1908","1967 Mercedes 250s","GFs grandma and her dog. Ca 1950","Americans thanking Canada for rescuing American diplomats in Iran, 1979","That night in '72 in Syracuse, NY when a hockey referee punched a player, then the goalie choked the referee","Tunisia, around 1970. 49 students in the class of my father (left) and 2 other teachers.","United States President Calvin Coolidge in a Sioux headdress after being officially adopted into the Lakota nation, c. 1927","My parents at my mom's graduation from FIT, 1992","My Grandpa mid 60s after winning a boxfight","Today is my grandparent's 60 anniversary! Here's a picture of them shortly after their honeymoon in 1958.","Jon Cryer on the set of Superman IV (1987)","David Bowie and Elizabeth Taylor, photograph by Terry O'Neill, 1974","My third great aunt [far left] and family traveling home from the World Fair, abt June 1915","Beetlejuice (1988)","My grandparents on their wedding day, exactly 60 years ago [1958]","My italian grandfather in 1962 (He was 16)","Jack Nicholson and Faye Dunaway in Chinatown, 1974","My dad at the Chicken Ranch outside of Vegas, 1985","Marshall Thomas Fleming, some distant cousin who has either vampirism or has seen some shit. This image is from the 1800s.","Frida Kahlo at 32, in her garden with an Olmec figurine. Coyoacán 1939","George Washington Carver with Staff, 1906","As a teen in the 1940’s Mom had style","Mariya Takeuchi and Tatsuro Yamashita at their wedding, 1982","My mom looking on trend in 1989","My Mom 16, sitting on a fence [1973]","My great great uncle, 1940s.","John McCain, 1973","Rare photo of Gia Carangi 1970s","Beauty Show [1922]","sailor with a dog in a torpedo tube, 1940s-ish","Bugle Boy commercial with an incredibly 80s dark alley dance routine (1984)","Bryn Mawr College girls waiting for the train in 1957","My dad in the 50s (I'm guessing). Today would have been his 91st birthday.","My great grandfather in 1969, on his 112th birthday.","Nancy Wilson, 1970s","Just celebrated my Nana’s 90th birthday, found this picture of her circa 1950","Willie Nelson early 1960s","Mike Tyson and a tiger 1996","Grandpa brought his city slicker bride back to the family farm for a visit sometime in the late 1930s","Back to the Future 1985","My Grandpa and great uncles and aunt in 1937. Aunt Gladys turns 100 in a few weeks. She would love some birthday comments from around the world as a gift. During WWII she was in the navy and the rest were in the army for England.","Bob Ross Air Force Portrait in 1963","My grandfather posing with a plane in 1945. My grandmother’s name was Joyce.","Virginia Bell, 1950s","My Abuela Mima &amp; My Abuelo Alberto , Maternal Grandparents on their wedding day in 1953 Grandma was 17 and Grandfather was 25","Okay who else’s parents bought them a car known for blowing up when hit lol! 1st car - 1977 - The Pinto","My Grandpa and his daughters (my mom is holding my sister) 1986","Vogue Italia 1991","My dad (left) and uncle looking sharp, 1969","Stella Stevens, 1960s","My great, great grandpa (middle back row) and his siblings. Norway - 1914","My grand parents on their first holiday together, aged 16&amp;18. 1962.","Keith Moon, the drummer for The Who, posing with the frame he put around a champagne bottle stuck in the wall after he had thrown it at his wife and missed, 1968","My dad and his schoolmates, San Luis Potosí, Mexico, circa 1975","Roberta McCain in 1961. She’s still alive today at 106.","My dad, on the left, December 1960. Just found some photos cleaning up his old house.","My Uncle with Muhammad Ali in the 1970-1980s (New York City).","Old School Aww, me and a baby goat 40 years ago.","My son at his baptism in 1990. Looking like a Mini Cartel Boss. What was I thinking? LOL","John Lennon in 1967","My grandpa in the Navy around 1955","My mother sitting on a railing [1973]","This yearbook quote from 1913.","Richard Pryor, 1960s","Shane McGowan &amp; Victoria Clarke. Soho, London. (1991)","My dad channeling John Lennon while playing music (1970s)","Blond &amp; Red, Anna Nicole Smith , 1990s","This dope magazine ad for a PDA in 1990","Phil Collins beyerdynamic microphones magazine ad, circa 1980's","John McCain III in 1936 as a baby with his father Admiral John McCain Jr. and grandfather Admiral John McCain Sr. Coco Solo, Canal Zone, Panamá.","Count Basie and Frank Sinatra, 1965","McCain, colored, 1965","Terrified of the first fish I ever caught. 1992.","Barbra Streisand and son Jason Gould on the set of \"Hello Dolly\" (1969)","My grandpa, taking a photo with local kids in Algeria during WWII (1942)","Beastie Boys 1982","My dad in the early 80's. He still has that jacket laying around somewhere","My husband at 10 years old in 1971 rocking the giant shirt collar.","Keith David in 1980s","Morrissey, 1980s.","My dad 3rd from left front row Butler county Ohio around 1938","Dad &amp; Uncle in mid 80’s","Anita Ventura, 1963","My mom her stepdad and my dad sometime in the late 70’s","Stan Lee, Spider-Man and The Green Goblin demonstrating \"Spider-Man\" for the Atari 2600 (1982)","Siouxsie Sioux, 1979","My Grandma with a new Record (1968)","My Mom and Dad looking like Jackie and Hyde mid/late 70's before Prom. They are still together.","Found a huge stack of old pics at my Grandparents. This is a few of them from when my grandma worked/ran a grocery store.. Have no idea when these were taken... late 50’s maybe?","My aunts and uncles 1 week before the DNC protests in 1968","After a winning day at the Tennessee State Fair, Guy, Susanna and Townes at Jim McGuire’s studio, circa 1975.","Colonel A. Castellano as commandant of cadets at the New York Military Academy in 1978 smoking a cig in the hallway.","My Grandfather (far right) and his platoon mates. Kimpo Air Field, South Korea (1952).","My great great grandfather in 1914, Russia","My grandmother late 1920's","Right to left. Me, my mother, my grandmother, my great grandmother and my great great grandmother. Taken in 1997.","My parents in the early 70's walking out of Artis (A zoo in Amsterdam)","1965 - hanging with the COOL scouts","Father and son, 135 NASA shuttle launches apart","Looking at a slideshow on my grandpas projector. Malaysia, Circa 1970","John McCain (1965)","Raquel Welch 1,000,000 years B.C. (1966)","My friend's grandpa (far right) and his three brothers in a Milwaukee bar - 1928","My dad (sitting in my grandfather's lap) Kyles Ohio 1933","My mom in the mid 1950's with her family.","My great grandfather and his badass hair. Likely 1910-1920.","My grandfather next to the first (beautiful) bus of his upstarting coaching company. So stylish! [~1955]","Kate Moss photographed by Denzil McNeelance, 1993","My first attempt at recoloring a photograph. World War I, 1915, Germany.","Easy Company 1945","50 years ago today, this masterpiece was recorded","My dad and friends on the Colorado River at Blythe, 80's","Adam West as Batman riding an elephant - 1967","Dustin Hoffman and Faye Dunaway in Little Big Man directed by Arthur Penn, 1970","My great great Great Grandparents in the late 1800s. I hope you all think it's as cool as I do.","My wife, 1995","My girlfriends dad, circa 1980’s I think, Florence.","What we're dealing with here is a complete lack of respect for the law, 1977","Old school Cuban grandfather (Front with the top hat) back in 1942 Havana.","My great grandfather right before he went to radar school during wwii","John McCain (1973)","It's the Ham Show! My wife's uncle, 1961","My grandfather circa 1950.","Beautiful Mexican girl, 1931","Found my parents Christmas card from 1975. I'm the toddler.","My 2x Great-Grandma 1900’s.","The first Aldi store. Essen, Germany, 1930","My cousin and her parents, 1979","Just getting ready for bed 1966 , but had to try on our new shoes 👠 lol!","Father daughter 1981","My grandpa was a captain for Lufthansa after WW2. Here he is posing for a postcard","American soldier and Vietnam prisoner of war John McCain sits on a sofa during an interview, about a month after he had been released and returned from Vietnam, on April 24, 1973","My uncle Dan circa 1983. He's the long haired dude.","Anyone know what year he actually ate the rice? Man eating rice sometime in the 1900s.","Barbra Streisand, 1950s","1965 my Grandma throwing up the deuces in Miami. She’s 89 today","My grandpa firing mortars in Korea during WWII","1981. My dad's class photo from 6th grade. He is the 2nd child in from the left in the 2nd row.","My Great-grandfather's Family c. 1925, central India. He is the one seated on the far right center row. The man with the gun is his bodyguard. My grandfather wasn't yet born.","My parents when they first got together. Mid 80's","Dancer Anna Pavlova in a traditional Russian costume, 1909","My grandparents at their wedding day in Aydin-Burhaniye, Turkey, ca. 1946/1947","20 years ago my high school class won a mullet photo competition. Prague, Czech republic.","1952 - My great grandmother at the beach in Durban, South Africa.","An old Sorry board game that was already pretty old school back when my dad handed it down to me in the early 90’s. Box is dated 1972.","Circus performer Miss Victorina swallowing 10 swords, ca. 1890","“I am not sick, I am broken. But I am happy to be alive as long as I can paint.” -Frida Kahlo 1950","Old School Street wear,1943","my Great-Grandfather (middle row, third from left) and his guys felling giant redwoods nineteen-teens or early 20's.","My grandma after winning a drag race with her corvette,1970.","Wrestling at the Scottish Highland Games, Sept. 5, 1929","Girl of the year contest. Czechoslovakia, 1968.","The first ever Aldi store, Essen, Germany, 1930","Joyce Bulifant, original choice to play Carol Brady in the Brady Bunch, late 1960s","My 17yo dad in 1949, 18 months before becoming a Marine wounded in combat in Korea","Only Michael Jackson could pull off something like this [1980s]","Pakistan's new Prime Minister, Imran Khan, somewhere in the 1980's","The Original Neckbeard, Nathan Smith Davis, 1890's","Dad on duty- September 1985","Jennifer Jason Leigh in ‘Fast Times at Ridgemont High’ (1982)","I found this friendship book from 1934 in my grandmas stuff. Would love for someone to help me decipher old german cursive...","Wolf hat dude (1980’s)","Kate Winslet, 1993","My Liverpudlian Dad age 19 in 1969, in the Norwegian Merchant Navy.","Essential 90's Garb (1993)","Dad and Mom, early 70's","John McCain in 1965","Elvis Presley and Sammy Davis, Jr. sharing moves (1958)","Young Susan Sarandon, 1960s","Dracula’s Castle, Romania 1920.","Nadia Comaneci 10/10","Grandpa’s 1919 Folsom mugshot","My grandma on her wedding day in 1953","Ice Cube in his senior year of High School (1987).","My grandparents in the 1930's","Anybody know who this is from the 1960s? Found in viewfinder at Country Music Hall of Fame.","Marisa Tomei in My Cousin Vinny (1992)","Protesting the high school dress code that banned slacks for girls, Brooklyn c.1940 [2000x1516]","My mother, about 1935","My blessed mother sometime in the late 1940s early 50s","My great grandfather's friends on his homestead. No date.","Young John McCain. 1960s.","X-Post: 1965 Cool Scouts and Girls","My grandparents, on the day they bought their farm in 1950","John McCain (bottom right), 1965","Just laid my Grandpa to rest. 70 years of romance with my Grandmother!","Skateboard guy in Central Park, 1965","(Technical Dragons) Task Force 1, South Vietnamese special forces with M16a1 M203 -circa 1968","My grandma’s high school graduation photo. 1941","Farrah Fawcett on a Mustang Cobra II, 1976","Members of the Texas Track Club of Abilene lining up for a Sports Illustrated article in 1964","My great grandparents in the 1960's getting ready to celebrate his 112th birthday.","Sen. McCain exercising his right to vote 1982. In his memory exercise YOUR same right this Tuesday August 28, 2018 polls are open 7AM to 7PM.","My Dad on his bike. 70’s","John McCain during his days as a Naval Pilot in the 1960’s.","Another picture of my great grandparents, this one was taken during his 108th birthday in 1964","My gorgeous dad and beautiful mom. 1969 Guayama, Puerto Rico.","A motorcycle jump through fire at the Strathallan Highland Games at Bridge of Allan in Stirlingshire, Scotland, August 8, 1951","POW John Mccain was escorted by a public relations officer to Hanoi’s Gia Lam Airport after the American POWs was released in 1973","The Perils of (my aunt) Pauline (circa 1927)","Bill Withers performs Lean On Me live on Soul Train (1974)","John McCain, 1967.","Per colbycheese2316's request the un scaned photo of my grandmother from the 1920's.","David Bowie &amp; Elizabeth Taylor share a cigarette at George Cukor's house (1975)","Nick Offerman's senior portrait from 1988","The Truth Is Out There , 1990s","Jaclyn Smith, 1970s","RIP Senator McCain - 1965","Võ Nguyên Giáp and Hồ Chí Minh, 1945","Does this sub need new mods? 1900.","My mom, circa 1989. Check out that computer!","Dalí forging a Picasso 1960s","My mom and her twin sister in the mid 80’s.","Suzanne Pleshette, 1970s","My dad in the late 50’s I think. Air Corps Australia. I don’t have many pics of him but love this one.","A US Long Range Reconnaissance Patrol Soldier wearing a Republic of Korea (ROK) Beo Gam camo, He also has rigged a makeshift sling from a rope for his XM177E2 -circa 1968","My father, who joined the army fresh out of high school. 1970's","My grandma (right) on this Ozarks postcard (1950s I think)","Then and then. Hand in hand through their college campus 1953 and 1993.","My dad in 1930","My dad in Middle School in the late 70s or early 80s","My grandpa was the original hipster (1960)","My grandfather in Vietnam, around 1967","My grandfather on his Vespa scooter in late 1950’s Italy","Anjelica Huston, late 1960's","Rest In peace Captain John McCain [March 18, 1978]","[1994] My dad shooting his senior photos at age 16.","My parents on their wedding day in 1977 but especially the style icon behind them.","Private Hendrix, 1961","Three generations in one picture. My grandfather being held by his father while on my great great grandfather’s tobacco farm. (Kentucky, 1938)","My 3 times great grandfather George, 1895 in Massachusetts","My grandparents hiking in the Adirondacks (1986)","My grandfather — 1989","The iconic Woodstock couple, 1969","Grandfather walking grandmother down the aisle in the 40’s","The colours of the 80s","Terence Stamp (Bernadette), Hugo Weaving (Tick), and Guy Pearce (Felicia) in \"The Adventures of Priscilla, Queen of the Desert\" 1994 - Priscilla was the tour bus.","To me this is the definition of Old School Cool, Humphrey Bogart, 1940's.","My grandfather in Germany with his dog, Flip. Late 1940s","If my apt. ever caught on fire, this would be the first posession I'd save: my grandmother with Mohammed Ali. This man had always been her hero (LAX, 1980's).","The Wizard of Oz premiered today on Aug 25, 1939 (79 years ago)","My grandma about to get married in the 1960’s","80’s Ladies Night.","Tourists in Anjuna Goa, India - 1972","Tom Petty, Rick Rubin, and Johnny Cash (1996)","Agnes Lum, 1970s","My Mother in 1963 Rocking that nursing uniform","The Dirty Mac, a one-time supergroup consisting of John Lennon, Eric Clapton, Keith Richards and Mitch Mitchell (1968)","My great uncle Frank Gaeta in Normandy, France 1944","John McCain in 1954 joining the U.S. Naval Academy. RIP American hero.","My Great Grandfather fixing up his boat with a few members of his boating club (1932).","My dad as a bouncer in the 80's","My Grandmother, Patricia’s Senior Photo c.1934 N. Iowa","Groucho Marx introduces Johnny Carson as the new host of The Tonight Show (1960s)","My grandmother excited before a job interview. Early 1940s New York.","Same grandmother but in 1961.","Ed Ames teaches Johnny Carson how to throw a tomahawk 1960's","My mom in the middle with her twin sister, my aunt, uncle and grandfather (1978). She always talked about her “macdaddy” pink panther bike with the banana seat. I finally got to see now I’ll share it with you.","George Peppard, 1950s","German born actress Marlene Dietrich passionately kissing an American soldier as he arrives home from WWII","Mark Hamill with Gary Gnu and puppeteer Jim Martin on the set of The Great Space Coaster. Circa 1983","In case you missed it, my Grandpa is pointing out the nature. 1975","My grandparents in the late 60’s early 70’s.","Võ and Hồ, two Vietnamese rebel leaders working with the OSS to fight the Japanese (1942)","I can only ever hope to have this much swagger. My great grandfather, Romania, 1920s","Don Felder, 1970s","John McCain, Jr and the III (circa 1940)","My great grandfather [Washington, 1930s]","Khyber warrior returns home for a short break between flights - Pakistan around 1950","Stallone, a Lamborghini and Adidas tracksuit is the coolest circa 1980","My dad in Puerto Rico in 1994. He was a father of 3 at this point! Eventually became a father of 7.","Dame Judi Dench, 1968","My mother and grandmother in 1964","King Frederick IX of Denmark (1899-1972)","The North Super Highway (1971) now NLEX (North Luzon Expressway) in the Philippines.","Carrie Fisher (1983) at ABC Entertainment Center in Los Angeles.","The German sex symbol of 1968 Uschi Obermaier and her boyfriend Rainer Langhans","My dad on the way to Prom of '81","My grandpa and his buddy about to make moves with their mini-Millers in the 70s","Great uncle dressed to the nines for the parade, car included. 1922, Spokane USA","My great, Great, GREAT grandfather (born sometime around 1820) rocking an awesome hat and beard.","My 90's crew","Little girl with her dog, Kansas City, Missouri, 1933","My grandpa when he was 18 (1949)","14-year-old Gwen Stefani receiving an autograph from Sting in 1983.","Behind the scene of ‘Rear Window’ circa 1953","My grandparents right after their wedding - Yugoslavia (1965)","Mom and me rocking it back in 88’","The Cavern Club, Liverpool, 1964","A Beautiful Lithograph of Vivien Leigh that is 102/325, signed by the photographer, Laszlo Willinger","Happy Birthday Võ Nguyên Giáp! He would have been 107 today.","My nan and grandad, Rene and Reg. London 1960s.","My grandfather was in a motorcycle gang in Minnesota in the 30’s...","My dad and his new BB gun, 1970's","My madly in love Grandparents, 1931 on Lake Minnetonka.","Magazine Cover (1966)","My grandfather working for Penn ship builders in the 70’s. He always wore those plaid shirts and that grin.","My Great Great grandpa circa 1900, Pyrzyce Prussia.","First generation of my family to make it to the new world. Sometime in the 50's..","My dad in the early 80' in ex Yugoslavia","My dad’s high school graduation picture. 1966 I think.","Steve McQueen as Thomas Crown (1968)","My Dad &amp; Spot. Late '70s, Northumberland.","Don Rickles in the navy, 1944","Khyber Pakistan around 1950s - from Khan family photo album","Red Hot Chili Peppers (1989)","My grandfather in Switzerland, 1950's","Grandfather getting QB notes from his high school coach during a football game. 1950s in SC.","Picture on the right is my grandpa and his brother. My grandpa in the Marines and his brother in the army. Met up in korea new year's day 1950. RIP","My amazing grandparents on their wedding day - August 1958","My dad and two of his brothers with the Corvette in the 1970’s","Parents celebrating 44 years!","My Dad with Coyote Chilling in there Car, 1976","My husband's great-grandmother holding his grandmother and her brother, early 1900s.","My dad in his early 20's... Circa 1945","My wife's dapper Uncle. He was born in 1932 so I'm thinking this picture is from the 1950's.","My grandparents at a wedding sometime in the late 60s or early 70s","Fred Astaire and his dancing shoes, 1950s","My dad and I, ready to bust out some aerobics. Australia, late 80's","V-J Day in Times Square 1945 Original by Alfred Eisenstaedt.","Those were the days! Early 80’s. Pictured from left to right: Cousin Danny, Grandma (Mima), me (wannabe breakdancer), and uncle Jorge with his skinny tie, zipper vest, and cool stache.","My great great uncle Martin Daly in the free state army early 1920s","Nine Inch Nails Trent Reznor @ Lollapalooza 1991","My Grandfather with his horse Thunder in a bar in 1960","My mom and dad defying norms on a date c. 1966","A New York birthday party and a monocle, 1928","1980's Nicolas Cage in an Iron Man T-Shirt.","My grandfather playing sax (left) for Tony Bennett in their regiment band touring Europe, 1945.","The University of Louisville's 1918 dentistry basketball team. Fashion hasn't changed much in basketball.","Joan Jett (and Cherrie Currie?), \"Scott's Bar III\", 1982, by Della Grace","My great grandfather, school principal, 1920s","My grandma and her little brother, 1958.","My great grandmother in Germany, 1945","My dad - early ‘70s","Rowan Atkinson on drums (1980)","My great grandfather in 1902.","Nothing is more timeless than Patrick Swayze in Road House (1989)","Strikers and their children on the picket line in 1941 at the River Rouge Ford plant In Dearborn, Michigan","John McCain arriving at Jacksonville Naval Air Station just released after being a POW for over 5 years, 1973.","My great-grandmother; and my great-grandparents; New Orleans, 1905.","[COLORIZED] Audrey Hepburn. circa 1950. British actress, model, dancer and humanitarian. Recognised as a film and fashion icon.","Michael Jordan with Sam Perkins UNC 1983","My great uncle doing the damn thing around 1930","My Mom in the mid 70's kickin it with some friends","Lucille Ball, 1946","Hawaiian model Agnes Lum, who was popular in Japan in the late 1970s and early 80s. The fictional character Lum Invader from Urusei Yatsura was named after her.","Crete, Greece in the 60's. The mother taking care of the little one, while the other boys play casually with a WWII german Mauser rifle.","Chris Cornell, Jeff Ament, Layne Staley, Matt Dillon and Cameron Crowe on the set of Singles, 1992.","My grandmother on her First Communion, 1947.","My great great great grandfather in the early 1900’s","My Great Grandfather and his 3 sons (1915) England","Debra Harry wearing a hotel shower curtain and red tape (1979)","Jazz singer Annette Hanshaw was gifted with a lovely voice, but enjoyed a rather short career...here is one of her only film appearances in 1933","My Grandmother Annie Lee 1920💜","My favorite picture from my Dads service. It was 1970 something.","A refugee camp restaurant in San Francisco after the Great Earthquake, 1906","My adorable grandparents in the 1950s","YAWNING HERRING RACE 1920s","Dirt track riders showing they have no fear of heights in a flying boat at the Crystal Palace fairground, London, 1929","James Spader (1987) at the premiere of Baby Boom at Lincoln Center.","My grandfather, the cabbage king, May 18th, 1988","My Great Grandpa, 1945","Captain James Stewart with pilots of his squadron in Marrakesh on the way to England. November 1943.","My grandmother and grandfather 1964","Let it Be Documentary - released in 1970","Jim Henson and his Muppets in the 1980s"]