["/r/TwoXChromosomes is looking for new moderators","I'm Carol, and after losing my first daughter to a cord accident during labor in 2003 I went on to found Empty Arms Bereavement Support, a community based non-profit that helps other families who have experienced the loss of a baby. AMA!","My baby is going to die from a chromosome abnormality, and my doctors are making me carry her.","I just had a guy call out a \"girl code\" violation and found it very sweet.","NOT homeless anymore","My husband died today.","I pay $400/month for health insurance and I still have to pay $75 copay to see my OB/GYN because they’re specialists","eye opening conversation with my teen","Lost my virginity last night","A female tennis player receives a code violation for removing her shirt to turn it around. Male players are allowed to remove their shirts without penalty. In addition, media feels the need to bring attention to the issue with a sexist article title.","BEWARE the tulip cup and the company behind.","I've told my boyfriend that what he's doing isn't pleasurable, but he won't listen","Having a friend of the opposite sex does NOT mean it's only for sexual purposes!","I don’t really know what to do.","The heartwarming period bandwagon","\"employees\"","You people are amazing","At work I got laughed at because I'm careful when I drink alcoholic beverages.","Skirts in the wind suck","Is the change to blame?","Do women lose respect and attraction for men who tend for a womans every need","Handmaid’s Tale author Margaret Atwood: ‘Things can change a lot faster than you think’","BV clearing up?","Best product for very dry skin?","Waking up early for work could quite literally be killing you","If you feel unlovable tonight, this post is for you.","Why are my periods like this?","Anyone have good ways to get away from home for a high schooler?","Period mood swings make me a bitch.","Scotland provides free tampons/pads to all students","The Many Roles of Women in War: Sniper, Pilot, Death Camp Guard","Constant remarks on my appearance/health","Double fault / standards for women at US Open!!","Menstrual cramps be gone!!","Any other spouses of doctors?","Rental Agreement between Exes","Boy stabs girl at school assembly up to 11 times after she rejected his advances. This is what happens when boys aren't taught that they are not entitled to the affection or attention of a female.","Indonesia: rape victim wins release from abortion jail sentence","Coding Like a Girl (a cool interactive package about women who code and gender inequality in the tech world)","Makeup Rant","A comedian who admitted to sexual misconduct seems to think it’s time for his comeback.","I don’t come here often but.. 4 years ago today I found out I was pregnant.","Because women are masters at multitasking","I’m sick of comparing myself to other women","Gynecologist visit quoted for $6500, and will not be covered, need advice on options to get it covered","Separation anxiety when away from boyfriend","Update on the got raped last night by a coworker story - i decided to press charges and the medical exam proved it was rape","Found a huge stash of revenge &amp; spy cam porn on a website. Is there anything I can do to take them down?","Does anyone cut their own hair, and can share tips or good videos?","Continuous use of birth control, thoughts?","Custom size jeans for women, any recommendations? (UK)","My best friend attended my first Well Woman exam with me today! It was amazing to feel so supported!","Dismissed by doctor","Uncomfortable Around Male Classmate","Might end up without a uterus this week, what should I know","I Just Need The Strength To Leave","Update on coworker story - got PEP from the hospital and the rapist has been suspended from work!","Baylor University \"infiltrated\" campus sexual assault support groups","Intimacy ruined someone's life and I feel terrible","My BF doesn’t really respond when I talk to him. He is either silent and literally doesn’t respond at all (on phone), or grunts, or says a quick response super quietly and I can’t even hear him. It makes me feel like a looser. Can I do something or say something to change this?","My boyfriend is a bit depressed. What to do?","Not sure what to think?","Was possibly raped (see post history) and I lost a \"friend\" over it. And talked to my therapist.","How do you get over someone you love?","Period positivity","ASA finds Natural Cycles app not as accurate as claimed in UK advertising (but not dismissed as totally useless)","UTI\\BV\\yeast drama","In 1961, her calculations put the first American in space. Today, Katherine Johnson is celebrating her 100th birthday","Not sure if this can go here.. But I experienced my first breakup a couple months ago. Thought I was over him, and last night a song made me lose it and realize I'm not over him at all. What do I do?","Will Charges Against Asia Argento, Gretchen Carlson Stop Survivors From Coming Forward?","Two Women Describe Louis C.K.’s ‘Uncomfortable’ Comedy Cellar Set","No libido at all","(yeast infection?) Test results came back negative, twice, but still experiencing symptoms","Feeling pressured","Crazy gender imbalance in my workplace in leadership positions","Middle of breaking up, possibly...","Beginning to process my roadside assault/attempted abduction from yesterday."]