["Beyond Launch","[D2] Daily Reset Thread [2018-08-29]","Bungie, can you change everything over to the new dark menu?","Destiny 2 is September's Playstation Plus free game and it's available NOW!","Destiny 2 Sandbox update - FAQs, Returning Player Guide and Forsaken Info","The Old Infusion System Returns.","Massive Breakdown Weapon Stats Spreadsheet has been UPDATED for 2.0.0! Includes Times-to-Kill (with a new Calculator that can take into account Resiliency Levels and Damage/RoF altering perk effects), and other relevant stats!","With Random Rolls returning, I'd just like to remind everyone that r/sharditkeepit is a thing","Bungie, can we please remove the glimmer cap once and for all?","Petition: Make Randal the Vandal one of the Wanted bosses","Bungie making our behaviours as Guardians canon yet again in new Forsaken lore","I'm not sure if the current weapons system was a summit idea or was generated internally, but whoever came up with it and green-lit it deserves major kudos.","WHERETHEF&amp;*#ISXUR?","Sunshot Indirect Nerf from the Explosive Payload Nerf","Mass shader deletion at the cryptarch is somewhat a failure - a few suggestions","Download the Destiny 2 PS plus version even if you have the retail copy","Apparently the Area behind the Ramen shop in the tower is now a Gambit area?","If you don’t know already the minibosses that spawn during a public event on a flashpoint drop about 12 planetary materials","The new Transversive Steps are AMAZING! A Single Blink jump will reload all 3 of my weapons.","Overcharged Sturm + Empowering Rift = The Legendary One Tap","Ultimate Forsaken Spoilers, do not open unless you're a glutton for punishment!","We need big maps back in crucible!","A good way to reintroduce an old exotic: a Nascent dawn quest for No Land Beyond from Devrim.","Fighting Lion is currently extremely powerful in PvE. It's doing Power level damage as a primary.","Blessing of Light and Defensive Strike are still bugged from Destiny 1","To all of you LOVING the new meta...","Just got this bounty from dismantling a forsaken armor piece?","Since planetary mats are going to be important for infusing now, maybe we could get that stupid timer that stops us from getting materials from chests to go away?","Antaeus Wards Lore may reveal the forms of the Nine!","SBMM back on in QP","New Orpheus Rig Videos","I want failsafe to acknowledge caydes death","Coldheart and Prometheus lens count as fusion rifles for this week's prestige raid lairs","Petition: Move \"The Traveler\" back to the middle, not Earth!","I did some testing, and it looks like high impact scouts took a significant PvE nerf following yesterday's patch. Bungie, is this a bug or an intended balancing change?","Damn it feels good to return to the Voop Life","After deleting thousands of shaders.. I noticed Master Rahool only swipes to the right.","Big Issue with Armor Infusing Regarding DLCs","Thanks Bungie. For real.","PSN + Destiny 2 FAQ","I love how stupid it looks seeing my Titan holding a sniper with one single arm. Absolute unit.","What is this feeling, in the crucible? It's new.","Crucible felt so much better I could cry","Raiden Flux stealth nerf?","Tethering a strike boss by themselves gives 25-30% of your super back with the orpheus rig","My new armor seems designed for Nicki Minaj..","Do NOT infuse Forsaken weapons into year 1 weapons!","The new crucible meta is bad","The New Loading Screen is Annoying","Bring Back Rift, Please Bungo, for the Kids","Sleeper Simulant now has 3 shots in the magazine","[Spoiler] Triumph Challenges","Celestial Nighthawk isn't giving super back on kills if the enemy is shielded","For those noticing possible reimplimentation of SBMM in quickplay, they're looking into it acc. to dmg04","If you really hate shotguns in Crucible, stop using them!","The First Thing Our Guardian Says Should Be \"Wait, Have I Been On Mute This Whole Time?\"","Level 500 wizard ruined me.","Some advice on dealing with shotgun users","So from yesterdays Letters from Cayde post..","Since we are getting Titles in Forsaken, there should be a Title \"Iron Lord\" for those who played the Rise of Iron","Three of Coins being retired","[Spoiler] Joker's Wild is going to be very interesting.","Dismantled Forsaken Gear and got this","[SPOILERS] - The Drifter's Lore Described What The Darkness Is","The hardest thing about update 2.0 is getting used to only tapping the switch weapons button instead of holding it to get to your sniper","The next TWaB better be called Before-saken","Since he left us earlier then expected i made a Low Poly Portrait of Cayde-6","Sleeper's damage possibly received an overall buff, not a nerf","Dragons Shadow Nerfed Indirectly with Marksman's dodge Buff","Let’s at least wait until next week to start if you’re going to complain about things with Forsaken","If you ever want to play Prestige Eater of Worlds or Spire of Stars, do so this week. The Arsenal modifier is amazing with the new weapon system.","I now realize I enjoy Fusion Rifles thanks to the weapon slot updates","Destiny 2 Weapons Time to Kill Spreadsheet updated for Forsaken DLC. Might help if you're looking for weapon balance changes as well!","Reset-timers in Forsaken","Ouch, way too soon Bungie :(","Rockets now get 2 ammo per heavy brick.","One of the best changes I've seen is engrams that drop from enemies not needing to be decrypted","With the new Title system coming can we get a Thantonaut title if we kill ourselves enough times?","Possible new Eververse items, according to DestinySets [SPOILERS]","So Arcstrider with raiden-flux got nerfed ?","Forsaken launch trailer.","Sturm can One-Shot now, if Overcharged &amp; combined with an Empowering Rift","DAILY THREAD - RANT WEDNESDAY","Skull of Dire Ahamkara is really good, like really really good now","Anyone having a camera glitch out after they die?","Three of Coins will cease to exist after the launch of Forsaken","I made a speedpaint of my hunter taking a selfie with Cayde.","Prospector got nerfed from 8 rounds pickup to 4 in crucible","People of the subreddit who never played D1, how do you like the weapon slot changes?","How great would it be if The Last Word comes back and the flavor text is, “How’s your sister?” - Cayde 6","Instead of putting Special Events in the Tower, Put them in the farm!","So I just got a Forsaken SMG from Mars flashpoint reward...","Yesterday was the most fun I’ve had since Rise of Iron.","Do you have long matchmaking times in PvP?","Tracking your flashpoint from the planetary map will allow you to see your progress directly on your screen","[Spoiler]Loving the new animal themed titan armor in Forsaken","Imagine being at the reciveing end of this hammer...","The newly buffed Skull of Ahamkara in action!","[Spoiler] Taox, is that you?","Hand cannon recoil has been increased on PC","Quick way to tell if it’s primary or secondary.","Is anyone else not able to find games right now in the crucible? It seems as though it will never loaf past evaluating guardians all night for me.","Cool shot I hit on KingGothalion","MAJOR FORSAKEN SPOILERS (DO NOT OPEN IF YOU WANT TO WAIT FOR LORE)","Telesto got a Buff","Funny thought: How would our Guardians react to the new weapon slot changes?","Destiny 2 Update 2.0","This feels like D1 PvP but with the ammo economy fixed!","I’m so glad the bug that allowed us to get Forsaken gear early happened","Please stop putting spoilers in the titles, mobile users can still see them.","GG Bungie. Today has been super dope.","Just ran 3 Snipers in a strike","Ace of Spades poster","Spoliers! The History of the Awoken","Telesto reloads itself with multikills now.","Graphics Improvments","Most \"Friendly\" LFG for those with Social anxiety?","Telesto can destroy the vents on the cabal injection rig event even if they're closed","they did it.. I wasn't sure they could but God as my witness I am in love with destiny again.","You can stop going on at length about why you're not coming back.","Fanart of a Certain Hunter Vanguard","[Spoiler] Let's talk about what we now know about the Darkness, and potential gameplay aspects.","Alpha Umi Ship Model Broken","D1 Veteran Emblems on PC Unlocked","I just spent 15 minutes \"evaluating guardians\" for a casual pvp game, only to load solo against a 6 stack.","Benedict is selling Midnight Coup right now. Consider picking it up if you don’t have it already.","Joe Blackburn on the new raid revive mechanics","PETRA VENJ EYES ONLY//AMETHYST PROTOCOL","Whisper of the Worm got a BUFF, not a Nerf","The Bubble is Back","I can finally look more like saint 14 holding his shotgun!","All forsaken exotics (SPOILERS)","I knew Russia's new exo-skeleton looked familiar...","This is every new Item - Weapons, Armours, Ghosts, everything else - in today's API update","With Forsaken, Resets will happen every 4 days for some activities...perhaps this week as well?","Xbox Forsaken Pre-order Links","Hero Moments are back in the raid!","Trace Rifles in Crucible...yikes.","Zavala Read Shakespeare","Ikora gained some respect from me","Full Super Regen with Skull of Dire Ahamkara. Madness.","Walking around with a fully charged Chaos Accelerant grenade makes me feel like a badass.","“Blah Blah Blah.... killed by a shotgun in crucible... can we go back to team lane shooting with Graviton? Much more balanced and exciting”","Sturm and Drang Need A Complete Rework Becuase of This Patch","Pizza Party at the Prison of Elders!!","Destiny 1 Orbit Music is Back","H e r o M o m e n t s","The Calus/Leviathan Storyline will continue in Penumbra","With Nezarec's Sin (and Masterworks), a Voidwalker can generate a full nova bomb in 60 seconds.","High Impact Reserves - post patch 2.0. It stated that “Damage bonus granted earlier in the magazine”, I don’t see any difference.","This week's Leviathan challenge is the Royal Pools.","In D1 I accidentally deleted all of my Trials tokens in under a second...","Masterworks are no longer rerollable on year 2 gear","ADS toggle on PC post patch?","Trick Sparrows (possibly) Returning","Probably Useless, but if you never claimed your free \"Solstice Engram\" from Tess on a character, you still can.","Saw this on local news just now","Did I just get my god roll already?","Hand in Hand and Weapon Slot Changes","Red War Campaign- Post 2.0 Update.","OMG Destiny, where did my guns go!?","Material Exchange Question","Finally!","Exotic masterworks are, in fact, dropping from the legacy playlist","I feel betrayed","DIM allows you to preview the new subclass node perks!","Unpopular (?) opinion: Keep the tower and earth where they are because that's how it was in D1","Sense Bungie is working on faction rallies I had an idea","WANTED: Whisper of Oryx was just in my Pyramidion strike, is he one of the new PoE escapees?","Have the quickplay matchmaking parameters changed?","Flashpoint: Heroic Adventures on Mars dropping powerful gear","Bungie, buff sparrows","Getting Ready for Forsaken with ma Bois","The last supper","I accidentally deleted my star map shell.","Actium War Rig and Sweet Business","Thank you Bungie, I can snipe freely again!","Throwing Knives unaffected by net damage increase","Will Hunter \"shoulder charge\" be a one hit like Titans?","The Return of a certain favourite has a Quest","Baby Shark Dododododo emote!!!","has anyone gotten an ikelos from heroic adventures?","What happens to the SoH emblem after the event if you didn’t claim it.","Forsaken helmet i got from music boxes on mars","Bungie, fix the mercy mechanic","Now... I want to like the new warlock chest piece, but I feel like it's missing something.","Sunbreaker's bottom tree can't do a quick double melee with the melee ability up.","I have all the Bright Dust in the world, but I only want one ship...","why cant i infuse blues into my exotic armor pieces anymore?","Last night was too hard","Bungie, if you're gonna go back on the idea of Majors/Ultras dropping guaranteed Power ammo, then just give us Ammo Synths back...","So, Telesto now reloads itself on multikills.","Who's idea was it for trace rifles to get 33 shots?","Game Changing Orpheus Rig Glitch","Best wishes to Benedict 99-40 and the other Tower Sweeper Bots for the reset.","[Spoiler] List of found Escapees / Prisoners","[Spoiler] The Ace of Spades Forsaken Questline","The whole \"Rasputin shot the Traveler\" theory is now referenced in game, and is spread by Uldren","The Scatterhorn Robe has a cool feature for holstering hand cannons","Love the versatility with the new weapon system, but man those 9 slots for energy weapons feel very crowded now","Grandad and little light watching the new trailer.","Change Perks via Companion App!","So my girlfriend just blew my mind...","Cayde's Ghost Now Available for Purchase","Are guns like Play of The Game rotating out with Forsaken?","So Voidwalker charged melees have knockback now.","Don't let the hype distract you from the fact that Benedict is selling the Midnight Coup this week","D2 Forsaken... Should I jump back in?","My Titan is actually a TITAN now","Can CoO and Warmind remain for $10?","Flavourtext no longer in weapon/armour tooltips?","Of all the new stuff we are getting in forsaken, I'm just sitting here praying that Iron banner gear looks good and has unique perks.","Main problem with the update, and it's not too big of a deal","Network issues?","You can get exotic drops from Lost Sector bosses.","now that some D1 orbit music is back in D2..","Sturm 1 Hit Kill in Crucible","Xbox wtf","Did anyone else’s load times go way up after 2.0?","Fun things to do before forsaken?","Don’t dismantle your exotic armor right away","1285 Atlanish Wash shaders gone in a matter of moments. The best part: Master Rahool didn't say a word. Thanks Bungie!","Even after the tether buff, Shadowshot needs to OHK like in D1","Question about Destiny 1","I like the new Warlock boots","To my fellow PS4 users (as well as pc and Xbox once forsaken goes live) Procrastination paid off with Borealis catalyst","I really like how I can fuse different weapons together now. I.E. sidearm and sub-machine gun","Found where the Drifter is going to be setting up in the tower.","New Armor and Weapon Perks in API. Some are really strong","No weapons from the flashpoints, got something else neat though.","I broke down Forsaken Armour and got this...","Beware: Comp is now “Planet of the Apes”","Is there really anything new to be doing this week?","[Spoiler] Last Stand of the Gunslinger but it's in sync with the Immigrant Song","Be careful when Infusing! New Infusion economy in place.","(Xbox) game share pre-order bonus?","Letter From Cayde","Some changes had to be made to my gaming setup","Braytech Titan armor can't be infused??","Question from a returning player","I hope Bungie doesnt miss a great opportunity and Forsaken has a legendary hand cannon or Ace ornament called \"How's Your Sister\".","Photo of the new title screen!","\"Mr. Shaxx, I dont feel so good.\"","I got to say Nolan North did a great job with Cayde six's voice","How have the weapon changes impacted Raid loadouts?","I will laugh hysterically if we end up with a blink shotgun meta again.","[SPOILER] Lore leak?","All New Exotics arriving in Forsaken (Names &amp; Perks, no Images - Unclassified)","THEY FINALLY TURNED THE COLOUR DOWN ON THE LOADING SCR.... nope.","Borealis perk(Ionic Return) was been nerfed.","We Ran Out Of Medals AND Leaves None Standing - At once!","Deleting shaders in stacks of FIVE ONLY!? And only while in Master Rahool’s vendor screen!?","I can't infuse any other helmets into my Helm of Saint-14 or vice versa","A small note about skill gap","Crimson needs a damage buff, it cannot keep up with other weapons now.","Everyone is getting mad at Uldren...","Forsaken Trophy/Achievements","Thanks to the amazing dudes who just helped me to my first Escalation Protocol clear! You guys are what makes this community great.","New Hand Cannon Arcytype","Legendary engrams auto decrypt on pick up. If you leave them on the ground they are sent as engrams to the postmaster for later use","Prioritize ghosts that detect caches over planetary material nodes","High Impact Scouts Three Tap","(PC) After Update 2.0 toggle zoom changed. Is there a way to reverse it to how it worked before?","The Strike Background Changes in Forsaken it seems.","So happy that HMG’s are returning!","Anyone else experiencing ridiculously long queue times for Crucible?","What are people using in the power slot?","Anyone else gotten 0 work done today with all this new info","After crucible today,I came to the realisation that I don’t even know a quarter of the guns in the game","Bungie has flung destiny 2 in the right direction. But I really hope they put the effort into strike exclusive rewards they put into D1.","Prediction: Penumbra is going to be about us becoming a Shadow of Calus","A Few Unlisted Changes","Most Underrated Change","For those who didn't get to tell Cayde goodbye...","[Spoiler] Not only are we getting new weapon types (Bows) with Forsaken, but also new Archetypes for existing weapon types.","Will shaders be single use still?","If Zavala dies, will I get my Fabian Strategy back?","Anyone else's screen really dark now after the update?","The Ultimate Clutch Res","One small change I would like to see for PVP crowd","Golden Gun Animation","Remember that the EDZ shard is corrupted!","Now that shotguns and fusion rifles are in the energy slot, does hunter tether effect their damage output?","Opinion: if Banshee-44 does not get to go the Black Armory it will be a travesty","Destiny 3?","In forsaken will we be able to reroll ghost perks?","Throwing Knife Damage Bugged?","Laggy PVP games since the update a sign that SBMM is back in Quickplay?","Matchmaking Question","Sparrow Infusing","Bungie PLEASE can we get an in activity notification for the postmaster being full?","Forsaken Preparation","Season 7 / Season of the \"_______\" Title Speculation","WARNING: Dangerous sherpa's","It feels like I've exchanged a double primary weapon system for a double special weapon system.","The current sandbox is NOT faster paced than the old one.","Primary sniper headshots count for the DARCI masterwork","Not to put a damper on all the recent excitement, but do we know what will be the Playstation exclusive content in Forsaken? (which exotic weapon, in particular)","Is the Cayde's Spicy Ramen quest still bugged?","Anyone else firing shotguns into thin air thinking they’re energy weapons?","I got the last one within 50 miles!!","I guess still no Tracking rocket love","[Spoiler] Lore for all new items","Masterwork Armor = 50 cores","Can we talk about the crucible ammo economy?","Loving the increase planetary materials and heavy ammo drop!","Devoted of Nokris in Strange Terrain quest","STORMCALLERS! REJOICE!","Any of you have some new \"quest steps\" since the update?","Bungie please let us finish our S3 vanguard ornaments this week","Hideous Crucible Matchmaking Time.","All I Want Is Sparrow Horns Again","A Sincere Thanks","Anyone notice the new infusion costs...its pretty steep!","Cayde-6 Ramen Quest Glitch?","Annual Pass Strikes?","NEW GLITCH- MOBIUS QUIVER ON TOP TREE NIGHTSTALKER!","What is the microchip looking item in datto's inventory?","Haven’t played the game in months. Did all the campaigns and currently Light 345. What’s the fastest way to level up?","[Spoiler] Forsaken Exotic Armor &amp; Weapon Perks","Destiny 1 Music in Orbit","gunslinger knife throw super regen","Lost Sectors help complete the Flashpoint milestone much faster","There needs to be a better special ammo system.","Giving away 2x Solstice of Heroes t-shirts codes!","To all lore lovers: FORSAKEN WILL MAKE YOUR PANTS EXPLODE!!!","Exotic Engrams Dropping?","With heroic strikes gone, where do we farm the catalysts right now?","Agree or Disagree: Ammo Economy","Moving the Traveler and the Tower landing zone icon away from the middle of the screen is a crime against humanity.","Anyone else having the loading content crash?","Rasputin key fragment activities?","Masterworking before or after forsaken","Can't pick up Ramen Coupon?","[Spoiler] IMDB has cast for player voice","Thanks to the community.","Is there any situation where you can use a sword in PvP now?","Are the DLC free in the PlayStation store too?","Telesto actually molestos, it still has its heavy-weapon status damage.","Destiny 2 or D1 Post Launch","Hey can you guys help me out with why the new update is taking so long? I started yesterday and right now it says 15 hours left, been going down tho every few minutes","Marksman’s Dodge and Kill Clip.","Heroic Adventures got nerfed?","Problems with the update...","Completed two full EPs on Mars last night with randoms","Anyone know what the loot chances are for nightfalls during transitionary week?","No more sound on ammo pick up?","Nightfall exclusives","[Spoiler] New Activity called Contested Zones found in the API","Is there a way to pre-order forsaken, including the annual pass and pre order content; but not the base game and expansion pass?","Ps4 Y1 Gear, how do I get it?","Sturm Catalyst progression bugged with Weapon Slot changes?","Player Count, Game Value, and Overall Presentation [PC]","Just Curious, Are the PS4 Exclusive strikes out for PC yet? Or do those drop with forsaken?","Did the Raiden Flux/Arcstrider combo get nerfed?","Spire of Stars end phase bug","Is there a tracker for which Override Frequencies you've collected?","Using shaders is now free to apply.","So what's good for raid dps now?","I was so sure Bungie wouldn’t let me have enough shotgun ammo to consistently keep a 3-Shotgun loadout in PvE. OHOHO BOY WAS I WONDERFULLY WRONG ABOUT THAT TODAY!","No... I wasn't ready for this.","Did they ninja nerf Raiden Flux??","Do you think the game will have more longevity? in Forsaken?","SBMM is on again on Quickplay???","Here is the typeface used for the Forsaken logo.","Dialogue more serious?","Crucible is fun and all","Anna Bray's Hand Cannon","Show Lore Bug?","Having activities load from a specific location (ala Redux missions) at the Tower would be huge for matchmaking.","Changes not in patch notes","Purchasing for a friend.","A montage of the chaos that was Scorched","Took the selfie right before Cayde left the tower!","Warlock or hunter?","Armor from Warmind doesn't seem to be infusion-compatible with anything other than other armor pieces from Warmind","Do the Transversive Steps make a constant reload clicking sound now for everyone else?","Any Breakdown of Materials/Glimmer Required to Masterwork Armor?","[Spoiler] The best part about today's update?","Just a refresher about Rampage from a past post I made...","What's happening with Prestige Nightfall and Strike scoring?","Trailer comes out in 2 hours","Giving EP armour random rolls will help it keep it's relevancy in Year 2","So funny to see the meta in the process of shifting.","Helping A Friend Return To The Game","Turns out, you cant beat all of the escaped convicts just yet","Is simply joining the raid making anyone elses game freeze or crash?","Starting Fresh","Do energy weapons still deal less damage compared to kinetic weapons?","Wotw Box Breathing Perk Does Not Get Removed After First Shot","Anyone seen Cayde??","Possible to get nightfall exclusive rewards still?","You can now infuse 400 stuff into anything!","Alexa ghost","The new infusion system is two steps forward, one step back.","Flashpoints are great for planetary materials","Destiny 2 2.0 nightfall","Advice needed","Annual Pass","It blows my mind how many people in this sub have not completed a raid","How do subclass trees work now? Did old super trees also get updated? Are the new supers way better than the old ones?","Getting sent to Orbit.","The Pyramidion strike seems to have some new effects in the beginning.","I can’t do nightfall?","[Spoiler] \"He [The Spider] has a hobby of collecting dead Ghosts.\"","If I pre-ordered forsaken with the annual pass, but didnt get the digital deluxe version, is there a way to upgrade before release?","With ammo economy changes inbound, it feels like time for heavy ammo to not disappear when changing weapons","Sturm Catalyst no longer progresses since the update.","Do not infuse the Forsaken pieces into your gear.","Year 1 weapons going away?","[Spoiler] Just got a Forsaken weapon from my Flashpoint, complete with lore!","These 200 strikes make me feel so... POWERFUL!!","i made some cosmetic ideas","370 Anti Hero Victory Titan Mark and I can't infuse a 380 Blue(Rare) Titan Mark into it.","If you still have Cayde Stash Maps...","Making a Spotify playlist to hunt down some barons to","[tower tought] We're pretty much the greatest scumbag on the crucible lorewise","Now that they have me interested again, what should I be doing with this week prior to Forsaken release?","Can anyone confirm that the nightfalls are dropping the exclusive loot this week?","Golden gun used to have 14 seconds in D1. While I understand why 6 shooter can’t have this duration, but 3 shot golden gun should be bumped back up to this","How can I start a regular with NF without discarding my Five of Swords","Planetary mats vendor?","Question about the legendary edition. Standard edition came with my graphics card","Matchmaking issues","High impact scout damage bugged?","Can you still farm for Nightfall specific loot in 2.0.0?","Is it still possible to get catalysts ?","Whenever an NPC at the tower mentions \"All those we've lost\" I think of all the real life guardians who quit playing Destiny over the years.","Too soon, Bungie, but well played","\"And it is not a metaphor!\"","New Forsaken Title Screen","Forsaken Escapees Should have a unique appearance.","Stupid Bungie had to mess up my plans....","Is there a reason that each class has a subclass icon that's just the symbol for the damage type?","Reading this Cayde piece makes me happy and sad","Sleeper is an absolute monster now","Unwritten Nerf: The Prospector now picks up 4 shots, instead of the previous 8 shots that it was given since the March update","How are people equipping their new weapons?","Juggling Destiny 2 in college","Just got the Legendary edition","Patrols don't count towards flashpoint completion?","Didn't Celestial Nighthawk have keyhole?","Should I turn in my planetay tokens now?","First impressions Forsaken Sandbox","So far, that Scatterhorn armor is rivaling the PoE sets for the coveted \"Most Hideous Armor\" award.","I was doing one of the new heroic story missions and this scannable Taken orb looks different from before.","Prometheus Lens nerf","Guardians Feel Powerful Again - And why that's a good thing","Today is the reason why I never stopped believing in bungie","Simulation bloom doesn’t seem to be coming up for infusion.","Nightfall emblem variants and exclusive drops with no score;","Trace Rifles feel terrible in PVP post-Patch 2.0","Xbox/PC Borealis","Forsaken price UK","Storm Grenades are kind of ridiculously powerful now. As in, 1HKO powerful. And even more so with Arc Web. Welcome to the new meta.","About the Raid Encounters...","Catalyst's in strike's","Regarding annual pass","Trace Rifle Bug? Any thoughts?","Strike catalyst are dropping in legacy strikes.","Title system might be a nice addition...","[SPOILER] Preview of the Gambit maps and some new Crucible maps coming in Season 4","Crucible frames SUPER LOW","Should I be saving luminous egrams/powerful rewards for next week's reset?","US Veterans playing Destiny 2?","Is DFA missing or am i just unlucky","Shader dismantling should accelerate as you hold the button down.","Skull of Dire Ahamkara is ALOT better now. I havent done any tests but like 5 kills with one or two majors is almost or a full super","I thought this looked familiar...","Our guardian should be able to put a piece of Cayde’s cloak on the lucky pants","Welcome to the Inverted spire playlist....","Issues with connection and lag in the Crucible","Mk.44 stand asides REALLY should work with top tree sentinel.","Sitting here thinking about forsaken. Somehow I forgot about one the most fun game changers coming","Sturm Catalyst Progression Issue","Bungie, this update is amazing! BUT, two things I'd like you to look at!","[Spoiler] \"How's your sister?\"","Wanted to share some neat Sword Shaderings","How do you do the purple quests in your inventory?","The fact that there had been an absolute shit load of posts over the last 24 hours asking if nightfall weapons are dropping and no one being able to confirm anything leads me to believe that they in fact are not dropping.","I just got Forsaken boots and they are invisible for some reason.","Blue (rare) Planetary Materials","\"I refuse to bury any more friends...\"","Forsaken Purchase Issue in PS4","Jarring field of view change when wearing Peacekeepers and switching from SMG","Prediction: The Scorn are being revived through the Light.","Quick few questions","Forgive me if it's been answered","One of the things I'm most excited about is getting to keep my match-made fireteam from strike to strike.","Bring back Legacy Fireteam on the companion app","Fun PvE build: triple sniper hunter!","Were there any lighting/effects changes one to Xbox One X or is it placebo?","Recoil vs Stability","Let's take a moment to pour one out for our guardians with a sub 20mbs download speed","After seeing Cayde's fighting prowess in the recent Forsaken trailer, I really want to see what Lord Shaxx can do in a cinematic","A little detail in the “Beyond Forsaken” video- Variks the Loyal lore tab to be filled!","Where to purchase D2:forsaken complete collection for pc?","Found this guy wandering around Nessus. Reminds me of House of Wolves days","Is Forsaken gear dropping from the clan xp milestone?","Ikelos Hand Cannon Not Appearing?","Incorrect power level displaying","When its a Hard Job But Somebody has to do it","Did I miss the only week you could redeemed your coupon at the spicy Ramen Shop?","Are we supposed to get Forsaken items from flashpoint?","Download Stuck","Got a cool looking forsaken scout.","Winter's Guile still needs a QoL buff IMO","Hopefully the main screen changes tomorrow.","Does the weekly nightfall no longer give credit if doing a guided game as a guide?","Bungie With the Cold Blooded Advertisement!","Forsaken - Cayde's stash pre-order?","Why is the flavortext removed from item tooltips?","Post the best perks you've gotten on Forsaken armor/guns.","Normal raid tokens","Toggle ADS on PC is sticky.","Aug 28th update and the strike bounty: Complete 3 strike challenges","Appearance change please?","With the small Penumbra peak, it may be safe to say that we may become a shadow of Calus.","Tess is selling War Beast Skin (Acrius) and Reef in Ruins (Telesto) Exotic Ornaments","[D2] Maintenance 4.30pm UTC to 9pm UTC","Sunshot received a buff in the patch","Does anyone know a sidearm that takes green energy ammunition?","The Tower feels so empty now...","What fusion rifle can go in the special weapons slot?","Does the new weapon economy support not running a primary ammo weapon in PvE?","New Forsaken Exotic Armor and their respective perks","Drang not showing up in Tyra's inventory?","the update finally installed for me and WOW i feel powerful again!","Can't infuse into Solstice Armor?","Does anyone have the percentages for exotic drops?","Been stuck installing for over a day now....","Adaptive hand cannons are useless; buff their body shot damage","So, could this be a legendary LAST WORD?","Heroic Mission Access","Although your XP bar is not moving, You are still earning progress towards Bright Engrams","Do you have a chance to get the acrius catalyst from every chest opening every time you run the raid or only from the first time every week?","Preliminary Hallowfire Heart cooldown testing","Hey everyone my name is Ty Robinson and my interview was in here earlier and I would just like to say thank you to all the nice comments and support from you guys!!!!","\"[Spoiler]\"Spotted another WANTED during the Savathûn's Song Strike: WANTED: Osmium Traitor","Tractor Cannon Plus EP Shotgun","How is it that patrols do not progress “Patrol ______”","Sturm Catalyst broken?","Bungie why do I see Nessus like this when I click on the map?","Shader deletion needs to be even faster","Skull of Dire Ahamkara = Obsisidan mind 2.0","Thank you so much Bungie for making shoulder charge a one hit kill again.","An emote gold mine in hiding!","Worried About Variks","TIL Cayde's Ghost is named Sundance.","Nightfall question mark","We are aware of an issue where players are receiving Forsaken items earlier than intended.","[Spoilers] Here's every new Lore entry in Today's update.","With the change to Helm of Saint-14 giving Blessing of Light, bring back Glasshouse and give it Weapons of light","Should i delete Y1 weapons?","Quick question about Forsaken","Did power level determination change with update 2.0.0? My PL is higher than before with no additional drops.","Broken titan bubble??","The Anime is Strong with this Exotic:","[Spoiler] API Update 2.3.0 and 2.3.1 on GitHub","Misc so I was sitting in orbit and to my surprise the reef music from d1 started playing.","Ace of Spades Changes","Well played Bungie. Well played.","Is this a new bug? Prestige calus Psion Bubbles stuck during dps","Just a reminder that Bungie teased all the major DLC locations a year ago.","Sturm Catalyst bugged?","Polaris Lance catalyst not working","Legendary engrams auto decrypt upon pick up. Awesome QoL change","Warlock build advice","Claymore questions","(New to Destiny) With the adjustments to subclasses, do you think your strategy will change for the upcoming raid?","TIL HDR isn't on by default","D2’s Incendiary Grenades are still not as good as D1’s.","NEW RAID INFO [SPOILER]","Deleted the Ikelos Hand Cannon and Ana doesnt sell it","New Forsaken stealth armor","Ether Doctor is pretty nasty in the crucible","Reconnecting with different loadouts.","Share your first random rolls thread?","Do we know of any other D1 exotics making their way into Forsaken?","Question(s) regarding Leviathan Trophies/ Acheivements","Now this... this does put a smile on my face","Polaris Lance Catalyst Farm?","Bungie is giving us an opportunity to farm planetary materials before Forsaken drops.","XBOX ONE ISSUES - XP not displaying. Milestones not increasing properly: Flashpoint progress is showing 0/1 even when completed.","Friendly reminder that the LMG is NOT returning in forsaken, it is returning in black armoury","Looking to solo Heroic Whisper for the Catalyst. What’s a good loadout on 2.0?","Please Guardians some of us are not as fortunate as you.","I am an idiot","Anyone test rig hunter after nerf?","September 4th patch size?","Can't infuse into Armamentarium?","Is there an Expansion Pass + Forsaken DLC bundle","A Thank You to Bungie","Will there be a Forsaken OST?","I hope the Title Screen and Title Music Changes with this update!","New Warlock chest makes my guardian see thru!(video)","There are more news today coming, according to Deej","Since the weapon slot changes, I am unable to progress the Sturm catalyst..","Why am i being thrown into games that have aready started in crucible?","Mercy rule needs a look at.","The one about strike catalysts post patch.","Anyone experiencing long matchmaking queue times in The Crucible?","What do you think Season 7, Season of the [REDACTED] is called?","So I guess warlocks have invis now?","Picking Order of Equipped Weapons","Everyone here wants to avenge Cayde and get the Ace of Spades...","There's an immune boss on Io called the Ghaul Devotee, and he's immune to everything I do.","GOD I love Cabal Stomp. What's YOUR favourite?","Game is visually \"darker\" after 2.0 (PC)","Do I have to play the first Destiny to understand the story of Destiny 2?","Can Our Gaurdians Hold Something Other Than Their Kinetic Weapon?","Somebody with a Blueshift, can you check how much reserve ammo it has now with the field prep buff?","Has anyone received the DFA drop since reset this week?","Trying to make a full loadout that's a homage to Firefly and need help.","Theory on Uldren and Cayde","Daily Questions [2018-08-29]","How do I level up after doing the milestones?","Got a new Kinetic Shotgun with full auto. Maxed out its masterwork for bonus range.","My warlock loves floating so much he did....this","Rigs + Top Tree MULTISHOT bug","Can you still get the whisper of worms when forsaken launches?","Toggle ADS Changes Are Clunky.","Cayde = space dad","You can infuse your 400 Raid Weapons into regular legendary weapons now.","Will old weapons gain the new masterwork upgrades?","Do the flashpoint on Mars, and you get a Forsaken weapon RIGHT NOW, TODAY.","nightfall","Do these robes make my warlock look thick?","The Farm...?","A reflection on the past...","This made me sad :(","Where can I download the new weapon data?","Want to get back into destiny with forsaken, pricing is very confusing.","[Spoiler] Thunderlord Sneak Peek in new ViDoc","In sight of Forsaken, I made some phone wallpapers, enjoy Guardians!","Are random rolls back already?","Shottguns in crucible and smgs","Question about forsaken","Is Ikora as a vendor going to serve any purpose once Forsaken launches?","Sturm Catalyst Bug","Does the game seem a little...darker?","I might have spotted Phoenix Protocol in the new trailer.","So... the ADS recoil for omolon sidearms the same as their hipfire recoil?","Attention TITANS","[Spoiler] All Drifter Armour Lore Tabs","This is the first time in a long time...","help with bulk shader delete","Will starting a clan reset the staves?","Please reverse the changes from \"toggle aim/zoom\", or at least make a \"legacy\" option :(","The Frigid Jackal is pretty long","Guided games NF doesn't count towards milestone.","I just got some Forsaken Boots","Powerful Gear Question","Is there a package with only the first 2 DLC's and Forsaken?","I had a lot of plans to be productive this week. Then I watched the launch trailer.","Determine Daily Challenges vs. 4-day vs. Weekly","So how does DPS work with new weapon system?","Forsaken Edition Question","Firefly Reference in the Beyond ViDoc","Urmm....there is a LOT of heavy ammo dropping in PvE","The Challenge: Trials of LING?!","I was too sad to celebrate with my fellow guardians yesterday","Remember kids, Red means stop.","What happened to infusion cost?","We better get snackdad as a player title.","Can we have more milestones per week?","Really sad about my main ingredient","Hey, we get it, a bunch of stuff was added to the database, can you all leave the spoilers out of your titles please?","Enemies can now drop legendary items without having to decrypt the Engram:","Game error broccoli after loading into world","Whisper kept the non-nerfed box breathing","Missing DLC.","Golden Chests give you 12 Planetary Materials...","We're breaking these teams up to find a better match!","With the new weapon system what’s a good energy sniper for pve?","Nightfall unique rewards bugged?","Patch notes updated with new Raid Revive mechanics","Rally barricade buff is the same a Luna boots","Destiny 2, got someone a unique nightfall weapon after patch?","NERF THIS. IT’S OP","Forsaken Gear Dropping Early from Milestones","Etheric Spiral","Thank you for the Skull of Dire Ahamkara buff!","Nightfall emblem variants?","[D2] Weekly Reset Thread [2018-08-28]","Why am I getting five rounds for Coldheart per energy brick pickup in PVP?","Question about Vault","Best Heavy Weapon?","Thanks for turning off perma Juggler Bungie.","Can you get bows from the Flashpoint?","Something interesting about the Warlock’s Forsaken Chest Piece","Any other Titans out there PUMPED to see the Return of the Infinite Lines Gauntlet model?","I am not afraid of already really good shotgun users or snipers...","How are Warlocks faring in the new PvP rushdown meta?","Call to Arms Powerful Gear Engram?","You can now infuse your 405 Prestige legendary weapons in to non exotic weapons.","With Linear Fusion Rifles being one of the few weapons to still take Heavy Ammo, don't they need a buff?","Is guided games only available for the arms dealer nightfall?","How do I complete the Warmind’s Glory quest step now without heroic strikes?","Shader Deletion at Master Rahool","Smooth Mercury Location Bungie","Why So Serious??","Haven't played since like October, where do i start?","Question about Raid checkpoints","Just acquired an Exotic with Random Rolls","About that shader delete...","How much calus coins do you get from normal Leviathan","New perks on Wormhusk crown","So I have a buddy who is a kinderguardian had a few quests to turn into cayde..but hes gone...","Trace rifles feel fantastic now","Idea for Dawning 2018 Quest","(PC)How do I get the IPs of bungie servers when it says \"checking for updates\" during login","Pre Forsaken patch vs after Forsaken","Milestones vs Challenges","I am Casper, the Friendly Warlock Ghost.","In this awesome state the game is right now, I would love to see K/D on the final screen of a crucible match, not KDA","Sturm catalyst isn't progressing","New “Onsluaght” perk.","Anyone using Inaugural Address in crucible?","Sound effects","Giving your character personality","Can I get the D.F.A to drop this week?","Presaken loot","Can’t find standard edition Forsaken in Xbox Store","Olympus Descent Out of Map","Are we supposed to be getting forsaken items now?","Aim Down Sights (toggle mode) now stays on after sprinting and jumping post update - Bungie please let me turn this setting off.","Is there currently a purpose to Daily Heroic Story Missions?","What’s your favorite Warlock Glide, and why?","Help pls","Striker UI Error","How do you add images?","For those of you who did the raid in this update, how did it go?","Ttk soundtrack is back?","What PVE combo's are you enjoying right now?","Will Bungie ever fix Scatter Grenades infinitely bouncing and not detonating?","I wonder how long it will take for someone to complain to Bungie that the player character doesn’t sound like them...","Humanity, humanity, humanity. Who was Humanity??","No matter what the new meta is about to be set, one thing is crystal clear: hero moments are back.","So, who is taking care of Caydes' chicken now?","Forsaken Expansion Packs for Xbox only sold by Microsoft?","How to join a faction","Stormtrance","Vault loading issue","Having 3 tap 140 handcannons back puts a chubby in my chinos.","Anyone See Catalysts Drop in Strikes This Week?","WEASEL ERROR CODE!","In before Season 4-saken","Pvp emotes?","How long have i needed to have alkane dust, dusklight shards and all them to infuse my gear? Also how do i get them?","Titan Rally Barricade is Now Amazing","What time is Gambit in the UK","Borealis since changes","I'm sort of lost here with the blizzard launcher and d2","Insurmountable Skullfort + Striker Top Tree = Unstoppable Madness","Destiny 2 servers are back up","New Crucible is Interesting","Interesting ghost flavor texts in Destiny Sets","If anyone is looking for a cool place to take screenshots, do the adventure in EDZ Trosland called \"A Framed Job\" It will send you back to the cliff side.","Region Chests Grant 12 Planetary Materials.","WTF No engram for clearing the Castellum","I've heard conflicting information around current item collections, can I get some clarity?","Sparrow Flipping is Back!","[Spoiler] Fallen Prisoner, Beltriks found on Nessus","Text on the Trackless Waste","Key binding issue (air move)","Does the Location Matter When Infusing?","Nightfall exclusive rewards?","Did Anyone Even Play-Test Trace Rifles in the Crucible?","New ADS mechanics on PC?","Bucket List beForsaken drops","PC Map Borders seem to have been reverted","Omolon scout in Kinetic hopefully.","Does anyone know if we're on the 7 day reset for flashpoints or the 4 day reset now?","Can we please have a \"Stay together!\"","For the few who care, I’m pretty sure both Human Voice Actors weren’t the ones in D1.","Nightfall Farming Question","Whatever the new meta is that develops with tomorrow update, I just hope it isn't as un-fun as getting blasted by 6 Graviton's in every lobby.","I did a doodle and colouring","Are there 2 resets now since patch 2.0?","Question about Midnight coup","Can anyone help me with my Problem?","Tomorrow is officially Shader Deletion Day!","New perks on old exotic armor?","The new system of keeping balanced lobbies/splitting up uneven lobbies in crucible appears to be breaking apart premade fireteams.","New warlock man bun helmet, lol","Did i buy the wrong forsaken?","If I don’t own any dlc, what is the best way to go about getting it?","The Tower feels so bare.","I know it’s quickplay...but...","Explosive Payload Weapons aren't Good in PvP","Question about Exotic Engrams","I'm extremely picky. Help me choose my class.","Found an interesting bit of foreshadowing from vanilla D2.","Just a reminder: Come tomorrow's weapon slot changes, Kinetic will NOT equal Primary.","Guess I'm gonna enjoy not having feet for a week ;)","The Importance of Penumbra","Everytime I open the director to fly to the tower i end up going to Earth instead lol. Feels good though","I’m curious...","Question about weapon slots.","So uh... where'd the rest of me go?","Update 2.0 Catalyst Issues","Sidearm shot spread is actually accurate when ADS-ing now.","API might give hint on Raid Power Level","[spoiler]One Thousand Voices Lore[/spoiler]","Titans, we have a task.","Downloading the update while at work or otherwise away from your Playstation...","Year One Weapons and Gear Underwhelming Post Forsaken?","The speed boost on Peacekeepers is no joke.","For those of us still updating the game","Filthy Casual Forsaken Questions","If i use two Primary Ammo weapons in PvP I shouldn't drop or pickup Special ammo..","Some sandbox tweaks I'd like to see","Has anyone gotten a bow to drop?","Sleeper Simulant Quest: Heroic Strikes","If anyone is interested in mixing up your weapon choices. Check your primary blue hand cannons before dismantling. If it’s the “Ballyhoo MK27” give it a try.","Raiden flux got a nerf as well","Is this where the drifter is going to be?","The bug of forsaken gear dropping early is here to stay until forsaken launch","Controller Sensitivity on PC","The new weapon system is a nerf to any energy weapons that are “primary.”","Is solo progression still tied to milestones in year 2?","How to delete shaders in mass?","Power ammo economy after the update","Could we finally get 2 different types of controller sensitivity? one for ADS and one for the Camera","So I just got Dunemarchers from the Clan Milestone reward...","Posible Spicy Ramen Bug","Glass needles?","Are there going to be new Rare weapons come Forsaken?","Pc update installation issue","[SPOILER]The thing you see Uldren messing around with in the new trailer...","Heads up guardians. Sturm catalyst currently bugged.","Guided Games Nightfall doesn't count towards milestone reward anymore","With Heroic Strikes gone, will it be impossible to get Perfect Paradox this week?","Free PS4 player coming in, is any of the Y1 DLC worth purchasing?","Crucible death cam glitching with new update?","Accidentally locked a shotgun, Graviton, and sword in the nightfall last night..","Heroic strikes checkpoint in patch 2.0?","Having worked Fast Food &amp; Retail. I can relate to the weapon slot changes:","Loading screens are still blinding white. Here's how good a color-inverted opening screen looks.","Uncollected Engrams are NOT decrypting into inventory/postmaster.","I just got Forsaken boots on Mars but...","Spicy Ramen ‘quest’ still available?","The new scatterhorn Titan helm looks gives us Peyton Manning’s forehead","Orpheus RIG new rules","Recent Returning Player Advice","First 24hr New raid completion emblem?","Exotic Rolls","Possible bug: After update I cannot infuse my Helm of St 14. Video Below. Anyone else have this issue?","Which activities no longer reward exotics?","Forsaken Release time?","15 New Hunter Cloaks in Forsaken","Anyone feel like you need to write down a shopping list for the infusion materials to pick up from each planet now?","[Destiny 2] Do I need to have my highest power weapons/gear equipped in order to get the best drops?","Locations of poe escapees?","Now that a lot of prayers have been answered, can we talk about crucible maps and crucible labs?","Last Two Powerful Engrams I Have Decrypted Were Below My Light Level","What's replaced Heroic Strikes in quest steps?","This is Cayde we are talking about, to not buy the DLC would be.... cowardice.","(Possible) Exotic Armor List &amp; corresponding Perks - Forsaken","Vanguard Ornaments","Public service announcement","Fighting Lion produces multiple bricks of heavy sometimes on multi kills.","Quick question about weekly milestones","Has anyone gotten a nightfall exclusive weapon this week?","Year 1 Exotic Armor drops with perks it didn’t have on the year 1 version!","R.I.P. Find Fireteam (Legacy)","Does the tree of probabilities still drop the d f a or did bungie pull it from the loot pool?","Random Fireteams Kept Together","What is going to happen to factions?","Coming back to the game from launch. Didn't play either expansion.","I am 90% sure the blue filter was ninja-removed in this patch","I took this as soon as they declared his fate. And I'm glad I did.","How do you see progress toward flashpoint completion?","Radian Flux got nerfed?","Which rolls will be considered God Rolls?","Concern about bows...","I Keep Falling Over","[PC] update 2.0 - ADS toggle bug","Meta change!","This hit me right in the feels","Orbit Music","Dont flake on the trace rifles Prometheus lens is ripping through enemies","Hunter dodge still broken","Don't know how I feel about forsaken after a PVP match","trench barrel no longer activates with throwing knife","Its a small thing, but thanks bungie for fixing the Earth's rotation. I was beginning to think the traveller did it. Lore?","State of the crucible.","Cayde knew something about Mara Sov","Sword Ammo buff with Helmet","Young Ahamkara's spine has created the most enjoyable gameplay loop in the game","Equipping Forsaken items","Safe to open Engrams ?","Destiny 2: Shotguns","Old Weapons/Armor now have new infusion cap!","Legendary Engrams auto-decrypting on pickup?","Soltice Gear questions","So, loss streaks in comp gone?","Celestial Nighthawk","Quest steps to unlock Ace of spades [SPOILER]","Y1 vs Y2 infusion costs","How to Polaris Lance Catalyst after patch 2.0","A Brawl with Randal the Vandal (Part II)","Orpheus rig changes; not as bad as you think?","So what are the Milestone equivalents for Strikes and the NF now?","Attempting to infuse but item not visible?","Level 20, 405 armor, 380 whisper, and 2 level 175 blue weapons after starting over","This is your last week to earn a non arc ikelos smg","Telesto wasn’t hit by the Fusion Rifle damage nerfs when it was moved into the Special Slot","I like the changes to Box Breathing, but I wanna see it on more guns.","Got an exotic with Forsaken Perks","Spoiler Titles not blocking out on the new reddit theme?","Prometheus Lens Needs some PVP love","Sorry, you're not eligible to purchase Destiny 2 Forsaken Legendary collection pre-purchase.","Picked up a legendary engrams in the wild, instantly turned into a decrypted random roll Helm of Saint 14","Remember Cayde's cloak?","Coming back to destiny 2, quickest way to get higher power/what should I do before forsaken","Borealis.","If we're petitioning for Y1 armor designs to return...","New weapons and armor","Orpheus Rigs + Mobius Quiver gives &gt;3 arrows.","Now my muscle memory's messed up","Will there be a \"Legacy Endgram\" for Year 1 exotics like there was in Destiny 1?","Almost 700 mod components and legendary shards later, and I've scrapped all my mods!","Oh Bungie you tease!","Anyone else going to do something special with their characters to fit a western look?","Milestone for Strikes?","[D2] Daily Reset Thread [2018-08-28]","Final Reset before Forsaken Things to do List","Decrypting saved exotic engrams drops year one exotic armor with randomly rolled perks","Add D1 Exotics Throughout the Seasons","Update on PC stuck on initializing..","Competition has returned"]