["[Megathread] Mass shooting at Madden tournament in Jacksonville, FL.","/r/gaming is now open for submissions again. Thanks for your patience and respect.","I can't unsee","Brøderbund announces 2018 Oregon Trail reboot, touts “high difficulty” gameplay","Two online best friends that played gta together everynight met up to have lunch and take a few pictures","Unlimited power","I'm sorry","Look both ways before crossing","Hollow Knight - I was told that you guys might like this","Trailer vs Pre-Alpha gameplay - The CDPR way","Since Fallout 76 is using the same engine as FO4, I wonder if this age old bug will still be a thing...?","Batman: Arkham Knight Batgirl cosplay","Husband's anti-spoiler technology for the game we've been both playing","Skull Kid colored pencil on paper","\"Psyduck - Golduck\" by Raph Lomotan","I bet I am not the only one waiting.","After catching up with what the heck Cyberpunk 2077 hype was about.","D.va more like D.Friendzone","Secret floor plans [DnD]","Little something I found at a flea market","Wait what? Simulation games are developing","Harry Keg","Updating MS Office. One of these is not like the others...","An H.P. Lovecraft-inspired open world game, The Sinking City","When life was simple and stress free.","It’s done.","E3 Vs final relase","It's been 20+ years since I've picked up an artist's brush. My skills have atrophied quite a bit, but I'm pretty proud of the outcome.","SEGA machine still standing at my local orthodontist office","Interesting choice of plate and sticker for this car","Ulfric Stormcloak was indeed a very busy man","Gotta carve 'em all!","Finished my latest terrain project via Minecraft | Azkhul, a 6000 x 6000 block fantasy terrain","My daughter loves Minecraft, So I'm secretly building her a castle in creative. Can't wait to show her.","Laughts in Spanish","Forgive and forget is for the naive","This is how I proposed to my now fiancé (she said yes!!). The engagement rings are made literally across the world but I let a local jeweler put gems between the Triforces. Our names and “it’s dangerous to go alone” are etched inside!","Wait, hold the F up, where did they go?","[OC] I drew a sad 2B on my twitch stream","My Brief Understanding of Starcraft","Mail call! It's so pretty.","“Erm...Yeah... sure...?”","This is the remake I want.","this is my dream","A fantasy Overwatch Drawing I did[OC/Fanart]","if you remember this game , you are awesome :D","Since there's 76 days until Fallout 76, I decided to attempt to make a small Nuka-Cola cooler!","Took a couple of hours, but definitely worth it!","The most brutal vinyl collection in gaming history","Volsung","Mario likes more than just pounding the ground.","Found this on r/Unity3D - The Tony Hawk x DOOM game got it's first boss fight!","My grandfather looks like Vito from Mafia II.","I made a Fall Leafeon!","Miss this classic for the original PS - anyone else remember this one?","Silos Needed, Training, Training, Unit Lost, Unit Lost, Silos Needed, Training, Unit Lost, Unit Lost, Training, Silos Needed","World of Warcraft Sylvanas Windrunner cosplay","Who wins???","The moment by brother stopped playing split screen with me","Games then and now.","Damn, granny's got skills","3D printed Majoras mask that a friend painted for me. I thought you guys might like it.","Love the new xbox controller !","I may enjoy all three (especially DOOM)","Oh, you wanted to play a game? Would be a shame if every single one required an update.","Mother helping her child though a hard level in Super Mario Land.","\"Ha... I think I'll just stay here, it's okay\"","I decided to draw kirby","Playing Counter-Strike on a gaming computer in my school’s library","The Pippin, Apple's dead-in-the-water attempt at a video game console in 1996","Charlotte (Fire Emblem) by princess.rabbits","TIL: the scales at the very start of Dead Space 2 actually work and even show you how heavy the armor is","Lara Croft by Hue Vang","I was severely depressed for years, so I channeled it into a comedic RPG about a cynical game developer on a quest to confront the physical forms of his mental illnesses.","Everyone's excited about Cyberpunk 2077 but I'm just wondering where that piece of garbage went...","Dust this game off, boys. We're now backwards compatible!","Time has changed","Look into my eye","Game room progress. Never thought I'd get this far.","A friend made a Claptrap trash can","Boy and I’s rainy day set up","Me when I suggest outing ideas on a groupchat.","Thats weird ...","40 miles of Mario!","Some oldies in the closet.","This game would be the perfect remake! Online multiplayer and Hundreds of weapons!","CS:GO in one comment","As an Alien fan, this was an absolute dream come true - the perfect atmosphere and the perfect gameplay.","Cyberpunk 2077: Pre-Alpha Gameplay Vs E3 Trailer","Still bugs the crap out of me","Unfortune steam thumbnail","I finished this today and want to share (inspired by Banksy)","Internet is down due to heavy storms. Time to head to the garage for some offline gameing","Behold: The umbrella that seals the darkness!","Bethesda celebrates the 1 year anniversary of Fallout 4’s Creation Club by releasing the “Settlement Ambush Kit”. Security cameras, shooting ranges, and watchtowers help arm settlers to the teeth for new wave-based warfare.","Butt Busta 2000 VS Giant Spartan","Dad put my brother and I's collection together after I moved out. Rate my (Dads) collection.","A bug in the Xbox Store set the prices for custom controllers to 10€ each. Best 40€ I‘ve ever spent","Okay this is so cute","My dad got me this for Christmas but I lost it. I just found it in a old purse in my shed","hmmm","How Square Enix fans protest each game release","Checkout this ad in the back of my X-MEN comic book from December 1989.","I love this review for astroneer","An interesting title","I just started collecting for the PS1, Any suggestions on good games? The only ones I’m planning to get are the Final Fantasy games and Doom II","This is exactly what it looks like","Ive been making Pokémon in LEGO Digital Designer, here's the first one: Omastar.","Anyone want to meet up here after work? Ur mom gay","Cyberpunk 2077 gif","Kirby probably can’t even perform most Fortnite dances with those stubby little appendages :(","It works right?","He's the first member of the DK crew! 9x12 pen&amp;ink Watercolor illustration","cd projekt red throwing some shade at Valve in the gameplay reveal with a \"no life 3\" poster","My sketch of Nero (Devil May Cry 5)","Down to the last 100 days until Super Smash Bros Ultimate is released!","Someone build Mario at the beach in Rosolina Mare, Italy","When Roach feels like showing off","AK Shotty pwnage. in VR CS:GO on Goldeneye Map","When Puberty Hits...","Spotted at the MN State Fair","Used to play with a friend on steam all the time. He went mia and I dug around to see where he went","Asssassins creed on a budget","Ooooh a trail.","When your sneak is at 100","When you are experienced and high level and join a low ranking lobby with default skins.","This ray tracing looking sick","I made an arcade game with unique gameplay where you have to keep units from going extinct.","Still can’t get over how amazing Wildlands looks","RIP Paragon [3840x1080]","Fallout should be in the hands of a company who actually cares about single player","Captain America meets Luke Skywalker","Happy gamer day! (at least in Mexico)","KO!","A pic I took in Horizon Zero Dawn","Can't wait for the new Tony Hawk game to be released","What the fuck does it stand for, then??","Not a big muscle guy but just had to do it for Shelby, she's just so pretty.","Free September PS+ Games Announced","Damn suit","So tonight I'll be hosting a mario kart tournament with all my childhood friends","\"Alright, we need an awesome cover for our new Sci-Fi space shooter game, anyone have any ideas?\"","Just placing my bet","When he was more supportive than your dad.","The only remake I want","Sifting through Steam Curators for pitching. Find this gem in Top 10","The things people are making in Terraria is insane","The new doom soundtrack should be made up of exclusively death grips mashups","ᴶᵁˢᵀ ᵂᴬᴵᵀᴵᴺᴳ","Ultimate trap","I was searching for PC cases and happened across Corsair's 404 error page...","When Nintendo made cereal in the 1980’s - Nintendo Cereal System","Total War games these days... *puke*","ER trip was made so much better with LA Niore, a loving boyfriend, and amazing fellow redditor gaming nurses! If you guys see this, I want you to know you were amazing and made a bad day better!","\"Bad North\" has touched my soul. I love this game. Pick it up for 15$ on any console or PC. With enough support, devs have hinted at updates to the progression system!","I don't know what you want to do, but you look scary.","My 7 year old nephew attempting to cosplay a Fallout 4 character I made. Was surprisingly close believe it or not!","Felt like it happened in slow motion.","I went to go catch pokemon and all I heard in my head was a machine gun.","\"Get an adult job\", they said. \"It'll be fun\", they said. They weren't wrong.","Spelunky 2 - Gameplay Trailer","My addition to the motivational phrase board at work","So i got public internet box il convert it to arcade :)","Marble Blast Ultra spiritual successor, Marble It Up! Announcement Trailer","Spelunky 2 will feature dynamic liquids!","Longshot. One Shot, One Kill. BAM! Doggo.","This tip","With all the controversy about Spider-Man PS4's DLC, Insomniac should take notes from this classic.","Cute \"Spooky\" Game","Mechanic D.Va by Sean 'Raiko' Tay","People of r/gaming what game was it that got you into playing video games? For me it would have to be the original Crash Bandicoot. Curious to hear your answers!","Nintendo, then and now","I can almost guarantee there will be a lot of these special edition controllers at Smash tournaments","I can dream....","The nostalgia hits hard","I made Castle Black from Game of Thrones in Far Cry 5! ⚔️","Don’t know why i am playing Minecraft again but i think it looks preaty good","PlayStation Plus Free PS4 Games Lineup September 2018 | PS4","What board games should everyone have at home, with or without children?","Take a moment to appreciate an iconic Final Fantasy VII enemy: The Vape.","Travis Scott confirmed a member of the Warriors Of Sunlight","How smart this is","Chloe and Nadine by Grace Kim","I just drew some Tekken fan art","When Renaming In Video Games Creates Comedy Gold","PlayStation in a pool","Worst game you've purchased and completed?","This wooden controller coaster is beautiful.","I'm gonna have to call bullshit on that, Zyle.","She’s So Cute When She’s Sleeping","Purchased an NES Classic. Pure nostalgia...... (Play-through of first world in comments)","When Treyarch don't get enough from Activision and produce keys to make games.","[OC] The Last Supper, digital art","Mmmmmmm","Brigitte from Overwatch by Anastasya","What went so horribly wrong?","New Plus Games","Waiting for the new F-Zero game","Crazy Taxi 2 / Why a great game has disappeared?","Already rocking it peepz! 😎 To all the book lovers who are also gamers....lol. Great storyline, that's final.","I think Nintendo Official Magazine may have had some bias in its reporting","Battlefield 1942 INTRO HD, This Video used to get me so pumped up as i Loaded up.","I downloaded Prey on my Xbox One S and some objects are like this, like the helicopter I rode in and the little robot that greets you. I fear I know the answer but is this normal? If not, how do I fix this?","And so it begins","Cyberpunk 2077","Was going trough the store when suddenly a wild meme appeared","Progress on my Dune Wraiths figure","I haven't seen too much about this on reddit and as a fan of the series, I honestly can't wait to play it! Just over a month left to wait now.","When you realize why V has a sidecut in Cyberpunk","I got one minute exactly I’m shocked","Amazon has completely stopped their 20% off pre-orders on new games.","trying to estimate CP2077 release using all available info","Are there any games that have recently released or about to release that are similar to Rainbow Six Vegas 2? I really want a game that has something similar to RBS:V2 terrorist hunt with smart AI and a tactical atmosphere","The rage returns","[LPT]Don't mention DLC for a game that hasn't been released yet.","Cyberpunk 2077 mocking EA","Whats your reason on buying physical or digital games?","Nintendo shuts down the tool behind your favorite Pokémon fan games - The Verge","An update should not be the size of the game that was already installed and playable.","This is a serious question about the 3D Sonic games","Getting my dad into gaming post stroke + depression, where to start?","It would be awesome if EA released a special edition version of Madden or some DLC to Support the shooting victims and their families.","Family Man - Trailer","Sometimes classic is just the way to go.","PUBG PC vs PUBG Mobile","How important is story for you in a video game, and what is your favorite narrative in one to date?","Is it worth having a high spec gaming pc and Xbox one x?","Ew that hand","I did a thing. Tattoo by David Bruel at Red Letter 1 in Tampa FL.","Guys i just found this, who remembers it? This was the best thing back in the day","Broke both of my hands a few days ago, but excited to get to some Summer reading I've been putting off!","It's GAME NIGHT at my place who's in??","What do you think other game devs like Bethesda think about Cyberpunk?","New Spelunky 2 Gameplay with Dynamic Liquids and Mounts","Rate my Nintendo (controller) set up!","Project TL (for fans of diablo 3 / Ex Lineage Eternal)","What game to buy?","What are some good PC games that can be played with just a mouse?","Found this in a old box.Should I try them?","I cried after this.","GameStop employee told me there is a price increase, but hasn't happened yet. Hurry and get your MW2 copy for $8!","SCUM is a gentleman's game..","Free PlayStation Plus September Titles to Include Destiny 2 and God of War 3: Remastered","Jurassic World Evolution - Free Update 1.4 Coming September 13","This game is gold","The Tabletop RPG that formed Morrowind","So I randomly bumped into our Majestic hero Stefan in GTA...","\"Twins\" spotted in the Cyberpunk Demo","The first game that taught me stealth","Cuphead/One Punch Man crossover","Top ranking in the world - tied with almost 900 people but I'll count it!","Ascendant of \"Hong kong 97\"","Running over the guy fixing you is a bold strategy my friend","When you're browsing the Imgur and get a chance to see a wheat field on Mars, that convinced me to read whole the post. I'm sharing it here to help this young dev. He's worth it!","Still my favorite part","With MW2 becoming backwards compatible, this meme has become relevant again","The hamstinator.","DEFEND THE BURGERS!!","Best Hanzo cosplay so far","OOT VS. MM: which is the better game?","I heard MW2 is now backwards compatible, went to see if it was one of the games my dog got a hold of a few months back...","Girlfriend regrets being my friend in Animal Crossing","If Overwatch were Dark Souls","What will be the future of gaming for the average consumer?","AC: Origins Worth it?","I made this","EA (Madden19) should make those who lost their lives during the tragedy into special player cards. Levels 98 or 99.","Cyberpunk 2077 Looks Amazing","Any love for this game on Reddit? The old school Mac Gamer test.","I always had so much fun playing this game, maybe one day a remake of it will come out.","New Xbox Elite Controller","Is a PS4 for $150 good?","Makes me sad to think the younger players won't know this Terminator 2 reference...","Onimusha is getting a remaster!","Slip n Slide [Styx: Shards of Darkness]","What is your opinion on Overwatch?","Project Borealis - Update 4","Anyone Know The Name of This Scorched Earth Clone?","I wish","Good old days...","Hit my 200,000 gamerscore goal today. So much of my life spent doing so and no regrets really","Bought Yakuza Kiwami 2 and got this steel case.I really like it😄","PS Plus Games Announced for September, Bungie’s Destiny 2 Going Free","Just trying to play some Black Ops like old times","Need Games Please!","The Sims games are really successful and people don't deserve hate for playing it.","This is not real, this is fan-made mock up of a potential Chrono Trigger sequel. Maybe attention would draw Square in?","PETITION TO ADD GOOSE FROM UNTITLED GOOSE GAME TO SMASH","LOTR: The White Council - a open world LOTR Elder scrolls type game that was cancelled in 2007 due to too many round of layoffs hit that hit EA after it needed 3 more years to be complete","Is that the new kind of evolution coming up there in Pokemon?","Does anyone have experience with AR guns for mobile phone games?","Project TL ( For fans of Diablo 3)","Today I've discovered that the DriverPack Solution logo is the same as the Xbox, just a bit sideways, and it also uses the same colours as Microsoft does.","Made a soul gem and stand from Skyrim. Came out pretty ok I think.","Accurate depiction of Trauma Team","Lest We Forget","Internet, respects this innocence... please","Looking for a good hard drive to upgrade my PS4","Dark Cloud. Forgot how much I love this game. About to replay it, I don’t think I ever finished it as a kid. ☁️","Steam should do a customer appreciation event that provides partial refunds for all games played less than 1 hour in library.","That Spider-Man is a MENACE!!!! (Amazing Spider-Man 2)","PlayStation VR – How is it better than other VR’s","They Targeted Gamers","Gameplay GTA v Real","Payment Declined at Instant-Gaming, \"3DSecure error\" not giving money back.","Gaming runs in the family I guess","Article on the Changing Landscape in the Game Industry from Someone in the Industry","Shopkeeper in Skyrim randomly falls from the sky","I miss the good old days D:","TF2 reference","Child of Berserk ( By Anato Finnstark )","Destiny 2 - Free on PSN right now","Maybe I'm out of the loop, but did anyone else notice that the two options at the end of Far Cry 5 were \"Resist\" and \"Walk Away\", the two rallying slogans/hashtags of the Democrat and Republican parties?","I want to know, what did you think about the Scarecrow levels in Arkham Asylum? Do you think they should’ve been implemented into the other Arkham games? If you didn’t like them what do you think would’ve made them better?","Got this gem from my girlfriends mom. Complete with the game and both booklets! Did not know that she used to be a gamer.","Looking for a genre mashup: Deck-building and city-building in one game","Ummmm is this a glitch? I just got this from the mars milestone...","More Spider-man PS4s?","How about this for a remake?","Streets of Rage 4 - Reveal Trailer","CYBERPUNK 2077 Gameplay Demo 2018 #2","Do these statues look familiar to anyone else? (From Wushu Chronicles trailer on Steam)","Scott the Woz- A Console's Last Games","Pokémon fan game-making tool shut down by Nintendo","PlayStation Plus Free Games for September 2018 Announced - Destiny 2 &amp; GOW 3 Remastered","I added Adam Jensen's apartment theme to V's Apartment from the Cyberpunk 2077 demo.","MW2 Is Backwards Compatible!","The Wild Wasteland: Deathclaw","Far Cry 3 Classic Edition","Attempted to make the Gayest Pokémon squad I could after enjoying Pride this weekend. Thoughts? Can I go gayer? (Fire Red)","I got vault boy to help me get back on track","\"Priest (Soul Knight)\" by EvBel","This Limited Edition MW3 Jeep i saw at work","Destiny 2 is free with Playstation Plus","Found in my nostalgia box.","Most consistent game publisher/developer in your opinion","Take my whole hard drive why don't ya","Someone stole my kids’ PS4 😡 and I’m looking for some online help.","Who knows what game this is from my friend sent me this picture but he won’t tell me","Anyone know this guy?","Fallout 76...","I feel like this is going to be the game of the year; or a fallout version of ESO and GTA. Fingers crossed it’s not the latter. 🤞🏻","Your methods for clearing your backlog of games","I did this because I can","Will any laptop with USB-C work with the Razer Core?","Skyrim really is on everything","(AskGaming)What is a good first-time video game someone should play if they've never played video games before?","In 2077, if you shoot at the end of the reload animation, the gun still fires","Fortnite Bad, Minecraft Good","Insomniac Games announced DLC on not yet released Spiderman game. Might suggest the DLC is a cut content from the game to be resold as DLC.","Ubisoft is the New EA","FRAG – Casting an LA-based Fortnite Player for Short Horror Thriller Film","Can you tell I was 10 last time I played MW2?","If Elon Musk Thinks We're Living in a Computer Simulation...","Cinematic gaming channels","Site/tool to check if specific game is Nvidia or AMD optimised?","Reliving the golden days","A love letter to Minecraft","What games coming out or just came out are you excited for?","You are all here complaining about Sims and Total war, how about Train Simulator?","Most disappointing final bosses.\"SPOILER\"","FYI: Ubisoft does NOT issue refunds for digital content. Was spoiled by Steams better refund policy I guess.","Getting Persona5 for GTAV PS4","Sleeper Hits - This Generation (PS4 Xbox One)","Jack! Jack! He's a handsome maniac!","Favorite RPGs? Lists Welcome.","Hi would this be able to run WoW okay? I’ve had it for about 2 years, it’s also an i5. Thanks!","This is Jet Island, An open world with massive bosses, Unique mechanics, And multiplayer. I Highly recommend watching this.","Can anyone recommend me a war game?","This feels a bit lame to be honest. The ps4 version seems a bit nicer even though there is only one difference between how you start up the games on the collection on both consoles.","Sagebrush - Releasing 9/18/18 on PC and Mac","I just bought Zelda A Link to the Past and these were the previous owner’s save files 💀","RIP","\"FIFA18\" Story of the Hunter of Impression","This is by far the most challening game I have ever tried.","Rainbow 6: Siege of VR","Kinda looks familiar hmmm","That must hurt, Yakuza Kiwami 2","Honest Gaming","Ahh Glitches, The Best Part Of Games","How Does One Go About Becoming A Creative Designer At A Video Game Studio?","How to improve your reviews...","What simulation games do you have the most immersive graphics/physics?","Luigi's Mansion music","Forgotten title to beloved sega saturn game","I CAN'T REMEMBER THE NAME OF A F***KING GAME","Gameplay trailer for the H.P Lovecraft inspired game : Call Of Cthulhu","Mugman/Genos crossover I created today.","School sign in Mid-Michigan","The only remake I want to see.","Nintendo Cancels Plans for Chris Brown's Punch-Out!!","Anyone looking to play some Monopoly Plus? you do not need the game to play, just a working mic :)","Connect-a me!","For people looking for cross platform games. A wiki others and myself have slowly put together.","Anyone played assault andriod cactus?","How good do you think red dead redemption 2 will be?","Which \"collector's edition\" was the biggest rip off?","Overwatch Twitch streamer gains 7,000 subscribers and 60,000 followers in one day after Blizzard promotes stream with free cosmetics.","Savage Kiryu [Yakuza Kiwami 2]","Création d'un reddit de qui parlera de manga / Subreddit french for fans of manga","Now that Amazon's killed the 20% discount for game pre-orders, are there any other retailers that offer pre-order discounts?","The Road Ahead [Fallout 4 - Far Harbor]","Old Headset with Mic Issue","Steel Division 2 - In-Game Trailer","what are some of the best games for modding?","Bethesda, you’ve done it again.","Titan Arena Is A Massive VR Boss Battler","Confirmed.","Trying Out The Leap Motion Controller With Star Wars Theme","The Zelda team really went wild","Background NPC taking a whiz on a wall","Anyone remembers Unholy Wars on Ps1?","The hype level is unreal.","No need for bullets When you have Wolololo","Laptop","My dad isn't great at PUBG but he managed to win a game without any kills by outlasting the final person in the final zone.","I got one!!! #38707/#50000","Batman: Arkham Knight, Spider-man's rival still freakin awesome","The lifelike animations in Cyberpunk is insane.","EA, I've been a loyal customer for more than 10 years, but I just cant put up with your crap any longer, I'm voting with my wallet.","Peach?","Need help finding the name of a game unveiled at E3!","Game reccomendations for PS4?","Games like \"family man\" (mafia, murders, etc)","I am going to get a Terabyte hard drive for my PS4 to download some more games. Which hard drive do you recommend?","I heard you guys like Yoshi baked goods... I bring you homemade Yoshi cookies!","Can anyone give me suggestions for Fantasy RPG games similar to Undertale?","I found this old tips and tricks book that my dad had. This magazine was issued on March 2003","SCUM server patch out now","Number 42,400 here :)","What are some common gaming terms in French, German, Spanish, Polish etc?","What games do you think handle an easy difficulty better than the Lego games?","He will always be my hero.","Currently working on a Soul Calibur VI commission for Bandai. Didn’t get a chance to finish it off at the Ring Out event in LA on the 25th. Finishing off Sophitia today!","This mobile game company took a screenshot from Age of Empires 2 and passed it off as their own game in this ad","Help me identify this character?","THE BATTELFIELD 5 GAMEPLAY WITH RTX IS EPIC !!!","Could this be the Cyberpunk release date?","City reveal from game I've been working on","Loading Roster-Fuck. Well fuck you too EA","When you gotta reach the word count in a PG-rated essay","help !","Xbox One Games with Gold Revealed for September 2018","Parents - What games do you have your little kids play?","Anyone got a problem we can solve it on rust 😤","I've been working on this game for a year now and today I'm happy to say it's live in the App Store. It's a 2d platformer where you tilt your phone to move and tap anywhere on screen to jump. No more ugly on screen d-pads or auto run mechanics to worry about.","PS2 Games I Should Buy?","Getting someone else to buy you a game in another country?","The game that needs remastered or a sequel, maybe even both! With online play!","My new tattoo","Help me select a console,will you?","Gaming&gt;Parenting. This is why we can't have nice things anymore. But let's blame \"the community.\"","Onimusha: Warlords – Announcement Trailer | PS4","What is it like meeting up with someone you met in game?","My birthday cake!","Optimal Grapics settings for low end graphics cards.","Warning to all parents!","O SAPO NÃO LAVA O PÉ PORQUE ELE TEM QUE ATRAVESSAR A RUA - Frogger (1981)","Semi-realistic road trip game?","Our newly started Let's Play channel just completed Detroit: Become Human, and are following it up with a classic from the same choose-your-own-adventure genre: the fantasy film noir game \"The Wolf Among Us\" from 2013","Onimusha: Warlords is coming back (PS4, Xbox One, Nintendo Switch, Steam)","Some Photoshop practice I did a couple of years ago. Still proud of how It came out personally.","Need an opinon:","Does anyone know what this Arabic in Bioshock Infinite means?","New aronym for cyberpunk 2077","Defense Task Force - Sci Fi Tower Defense 30% off!!!","Anyone Know Some Really Bad/Buggy Indie Games???","Ubisoft is bad for many reasons and one of them is this:","POPstation, this is the \"PSP\" my father bought me because it was cheaper lol this was years ago of course when he saw my face he new something was wrong.","Any Steelseries Arctis Pro Wireless Owners","Almost Half a Million Viewers Tuned in to CD Projekt Red’s Cyberpunk 2077 Gameplay Reveal Live on Twitch","Probably nobody cares about mass effect 3 ending up to this point but here i go anyways...","One of the first games I bought on ebay. A worthwhile purchase","Question about gamestops $20 guaranteed trade in promo.","Hopefully this will be as good as 4, 5 and Zero.","Ready to play like it's 2009 again!!","Cyberpunk 2077 Gameplay Reveal — 48-minute walkthrough","Need advice ds2","How do i get better at Quickscoping?","Freedom Fighters: The Game that made 2003 for me.","Probably the best thing out of the Cyberpunk 2077 reveal.","Online gaming merchandise advise","\"single-player games are dead lol\"","How are you liking the new halo master chief collection update?","As they say : \" He still got a family to feed \"","Interview with the development team behind SCUM","Good to come back to this","Best way to clean mousepad?","I think this may be the hardest game I've ever beaten","Dark souls addiction.... Alternatives?","Spent far longer on this than I should have, Father Gascoigne from Bloodborne - Ink","These are rare","Microsoft will now let you finance an Xbox One S/X in Stores (Limited Supply - In Store Only)","Well then.","What’s your opinion on the Spider-Man PS4 bundle???","Cyberpunk Ciri cosplay by Irina Meyer","My PC has taken war gaming too seriously","New pin finally arrived!","Hazardous space early access in nutshell","Fallout 4 introducing underground ghouls","It depends....","Lives in the Nucleus where rads are worshipped...sells Radaway.","My time at portia or Recettear?","Nostalgia is gaming’s biggest trend - Do You Agree?","The hardest game I ever played (No it isn't Bloodborne) (Warning Rant)","Words cannot describe how pumped I am to play this again.. this game got me through a big difficult shift in my life and holds a seriously special place in my heart - thank you Microsoft for making my day so much better!!","remember this 90\"s game on video games ??","TF2 vs Overwatch 13","I Have Some Rare Gaming Items, Where Is The Best Place To Auction?","Cayde... Why so Serious??","Anyone wanna play Battlefield 1 on PS4","Favorite gaming/boardgaming podcasts?","Them are fighting words.","Gaming fortnite play","Hover, A New Multiplayer Parkour Game, Launching on PS4 September 18","Study or Super Smash 🤔","Haberdashery Game Insanity (World record score)","Gaming history lesson: A literal butt once delayed Halo 2 on Windows Vista","ITS FINALLY HERE","Got the surgeon simulator plat!","I was bored and i played some css","This is Cyberpunk 2077","Playing uncharted 4 and I noticed the SA Coat of Arms use in a Madagascan customs office.","Why do poeple not like Uplay. I love the fact you earn in game achievements that get you 20% off on any next purchase.","I drew Link from Ocarina of Time [OC]","Castlevania SOTN 200.5% map completion please help me find the last 0.1%","Life Is Strange is a required text for my friends college course","Tip - Triks / Smashing Four , Fantasy Finger Football , Asphalt 8","You guys need to check out FIREWALL ZERO HOUR. It’s so much fun","I tink garret didnt check","My favorite soundtrack to any game. Who’s with me?","Concept art for the new Spider-Man game","It's time for an adventure..again.","Madden 19 Qustion....please help","Starting the adventure for the thousandth time. Vandal hearts","Found this when cleaning. My sons room. I got super excited only to be let down by not finding the charger along with it. :(","Misunderstood sprites","A #NintendoSwitch Pro Controller featuring the Super #SmashBrosUltimate logo will be released alongside a bundle featuring the new controller, a steel case, and the game when it arrives on 12/7!","Just found this. Laughed so damn hard I can't even","Question about dead cells saves","Found this in a second-hand shop !","good mice with shitloads of buttons on em","Which of the 27 top, most stable, non-whitelisted games running on Steam Play beta interest you the most?","2019 will have some of the best games ever.","What do you guys think is coming in the new patch for JWE?","Top 8 teams from 2018 Pokemon World Championships from last Sunday","ARMS - High Tournament Play Montage - Vol.1 | Great Plays from Top Players [Nintendo Switch]","Super Luigi 64??? I didn’t know this was a real thing?!?!","Thats gotta hurt","Breath of the Wild is my favorite game and I was finally brave enough to do some fanart of it","Never mind SKATE4 I want skate and destroy 2! Where u at, Rockstar?","A comedic skit on gaming thots...","Gtx 1060 3gb vs Amd rx 580 2gb","Mooooooooooooddddddddddssssssssss","Sorry children. There are bigger priorities...","The Pokémon Invasion, 20 Years Later | Great story on Pokemon's first launch and origins, describing why the game's unforgettable music was so crucial to its success","Call of Duty: Modern Warfare 2 is now backwards compatible on the Xbox one.","The Zelda:BotW mods seem to be coming along very nicely","If your interested in joining the channel get in touch","MW2 now backwards compatible on Xbox One","Onimusha Returns with Onimusha: Warlords Remaster for PS4, Xbox One, Switch, and PC","Anyone want Join in Final Impact Closed Beta?","The greatest open world game of all time","Anybody else get into this downward spiral at one in the morning?","Skate 4: The Right Way","If this was real life I would be a billionaire.","The return of BattleTanx?","So what's your GOTY so far ?!","Ace Sniper","GTA San Andreas","The remake the world truly needs","Thank you Heart of Darkenss for the countless nightmares of my childhood","Last Official Games ever released for Consoles up to the 6th Generation","Homest to god, who here had actually bought a game's soundtrack?","Project Cars 2 - First Lap Antics","Forsaken loot","Which is a better game franchise Forza or GT","Now That Is Hard To Argue With","A question about Dragon Quest 11","In honor of the cyberpunk 2077 gameplay reveal","Fornite Devs Scramble To Explain Unintended Purple Cube","Is cyberpunk 2077 really gonna be as food as its hyped up to be?","And here we have.. Oh- uhh.. well, here's a nice ship.","Question for the Old school RPG players.","Early concept for Ratchet &amp; Clank","After not even using my wii for over 3 years, I decided to start playing an amazing game today, only to beat the grand finale galaxy for the first time in my life. The best childhood game I’ve ever played.","Post your most awesome gaming wallpaper!","XBOX1 MW2 CLAN, lets get it boys!","This game.","Seeking moral support for gaming-related OCD.","When she wants to go for round 3","nvidia graphic card/mac bootcamp windows","Thirst Zapper!","\"Yeah, I can play the guitar.\"","With the power of Flex Tape, anything is possible!","0 A.D. Alpha 23 - A Historical Real Time Strategy Video Game","Super Mario [?] Piggybank","Predator Thronos gaming chair would be perfect with 6DOF motorized action","My Lan party - 3 or 4 times a week!","Which Marvel vs Capcom?","Link cosplay from Breath of the Wild!","Need a friendly help","Pokémon Red/Blue vs. X/Y","cyberpunk 2077 gameplay demo music tracks","Most Evil Mario Level","Every skyrim adventure 🤣🤣🤣","luigi","Innovation made real with a little help from Kickstarter. But do these products really make the cut?","Although my BK anniversary item from Lootcrate is being shipped seperate due to a delay, still got this cool little poster.","Unlit.io - Made by a couple of my friends and I. Go check it out! Any suggestions are welcomed!","So, uh... I guess I spanked my opponent?","Multiplayer games","Vintage warranties are like the good wine.","All my best Nintendo gear fits perfectly in my new CPAP machine’s travel bag!","Playing some PUBG!","GOTY Masterpiece","Should I quit playing Spider-Man Web of Shadows?","Yennefer cosplay by MilliganVick","HELP DECIDE: Monitor vs Monitor","Is it just me or does SCUM feel like a Titov title??","Now that i got color on it, i can show you one of the last pieces i got today! Kaepora gaebora!","Riot Games accused of fostering a hostile, sexist work environment","I have a GTX 1080 Ti, should I save money and upgrade to 2080 Ti for Battlefield V and recently future coming games or not? Why?","Blizzard removes paid loot boxes from Overwatch and HOTS in Belgium, says they have \"no choice\".","Love it! ❤️","My Mario sculpture finally complete. Who should I do next?","In FPP, whats your Horizonal Field setting on?","I made some knife from cs:go out of wood","\"Plague Knight (Shovel Knight)\" by Gustavo Garcia","\"Jesus christ, my legs...\" the guy screaming without a head I already fell in love with Cyberpunk﻿","After 2 years I finally did it and it is so satisfying","XBOX GAMES WITH GOLD SEPT 2018","hand keyboard placement?","Splicer cosplay from biosock by me and gf (photo by: K Cosplay Video)","Heard about the new updates. Decided to give it a try. Got it for 30 bucks at Walmart. Rip off?","Onimusha getting the HD Remaster treatment.","Microsoft to be in selling Xbox One S and X models on subscription service plans","Goose Game -- looks like the best game ever!","Switch, PS4 or Ryzen 3 2200G?","Gaming War Bothers...that Never Get tired !!","Dark Souls Trilogy Ultimate Game of the Year Edition announced today","Any tips?","WHO'S BETTER (I think the one on the right)","GTA San Andreas #2","woah, thanks konami! Great sale there!","As someone not really all that into gaming, is the Switch for me?","Curious about first build","A DLC roadmap for Marvel’s Spider-Man has been revealed with 3 planned installments. The first arrives in October with the latter scheduled for November and December..","Meet Pucker-Face, Hero of Kvatch!","At some point all control was lost","What's your favourite game?","Yoshi and Mario are best friends. Except they're not, because Mario is a jerk.","[Furi] should I move on to Furier?","Girls only play fortnite and overwatch","New mobile game?","Battlefield V launching with multiple missing features. When are we going to stop allowing this kind of nonsense?","Any steam games that are kinda D&amp;D like? I want some good rpg games that will last me a long while.","DayZ Equivalent","Looking for a good laptop.","Glitchers should burn in hell!","Nice little find In my garage","Mario Kart Wii: The History of the Ultra Shortcut - Summoning Salt","The OG battle royal","Soooo now my life is complete. 🎮🕹️","DAMNIT MONSTA","First take on my favorite video game character. Say hi to Midna!","Is Sonic the Hedgehog nowadays furry trash, especially compared to Mario?","Xbox help","My dentists office had a gameboy","Stop shootings 2 gamers killed guns are not toys","My latest Matt Groening styled Overwatch character, Moira!","Tips for building a first PC","Ideas for a LAN party.","Should I try playing factorio or not?","Last Undead Standing","Dragon Priest staff carved out of wood... Good Staaff","The Nostalgia Hits Me Every Time","Modern Warfare 2 is now backwards compatible on Xbox One","New headset","Looking for a game I can play at work, preferably possible with a track pad on steam.","PSA MW2 IS NOW BACKWARDS COMPATIBLE ON XBOX ONE","Looking for a Sound Bit?","Anyone know when kindergarten 2 is coming out","Just picked up my copy","The Final Contestants Of The NEO Game Competition is Here. Have a Look (Video)","*Video Editor for Hire*","Tony Hawk meets DOOM boss","Not a full battlestation, but perhaps you fine folks will appreciate “The Captain’s Chair, mk. 5”.","Found some of my old PC game boxes and manuals in my parent's loft","Repaint and made the handle of my Daedric sword from skyrim!","Gotta love Valve.","Not the best story, but fun multiplayer","MY AMAZON ALEXA SOLVED 3RD QUESTION IN BALDIS BASICS!!!","Why Skyrim keeps pulling me in, even 7 years later","What's the gaming community's perception of Nintendo?","Holy shit, this is kind of exciting and its got my mind of cyberpunk for a few minutes","League of kitties","Modern games are a little frustrating","5 Years in the Making - Tomb Raider Saves","Time to Play Games","What graphical detail do you think many games fail to get right?","Warhammer 40K Tech Priest Cosplay - SKS Props [self]","Just gonna post this here","Internet (aus)","This is the popup in Madden 19 today","The only way to afford playing a game from EA.","What is your honest opinion on Minecraft now?","Capcom is finally listening","Cyberpunk 2077 easter egg in loading of gamplay, it means in Polish \"The Witcher 3 is the best\" :D","Painted Zenyatta from Overwatch. Hope u guys like it. ^^","Grandma called and said \"I got something for you\"","Modern Warfare 2 is now Backwards Compatible on Xbox One","OMG Streets of Rage 4! Finally!","Cleaning my house and found this . Memories","It’s finally here!!","Entire controller collection","My Bioshock Infinite Framed Poster","'We Happy Few' is a lovely game to play with Grandma!","When you skip leg day","The Golden Era of Xbox Live - This needs more attention","All in all, The Witcher is a great game on a technical level","What's the first things you check / change starting a new game.","Who else gonna be playing Modern Warfare 2 now that it's backwards compatible?","Dope game","Destiny 2: Forsaken – Launch Trailer","PSA: Valve is working on making Windows games playable on Linux with Vulkan","Cyberpunk 2077 added a Blade Runner Easter-Egg in the Gameplay Reveal","My most anticipated Cyberpunk 2077 feature has to be the reflex booster that...","Aim in online fps","‘Cyberpunk 2077’ Gameplay Thoughts - ScreenHub Entertainment","are these temps okay for a brand new laptop while gaming?","It’s HAPPENING","Found this beauty in my closet today.","PS4 500 Million Edition","MW2 is backwards compatible as of today, so my boyfriend immediately bought, downloaded and logged in. TIL it’s possible to play 36 days on CoD","[Discussion] Getting xb1 for backwards compatibility Questions/Concerns","Bought it digitally on Switch but enjoying it so much i needed to get it physical. Sadly the Switch version was out of stock :(","Honestly super excited to play mw2 again and relive my high school glory days","Oh how far we’ve come *throws controller into tv","Are Astro headsets really that good?","Any good First person open world rpgs?","Seagate External Drives","Advice needed for finding the right game (offline RPG)","Fortnite sniper in Black ops 3","Just a curious gamer who wonders what other gamers have to say about this matter.","Onimusha coming in 2019","Who I really wanna see in the new smash","Cyberpunk hype is real","Playing Old Game!! Resident Evil 2 on ePsxe~","When you start playing Pokemon again, but are now an adult","What","After Jacksonville shooting, Fox News panel calls for regulation of video games and smartphones","Despair, capitalism and the need of seeking for a better future. This is Damnview: Built from Nothing coming to PC &amp; consoles in 2019.","King K. Rool is too Fat for Smash","Such a niche... But SU-27 (DOS) was my childhood in 1997","Essence Magazine plagiarizing a Youtuber","Zelda sword and shield keychain set for $10!","A great way to destress after a long Monday....","gamers plight(long)","R/Gaming Showerthought...","My last purchase from Hollywood Video about 10 years ago.","Why hasn’t there been a new battletoads game?","Can Anyone help me find a Tower Defense game? ~2010","Some men like breast, some like the booty....","Quit gaming 6 years ago looking to start again - Sell me on a console","Guess I'm a bit late to the party","Latest update video of a fan-game for Half Life 2 Episode 3","Best Beast Class in Anything","Just got the good old skate3 again (fresh from the box)","So, I’m writing a story for a game. What do you think?","Me when people get mad because there's no new Smash Ultimate info in the latest Nindies Showcase:","What game's story have you re-played the most, and what parts do you look most forward to revisiting each time?","Spiderman PS4 or Skyrim Switch?","What is the best website to use if your goal is to make a website designated for gamers?","How the video game Ingress helped prepare the Cajun Navy to save lives.","My dissapointment is immeasurable 1/5 Do not recommend","Name the most fun gameplay abilities or ability animations you've ever experienced!","Nintendo's SMALLEST &amp; MOST OBSCURE game console!-Pokemon Mini","Pre-ordering a reselling on ebay","While my xbox one s was doing pretty good, this gaming laptop just came by. Obviously, it's an Alien to the console.","Cyberpunk 2077, Ghost in the Shell, and some ideas","Confession: Sometimes I disconnect in ranked before 00:00 and jerk off for 5 minutes and make all other players wait for me","Rainbow 6 Siege or cs:go??","Anyone remember this gem?","Dota 2 International 2018 Battle Pass features to be extended for two weeks","Good advice","Cyberpunk 2077 looks surreal","Fortnite Pistols (ONLY) Pistols vs. Scars: Gone Wrong","Need help identifying a game!","If you could only play one, which would you pick? Spider-Man or Tomb Raider.","Does Goldeneye have a story that connects throughout the games?","Cannot connect to MW2 servers on Xbox One","What do you guys think about big bumpin’","What are some fun cheap-ish Steam games that can be played offline on a plane ride?","FYI, MW2 and MW3 are available for backwards compatability on XB1.","1080 Price Drop","Half life 3 set for 2077","Question: Are there any really good Labor Day Sales for the Nintendo Switch?","PlayStation Plus is better than Xbox gold","Gta online","Nefarious Trailer","Shovel Knight Showdown - Gameplay","Bethesda's Pete Hines on Playing Fallout 76 Solo and Why 'Replayable' is a Dirty Word - Gamescom 2018 - IGN","He did it for the Ballas to catch up...","Any good Wiimote to USB adapters?","Good recording software recommendations?","Not sure which weapons to pick can i get some advice [Nier Automata]","Looking for a game, I cannot remember it for the life of me.","10 year anniversary of Castle Crashers!","Off the hook","How to setup Project 64 for school! (working)","Characters in other games","Not sure if it's still cool to post this stuff but, here is my N64 collection from when I was a child.","Need help with Games for dad.","(Xbox 360 Gameshare) Dance Central discontinued downloadable content","Rising Storm 2: Vietnam is less then $10 on steam."]