["We are looking for users to join our mod team.","Saw these stacked stone arches at the beach this morning","Apparently my doctor always opens the door with his pen in hand","This upright statue on a slope.","My phone camera captured a shooting star","Chick-fil-a will take a penny off your order if the total comes to 6.66...","These are “Bat” Orchids.","This mural at my school has Fahrenheit 451 positioned on the fire extinguisher.","Dog biscuits interlock to make a pretty cool pattern","A creative customized Metallica license plate","The almost identical similarity between my dad 36 years ago and I.","My shoes came with a “handle” rather than being packed in a one time use bag","I think I’m the chosen one","the way my lamp refracted through my glass of water","This watch my friend got from a math competition.","My textbook rental came with a Redbull","These heart and cube-shaped fruit","An ant in a droplet on a flower","This vertical chessboard in a cafe.","This yogurt lid can be folded into a little spoon","Driftwood swing, Oregon Coast","My wife tore apart our house looking for her last puzzle piece. I cut one out of the box it came in to fit","This chicken strip that looks like a dolphin.","That drop of wine perfectly ending its course in the glass of the angel","These two bulbs both failed on the same day. One went white and the other black","Water droplet that looks like a tree. My first reddit post :)","Found this Ballot Bin in Amsterdam.","My local candy shop sells the messed up gummy candies","Caught a ring of fire coming from a 44 magnum while taking a picture of my buddy at the range","I still have a free ticket to see Armageddon from a McDonald’s promo that expired 20 years ago today.","A butterfly landed on my nose today and hung out for a bit.","This really square pebble I found at the beach.","Her blonde side has white whiskers, her black side has black whiskers.","Creative poster in my teachers classroom.","1st time I've ever been on a \"green\" roof","This grape that looks like a pumpkin","This egg looks like a tiny potato","These new LED street lights makes the shadows look low-resolutioned","This horseshoe crab shrine I found and photographed at just the right time","This bee has been watching me for far too long","Cross section of a felled palm tree","There’s a hole in this hotel soap to reduce waste.","Fueled up and this happened - was more excited than I should have been...","When I'm walking in a different neighborhood, I'm always careful as I don't know what kind of dangerous animals may be in the area!","My phone camera captured the Milky Way at a local music festival","This single dandelion in a field of grass.","This marble I just made that kind of looks like a flower.","This building looks like it is 2d","IKEA uses projected arrows instead of floor stickers in order to prevent people from scratching them over time.","Found this snails in forest today.","This Children's Hospital X-ray machine is designed to look like a fire department ladder truck","Every mountain has its own little cloud","I made a Fifth Element Fire Artifact. (Rough Draft)","My oldest son went off to college hours away last week. Today I found this letter he hid in 2012. Made me laugh and cry.","A block of clear homemade Ice.","The salt &amp; pepper shakers on this Dutch airline are little clogs","Grass growing through a mushroom","A jewelry store used a break-in attempt to advertise the demand for their inventory (Translation: \"Everyone wants our jewelry!\"","This defiant plant in the middle of a parking lot","My daughter’s Toothless came with a fish for the trip.","My order uses packing tape which tells you which side is OK to open.","This onion ring that looks like a perfect 8","Money in the Faroe Islands.","My friend's eye-studies drawn by hand. Red ones are my favs","[OC] The 700,000 seat capacity, future-home of the Los Angeles Rams and Chargers from birds a eye view.","My son’s middle school misused the meme.","This bracelet charm has been worn down after being on my coworker's wrist for 22 years.","Parking that depends on the year.","The mileage on my car.","A statue of a dog driving a scooter with a bunny on the back","Funny little floor sign I found","My chicken on my fourwheeler","This Candy Corn looks like a Tie Interceptor","This can/ plastic bottle combo","“The finger wipe board”","I got a speeding ticket over the weekend. 6 different different lawyers sent me letters today","These vandalized flushing instructions inside a train station restroom.","Inflatable castle next to the real castle","The light shining through my window reflected through the water bottle and colored only the W key blue","Polarized sunglasses + car windows = rainbow skies","Neat tooth fairy bill from 74","My egg looks like Eva from Wall-E","Restaurant has ridiculously large salt shakers. Crayon for scale.","This book of random digits","I just peeled a Garlic with all the cloves fused together","This giant manilla envelope. Chicken Noodles for scale","This really, really small jar of Nutella","My favorite new charger I can already tell","These 2 lizard skeletons I found behind an old sign","There was a tiny hand print inside this unopened jar of pb&amp;j","Polish regional trains now have wireless charging tables","This fly that got stuck in the vent panel in a rack.","The cake sample I got from the bakery","This box of snacks delivered to my local 7-11","This apple is red inside! (Pink Pearl apple)","This branch fell out of my tree and landed perfectly upright.","As I was about to eat, I was greeted by this fella...","The sun shining in at just the right angle to make my glass desk glow","The last window in my living room being lit differently than the other two, from the sunset.","My odometer hit 77777 miles while it was 77 degrees","I found Adolf Chipler","Rock and Mandela Effect","Redditors actually followed through with his request to keep it at 666 likes","A comparison of the same swim suit, except one was swam in almost every day for several months, while the other is brand new and has never touched a drop of chlorine","This butterfly hung out on my leg all the way home from class","This apple is so ripe it bursted.","My Mum bought some furniture, and a dead lizard to go with it","Saved a shot on goal with my arm and left a perfect imprint of the stitching of a ball hours later.","This mostly full never opened bottle of Ancestor Oil medicine.","Stumbled across this impressive stack on rocks while hiking the greenbelt.","These plastic spoons that look like metal ones","4 years ago, my gf, daughter &amp; I took a boat out to a tiny sandbar island in FL. We were the only people there. We took this pic. I have a tattoo sleeve on my right arm. You can see this (&amp; my daughter) in our glasses. But in my gf glasses, another me? We’ve never been able to make sense of this.","This giant cheezit","The condensation on my football Dr. Pepper gives it a football-like texture","This is a grease stalagmite that formed from drippings off of the grill at my work.","This person who seems to be shopping in the right section","My laces came untied during a race and impaled itself on the spike.","Caterpillar likes my rhubarb","My tomato plant grew a grumpy old man. Dirty fingers for scale.","No jaffa cakes left over night","This tiny plant is growing out of my kitchen sink","Up or Down, this pin stays the same","A remixed version of the Mona Lisa","Violife Cheese slices are cut into bread shapes so you don’t have overhang on your sandwich.","Weird looking seaweed","So...umm...this real place.","This balloon firetruck","Those umbrellas are cheaper when it's rainy outside","When there’s a picture of the KFC colonel without the rest of his apron, it looks like he has a tiny dancing stick figure body","We found a rock at work that looks like a shark","This cherry Tomatoe looks like Mickey mouse","My Family business turned 45 and the BBB (better business bureau) sent us a happy birthday jelly beans.","This avocado that looks like Audrey 2","This electric eraser found in a local resale store. It was a lot quieter than I thought it would be.","This one eyed frog.","Found this 1956 calendar in my kitchen wall","A goose at my work is missing part of his beak","This moss formation","My dog peeled and ate this banana without detaching it from the bunch","Unicorn ransom Polaroid","The fold in this pringle","My textbook came with a page of sticky tabs to use.","When training for surgery, doctors apparently make bead patterns.","The woman in this advertisement looks exactly like Matthew Lillard.","I sat on this patio furniture thinking it was going to be heavy aluminum or copper or maybe even stone. It was plastic.","The way the lady on a water truck looks like she spilled water on her dress.","The coin on the left is worth 42 times the amount of the coin on the right.","This priority sign in a Dubai supermarket","A bird flew into my window and left its mark.","Appropriate registration","You Can Please Everyone","Havent seen this one yet","This neat video game store card with all numbers and locals and buttons","That can't be good for visibility","This fence made of mattresses in Seattle","My apple has a smiley face brown spot!","While Reading A Washington Post Opinion Piece About Sexual Harassment, Louis CK and Masturbation, This is The Ad I Was Served.","This representative toilet sign","The cakes sold in the bakery in my town has flavor written on it","This rock with a small fence around it on the side of the road","I opened my chopsticks and they were burnt","These Bin Laden matches","The way this incense ash formed","The way this ice cube froze","The way these matches got stuck together","Only this one branch produced pink leaves, all the rest were green","I made a hybrid earphone with Motorola and Samsung. I feel like doc Frankenstein right now. (Engrish)","Antlion funnel traps next to a building","My campus sells scantrons in a vending machine","Ceiling bin for baloons.","This grasshopper thinks my car is the mothership","The way the clouds end and sky starts","! Keep coffee mugs out of children","My bicycle headlight changed color from black to copper after being exposed to sunlight for a long time","This one eared donkey","This tiny tomato that my tomato plant grew","Praying Mantis landed on my shoes","The A and O labels didn't work in this Red Cross ad.","The view from my plane looks like Mars","Found this little stone on a walk with my dogs.","This was the wallpaper behind the urinals at the reception hall for my cousin's wedding.","This door asking you to pull from both sides.","This heron has a trendy haircut","This plum growing straight out of the trunk instead of a branch.","The way the neck of the bottle disappears with portrait mode","This green potato chip...","a sign I pass every day","This restroom stall in China that tells you which stalls are open","Dad liked a common European garden spider so much, he decided to take a photo. They turn out to be reflective!","found this little knight fighting two dragons. part of a modern fence at an old castle.","Written on a wall in a house I'm remodeling.","This giant defecating grasshopper","I found some homeless books on a public bench","The way the light is coming through my window looks like it’s coming from the car on my TV.","This sign in Texas","These wiggly eyes watching me on my walk to the store this morning.","Our rental car had over 100% fuel","The vending machine at my workplace stocks Budweiser Prohibition.","My background makes it looks like my screen is transparent","This rock wall on the side of the building","This fabric softener has an iron ironing straight the bar code","saw a real police box in london","These miniature shopping carts for children (on left)","I just found out my mom is the 5th top person in the world on Candy Crush","This spider web is killing off the leaves on this part of the tree","My boyfriend found canned water in Tesco","The lifts in my building","My roommate’s new fork(s)","My sister apparently is a god with reaction times","The Sun has faded all of the colour on this packet of crisps, except for the sugar content percentage","This guy taking pictures at a concert with his Nintendo 3DS","Painting waiting to be picked up at the airport","I dropped some orange peel on the ground that looks like a bird","A penny from 1961 and one from 2006","My shoe was stung by a wasp","Misaligned dollar bill","Pigeons hiding in a tree after falcon attack, they were all on the ground before","The floor got so worn down down to the previous tiles from all the people who got through the door.","Wasn’t aware it was possible to see both sides of a rainbow..","My studend ID has been in my wallet for 4 years. The plastic from my wallet absorbed all of the color from My ID","I found a store that sold a bunch of alpaca themed items.","This nugget from chick-fil-a that's shaped like Mexico","The logo of the building is a logo of the building","A whole shop dedicated to Haribo (type 3 diabetes?)","Pepsi are revisiting their old designs for an event","These long courgettes I found in an Italian supermarket. They are called 'Zucchini lunga'.","This seagull only has one foot","A fairly large blackberry fully grown (and really sweet) before Autumn has even started","I found a battery that expired in 1996 in one of my old toys. Unfortunately the battery was corroded and my kids can’t fully enjoy this mermaid doll.","My earbuds zip up so that they don’t tangle","First time I have seen any upside down in a flat","Brother found a grape that has the Tumblr logo on it.","These vents are forming a Mickey Mouse logo","This plum tree only has plums in the caterpillar nest","A picture I took of the mist- Jura(France)","Chinese toilet paper doesn't have a roll","This train station has a defibrillator container built into its walls.","Guinea pigs frolicking through someone’s front lawn in Opava, CZ.","Two cameras in a row","This fire hydrant","My cat's toes are light where the fur is white and dark where it's black","These two puddles look like the old \"candle stand or two people kissing\" illusion.","Photo of my ripped leather couch looking like a dry riverbed","Randomly found my cousin's doppelganger while scrolling","The way the clouds almost are the same shape of the tree.","The colour of this tomato is so damn consistent that it looks like a fake tomato.","I achieved a nice little milestone in the van earlier today","There is a place to walk your dog in the San Francisco airport terminal","This weirdly shaped tomato my father harvested","Dawn makes the steam from my cuppa look like it's on fire","Got a small penny in change","Found my missing toolkit buried under a bunch kids toys, and it was unimpressed.","There's a secret compartment embedded in this bed frame","This window seat at a restaurant gives you a discount if you act happier","Safe meet up spot for internet purchases at my local police department.","This fire truck is on fire","This separate mini towel dispenser by the door so you don’t have to touch the handle.","My dad’s fused together purple tomatoes","The Korean snacks I bought has small fish in it.","Oil rainbow in the puddle!","This cheeky bubble wrap that cant be popped because they are connected in a row.","My hotel room in Copenhagen has a pair of dumbbells at the wall","Mad Magazine’s Early Anti-Smoking “Inventions”","This plastic tubing with holes to simulate air ducts while undergoing renovations","The morning dew made a flower in my driveway","This urinal with a tank.","But what if I don’t have the manual? Can I still staple?","I wonder if these candles work as advertised.","Urinals at my local university have a Bee printed to help you aim efficiently.","My oreo was put together wrong","My meat has a sad face on it","Rolling shutter effect during a thunderstorm","My pineapple came with instructions on how to cut it.","I was in a motorcycle crash and this was my only head injury.","McDonald's employee wage on show","All the prices at this carpark were in pennys","Thid door knob at the pediatric ward where I work is out of reach for small children","In the center of a baby carrot, lies a cylindrical core of....more carrot....and spikes.","These bathroom sinks have three different types if faucet handles","What is this!?! I stepped on this at the beach. Its 1 1/4 inches long. It has been cut on one side. I hope its not human bone but it sure looks like it! Any guesses?","Nothing strange here","This pub in Bournemouth (UK) has coat hangers and outlets under the bar","Some sort of small fruit I found today. Any idea of what it is?","This Cedar Tree Stump Looks Like a Giant Duck Footprint","A Chrysanthemum Growing Out of Concrete","This microphone clip was made in West Germany.","This abnormally large mushroom I found at work","The leaning red man of Helsinki","Chair in the men’s room of local hotel.","A threaded screw","The outlets at my school are orange","Cement truck driver stopped in front of my house to check out a little library.","This generic London Monopoly","In this bathroom in a film studio combination of tiles and mirrors are shaped like a film","My son's second and third toes are fused up to the first knuckle.","From upside-down the busses on my Copenhagen-themed towel look like sad monitors holding hands","A wizard turned my apples into potatoes chips","Random happy onion occurrence.","The US Postal Service puts mail on commercial passenger planes.","Comfy snooze chairs at the airport","This self-driving truck is not self-driving","Weights and measures from this 1896 cookbook","Duck with poofy feathers on head","The metal parts of this bullclip are ever so slightly magnetic","Water Dispenser at a Local Craft Brew Pub has a PBR Tap Pull Handle","Glasses shadow are the opposite","The way my hard boiled egg turned out this morning.","The way these clouds are aligned","In this elevator you type the floor number you need with the keypad","This tomato looks like an 8","My Doritos Locos Taco Had Two Shells","The texture on this Pita Bread resembles a smiley face.","This retro Dan Dare stamp from my eBay parcel","This sandbox allows kids to play while sitting at a table","These dual-colored crayons","The way my dashboard looks when the street light shines through my wet car window","Finished work to find someone with the same bike parked next to me!","This baby packet of Tic Tacs","My sunflower looks depressed","One of my prized rock stacks","The water was drained from this area of Walt Disney World and you can see that the Liberty Square Riverboat really runs on a track!","This Hitler Minion toy I found at a gift shop in Hangzhou, China","Traffic cone lip balm given out at the MN state fair","A craft beer vending machine in the pub","This road sign has been engulfed by nature","Strawberry jellies are bigger than all the other flavors.","People wore down the floor after taking a swing at the stairs","The way the two soaps mixed..","This little guy","My microphone looks like a very surprised person.","26kg of garbage - Screws, nails, odds and ends I removed while renovating my old house","There were two fruit roll ups crammed into one package during my lunch","This rock from my yard has a perfect hole in it.","There's nothing like a virgin public toilet","Received a letter from Senator John McCain in the mail the day after he passed away. RIP [OC]","The middle part of this house looks like an upvote arrow","This urinal has a handle for dogs.","My local golf course has a couple of wind wheels made from club heads.","The hospital where I volunteer has displays of foreign bodies removed from food and air passages.","This layered sand picture in a bottle of a surfer and scenery.","This banana chip brand uses BonziBuddy as its mascot","One of the bathrooms in my college has a Braille sign to identity each bathroom","This doll next to a painting of itself and a 4yo Agatha Christie","The pretty tree patterns that formed in this century egg","The way this toddler spork balanced on my counter.","Seashells in the roadway median in Harvey, LA","I got extra jalapeño cheeto dust","These color spectrum cherry tomatoes I grew.","The same magnet, one has been exposed to the sun for years (I know this happens it’s still cool to see it in person)","This receipt with a clove symbol on it","I Threw My Pen onto The Wall and It Got Stuck","Such a big box for a deck of playing cards.","Flower box fell, leaving flowers in a satisfyingly straight line.","I made an egg monster","They forgot to thread this screw","Over the years the window in my wallet has scratched off pigments from my student ID so now my face is vaguely visible after removing the card.","My local Italian deli's sandwiches are all named after famous Italians","The ocean / ships appear to be in the sky due to this hill","Balconies of this Building I photographed on my way to work.","Volcano crater on Etna, now semi dormant and approachable.","I crushed a plastic ice-cream cone holder and created the Sorting Hat.","The devils drives Toyota","A surprisingly well done free hand circle for an answering on my test.","a dust web thingie in my bedroom is shaped like a dancing man. kinda","The bottom of these keys look like 5 gum.","This restaurant has a sad face on the sanitary bin next to the toilet","The size of my 'wotsit' is larger than average!","Ladies matching their suitcases at the airport.","A bit of the brand new building at our school peeling off.","My Uncle's Old Coca-Cola collection.","A fairy ring in my neighbors yard","The country of Monaco has its own trains that run in the French rail system","One of my Combos didn't have filling","This one arched McDonalds.","This car I found making a O3O face and saying \"OOO\"","Portugal in a nutshell","In case you were wondering how big street lights are","Open my handbag to see this creeper staring back at me.","This actual photo of my dog looks surprisingly fake for some weird reason","Albino moth I found on my door","Local AT&amp;T store casually roasts Verizon","If the burger was homemade and looked like this, would that still apply?","The way this red trash can outside my work has weathered","A subway with a drive thru","This building looks 2D","This is mica, a rock you can peel in layers till it is transparent","Arabic translation of (per pc)","How the vinegar reacted the the rust and paint on this handplane","Look at the size of this spud. Kettle for scale.","This crystallized sap on a tree I found is purple, orange, and red","Rock hit my windshield and made a strange pattern.","I got an extra half cookie in this packet.","Iodine tablets that were sent out to us back in 2002 from the Irish Government","This restaurant has a newspaper in the bathroom in case you get bored while \"working\".","A street in the neighborhood i grew up in gets a unique sign!","The soy sauce pattern on this egg with my dinner","The inside of this recently fallen hollowed tree resembles a waterfall over a mountainside.","Found a pre 9/11 NYC patch in my police patch collection.","My first time making a rock stack","I put a penny on some train tracks and it turned into a pringle","I created this while I was on the plane and used my Geography skills.","This cloud kinda looks like Winnie the Pooh","there is only braille on one side","Bug trail in the dust at work","The way the light suddenly stops at my local park","The buses in my city are starting to have USB charging","This door at my high school has 2 different handles","The cloud formation made it look like there were two suns this evening","This fire looks like someone holding a fire symbol.","Always check your change. Discovered a 1936 Nickel right before I was going to cash my change in.","The hotel I'm staying at keeps bees on its roof","New automated checkout machines at the local supermarket (Ontario, Canada)","The difference in size between these two clams","The roof of the Hollywood/Vine station is old film reels","The way my notes move off the paper","I left a syringe of blood sit out for about 30 mins at work.","Don't know if this belongs here but when the marker dried on my Adidas pants, the red and orange switched colors.","My math teacher’s clock goes backwards","This Corn Is Split","A piece of watermelon that kind of looks like raw meat.","This car seat has a place for a tissue box along with two cup holders, 2 small flat pockets, and a large flat pocket","This egg shell is creased.","This strange cloud formation","My potato has a bum","This traffic light is for U-Turns only.","Two albino deer are better than one!","Another plane from my seat on a plane.","Dog's nose is healing from a cat scratch","My entire 12 pack of beer cans was printed upside down","The way these two dogs create a near mirror image.","My dog has a heart on his butt.","My ice cream looks like a chihuahua","Just some traffic lights near my house","The weights are color coded by how difficult they are to lift","I was divebombed by a hawk that waited for me to attack back","The shadow of my banister looks like it’s smiling","These little monsters under my bed (And all over my apt.)","My hotel shower has a hole in the door so you can turn the water on without getting sprayed","Vacation home consumed by flames (Waves, NC last week)","My cavalier looks like they’re sponsored by Nike","Functional pint-sized washer at my local Home Depot to demonstrate how the wash cycles work - video in comments","Our \"Mouse Pad\" at work.","If you fall I will catch you. - Love, The Floor","The back seat of this car has a rear-view mirror","This bottle has the expiration date printed twice","This store sells a 12lb jar of honey","I found a \"pumpkin\" at the grocery store today hiding out with the peppers","This truck hit an electrical pole, which got lifted off of the ground and stuck in the bed of the truck","All these eyes staring at me on this hotel wall","This wedge of parmesan cheese that came from a bag of grated parm.","The base of my cup left a smiley face when I took it off the table","This machine screw doesnt have any threads.","My mothers aging alarm system has an interesting layout of lettered buttons.","This extra long tostitos chip","This leaf looks like an arrow.","These 3 musketeers where made together I think the love each other","One of my professors making a chainsaw carving for my school","Border Fence next to our family property in South Texas.","The smaller can of beans is \"maple &amp; cured bacon,\" while the larger can is just \"maple cured bacon\"","Puddle on a beach in Cape Cod looks like a portal to another dimension [OC]","Today I blew up a balloon inside a balloon inside a balloon","Found this on back of what I thought was a cutting board.","Some rocks I found that look a lot like Africa.","This crosswalk was once a burial ground","For some reason a flock of plastic flamingoes in front of our offices.","All of the lowercase “L”s and uppercase “i”s are missing from this item at my work.","These packages from Dbrand.","This Barcode really shows the product is made from a farm!","My girlfriend left these coasters like this and told me not to touch.","My YoCrunch yogurt has no label on the container","A pigeon stands on top another almost unbothered pigeon","This high performance PC kit at my local thrift store.","The way these gas nozzles dispense fuel. (Philippines)","This sculpture of a bull looks like a frog from far away","An old KFC sign is painted black rather than removed","This cup is designed with 2 layers of glass with an empty space between them so that you don’t burn your fingers","This faucet is also a hand dryer","We get a lot of geckos and this little guy just hopped right on","This old mug looks smart with the sticker","cool coloration on this pepper","This unmixed tea looks like a pool of blood","My daily ride's seats have the route map as artwork.","Only one ice cube is floating (and it's not stuck)","This stinkbug with its shed skin stuck to it","One of these Cokes was filled to the very top...","This Huge katydid I found in the gardening center at walmart","This rainbow is really low to the ground","This vibrator costs exactly €69.00.","LegoLand employees sanitize their hands with gobs of disembodied heads.","I found this giant wooden thumbs up in a friend’s home","3 Oreo o's stuck together","Found this snowmobile for sale in Roslyn, WA (aka Cicely, Alaska)","This table was so happy to see me.","A storm rolling in to my neighborhood this evening...","3 Different Coloured BMWs of the Same Model Decided to Park Next to Each Other","This “chork” - chopsticks and a fork","They use candy to teach hospital trainees how to package pills","Push dagger that my brother made by melting down a bunch of my La Chroix cans.","I bet your first thought was a broken Iphone.","Close enough, right?","My aunt's chicken laid this egg.","This leaf looks camouflaged.","A piece of cheese from my sandwich formed a creepy face","The texture on this mushroom though!","This fake palm tree antenna has fake dead branches","The evolution of the size of my mobile phone","The way these neighbours tended their grass makes it look like their houses were badly edited together","The Seattle Ikea tracks Azeroth time","The way this guy drank his cappuccino","The way the sun made this contrail red","How to wash your your hands properly...","Two long haired wiener dogs laying together to make a number 7.","Gillette sent my mom a birthday present. (She’s older than 18)","This bike that's themed after both Iron Man and Ultron...","This spider caught a fly","A bowl of real pearls","I think I found Putins babushka in Vietnam.","Caught a massive heap of fire coming out of my .308 Saiga rifle.","Individually wrapped jelly beans","My bowl of Cracklin Oat Bran came with an upvote","The ceiling at the Hollywood/Vine metro stop in LA is made of old film reels","My guitar fretboard wood looks like it's from Borderlands.","Baby Groot stands in the front yard of a home in Cheshire, CT. The work was carved in Massachusetts by artist Ken Packie and then installed atop the trunk of a maple tree for the homeowner.","The amount of times cars scrape the wall at this drive through atm","It looks like there is a bear in my light fixture","Texas license plate in Iran","So once I was at the airport..","This bible quote in the middle of a restaurant menu","New, old, lawn mowing/painting, river.","This urinal has an entire stall/cubicle dedicated to it, and it's got a lock too","I just inherited my grandfather's airline silverware collection.","This steak that looks like a map of world","Lego's in a cafe wall","These 2/4 mozzarella sticks","Found the token brown chip of the bag","Found a polar bear in a picnic table.","I got bored in a beginner video class, so I spelled my notes wrong on purpose.","This person used red and yellow tissue paper to cover his broken taillight","Our window AC unit melted the adapter","My mom's dress looks like the blue &amp; black / white &amp; gold dress","Carbonated Water Spill","Some motivation inside the hem of my shirt","The water flavor is gone","This bearing I saved from the trash at work","How these clam shells fit together","My sunblock for oily skin is matte , while the one for dry skin is shiny.","This car rental terminal had a redit card reader","Clouds at the tippity top of Mt.Washington","Some of my flashcards from 4 years of college","Snapping turtle I found at work. For comparison, I wear a size 14 1/2","Double bag of Cheez-its.","Our ceiling fan has pull cords that indicate whether it controls the fan or light","Cut into a happy Poblano Pepper for dinner tonight","This broken out hole in a museum piece in China that looks like Austria","My textbook came with a can of redbull.","My roommate balances his chopsticks like this whilst waiting for his greens to cook.","My boyfriend used the last of the plastic wrap at the family cabin. August 28 ‘93","Pineapple bush, almost looks fake","This spider in my bathroom only has 6 legs","The graphics on this moving van makes it look like the door is open.","This working sun-dial on the side of a building","Moonrise in the Santa Rosa Mountains, California. Backlight is from camp lantern.","FIL found a roll of Carson City silver dollars.","The way the trees are ordered by height","Is this a pencil real or fake?","This station at the bank in my home town.","There was a guy kayaking in my school's fountain today","The color inside the boxes T-Mobile sends out their phones, etc is pink.","This broken part of my laptop screen inverts the colors","Coles mini’s milo vs 1.25kg milo","This elevator that comes up out of the floor.","Mind Collage painting done with india ink","This gallon of juice collapsed when we drove it from 3 km altitude to the sea level","Found an Anime decal on a car at Miami Subs","Quilts on display at the local fair look like they have a swastika design.","Tiny Tigers Eye Stone found in the tread of my boot.","One of these mugs says Hero Turtles as Ninja was censored for kids in the UK","This mini Diam skipped its packaging and double packed the next one, without breaking the chain.","This unwrapped Dumdum","These eggs that have the expiration date printed on them.","A public artwork looks like Dead Space marker","Where two streets end?","My clementine has a heart!","Found this behind our truck at work, am i being contacted?","My textbook order from Chegg came with a free Redbull.","Textbooks - 1950 vs 2018","This door in a hospital office has shag carpet on it.","The sky this morning.","A real life bitcoin shop","One of my blueberries was printed on.","Accidental egg :-)","This sushi place has a spinning projector displaying their logo on the floor outside the building","This cup created a miniature version of her face.","This plant wall at my hotel in an effort to regrow after hurricane Irma","The last spoonfuls were the beginning and end.","These fruit flies have turned red from the raspberry trap","Accidental marble sandwich bread slice","Found this cool little hut on a beach","This Trippy photo of Saturn","My banana had the Mercedes logo","A bird crashed into this window and it made a mark","My (fired) plumber set my handle into the wall. I used a frisbee as my trim/escutcheon","The way the ice is still in the shady parts on this building site","This 1912 Mills Novelty Co Self-Playing Violin and Piano Duet","Booklet on how to survive an atom bomb attack.","My food was served inside a cowbone","This umbrella at a cafe looks like its floating","The amount of advertisements in our mailbox (for 1 day) [Berlin]","Pigeon missing all talons on one foot besides it’s back one.","Got the wrong puzzle piece in my sons set","My black kitten developed stripes","My slice of bread has an extra crust","All these pigeons stay in the shade because of how hot it is outside","Septic field vs. regular lawn. Both get zero water.","This two for one Fruit by the Foot package.","Found a plate with a dictionary word in a country where custom plates do not exist","A second Paprika grew inside this one.","This bug matches my countettop exactly.","This lid from Starbucks","The Complete contrast of these clouds","The way this tree grew through the fence","This blue park bench on a small section of roof","The top of an old building next to my hotel window advertises what it originally sold.","My crystallised ginger packet has the cooking instructions for quinoa on the back.","This wood stump resembles a city skyline","The wear on the older foosballs on the work table.","Housekeeping left us this cool swan.","This Hecta-Mini-Wheat I had the pleasure of eating this morning.","Creative toilet paper placement ensures legitimate privacy in the stall (grins and nods)","These two robots looking up 1st Avenue in Manhattan","My watch tan line is 3 different colors.","This painting in my Hotel Room.","The butane lighter is blue","This Greek restaurant's Order sign is from a Quizno's","Words to live by until 2019 — someone’s car in my office parking lot.","This place just says “Food”.","Had 10 socks left after folding my first batch of laundry. None of them matched.","How this paper airplane landed","This wine cork uses pictures to help people pronounce the winery’s name.","Window reflection in Taco Bell","My glasses had a weird reflection on my tv stand","This house that resembles Mario","I made a prototype of a hammerhead bulldog pet for our robot overlords today at work.","My wife’s phone camera looks like a happy robot","The smoke covering the mountains in BC","The row in front of me on this flight was unused","This Ginko tree was forgotten about when my grandparents could no longer tend to their garden. Left without water or much sun, it still managed to grow a very small amount every year. You can see it on the branches and stem.","Part of the letter B peeled off and made a lowercase b on this ride at my local fair","This brown pencil thinks it's light blue","This train in the UK has games like Monopoly, Chess and Cluedo printed on the tables","A giant zucchini","My sister burned herself and the resulting mark looks like a heart","This reflection of the sky","This can, canned within a can","This body wash that actually smells like good chocolate","Bronze and white moth that just flew into my office","Building a parking lot around a tree.","I local restaurant bar has Nutella wings","The shadow from the window sticker in my car forms a heart shape","This cursor shaped hole in this leaf","My pizza has a use by date, hour and minute","This flower that grew through the fence","Found a gummy worm in a pack of fruit snacks","A 3D printed cube","This lighthouse in Dungeness sells a simple but effective weather rock","Braid the puppy's hair","Picked rose hips for the first time.","A rail crane transporting a Porta Potty","This pizza place in my town does half calzone, half pizza all in one.","Smiling sucker","This newly installed toilet sign in my office","Wife bought a different toothpaste to take on vacation and its black","He was so close to all 10’s. 10.10 with 10 cents off and 10 dollars back on pump 12!","Misspelled sign on IHOP","This rock looks like a iguana head.","This McDonald's sign in the old town of Salzburg, Austria","These tiles at the bus stop are pictures of the background behind them","Food truck conversion to mobile Credit union/ATM","A squirrel politely eating an Eggo","An ice cube got stuck in my lemon","While cutting some very thick brush, found these grasshoppers getting busy","Wandering Cow (WI)","This shipping company decided to use comic sans for its DOT number","This vehicle has a warning sticker about going the posted speed limit.","This bit of light looks like its not loaded in properly.","This no soy, no dairy, no egg, vegan, kosher cookie.","The way this tree root grew through the concrete bonding","A crow took the remainder of my McDonalds wrap and kept watch, perched upon a fence.","This piece of cloth looks like it’s greeting me.","My tangerine had a tiny tangerine in the middle of it.","Fly trapped in flyswatter midflight","This rope is made from glass beads and can stretch out to over a mile in length","This 25 year old receipt I found being used as a book mark in my 26 year old book.","On Church Street and the two cars in front of me have 666 on their license plates","My auto shop has a battery with different kinds of chargers.","Chandelier made from human bones","These marks made by scooping out BBQ sauce","This lime with two stems","I seen this Illuminati type plaque on a street corner in Poland","Damselfly at Glendalough, Ireland [6000x4000]","Tree holding a sign","This urinal has a grate below it to catch your dribbles.","Skechers always puts 2 pairs of shoelaces with their shoes.","My uncle picked up these recreations of the terra-cotta soldiers found in china while on a trip there.","Trailer business is a gym in Pokémon Go. They painted their horse statue like Pikachu","A bird flew into the window.","My shoes match the carpet in my apartment lobby","My 40 package of pizza rolls gave me 42 pizza rolls.","This door was cut to match the irregular shaped bricks of the doorway","This cup in my hotel room has a \"Other uses for this cup\" list","This cup holder thingy made from recycled Starbucks paper coffee cups.","Someone put this la croix can inside a hanging glass planter.","This melted solo cup is perfectly angled for spitz.","So I hit a bird on the highway and it made an impression.","The brick mosaic image on this local sports hall","This image I wanted to post to Instagram corrupted after taking it.","My ziti looks like a nose","30 year old stickers I found in my old bijbel.","The growth of this tree contorted the trail marker","Dried coconut looks pike crack cocaine","This Redditt sign.","Spiderweb collects rain in an interesting pattern. Bonus interesting shadow!","This semi-rip of paper off the Adidas shoe box formed an artistic side and forward view of a face","Hand made chandelier in Romania","A couch that matches its surroundings","The -2 is slanted...","Three different enterances for this building (Bike, Drive, Walk)","This Cheese Claw Machine","This X-Ray of a Nintendo Switch","The new dyson hand dryers look straight out of the future","This exhibit on medieval art at the Met shows how much each piece would have been worth in cattle.","Hasidim vs Franciscan glass chess set","Condensation on windows of indoor pool behind plants (yucca &amp; frangipani)","When your callus make the shape of heart","Trackable dollar bill","There are pop-up warnings now irl (text: your bike is broken)","The toilet stall at work has a list of items not to flush, including old phones, unpaid bills and goldfish","UFO installation in Utrecht, Netherlands","Pumpkin the cat’s adoption headshot perfectly aligned with his actual body.","I wonder if the girl from Tokyo Drift knows about her face being used for an advertisement","My Pen Fell out of the table and landed standing up","Found a Kestrel Fledgling (Found Its Nest and Put It Back)","This sign that can toggle between \"Open\" and \"Nope\"","My fingerprint on my beer","Fire training exercises at Schiphol airport, Amsterdam.","There’s a faded reminisce of where the “p” used to be.","This sign in an antique shop.","This truck in Idaho that looks like Hello Kitty.","The restaurant I'm in has a button to call a waiter or to pay the check","Burn mark travelling down my vein (saw something similar with a bug bite)","This picture of my son's first haircut makes it look like he has massive feet","This East German Cap circa 1960s.","Just some of the crappy drawings I've done for my coworker over the years","Tree growing around a fence","This gas station bathroom with \"bowl fresh\" hanging from the ceiling.","The formation of these clowns","The machine that created this cigarette is badly adjusted.","In this small museum in Romania, they accept a 'broom sweep' as payment.","There is a spot reserved for book readers on my local bus.","This unholey gummy ring candy","I left an egg boiling for too long and it \"popped\", but was hard","The way the vertical screens are blacked out through my polarized sunglasses","Ha! The code for the breastfeeding chamber at Burbank Airport is “BOOB”","My grandfather has bar stools that look like the cap to this Holland lager.","You can buy Popeyes spinach at Walmart","This tp roll with instructions revealed","This telephone box that's been converted into a defibrillator box.","My Other Pen Fell out of the Table and Landed Standing up on Top of an Already Standing up Pen","This off centered bag of Fritos.","This innactive car has gathered 4 parking tickets over the past month","Spiral notebooks made for left-handed people, sold at my school bookstore.","This strange looking tree i found at a cemetery.","Two bubbles merged together and flew away while I was washing my hands.","When eating gummies, I found an egg, but it’s only the white foam","My grandfather's freemason medals","Saw this at my American grandmother's house back in July when I visited her. Her sister claims this painting is over 100 years old, from the turn of the 20th century. Not sure what painting this is, but it is GORGEOUS.","This strange contraption was sitting in my driveway","This street graffiti is a recipe for Baba Ganoush.","The Oakley logo looks like it’s in the middle of the Under Armour logo","The layout of this restaurant is so unusual that snapping a pic of it makes it looks like two pictures stitched together.","Found this small face mirror","This baby green grape out the bunch","I found a cicada that has the McDonald’s arches on its back.","This woman made a mobility scooter out of a hover board, furniture dolly, and a cooler.","This unopened case of Poland Spring only came with 23 bottles instead of 24.","This really crappy photo I took looks like a very well done water color painting.","Some guy wearing too many life jackets.","Is this really how they deliver blood?","These t-shirt color options are tiny t-shirt scraps of fabric.","I pulled the core directly out of a strawberry","My friend sat on a penny that was in her car and now she has a penny shaped burn","This leaflet I found inside a 114 year old book instructing the owner how to properly handle it and avoid damage.","Saw this face on my bus bench today","This apple that fused into another apple in my backyard","The narrowest street in the world.","This coffee stain on my bench looks like a seahorse.","This huge bruise I got from one paintball.","This cafeteria has different spouts for “ambient” and “chilled” water","This toothbrush was packed with no bristles","My cat looks like she is sitting in the middle of her own shadow and has one eye.","This binder came with 2 of these “durable view” sheets in it, instead of 1","Rain still hasn't reached the grass under the railway tracks after a long drought","The tips of these matches fused together","A place at local fair sells fruit juice in the fruit.","This trapped moth looks like it’s waiting for a drink","MP3 player still has charge 8 years after its last use","This cops bike has 3 wheels !","My English book contains the old lady from a meme","This shot glass from Finland has a working compass in its base","A Comic where Superman lands in the ussr instead of America","Police interrogating an owl","upon ripping, my bag went two separate ways","An antique tricycle with opposed steering and one drive wheel.","This seedling sprouted behind my kitchen faucet","This perfect “line of clouds” my friend managed to capture today.","The mileage on this car","Most watches are able to hold themselves up to display the screen","There was a triple peanut shell in the bag.","There’s a tiny orange in an orange","The Chinese sentence has an ! but not the other two sentences.","My girlfriend's bra has padded \"hands\" on the inside","This absolute unit of a blister I got from getting a wart frozen off.","This red capsicum growing another capsicum","This street sign in the town where I live.","One of my waffle fries wasn’t “waffled”","The temperature was so hot in here even the asphalt got softened and melt this plastic bag","These huge tires","The shadows of the lines on the glass make it look like there are waves on the surface.","This two bills with consecutive numbers (argentinian pesos)","A vending machine at my college campus gave me a $1 coin for change","This firehouse in the middle of a park in the heart of Chicago.","I found a 19 year old math worksheet shoved into a seat","This crappy sign.","This dog ice cream brand has Braille on the side of the box.","Business card dispenser on the back of a car","The turnout for this showing of The Happytime Murders","After about three years of owning this (and losing it for a good few months), I have finally finished a lip balm!","I have just been informed that not everyone’s toes are this bendy.","Linda Brown, the poster child for the Brown V. Board of Education court case, graduated from my high school in 1961.","This 9/11 truck on my street in Canada","My Mothers Pumpkin Plant Grabbing Onto A Lawn Ornament.","This bar of chocolate is divided in unequal pieces.","This wasp landed next to me carrying a grasshopper.","This cloud ring forming above a storm cloud, also moving toward thick fog","Jason Vorhees mask on my Cream Cheese Lid","This kids store has a “kids only” entrance.","I had bug spray on and the images from the soil bag transferred onto my skin.","Today is the first time tax has ever made me happy","local cvs honoring fallen hero","My kitten caught a piece of very distressed tree bark","My sheets came with this note","My son is experiencing his first milk hang-over.","My mom accidentally grew a purple bell pepper in her home garden.","My pizza stone looks like the moon.","This Trump head in Sydney, Australia.","I made a tree out of plastic forks","The way my screen protector cracked","This skyscraper looks 2D","This peanut we are selling at my work wasn’t printed correctly","the sky's color right before a storm rolled in.","A fly got caught in my candle","This Pepsi tables.","Five leaf clover. Gooe luck or bad?","A bird crash landed on my in-laws window","Spilt some water and got an unexpected smile!","In Portugal they cover Oreos in chocolate, basically removing the property that makes it an Oreo","I found this page with Arabic text","My yoghurt didnt break when i opened it","This tree swallowing a concrete pole.","The rip in this box makes it look like it was caused by the power washer","Urinal by Toto","A nest of squirrels blew out of a tree and I found them in my driveway","The topic references on these 1987 Encyclopaedia Britannica volumes.","The Way This Nail Is Defective","my succulents grew creepy fingers...","This photo of my dog on my porch looks black and white but they are just the same color.","The way these chips were packed vs the regular way","This machine gives free pennies","This sugar provides more sugar per teaspoon than the total volume of the teaspoon","This grasshopper on my window.","My daughters chocolate milk is flicking me off.","This toilet paper roll had a removable center roll of paper.","This abrasion on my knee kinda looks like Hawaii","This grilled chicken thigh that looks like a turkey","There’s usb charging ports in this gazebo","Add bacon to your milkshake...","Smirking poo snail bruise","Lightning Strike in West Texas","A toilet with squared off edges","My school’s stalls have small bumps to prevent vandalism.","I have a single black hair on my otherwise blond arm","This iron has no holes","This 1944 one Franc coin made of aluminum. I found it in a WWII vets camera case.","I have a single hair growing right in the middle of the middle portion of my middle finger.","Ivy, cut from a tree","Original Thomas Crapper Toilet in a castle in Scotland. That’s why they call the toilet a Crapper","Poster of movies made in my state","This preferated bag of almonds","My driver floats like a butterfly and stings like a bee","The way coconut oil hardens","My Pepsi can is surprisingly happy for me to drink it","A Samoa without the caramel, coconut and chocolate coating.","The two order numners from my 2 McDonald orders","the foam on this glass looks like a dolphin","These cherry coke bottles at work.","A friend of mine said she had “toe-thumbs”... she wasn’t kidding.","This Dumbledore doll looks like he’s wearing shades.","There’s a demon hiding in my dirty oven","The label on this water bottle is flipped so that it can be read even when seen through the water.","My shower fogged up only the top half of my mirror","This heart shape formed by the arching branches of my neighbour's tree","Walking home and saw this at the bus stop","This tree is growing around this brick outside the Chinese consulate in SF","Found a blank penny at work","Anti money stamp on a piece of money.","These footprints on the back of some drywall I pulled in my 1970's home. (Converse maybe?)","The name of this coffee shop in Berlin"]