["Star Wars Battlefront II - Release Notes – Elite Corps Update","The updated roadmap","DICE 327th vs Modder Orthohex","Do I even have to say anything","u/F8RGE While you’re at it, how about sending a ticket in to fix the 212th as well. They’re equally as fucked","Goldie is back bois #LegoStarWars3","Possible Droid Skins For Battlefront 2 To Go Alongside Clone Skins.","These would make great defaults DICE. Plus they’re plastered on bits of promotional art and star cards.","Why the Aerial clone doesn't have any skins? He's a clone too! :(","Ben reveals At-TE and teases more vehicle details!","I thought this was how the specialist was supposed to look...","CONQUEST MODE HAS TO BE IN ARCADE, IT'S THE REASON THE OLD GAMES WERE GREAT. DON'T SCREW THAT UP.","All clone skins in the files now have proper metadata. Nothing stopping a release right now.","Okay I laughed a bit too much at this","The Green company look seriously needs to be the look of the 41st elite corps skins on Kamino, no cameo at all please","YEEEAAHHHH BOIIIIII","Showerthought: How are campaig maps not suitable for multiplayer when part of the campaign maps are actual multiplayer maps from BF2015? This is Bioniip Laboratories from the Bespin DLC","At least the camouflage pattern is right, Oh wait... It's not.","This looks fucking awesome.","Dice: \"Development time takes many months due to Disney's strict approval process to preserve the integrity of the Intellectual Property loved by millions.\"","HAHAHA try to find droideka now","November looks like It will be the best month of this game life. I’ve always look forward to play an AT-TE!","People are literally begging to throw money at you DICE and you can't deliver anything worthwhile to allow them to do that. That is the state of your company. How sad is that","If the 327th skins haven’t been changed since they were dataminded you know what that means","The update was actually surprisingly good","I'd like to change my opinion","BARC Droideka imbound bois","I Spin them right round, baby.","\"Reviewed with Lucasfilm\" and \"tweaked if needed\" - I guess that never happened in the past 10 months?","If they made the 41st like the LEGO, why not 327th?","/u/F8RGE I was Vader for less than a minute. The choke is still not fixed. Enjoy watching me clicking respawn instead of literally anything else","They ruined Blast - you now have to play the same map twice in a row","Hey players this is John Boyega and this is Star Wars Battlefront II: Empty lobbies edition","The Clones aren't the only one's with inaccurate armor","Crystals and Credits Being Awarded","Clone officers should have the option to have armor or just have the uniform","How the fuck did these get through lucasfilm/Disney's approval process!?","If you're releasing Grievous first because he'll be finished first, then what's stopping you from releasing all the clone skins?","Galactic Assault tile in menu uses WHITE PHASE II CLONES","Roadmap coming later today.","Hi guys 👋🏻","Okay, to be fair, this skin might not be canonically accurate. But it does genuinely look really nice on kashyyyk.","Just played a match on kashyyyk where everybody was using the 41st skin","Didn’t expect it the first time, Definitely didn’t expect it the second time.","If only we could see the Homing Spider Droid along with the great AT-TE","I made a video guide on the many \"flying Yoda\" combos + how to bypass his Presence animation","This season will be a perfect time to give Maul his much needed skins (robot legs similar to the ones in Solo, Hooded Maul, and topless Maul)","Here is my take on the 327th that I finished a few months ago. Not modded and created from scratch but I guess still better than what Dice released.","Not the best looking skins, but they're sure useful on Kashyyyk","Much Better.","Ok usually I hate the \"modders make better content than DICE\" comments, but in this case it's dead-on.","Bundles are available from the crate menu","..... Did a bunch of people just delete there valid responses? There were some good criticisms here and now there gone. One even got gold.(This is on the \"Do I even have to say anything\" post.)","The worst part about all this skin controversy","It's okay everyone, Ortho fixed it.","They have no more excuses. This update came with no major bugs. Progression is finished. Let’s get the content.","What about the in game model for General Leia (as in TLJ)? Wouldn't this be an easy legendary skin for the Princess?","Guys. They changed the disclaimer. Things are looking a lot more optimistic.","Anyone else still disappointed that the Separatists aren’t getting any customisation whatsoever?","Skin gripes aside, this update has tremendously improved the game.","How to triple jump as Yoda","Wish I was that lucky when lootboxes were here","Galactic Assault is 10x better with reduced battlepoint costs","Victory poses have names now","Anyone else having more fun in Galactic Assault?","DICE. Providing us with quality ski-","Ben: Please Stress That We Don't Want Wookies on Geonosis","The 327th we should have got (Pc Mod)","327th assault","Hype is back!","I’m really enjoying the new updates. The prices for hero’s and enforcers are making it a lot more fun and it seems more balanced so far in GA. The end screen stats are fantastic too","YouTube Vs Reddit (sorry for the low quality)","Look what i found!?!?","\"Come get some!\"","The Dank Engine is back bois!","Improvements for the clone skins","At least we have this mod by Orthohex","The fact that there aren't any clone officer skins is a fucking disgrace","Guys, I found them","Just Tow Cabled both Walkers on Hoth, winning us the game. Didn’t receive any playing the objective score and placed 4/40 on the new Objective placement on the scoreboard. Can you please take another look at the tow cable, DICE?","In the battle of Geonosis there should be OG-9, sphq-t, IG-227 and DSD1. Please","You can now rotate camera on the Y axis in the inspect mode.","Really cool video by Cinematic Captures that shows the behind the scenes development of the game","I can see it now.","Make A Post About This After The Leak And Get Called Crazy... \"DICE Would Never Release Non-Canon Skins! That's Just Old Datamined Info.\"","I know this isn't a priority, but I would love for the Corvus to return as the main menu background, but with all the lights on and a full 360 interior, imagine how good it would look with the no-hologram menu we have now","\"Good soldiers follow orders.\"","For the love of god please have Conquest be playable in arcade","You gotta love the reference","The only thing that made me sad is the 41st skin for sniper scout trooper. It should look like this.","Star Wars Battlefront 2 New Clone Skins Wallpaper","Need Accurate CIS Skins","327th assault more like insult","Skins aside, this update is fantastic.","So the majority of the content is still 3+ months away...","In the shadows","AT-TE is not on rails!","Just realised we can't actually change the skins for troopers pre round.","If DICE is releasing skins that are inaccurate to canon, does that mean we can get legends skins?","PSA: The pre-game skin selector is not enabled for Clones, you must select them from the main menu","The Naboo Hangar is my favorite blast Map now","So Officers don't even get SLIGHTLY modified skins for their Legion from TCW and only the First Order Officers are females (besides humanoids in other classes)? Seriously EA?","Do I need to say more?","They removed the Droideka from the update splash screen","We finally got some good news!","Thanks for the new skins.","In the Star Wars show today, when talking about the roadmap, they say \"prequel era Obi-Wan\". Does that accidentally confirm we're not getting an Old Ben skin for Obi-Wan?","I fucking love this game.","The Vader 'choke-stuck' is STILL BROKEN","Tutorial : How to lose Vader like a fucking dumb in 2 seconds","Horrible lags","If all the 327th clone skins don’t get pauldrons and kamas, DICE will be breaking canon. Sadly I can almost guarantee that if there is any change to the skins, it’ll only be the markings because DICE will not budge on the whole “each class needs to look significantly different”","End of battle results screen. Credits visual glitch has been fixed + extra stat info.","Begun the Rainbow Clones have","God, the 41st skins are damn ugly everywhere except Kashyyyk...","Why are there never any complaints about the separatist vehicle colors?","My Name is Dooku","Something no one has brought up","Roadmap V3 (speculation)","interesting detail on the whole pauldron debacle","Fan-Made 41st Elite Corps Promo - Update is LIVE!","When you can finally buy emotes after months","November's gonna be lit","We can't change our clone skins in a match (+ plus it still mentions playing together for double battle points in the spawn screen)","Vader choke glitch is still a thing","DICE LA Producer on BFV Live Service - \"(we can spend time) on making the game more interesting and unique, rather than just more content period.\" History is repeating.","These character models could be an assault class reward for reaching a certain level. Which would be fairly easy to make and fix the 327th problem.","As an officer main, I have NOTHING to look forward to in this update skin wise.","There needs to be a skin selector in the spawn menu","They didn't fix a lot of what they claimed was fixed","The 327th skin was a middle finger to the community","With all these new vehicles AND a new Squad System. Please tell me we will be getting multiperson vehicles. I remember a few months back when you could hold []/X/E to enter a speeder someone else was also In. I hopped into my friends speeder on Endor as lando and had a great time!!","I will say that despite all the skins being inaccurate (and some not even being colored in) I do like that there's a bundle option.","Good luck sleeping tonight","Both skins are inaccurate.","I made a push notification feed (desktop/mobile) for posts of r/StarWarsBattlefront that have a minimum of 200 Karma.","YAVIN - Fixed several collision issues that would occasionally allow players to hide inside the temple mesh or walk through walls","IF THE AT-TE ISNT ON RAILS, THEN THE LAAT AND U-WING SHOULDNT BE EITHER. MULTI-SEAT VEHICLES AND GUNSHIPS WILL BE SO USEFUL FOR THE \"MORE OPEN\" GAMEMODE","I’m just gonna leave this here","Can’t find a single lobby ERROR CODE: 1,066??? - Any ideas on why this has been happening all afternoon??","...What have you done to Blast?","POLL: Which skin would you want the most for Obi-Wan Kenobi? Curious on what everyone else thinks.","Apparently you can't change the appearance of the clones during match","Space chickens and alien monkeys still broken","Nice!!","I’ll never understand why someone would want to be a camo trooper on Naboo....","I don’t mean to nitpick but you can’t change your clone troopers skin during gameplay.","We haven’t had a skin drop in months, and you guys couldn’t even make the clone skins canonically correct..","Since when were Snail tanks playable?","what is the new map rotation?","F8RGE, Please (327th Skins)","Destiny 2's new roadmap. Why can't this community have something just as good?","For all the People complaning about the skins for the 327th, hear me out why it isnt as \"uncanon\" as you think","why is my clone not even on the screen right?","Can we get a higher max level?","Welp, called it for Grevious and disappointed with Kenobi.","Thank you EA/Dice for adding names for the victory poses","New bug can't change clone skins mid-match","41st specialist","So, about the new Clone Skins,","Play the objective fuckers","Maul’s saber throw still does not work","Took them months just to smack some paint over the Naboo troopers armor, Lmao.","Can we please just have Bespin Luke at least?","CLONE APPEARANCES BUNDLE UNDER CRATES","Interview with CJ","Not sure why people are making such a huge fuss over the new skins","What's more frustrating? The drip-feed of content, the constant lies, or that this \"season\" content should have been in the game at launch?","For those wanting a true 41st skin","Those skins look awful on Kamino","The new Naboo Hangar map in Arcade is AMAZING","Update","Cant select new clone troopers skin during a match","I like the new background for the hero icons","Unable to change skins on Kamino","There is a glitch on Jakku GA where \"lost Landing area\" doesn't go away the entire game","I dont give a damn about how many people are working on this game or how much effort dice wants to give us.","Can we go back to 2015 before Battlefront (2015) where the hype for this game was inmeasurable","Look at the names of Chewies Victory Poses, I love this","What have we learned from all this?","Tomorrow, at an end your rule is...","Vader","With hero prices being lowered, you think we could increase the max level of heroes from 2 to 3 in the second-last phase of GA?","Can we have a pinned bug post by the moderators?","Anybody Else See This? Tach Moonwalk","End of Match error? LOL","Jabba's Palace: would it be possible to make it galactic assualt compatible?","The STAP is Coming!!!","Is it right? We gonna capture points in new large-scale mode, just like in old Conquest?","In terms of content, this update reached a new low","Feel free to downvote me to oblivion if I'm wrong, but could DICE just import community made items like TF2 does?","EA/ DICE: A little effort for cosmetics like these would go a long way, for both the game and the players.","Why are all the skins just recolors?","Han... I miss u 🤦","Mid match appearance changer doesn't work for clones","Why is Theed Hangar Backwards?","I'm happy with the Clone War prioritization feature, but why not do it for all 3 eras even if Clone Wars is the most popular? And why not take a step further and make a map selector like the last game did?","Eh","Im a dummy.","Anyone else experiencing more connection issues than usual?","To those complaining about the clone skins...","PSA: Possible free crystals glitch","Droid side vehicles on geonosis","OOM Security Droid Wallpaper (I Took It With Windowed Mode Since Origin Has No Screenshot Function)","Tried the clone wars playlist 3 times.","Off the end of this update I have hope for the game. There was nothing incredibly disappointing or game breaking off the end of this update and the new vehicles was a good surprise. I am very excited for the future of this game and can’t wait for the squad system.","I've been looking forward to this","Here's list of things that we could get and EA/DICE could capitalize of Battlefront 2 if Live service was proper.","the 327th looks better on Kamino and accurate","Boba feels a lot better at range after the patch!","I would really love if when Grievous Obi Wan, Geonosis, all the new stuff came out we would get a dynamic main menu.","The assets to finish the 327th Bly skin are already in the game.","AT-TE CONFIRMED","NEW HERO GLITCH","About offline.","Another Day, Another Dev Gone, RIP PIZZA GUY","Will there be more major content after this roadmap? I play a lot of extraction and am hoping for some new maps at some point","Can’t get into any matches","41st assault","Shock/freeze/electrocute ability","Look on the bright side","Whyyyyyyy","Fix Officer bp gain","JEDI V SITH GAMEMODE/CHARACTER, Just hear me out.","These are the clone skins you were looking for.","I think we deserve at least good basic content with The Clone Wars.","I know this game isn't as good as it could be but damn, it looks so good!","Does the game at least run better than before the patch?","Im out of the loop, when did this map got added?","GA matchmaking issues","What is \"Combat Score Placement\" Supposed to Be?","Crosshair lag glitch on xbox one.","New skins for already existing Heroes/Villains??","Custom Clone Legions Skins","How do I get the bundle of skins? Ps4","when are we going to get some new weapons?","Why is it so hard to find a match in the UK?","Just a reminder for when Grievous comes that he was beaten in canon by a bunch of Gungans + Jar Jar. Would be a neat detail to reference when he is on Naboo or encounters Gungans (if they are added)","Are the skins going to get a few fixes I mean they’re not canon","Lost Battle Scenario Progress","Don't get lost in the details. These awful skins mean so much more that you may think they mean. It's not just about the skins.","Update/Patch Bug report Megathread","Just wanna note something about today's skins.","So, the new 'Combat score'/'Objective placement' is broken?","I don't know if anyone has seen this yet, but the new roadmap is on the US BF2 official site. New vehicles in November: STAP, BARC Speeder and AT-TE all on Geonosis.","Made something for fun with all the crazy drama going on. Enjoy guys.","Giving credit where credit is due","Ben, 2 questions about the new skins.","Love Naboo.","I’m so glad that idiots like this are gonna have to come down from here and actually fight tommorow.","The DICE Multiplayer Producer for Battlefield V’s response when someone asks about Battlefront...","Finally they kiss","DICE please make sure the AT-TE actually works","New bugfixes have arrived...","We need more maps for Extraction","Where’s the clone wars “playlist”? Or is it already like prioritizing Clone Wars un normal matchmaking ?","Finally joined the million credits club, does this mean I can afford the crashed speeder?","I’m a broke boi now","That comment didn't age well...","It appears Rey has a different stance in the menu UI","I think I’m done.","Hoth Sunset","Is the matchmaking fixed?","Question","Who wanna play on PS4 ?","Anyone spot any extra changes that weren't listed in the patch notes?","-“Hey you know those really basic clone skins we just slapped some paint on at launch? What should their prices be?”","Unacceptable","So with the clone skins being released it's too bad we cant get anything for the officer, but can we get the ability to change the jump trooper also?","Crystals earned in-game time for those emotes!","Just have to say","Quick question, don’t upvote","They changed the class selection screen a bit. Looks better.","327th specialist","Droid skins","Thanks for 41st can we get Kashyyyk Scout trooper next please Dice","Clone wars playlist; can’t get enough Clone Wars?","Is it just me or is this game more smooth?","I don't mind Bly-style 327th skins since they will be much more distinguishable from the 212th battalion.","327th Star Corps Promo","Time for Dice to come back to Battlefront?","Can’t change soldier skin mid game? Add that option please","I’m so happy Han is being replaced tomorrow.","I am happy whit the new roadmap","Clone Trooper Update Wallpapers","Let's show how much we love Arcade mode.","Been seeing people advocate for SBMM (Skill Based Matchmaking) on here","Recently I decided to try a different build with the heavy class. And I noticed the detonite charge has an incredible delay when being thrown. So when I try to clear corners and toss it on a wall it’ll stick right in front of me and then it becomes a wasted charge. Please fix this...","Pls tell me the cheap battlepoints to heroes, vehicles,ect its temporary","Almost unplayable","The leaked abilities for Grievous that we got a while ago are false according to Ben.","DICE please make the clone trooper skin bundles purchasable with crystals","Kashyyyk is an awful heros vs villains map..","Anyone else getting this glitch?","Still cannot change appearance pre-round in Arcade!","Since I haven’t played Kamino lately","Boba Fett is still a porblem on Yavin 4","Dice when the squad system is added to BF2 you have to balance the teams!","Mods, time to change the banner to a Clone Wars one!","I can't find matches","So we get to inspect our FoV in the home screen on console but we don’t get a slider??","Where's the clone wars playlist?","Is DICE never going to acknowledge the fact that these skins have been done since launch?","Did the developer have this toy in hand when he made the camo clone skin? lol","2 more months till we get the fun stuff","Is the red stripe on the 327th canon?","So, let's recap...","BF2 not registering inputs on PC","Well, I guess on the bright side DICE at least has a Commander Bly texture to work with, maybe add him to the game has a hero or something? Eh","Why is the sensitivity scaled up when zooming in with bow casters?","I’m seeing light in the darkness","I think a \"Free for all\" type Hero mode would be really nice.","Clone wars playlist","Grevious skin on release?","Gameplay","I have a question guys","Got Banned Again for Mods, am I Screwed?","I love the fact that I can get heros much earlier in GA.","My only gripe with the 41st legion skins","Fett can still glitch on Hoth HvV... nice patch lol","I'm getting worse and worse at this game.","More pick a side options for arcade","Are you gonna get 327th or 41st Skins?","Singlebladed Maul wont work anymore","To everyone who just runs/fly away and stuff when they are the Target in HvV:","Hey Ben since you had to post something about the mess that was the crashed speeder maybe you should post something about the clone skins we got and that there getting fixed or at least say DICE is working on a fix or will that take time away from the Clone Wars season.","Is it just me or do i feel smaller in this map? I tryed ir in arcade and it feels like the map is bigger","Ping site bug still hasn't been addressed!","Menu Issue","Geonosis - Heroes vs Villains map?","Are they investigating the French roadmap leak?","No new bugs except hero dialogue","Updated Roadmap with (potential) Days and Weeks instead of Months (dates are predictions; an exercise)","Why i think we wont get the \"winter\" content till early 2019","I'd really like to get back from into this game but...","Guys did you know they just released CC-5052 a.k.a Commander Bly","Is the post match screen bugged out for anyone else?","Let the discussion begin, Grevious and Obi appearances?","Nope, still not fixed, try again DICE.","Anyone down for GALACTIC ASSAULT (Ps4)","Satisfying.","Photo Mode for XB1/PS4?","How do I purchase the clone skin bundle for 40,000 credits?","Free weekend for Battlefront 2?","How’s mauls saber throw now?","Naboo Hangar Blast Gameplay","They finally fixed the DC15LE scope issue!","Dice desperately needs to a way to stop hero hogging","Clone Wars Map Selector In Action","\"Much to learn, you still have.\"","I can’t even comprehend how this is possible","More in-depth roadmap","I love this update BUT...","I like the heroes, the vehicles and Geonosis too, but the new Large mode should've been THE priority. \"Winter\" is very likely just a placeholder until they announce a 2019 release...","How vital were the clone skins for you to keep playing?","Update out on pc- Size 1.72gb","so is the ping site bug fixed?","New clone skins","Is the Clone Wars playlist out yet ?","Update had goods and bads","Yoda should be able to jump higher and dodge three times.","Hmm... I wonder where have I heard this sentence before.","With Clone Wars coming up can we bring a little more optimism and hope into the community?","1000 Hours Of Online Playtime!!","This may be an unpopular opinion...","Need help with og bf2 on psp/psvita","While we wait for tonight, enjoy this montage. Good for a couple laughs.","So these just appeared here and I thought I would try one and I opened it and it had the fucking common clone trooper appearances you use on Theed and I payed 40k for that. Anyone else has these on the menus? (Sorry for bad quality)","So is CC breaking not working? IE lightsaber spamming and you cant dodge","Still not fixed","Which Obi wan skins are you expecting","What is the map rotation for Galactic Assualt?","where is the zabrak neck skin fix and (dialogue for heroes on ps4 is buggy...)","Just have two questions","If you get emoted on tomorrow...","Gonna play finn all the time in GA","In one word sum up your expectations for the Roadmap.","Campaign Thoughts?","Think Vader is there","Vehicles, nice","An important problem with clone skins that is being glanced over...","Roadmap Update","Is the Naboo Starfighter playable in Starfighter Assault yet?","Xbox update time ?","System switch","Specialist Class OP (My First Post on reddit)","I decided to follow a random player today","So the clone wars only button doesn't work... Also the lobby it put me in is empty anyway","Does someone else got this problem? And i cant move","Vader's force choke is broken again.","Bundles worth buying?","Patch bugs so far..?","I need help with modding","Is the sound glitch only on the PC? I only took me one round before it happened. Are there any plans to fix it?","I can’t choose","I haven’t noticed any game breaking bugs, yet? Are there?","Too discouraged to load up a match - has the mid-round and end of round milestone tracking been fixed?","Can we get a dev comment bot like r/Destinythegame?","Sooo am I missing something or is the mentioned home icon to match clone wars specifically isn’t there?","Bro these skins","We need a prequel map playlist.","Lack of class diversity is such a drag","Roadmap release time","Does anyone have pictures of the clone skins on phase one troopers?","How I KNOW that Battlefront 2 is here to stay (and we'll get our skins)...","ha ha yes","EA canon think","40k bundle","Where is the Clone Wars playlist button ?","I just had a thought about the droidekas.","Did anyone else notice that victory poses have names now?","Please can we have more Hero skins","New map?","Big shout-out to all the voluntary Quality Assurance players in this community who provide us with a list of critical bugs or small issues usually introduced with every DICE patch, you will have work cut-out for tomorrow!","I swear this game just has it out for me, I’ve talked too much shit on this sub.","Regarding the New Skins, and Judging Them on Their Own Terms","What about the N1 STARFIGHTER?","Fins Stormtrooper Experience is shining.","How I feel after today","Is the clone wars only game mode up?","Double Battlepoints Multiplier ?","Tfw you're the MVP","Where is our promised new spawnscreen?","After clone Wars season any possibility of rogue one season?","Holy fuck.all Vanguard Assaults are Usain Bolts..","Are none cannon skins finally allowed?","What ?","You should all stop complaining","Heroes Skins question","Is the game fun on PS4 for a player with no wifi?","New BP requirements fucked up the game","Geonosis Appearances","Lets play \"what bugs will be introduced in the next patch\"","The Hero system in GA is atrocious","Kamino Needs Aqua Droids as Sentinel (or enforcers)","Will we ever get perks with heroes again??","Pulling back the veil","Yavin Wall Glitch still around","As an observer / former player.","Stuck on Kashyyyk...","Ben can we please get an Anakin quote calling Dooku an Earl lol","Coruscant map","Question on Ping Site","Marking objectives","A question from a lurker and casual player","Ok I'm just going to go ahead and say it.","Excessive number of posts about 327th skin","How long does EA/DICE have a monopoly on future Star Wars games?","grievous","Other Corps coming to aid!","Palpatine is broken - AGAIN","Where’s the clone wars playlist?","Can someone post pictures of the new vehicles?","Am i the only one disapponted out about the lack of love for Empire trooper skins?","PS4 Update is out","A new tile on the home menu for clone wars era maps? Not showing up on mine anyone else?","Continually getting Error Code 1,066 since update.","“A soldier’s most powerful weapon is courage.”","The new skins..","Let the past die, kill it if you have too.","Hooded luke and maul?","Random crystal points? Can someone confirm?","Just wanted to remind DICE of a skin shuffling option which is something I've wanted since the customization update","How much you guys wanna bet that even though the war beetle(atte) won't be on rails and freely driven it'll barely have room to move it around.","Elite Corps Deployment Info","When you get bored in HvV","When the new heroes come out, you think we can increase the max number of players allowed to be heroes?","Skin bundles?","How do I buy each legion for 40k?","No option to buy with crystals, missed opportunity?","Beware:","Has darth maul’s saber throw improved as stated in patch notes","How do I buy the new skins?!","A Critique of things that can be improved in Star Wars Battlefront 2 (2017)","How do you prioritize clone wars maps?","Is 33 kills and 10 deaths in strike good?","So I guess Stormtroopers and blast doors really don't mix :/","Hey Ben","Never Gets Old","Are there mods that give that put the ACTUAL skins on its respective map?","Lets get a reworked special unit system","Wait.. didn't i just see grievous leak?","So...any bugs so far?","For Tomorrow’s Update","Skins bundle","We might get some more devs back after BFV's release","Roadmap thoughts","Where is the \"Clone Wars Priority\" button on the main menu?","Health on kill for heroes needs fixing fast. It’s far too powerful.","Grievous Leak","No Holo üart 2?","Matchmaking","Been playing BF2 on Trial for 5 hours and...","Call EA and let them know they lied.","Is the Clone wars playlist in the game?","Clone skins are too shiny imo","Is there a new bug or is this still the ping site bug","At EA Play, Dennis said there would be MULTIPLE LEVELS on Geonosis","Question about Geonosis","Can't find the option to buy bundles...","Whats with 5 different heros per match","Where is the clone wars match making button?","Finally, after 10+ months of waiting, I think we're about to receive the best squad system in the entire gaming industry","The new clone skins are also for Phase 1!!","Don’t buy the clone skins until they fix them for the canon version not these incomplete ones.","If Geonosis comes out before the Conquest-like game mode, does that mean Geonosis will only be available on GA?","Not a priority by any means, but has anybody else been annoyed by this door since launch?","Why have i got a 42 GB update?","Unofficial Updated Roadmap - Using the leak","Dam Break 2.0 September.","27 minutes for the optimistic posts.","How go is use the clone wars only playlist?","I Like the new skins","How can I see the statistics after a round for longer than 3-4 seconds?","Look Dice add Pink Vader.","I hope the large-scale game mode won't be a reskin if battle station from BF2015","So DICE, since being accurate to canon doesn’t actually seem to matter...","How do you buy skins as a bundle?","Congrats DICE, you somehow managed to make Mauls saber throw even worse.","Confidence in future content is surely at rock bottom at this point.","Miss you I will","Did I just get the season pass for free?","Could somebody explain me the new EoR screen","pic from 2005, we can see the brown strips on the armor","Default skins look better","Am I missing something here?","WHAT IF Obi Wan...","Have the in game hero costs of battlepoints have changed?","Why the new skins are fine (Canon/Gameplay reasons)","Where is the clone wars playlist icon cause i dont see it","Ewok hunt","Hey. Are daily challenges still bugged?","I stopped playing this game 3 months ago. I keep waiting for something to bring me back in, but every month it's just more disappointment. Small content drips won't bring anyone back.","Darth Maul's lightsaber throw still bugged","The big scale mode will be 32v32 or 20v20?","So the patch is 650 mb?","Where is the clone wars era selector?","For people asking for kama and pauldron for the Assault clone class, wouldnt it be better for it to not have one to differentiate it from the Heavy?","Really guys?","Map era priority?","Captain Rex is a must add into the game!","Yoda’s presence is more than a heal ability","SO IT WAS A CRASHED SPEEDER!!!","Star Wars Battlefront 2 Clone Wars Customizations","*sighs*....EA","Challenge Progress Between Extraction Rounds","What it looks like to have your Mine Hangar overrun","Why isn't the battle of jakku a multiplayer map?","Has anyone noticed you can now play both sides in Blast on one Map?","Is there Phase 1 327th and 41st Skins?","Why can’t the bundle be bought with crystals?","Bf2 players be like","We need an answer","No skins for Phase 1 clones then??","Could somebody explain it to me","So after the launch of battlefield V...","Don't scream this game down only to hold out hope that devs should come back in any capacity","Is it possible?!","Will you be able to purchase the 3 pack of skins with crystals as well?","Can you imagine the game we would have if CD Projekt Red was the one with the Star Wars license? Just let that sink in for a moment.","Can we please not have two sequel era starfighter maps one after the other","Map specific clone commanders","ITT: Stuff you'd like to see in the background","Why I can't buy the new skins ?","veteran han and chewbacca","What is the Map rotation for Blast?","It's always darkest before dawn.","In an ideal world...","We just going to ignore the fact that the sliding doors on Hoth do this whenever opened?","Finding a game..","Both legion skins on blast","About the clone wars playlist","Hi. I'm a Clone Jumptrooper and I love windows.","Back to Season Pass?","Let me buy beard Han please","How to get the 40k bundle for the 3 skins ?","You can barely chain two dodges with a lightsaber Hero now. Infuriating.","How about removing the daily crate and add a 4th, daily milestone instead, that automatically \"completes\" on logon ?","Uhh is it supposed to look like this?","Let the rainbow clones begin...","Double XP Weekends are fine, but can we get Double Credits Weekend someday?","What I think it will take to get an actual Battlefront game from EA,","*PLEASE READ*","This is me in regards to pretty much any news about this game.","With the new clone skins coming in an idea just to mind about skins.","Even after tomorrow's patch, this will still be the same","Will there ever be private matches?","The last phase of Kamino is frustrating for the CIS","Any tips/help for a new player? (PS4)","I don't wanna be negative buuuut","Your clone wars galactic assault playlist is not working.","Game is unplayable","Ben, you alright?","Lando sent spinnin","Global - DLC - 41st Batallion clone scout class is incorrect","Cool “hunt mode” idea","WHY do I keep getting put in empty servers?","my favorite battlefront 2 screenshot","Ideas for a future villain.","Ben you said you were going to talk to the Dev team about Arcade when you get back from Gamescom","French EA website published new roadmap informations. Here's a translation of it. (original link in comments)","Ranking system for HVV and Showdown","Non update related post! Does anyone else feel like that when a hero dies in GA they shouldn't be available for the rest of the match?","5 questions after patch notes and roadmap","Clone Wars update will be the last straw for me.","Sound very familiar.......","Hero Showdown rounds should begin after 3 out of 4 players have joined.","What a game...........","I’m actually pretty curious to see what the new thing is that wasn’t on the roadmap. Even if it’s just one skin or something.","I’m HVV I would love if you could use your abilities when you are getting lightsabered to death so you just don’t have to take it. Rolling doesn’t always work.","Confirmed: Count Dooku will be called Earl Dooku (/s)","Clone Jet Trooper Skins","Custom Games are necessary","Im done","Ideas for Jango Fett that not result in a Boba reskin.","I think with this crappy update I might finally be done with the game","Post Battlefield 5 launch","Now that we have a look at the roadmap and all can we get an update on that live stream. Will it be showing off the Squad System?","Faction Specific Emotes","Can we get another update to the lasers?","So is this game just dead then? Cause they say they fixed the ping site bug but I still can't get a game.","Any plans for new trophies/achievements for the new content? (If you do make them possible and not based on luck please)","DICE, if you're making a Battlefront III, please be smart","Every one remember when the large scale game was coming in fall","Leaks are deliberate. We're all being played...","Thank You EA &amp; dice for the update! Currently downloading as we speak.","Less content in 1 year than a single DLC from Battlefront 2015","Battlefront Will Almost Certainly be Supported in 2019!","Why do we even try?","Hey so any updates on the continuation of the menu and non-holo improvements?","Spawn screen","Legitimately worried that there's no \"known issues\" section in the patch notes","Clone Wars Season","Clone Wars Update","Skirmish and Smash are Strike and Blast Translated Incorrectly, Right?","Which clone skin are you buying first if not both?","For fuck sake.","I hope we some kind of Starfighter content for the Clone Wars season.","Ben's gotta be bipolar at this point then...","I'd rather get Greivous alone in October than wait for both in November.","So are we ever going to get new Starfighter Assault maps or...?","Hey r/f8rge! Question about more polls like you did for voice lines...","This has probably been done before. Still awesome","What are some of the most frustrating things people do in this game?","Lol someone left a player a nice little message 😂","I still dont understand why they would make us wait almost a year for Obiwan and Anakin.","This does put a smile on my face.","How satisfied are you with the skins?","They got another one boys :(","Aww man!","Called it.","anyone else think the GA map rotation should be chronological?","i think we’re at the point in this games life where we’re gonna take anything they give us.","WHAT TIME DOES THIS START?","Why do yoy continue to support a game that has been doomed for months?","Request for next roadmap update","I really cant understand how DICE can fuck up this bad with EVERYTHING they put out for this game.","To those who are actually hyped about what is to come!!! (despite issues)","DICE, stop with the monthly \"updates\" and just take more time to polish content","Just got the game a couple of days ago.","What is all the single player content in this game?","So is the new season tomorrow?!?!?!","Today SW Battlefront 2 RIP for me","More Lies from Ben","One of the coolest moments in the campaign in my opinion","501st Legion Promo (Fan-made)","Maul having a flashback to the phantom menace mid battle","Which version of Obi Wan do you want to be the default?","How is it possible?","Can someone explain the earl meme?","F8RGE, while you are so responsive today, may I ask you on behalf of a big portion of the community","It’s all about flanking","\"No more hiding\"","DICE why u no do lyk dis ?","Can we get rid of the Emperor’s health on kill card? Or just the emperor in general?","It will cost 420,000 credits to buy the 4 heroes + all clone skins","Strategies for building up credits.","Worst experience on heroes vs villains yet","Battlefront 2 has greatest lightsaber presentation! they should add 20 jedi vs 20 sith mode! custom avatars, custom lightsabers = profit","More difficult to get a hero","When's the August update coming out?","Any new planned skins in the future","A question about all the leaks","I know that we’ve pretty much already gotten the road map but Ben confirmed that the ‘new’ thing on the roadmap wasn’t on the leak and that we’re getting it officially on Wednesday","Typo on Bossk Emote","Vulkan","So this game is basically dead?","When the worst guy from your team starts making remarks...","Upcoming \"Content\"","Xbox One ping site","Opinion: All heroes should be able to regenerate 300+ health","Matchmaking on Xbox?","Wookiee still op","So are they done with balancing the trooper classes? Officer is still way too powerful.","\"AS IF\" - DICE YOU MAKE ME LAUGH","Are We Even Gonna Get a Trailer for the New Content?","Piloting the Corvus in Battle","Okay. Which one of idiots was it.","An Open Letter to EA About Battlefront 2","More issues to come when Obi Wan, Dooku etc are released..","Battlefront 2 is far from dead (these aren't even all PC players, only the ones logged using the tool)","Leaked French roadmap (note: some information may not be final yet)","I assume the ‘surprise’ will release in October","New squad system and Galactic Assault","Henceforth, Count Dooku shall be known as Earl","Nerf palpatine or nerf the officer the enemy top player became papa palps in literally 5 minutes and destroyed us DICE plz.","Not a single mention of Starfighter Assault in the leaked Road Map. RIP to an incredible mode with so much potential","If EA Wants to do Right by Clone Wars..","DICE, Please Bring Back the FoV Slider to the Console","Who would be interested in Ewoks in GA?","FINALLY!!!!!!!","A genuine, positive thank you to the developers.","Kylo Ren should get assist, score after frozen enemies and the kill if he manages to kill someone with a pull","“And as if that were not enough” Really? Drip fed content and constant delays, not to mention most skins being in the game since launch? How is that “enough” in the first place!?","Is it just me, or is it much easier to win attacking with the light rather than the dark side? Even an average light team can win with all that extra health, but it takes a very good dark side team to get pass all that overhealing.","\"The month of Obi Wan Kenobi and Geonosis\" essentially means you can't wait till the last few days of November Dice!","I am actually fine with The new roadmap (Roadmap Leak)","Things they will most definitely never fix (please add to this list)","Ding dong the witch is dead, Wookiee warrior can no longer roll when using overload","Sullust is so DAMN HOT","What is the most boring daily challenge in your opinion ? My vote:","Scale of 0 to 10 rate battlefront 2 so far.","Okay tommorow official roadmap? What do you clone’s think we extra get?","Can i get an achievement if i play all battle scenarios?","A Boba Main's guide to Boba Fett","I made a new Video on good ways to play the Heavy class for new players!","Hey F8rge, can we get an update on these things that have been delayed?","Heroes covering you while playing objective feels so filling","Going off of the leaked Roadmap update, the upcoming Large Scale gamemode will be like Battlefield 2142's Titan mode","New Player: How does queuing work?","A question for u/F8RGE","If the game won't receive some additional saber combat changes, Grievous is going to be extremely glitchy","Lack of Perspective","Gamebreaking","Dxp weekends announced","I don’t wanna sound ungrateful. But is geonosis really the only clone wars map we are getting....?","Regarding the Florida EA Shooter","I really hope the new large scale gamemodes is playable against bots in arcade mode","Yoda is shooting 3's now?","The best bug fix in the new update","So it is confirmed that Grievous will get multiple skins, which one do you think will be his original and which one his additional?","Double XP this weekend!","When will the matchmaking get fixed and how will it be fixed.","Wanted to talk about Strike and how it could be a really good game mode","Wednesday Patch Bug Prediction Thread","Hey guys! I guess some of you may already know why I'm here. A new mod of mine is out! Horn Company. Enjoy!","Lightsaber combat (discussion)","Regarding that Clone Wars matchmaking tile: are the 3 prequel maps now grouped together or still mixed with the other maps ?","“And if that were not enough” are you kidding me the large scale game mode got pushed back grievous and obi wan are not even coming together. Also we are not getting any clone skins in October. Plus they lied about saying when heroes are coming by month because dooku and anakin still say winter.","we need a generic jedi for a jedi hunt mode, for when general grievous comes out.","How to select Stormtrooper or Scout Trooper?","Why is D’Qar so unbalanced?","What does this mean?","Ben Confirms the New Squad System is coming in September!!","Hello Ben. Just one question about the new squad system.","An Update on Unreleased Han Solo and Luke Skins","Jango Fett","When does the official roadmap release?","Are you fucking kidding me DICE?","Dice should work on a humanoid droid reniforcment as it would be a lot easier than a droideka.","Just a friendly reminder...","Is this a typo or was it only fixed for Heroes/Villains and not infantry?","Ready to ship out for Sullust","So no Skirmish mode?","Help a noob.","Are you team #EAPortugal or #EAFrance?","Thinking...","A year ago, saying \"of course we will get Obi Wan in November.........2018!\" Would be seen as a silly joke.","Pillio for extraction please","All I’m surrounded by is fear and dead men","Our biggest questions after seeing the roadmap leak!","DICE, PLEASE don't have Grievous and Obi Wan separated like this. So many people are going to leave HvV matches if they're not villains when only Grievous is released first.","The “unlocked and UPGRADED” has been in the game since appearance update, any news on this?","Direction","Hero skins I would like to see","Happy birthday to the greatest Battlefront YouTuber! Thank you Elliot for amazing content that keeps this community going!","So basically","EA’s Shortsightedness","Are community-created skins an option?","2022","CT Leaked ??? Translated from Portuguese to English.","#Stop the Hate","My idea for a Clone Wars Map","Dooku, Anakin and new large-scale mode in first trimester of 2019 (Brazilian Portuguese)","So what gaming breaking bugs were introduced by this patch?","Officers when Heroes release","Obi Wan will be able to say “Hello There”. F8RGE confirmed on discord","If Anakin and Obi-Wan's Hero Ships are just re-skins of Yoda's Starfighter, I'm perfectly fine with that","So what gamemodes will be on geonosis at launch?","Guys they're releasing the heroes separately because one's gonna be done before the other","Future of the franchise","Hero Idea","Whilst it's unfortunate that it's only going to be one hero per month, -","I found a song that describes pretty well the situation of Battlefront 2 and its community","Geonosis better be the best map in video gaming history, because the amount of \"no\"s we're getting to requests because of Geonosis is just getting ridiculous.","My thoughts on the game","Grievous comes October and Obi-Wan November","Hey F8RGE, can we get an update or ETA on the upcoming large scale game mode that is supposedly releasing in fall.","There are so many assets in this game alone, that they could easily make a \"low effort\" season just by (mostly) reusing/modifying them","Does the update Wednesday include the hero BP decrease?","Fan-Made Shock Trooper Promo","In preparation for Grievous (although I know 2003 CW is no longer canon) I can't help but love how they handled Grievous in this show. It will be always be my head canon.","As close as it gets....but we held. FOR THE EMPIRE!","Fuck.","Bug prediction list","Shock Trooper","MMMMMMMMMMMMMMMMMMM I'm mad! EA broke my fucking controllers! Help. [PC]","The new squad system can bring so much to this game if done right.","Are the Jet Trooper markings on Kamino supposed to be black?","We can mod the battlefront we want. (Probably)","The hypocrisy of the /r/StarWarsBattlefront community","I seriously hope the new added thing on the road map is new weapons.","Which Clone Wars hero are you guys in favor of that will be releasing?","I miss Sullust...always thought that map was gorgeous","One of Obi Wans victory poses should be just his zoomed in \"Hello there\" face from rots.","So I just started playing the game again after a month or two and noticed there isn’t a ping site for Australia anymore","Ben's Job is to firefight the players, not to help us get more content....","Predicted with ease","According to this \"leaked roadmap\" all the new heroes have additional appearances.","Could this mean were getting the peak at Kenobi given it wouldn't be a 'text based' addition","Updated roadmap (Yay?)","Is it just a preference or is it better playing in third person?","Darth Sidious","No players on PS4?","Patch notes for this week's update coming within the hour!","Could we get some sort of level editor just like snapmap on Doom?","New Glitch?","Roadmap official release Wednesday now?","Will the Clone Wars season bring any new content to SA?","I’d love to see the ratio of wins on defense vs on offense. I bet it’s 3:1.","\"Can’t connect to EA servers with this account to activate Star Wars Battlefront 2, please try again later\"","French EA leak...again?","Hero health cards.","I thought this was intentional, maybe call it a balancing change? But I guess it's another bug they didn't know how to fix...","It seems that HvV isn't as unbalanced as some people say (data from BattlefrontStats.com)","Just thinking of ways to tailor the combat experience.","Let the wookiee win Boba","Hahahaha we need matchmaking","Why can't DICE do this?? I don't understand why this still has to be a mod","Rose Tico in Battlefront","Starfighter Assault on Jakku","How many total clone appearances will be in the game?","Remember this? Feel like its just damage control the way they are releasing skins and all that stuff...","Speeder Bikes","Why I think General Grievous should be delayed.","Going to keep posting videos like this when they happen until devs tell us something more than “It’s being looked at”","Bring Battlefront 2015 maps into the game?","Would you rather have a long dry spell and then a big content drop, or regularly drip fed the same content over time?","Boba Fett is the weakest hero","New game mode is basically conquest","The best way to play Starfighter Assault","Infantry Skins","PS4 Group","Ultimate Villains' Abilities Feedback Collection (Heroes SoonTM)","Just a prediction","Obi wan until november hahahaha","What the fuck is going on with the French team?","Not much info on hero skins in the roadmap leak. Hope there are actually being worked on.","PLAYERS NEEDED: 1,000,000","the leaks confirm that we're on the darkest timeline","If you had to describe EA/DICE’s BF2 “Live Service” in one word what would it be? And why?","YAY Fixed an issue where the player was able to use the combat roll while the Overload ability was active","Bring more devs to the game","I feel bad For Janina Gavankar","Scrapped together hero info from ben","For everyone upset about how slow the content is...","Battle-scarred 💥 | 41st Elite Corps","I don’t know why I waste my time anymore","Guys the truth about the Droidekas","Am I going nuts? Has BF2 been abandoned by the players?","Remember when that leak said we'd get Geonosis in August?","The Roadmap doesn’t change much","Where the f is Qui-Gon!!!","Large Scale Mode is set for winter on the leak although on the initial roadmap it was set for Fall. I seriously hope this was some sort of mistake or will be changed soon.","Jedi hunt","Theory on why the game mode got pushed back","Roadmap comes after update =(","Now on the Community Transmission, they removed where it says 4,000 Battlepoints","When/if Geonosis brings Geonosian starfighters, please add them to Hero Starfighters at the same time! Don't take like 2 months like with the N-1.","Might be a silly question, but: Did we ever get a confirmation that the new large scale mode is actually an online multiplayer mode ?","Within one hour guys","Had a real good naboo game where the over time was 5 minutes I had 140 before over time was using bossk but I had to sacrifice him to get on the obj we loss but it was a gg","Crait HvV btw","the game at its finest","So, after 9+ months, can we finally have a definitive answer on why Wookies can roll during \"Overcharge\" but Death/Flame troopers can't ?","Learning curve of 2015's SW:Battlefront?","Are the different in game hero battlepoints costs coming in this update?","HALLELUJAH !!","Singleplayer GA","Need friends to make up the number to play Ewok hunt on the pc","Question regarding the Obi-Wan and Grievous split","Leaked Clone Wars Roadmap 404's Now. Here's Screenshots Of It All.","How can you people still remain positive after all the nonsense this shit game has put us through?","We’ll never get OT content. Not even hero skins","Obiwan and Geonosis in November. My heart is aching.","French Roadmap Info (not final)","95% of Galactic Assault is knowing where to stand","I wonder if Umbara could be a new map for the clone wars era","If I was a Battlefield fan I’d hate these prospects","So I'm guessing....","Did Dice ever fix this? (WARNING LOUD RAGE)","The maps in bf2 are better on a gameplay standard than bf1 but they severely lack detail","I wonder how many times he replied to something outside of these hours","If you can't find matches to play on PC, here's what you do.","Possible reasoning behind order of new heroes","Hey","Stuck on Kamino...","Why is this game dead on PC multiplayer but not consoles?","PS4 ERROR code: CE-34878-0","The ability star cards should just be their ability icon with the white being changed to the color of their rarity.","What Clone Skins do we want next?","SWBF2015 - I know this is late and it applies to many games, but this is the main reason why I don't play BF2015 anymore. Shameless modders","I hope Geonosis isn't chopped up into small phases. I hope it is an open, large scale area (from the previous leak).","Never feel discouraged on not getting the Heroes?","About Tallie Lintra","Surgery :\\","I. Can. Not. Believe...That I miss having a season pass.","Where is everyone!?","We get that Legion another Legion ( Wolfs) and the Squad System in September for the Season begin...","Reddit, I have no idea where to turn. I've been unable to play the game for months due to a game breaking bug multiple people are getting!","lightning still goes true walls. :(","Is the elite corps update live?","is there any content that were getting that we haven’t already known about?","Nope, not this time Luke","Is it me or the ion cannon need a massive nerf against vehicles?","So who the f is Obi-Wan's voice actor?","If you could add 1 feature to the game that wouldn't make sense in canon, what would it be, and why?","One of the only survivors.","Is Guillaume the only one that works at DICE????","Fix Your Fucking Game!","Why do people try to draw out Hero Starfighter games on purpose ?","Challenge suggestions (Hope you see this F8RGE)","Operation Cinder Naboo map from the campaign could work as a online map for GA and strike. But with rebels and stormtroopers instead of clones and droids. would be cool. Will probably never happen tho","Geonosis in November (according to leak)","Ping site bug fixed in Wednesday update ?","Team Balance for Elite Corps Update?","QoL improvement = Reset Star Cards when you are selected as target in HvV.","Hello There Confirmed","This crashed speeder meme is so damn good","Keep on getting error 1,066","I cannot wait to see how broke Grievous is. It’ll make for a great Sithpost Saturday.","are seasons no longer a thing ?","Will The general have 4 arms while fighting?","Remember when this was a huge epidemic?","Testrun : If 'opponent' doesn't know how to open the elevator on Bespin, 'opponent' is probably new to the game","Update drops Wednesday, patch notes drop today! Happy Monday!","I don't feel so good","I genuinely believe that Anakin and Dooku will not ever come.","Strike change suggestion","I went back to play BF1 today after playing BF2 since its release and I gotta say I have way more fun with BF1.","So when am i getting my double points back?","battlefront 2 is a much bigger disaster than 2015 ever was","I don't even care anymore.","Geonosis is a new Galactic Assault map?","Haven’t heard any updates on Palpatine so I’m reposting this in hopes that it gets added back with our next patch (lightning hitting blockers)","Guys keep talking about the force abilities being unreliable , as you can see the leak froma few months mentions bens method of \"tagged\" that they wont do anything if te community is not persistent enough!","When your teammate with the least points is almost better then their best","Patch notes available?","I don’t know if this was already posted, but here’s the leaked roadmap","Its fine to use these mods in online ?","When’s the roadmap coming?","Is the game dead in AUS?","Wait a minute we’re smarter than this. This isn’t the Clone Wars season, it’s Attack of the Clones season at best","HvV Hoth Glitch?","Game doesn't work anymore","Interesting little video about the possibility of dual-weilding in early development (excuse the clickbait)"]