["Off-Season Open Discussion Post - August 28, 2018","Gia Gunn - #LaChinaMasLatina ft. Alaska Thunderfuck [Official Video]","Jackee Harry responds to Eureka’s tasteless shade","The Vixen throwing some shade.","Billboard endorsed Ginger for Ursula in the Disney live action Little Mermaid","Trixie for New York Times Magazine","Shangela spills some scalding t","Jujubee and Tatianna showing us what they would look like on Season 9.","Miss Trixie in the NYT","This ru doll is so gorgeous","My birthday present from my husband, a drawing of my angel cat Quinn as legend Katya. Words cannot describe how happy I am that this now exists.","Kim &amp; Naomi slaying my life","Touch the Pop Art Change your life! Big and Milky for The Gay Times Magazine","Eureka responds to Jackee (although she didn't tag her)","The Dancing Diva is now officially a Duo! Get them booked at your local","The new preview from All Stars is here! Feat. Eureka and Shakira, Shakira!","The herstory lesson from S1E7","God is what?? A woman. Who?? Miss Fame.","Sharon being a relatable fish","Could Phi Phi be about to join the Celebrity Big Brother House? She was on the first BOTS... Phi Phi has said she’d go in if asked and with Stormy Daniels backing out at the last minute, there’s room for one more","Tbt Akashia hosting in the Oprah challenge","Pat winning Katya the makeover and reading challenge at once","Most wholesome queen, Tempest Dejour, swims with chickens and children","WASN’T NOBODY TALKING TO YOU: A Ms. Jackée &amp; Eureka O’Hara story.","This sickening moment from a season 3 lip sync","Tatianna spills the true tea about beauty influencers","Tatianna also suffered the “Mexican” incident back in S2","Jackèe Harry is not having it with Eureka","Trixie was interviewed by the New York Times! — “Trixie Mattel Says Drag Queens Are Like Swiss Army Knives”","Another Gia Gunn and Alaska collaboration! To that I say Absolutelyyyyyyyyyy. ❤️","\"The Gift of Showz\" - Sasha Velour's collab w/ Opening Ceremony for NY Fashion Week","Jackée ain’t playin no games anymore","Eureka Vaguebooks a S10 sister? 👀","That One Girl Shakira from the Streets of Tampa, Florida","Mama Chad scores first place for Drag Queens impersonating Celebs","Alexis Mateo is the new Miss Gay Florida America","Make sure you GET huh!","With Billboard endorsing Ginger to be Ursula let’s remember her singing Poor Unfortunate Souls","Jackée Harry having a cute moment with The Vixen on Twitter","One of my favourite moments from the show. Katya is a star forever.","Gia Gunn 'La China Mas Latina' Video Premiere","Eureka responds to Jackée Harry","Any news on Siblings Rivalry (Podcast)??","Yuhua's not at War on the Catwalk because she's been assembling her own superteam of Queens for her next big show apparently","Every Season 1 Lipsync","what does this bts photo of S2 gives you?","A cute moment between Monét and Yuhua at LAX","Race Chaser S1E7 \"Extra Special Edition\"","Water off a Barbie’s back! Vintage Barbie inspired look 💁🏼‍♀️ Outifit by Dallas Coulter","🏁Reddit's Favorite Queen of All Time - 2018 - Part 35 - 8/29/18🏁","Rupaul interviews Susanne Bartsch in front of the main stage","Manila and Sahara at the S3 premiere ❤️","Ru is not pleased with Jackée dragging Eureka","Delusion. Convince yourself.","Things that Aja did: That","Me and my boyfriend met Alaska at Manchester pride.","As promised, my video from Alexsis Mateao's talent performance from Miss Gay Florida 2018","This statue looks like Latrice Royale is telling the 5 Gs...","Detox is still promoting her perfume","Monet can now die happy after kiki'ing with her pussycat wig sister, Raven","Did anyone else know the Heathers had a single?!","Chi Chi being the queen we knew she was 💘","This looks like the most amazing superhero poster ever 🌟","Chad being a mother to Sharon 😩❤️","She is from ATLANTA, GEORGIA.","how come people still call miz cracker “miz”?","I can’t tell who is who.","Pink News being shady to Eureka","I love this picture of Adore so much ❤","TATIANNA Discusses HIV Stigma","Trixie apologizes for twitter controversy","Gia and Alaska. Let me know if you see a better picture today. I’ll wait.","Roast of Heklina Vids ??","Throwback to when the top 4 of season 2 were still friends in 2015","I drew Aquaria 👑","A moment of appreciation for Alaska with a fringe","Mayhem cancels planned Sept 2 appearance w/ Eureka in Columbus","Safe to say I had a fun plane ride","I know Aja doesn’t really wear titties anymore, but this video makes me wish she did cuz they are RIGHT","Post your fave underrated RPDR mugs! I'll start - Raja, 'Ru Ha Ha'","What happened between Eureka and Jackee?","A Pencil Sketch I Drew of Miz Cracker","Choices by Tatianna (It's A Perfume.)","Ms Tracy Martel: Comedy Queens, Brisbane 2018","Wtf is this and why did this happen?","DragCon attire?","S2 Tyra was lowkey hilarious","Las Vegas Queens","MUTHA IS ARRIVING IN MY CITY and i have no one to see her with :(((((","Ms. Carmen providing us with life changing advice","Iconic choreo","Monet being a shady lady on twitter","Throwback to Vivacious giving the ONLY iconic speech against online trolls.","Raja coming for Asia like","Susanne Bartsch has a new documentary coming out! Ru/Aquaria are in it so its rpdr related","C'mon Hookers, Lets show Kimora's Youtube Channel some love. The videos are HQ and she deserves more views","How to get the \"MISS VANJIE\" Fan Aquaria used in her LSFYL against Eurka at the Finale?","Rewatching 10 and noticed Aquaria being excited af to make it past round 1","Cringiest moments","EliteQueens is having a huge sale. Some shirts as cheap as $5 for anyone interested.","Best Season 10 Lipsync Moments Slowed Down and set to \"The Beginning\"","The Dawning of the Age of Aquaria","Tracy is such a nice friend","Which Bebe are you today?","Amateur Pencil Sketch I Drew of Vintage Rupaul","Monét X Change meets a “fan” at shake shack....","Violet was so shady during the first episode and I am still totally living for it","I’d like to introduce you to Ru’s newest fan, Louis.","Michelle addresses “I don’t know who the real _____ is” critique criticism","Pep Talks with Alaska Thunderfuck","Raja for Alright Darling","Jasmine deserves better.","How To Makeup with Yuhua: Killer Eyes!","SONIQUE on Look At Huh!","Sharon Needles being the motherly figure that we always knew she was back in 2012","this part from AS3 Ru-Cap managed to show what my mind looks like 99% of the time","Miss Kimora is not having it on tonight","Umderrated moment from AS1","Combining DRAG RACE with UNIVERSITY, yesgawd","I love the content jasmine produces","Boy Dida is making me feel things","Bob Being a Freestyle Queen","This subtle and understated D-R-A-G look is one reason why Alexis Mateo should be adored. She is literally an entire production.","Two beautiful women. Pep and Amy Adams","Throwback to party.avi","Drag Tots behind the scenes","Alaska in Gia's new music video (coming Wednesday)","Does anyone know each song that was adopted into different Cher's eras during the Cher challenge?","Miss Kennedy Davenport has crystallized and descended from the heavens to do the lord’s work with her vocals","Did anyone ever find out what song this is?","Aja kinda got the short end of the challenges... Twice.","WOW’s oddest DragCon ad placement to date?","Jinkx calls out a ‘fan’","Alexis is the most beautiful producer on reality tv","aja discusses cilantro with herself","Three questions from the Decade of Drag Race panel with Tatianna, Manila and Katya at Drag World","Aquaria cancelling Kameron’s gig in the cutest way possible","I actually think Rupaul should actually now own the Queen Bitch she is","Upon ruwatching, I started to think the wig on Shangela's head looked very heavy during her variety show performance, thus realizing that Shangela is a short queen","Raja’s show in Provincetown","My favourite Queen. The iconic and iconoclastic Raja.","This hair grew out of Blair St. Clair's scalp","Which country(ies) could you realistically see having a drag race version of their own?","This is the only “Oh Honey” moment that genuinely made me laugh my ass off","When Your Phone Autocorrects “Banjee” to “Banjo”","Throwback to when Katya and Tatianna made me question my sexuality yet again","Dela’s mug never fails to brighten my day","Why did Tyra and Raven never clash at each other in season 2?","Favourite RPDR quotes in your mother tongue","Stuff you miss from the early seasons...","Do you think Michelle's aesthetics is leaning towards being femme?","Lineysha Sparx’s fashion line is absolutely stunning. She deserves more recognition.","Mariah being Mariah","The Vixen is an absolute stunner","Interesting listening to this again in light of the new Pearl drama.","Tucking Tips with Trinity Taylor","Courtney Act on Edinburgh Nights about her Edinburgh festival show","Detox owning the stage and performing TWO of her songs LIVE at Chicago's Drag Matinee","Aja has really been serving some beautifully influenced looks 😍","Shea's mug 💜","When do the contestants film their confessionals while they lip sync?","Mama Ru looking fishy af these days!","SONIQUE on Hey Qween!","Aquaria and her mother looking cute","RuPaul’s Drag Race Season 10 Favorite Looks- Aquaria, “Mermaid Fantasy”","All Stars 1 + Untucked now available on WOW+ in the UK","Vixen, Alexis, and Jiggly are so cute.","RuPaul’s Spotify Playlist to Pearl","Lip Syncs where the loser was more memorable/entertaining","Great performance by Naomi (superlove)","Only a Handful of Queens (Violet, Fame) Can Elicit as Much Glamour and Opulence as Valentina","Aquaria saying what I thought about Kameron","Darienne Lake serving your grandma's cat ready to play but will end up pounding you","April Carrion as a Judge in Versus (Mexican drag competition)","Blair and legend NBFTMH kiki","About people who speak RPDR language in daily life","Star Trek: RuPaul's Drag Race (created by me)","I can already hear this picture from a mile away","Light T: Michelle Visage on bio queens","Come on overwatch league let's get sickening!","Yuhua’s reunion look was so iconic and fun","We have queens who are bad at Drag Race but amazing in real life, but are there any queens who are bad in real life but amazing at Drag Race?","Did 👏🏼 somebody 👏🏼 mention 👏🏼 art 👏🏼","My friend poured hot wax over herself during her number and Blaire and Raven didn’t even notice 😭😂","It's Derrick fish 💋","favorite FPR moment: Raja being too stoned to comprehend IQ Kitty's concept","Runway themes suggestions","Phi Phi wasn’t having it. Oh at all","Throwback. Ms Fame's epic \"I'm so happy you found love!\" moment","Gia is less than 3k away from meeting her GoFundMe goal","Found in Brazil","RuPauls's Drag Race: RuVealed?","What would you do for your entrance look?","Valentina serving 70s Glamour Barbie last night","Our First Lady, Melania Trump","WE*O queens just can’t catch a break with those vague drama posts ...","What's an obscure line you use from drag race in your everyday womanly life?","Let's remember Alaska (and Tiffany) being the only redeemable quality about this show","Entretien avec Tammie Brown – Le Polyester","Throwback to Milk impersonating Trixie's lipsync moves very accurately","How ANTM Inspired RuPaul's Drag Race | The Kiki Ep 4","🏁Reddit's Favorite Queen of All Time - 2018 - Part 34 - 8/26/18🏁","The Season 9 Finale Slowed Down and set to \"Good as Hell\"","John McCain showing up to the senate floor to vote against gay rights one last time","Morgan lookin great as always","Queens with their own titles?","Kameron Michaels Questions From Reddit (transcript) + Bonus Hey Qween REPOST","Remember when Thorgy was number 1 in Bob's Kai Kai list","Who is the Boss and the OG?","Preview for Courtney’s new show “The Bi Life”","Serving looks...and books! Children’s books about Eureka and Blair St. Clair available written by Indianapolis queen Miss Mossy Stone","Favorite signature wigs?","Me getting ready go out with friends vs Me the second I get into their car","I feel like the Werkroom re-design is really underrated, but I think it was awesome of Ru to showcase some of the show's most underrated looks!","Talented young dancers slay gag worthy choreography (courtesy of the also talented Brian Esperon)","Tyra whomst?","What color did Laganja paint her house?","Whenever a living male gets posted in here","Willam performing That Boy is a Bottom/ Es Una Pasiva at Parliament House 8/25","When you put time and effort into your shit posts and you get 20 thumbs up vs people reposting the same thing and getting 5k","Jujubee and Naomi on the newest episode of M.U.G!","The exact physical display of emotion you have the first time you realise Ru is just kind of an asshole even if he is your mother","I’m not proud of this but...","When the fans found out Vixen was good friends with Blair","For your eyes only. Ms. Monique Heart.","Willam performing Oral live at Parliament House 8/25.","Valentina Being That Bitch Tonight at One Eyed Monster","Did somebody mention art?","Happy 28th birthday to the stunning Elephant Queen herself, Miss Eureka O’Hara!","Well Ru, I don’t think you’re seeing....","Mom said it's my turn to use the fleshlight","Pearl at the Urban Cowboy","When ur watching porn and they just start f*cking without a Premise or Foreplay..","Hi guys I did a drawing of Alaska's pre-Lil Poundcake ruveal look cause I thought it was kinda underrated, I’m pretty happy with it","What came first?","Latrice Royale started a new diet and yaaas I'm living for it","Rupaul taking queens' childhood traumas for another Emmy","When you accidentally hit your sibling and you already hear your mom's footsteps in the hallway","Willam Belli: The Reality of Drag","When you subscribe to WOW+ in order to get HD images for Shitpost Saturday","Challenges or episodes that felt completely owned by a single queen","When Ru looks at you the wrong way and you feign ignorance to hide your truth","When you're ready for the field trip but your mom didn't sign the permission slip.","When the cameras aren't rolling, but the blunts sure are","Valentina’s Entire One Eyed Monster Performance and Kiki with The Boulet Brothers","When the cameras aren't rolling and Pearl starts to talk about how inspiring you are","An Under Appreciated Aja Moment Slowed Down","I can’t believe the S2 finale predicted Pearl","Michelle: Girl, no—that's a giraffe. Monique:","What Asia wanted the theatre to look like after her ruveals.","My mom seeing me play in her heels when I was 3","when you're so into voguing right now and someone hits a shablam","When everyone else talks about receiving unsolicited dick pics, but no one ever sends you any","We've all been waiting for this for way too long.","When you ask your mom for help with your Calculus homework and she asks you how the hell she’s supposed to remember anything from when she was still in school but then manages to solve a problem and is extremely proud of herself","Hi guys I did a drawing of Katya’s rubber on the runway look cause I thought it was kinda underrated, I’m pretty happy with it","The gay intern must be off this weekend.","The Latina Goddess Grooved the House Down Tonight","Willam contributing to the latest Pearl producer phonecall revelation 🔥","This sub was my introduction to reddit and it's still my favourite ❤❤❤ forever greatful to you hoes","Me in a gay club vs me in a straight club","Roxxxy flattening her tips with a hair straightener","I Fucking Love Bald Men","Officially star struck ✨","Asia keeping it up with the best social media game","Our favorite Runner-up 💕✨💕🤮💕✨💕","When people ask me what is my favorite Ludacris song","When you thought your sugar daddy would take you to France but he actually meant Paris in Texas","Hey guys I did a drawing of Sasha’s rose petal reveal cos I thought it was kinda underrated, I’m pretty happy with it","When your \"friends\" tease you about being constipated.","The Cornacia era was so iconic","To remind me I need to always excuse my mouth❤️","Off-Season Open Discussion Post - August 26, 2018","When somebody DOESN’T want all the hot Drag Race tea","me when people don’t upvote my shitpost that took 2 minuets to make but people upvoted a meme a stole","Hey guys I did this pixel art image of Sasha Velour's men's tie dress because I thought her outfit was not getting enough attention. I'm pretty happy with it.","Eureka's cameo on the incredibles 2","When your fave gets invited to Hey Qween to possibly ruin her chances to be in an All Stars season.","When your shift is finally over","When you work at an ice cream shop and someone wants a chocolate-vanilla swirl","When trade wants to do anal but you haven't douched yet","Another look for the Underrated™ series. Here, we see a rarely mentioned Violet Chachki gown.","When I realize I'm about to hook up with a guy without first making sure we're sexually \"compatible\"","Leaked original video for Sissy That Walk","When the show finally wins the best reality show emmy","Who is the OG Elephant Queen?","Tyra's a complete...","Exclusive footage of the producer calling Pearl","When you're supposed to give a wedding toast but you're too drunk to not act extra gay","Laura Lee: My Apology","Alyssa pleasing Ru by knowing \"what really matters\"","Rupaul when the cameras are rolling","Producer before he decided to call Pearl:","happy 2 year anniversary to the release of one of the best seasons of rpdr imo","When your parents ask why you can't pay your bills","When people say they want to get rid of shit post Saturday","When you call the cops because Sasha won’t stop harping on about art","Hi everyone! I’m an amateur artist, and I decided to draw Trixie’s Red for Filth look. Please don’t send hate. ❤️","Willam chimes in on Pearlgate. Who's Steven?","A friend ran into Kennedy eating fried chicken on the street last night. I demand we start calling her “Kentucky Fried Davenport”.","My friends: be ready at 8:30 Me at 8:30:","Walking around Manchester today for Pride &amp; I saw this!","A Convenient Atlas of Eliminayshon","Venus D-Lite when she found out she wasn’t on AS3","When your best friend cancels plans to go out.","Sasha Velour 3 seconds before the 2nd chorus in So Emotional begins","Did somebody say shitpost Saturday?","Alaska a beauty in red","When you have four hours to kill at the airport so you open Reddit to kill some time only to realize it’s shitpost Saturday.","RuPaul asking you about your traumas to determine your worth to the show","When I realize it's saturday already and I need something to post before it's too late","For all of us sisters who have poor eyesight!","Nothing you __verb__ matters unless the __noun___ are __adjective__","Minimalistic Drag Race: iconic moment #1","When someone asks me to make them an iced coffee when I already clocked out of work","The moment that gave us the face crack of the century","When you win the $100,000 but then remember you just won Drag Race Zimbabwe","Craquaria is smol bean uwu","Tyra kept digging herself into a hole","Rare footage of RuPaul saying that things said off camera matter","Asia expressing how we all felt about S10E1","Manila and Jujubee; Two Beautiful Blond Bombshell Lesbian Moms wishing Cymru a Happy Pride.","I love Sasha Velour!!!1!","When you haven't talked about art in 5 minutes","My contribution to shitpost saturday","I don't think you're seeing that Tyra's a complete...","When someone says the International Court of Justice is located in Geneva","when your two-top requests a booth at 4 PM, orders only water and bread, and then lingers for the rest of your shift, and ignores you every time you ask them if they're ready for the check","When they joke about that","those sushis’ are all real btw","Ru when a queen shares a traumatic story while the cameras are rolling","Found in the deep web.","Following an Aja Make-Up Tutorial Like","I Did a Drawing of Nina Bonina's Peach Look 'Cause I Thought It Was Underrated, I'm Pretty Happy With It","When someone asks me what’s a ring-shaped reef, island, or chain of islands formed of coral.","This is how Courtney watches Drag Race at home.","When you get given too much gardening equipment","Please Help! My phone was stolen at the Louvre and the security app shows this person stole it. Can you help me ID them?","Tyra is a...","Aja during the princess challenge","When you had mexican last night but trade said he’ll be here in 10 min and you can’t be bothered to douche","When someone asks me what I take for my ADHD","Tatianna didn't lie","when you &amp; your friend are playfully throwing shade at each other but then they decide to bring up your past","my boyfriends asia conspiRUcy for shitpost saturday","When you smear the camera in a purple filter to prevent any of the season 9 queens outshining your status as the makeup queen","me when i kept seeing miss vanjie memes months ago and it was never funny from the start","Charisma, uniqueness, nerve and safety","When People Start to Act Brand New.","Michelle when Dusty came out with dots once","Eureka and The Vixen serving looks","When you work at the hospital and the family asks for the prognosis","Okay, I am OBSESSED with...","When you're play boxing with your toddler and he catch you with a pop on your nose that makes your eyes water","SOMEBODY PLEASE CALL RUPAUL!","When it’s shitpost Saturday and you don’t feel incredible","Miz Cracker playing to slay! Corset by AbrahamDavidLevy, wig by Wigs and Grace","When your Shitpost got many upvotes on Shitpost Saturday","Me when the sub won’t post my shit post even on SPS","Yuhua serving up raw fish on a platter","When that bitch Kathy from customer service puts you on hold for 15 minutes so you hydrate and prepare your speech to cuss her out the second she comes back","Latrice and Aquaria are the duo we didn’t know we needed until now","Mom said it's our turn on the xbox","The two best, most effective, life-changing reads in RPDR herstory","I just thought they look similiar","One hop this time","that creepy guy with no picture and a scat fetish who messages you on grindr","In Theaters November 21","Sasha and her art couture looks 😍 Dress by Braxae, mask by Diego Montoya, feathers by Florence D’Lee and Wig was snatched when she saw herself in the mirror 🧡💙","I Did a Drawing of Bianca Del Rio’s Best Makeup Look ‘Cause I Thought It Was Underrated, I’m Pretty Happy With It","Trigger warning: Asia","When my conservative relatives start speaking politics at Thanksgiving:","Call Me By Your Name (2017)","Oh My Gag Order","Shea Coulee owning yellow snatching my wig","When trade threatens to leave the session because you're just laying there and not moving","One eye on the crown","Drag race fans the day Alyssa's Netflix show gets released","When Chad was winning All Stars","When you realize we're getting another 2 seasons next year instead of 1","FIND THE NOTE","A scientific and correct shitpost","Call her MISS GLITCH.","*queen makes a tweet.* This sub:","\"This is Your Name, goodnight!\"","Is she gonna fall from there?","It’s Saturday bitches","Has anyone seen RuPaul?","How gay is u? I have a playlist of rpdr related songz","The fbi man is getting his LIFE","I'm sorry","GIA GUNN | #LaChinaMasLatina featuring Alaska Thunderfuck | Preview","So I randomly met Thorgy on the street recently..","Kameron Michaels Questions From Reddit + Bonus Hey Qween (transcript)","Remember when this show was PG?","Alaska's impression of Kameron","When someone tells you to say “b”","Me flirting with Monét","pontius pilate during the trial of jesus christ","FASHION PHOTO RUVIEW: 2018 MTV VMAs with Trinity &amp; Eureka!","Blair and Nikki Blonsky from the movie Hair Spray Prepare for Dragcon NYC 2018!","Me not wanting Shitpost Saturday to be over 😢","The Vixen will fight you (while delivering on-theme mermaid puns)","Spot the difference.","When someone asks me what my favorite ADHD medication is","Don't miss the 2nd Annual Sasha Velour Convention --- DragCon NYC 2018!!!","When you’re muslim and they ask if you want bacon with your eggs","New Ru-Cap for S10 Ep5!","When i go out in the sun with my friends and we only brought one umbrella","When you’re enjoying a nice Kit Kat bar and your friend takes a puzzled glance at the delicious treat, curious to what it could be. “What are you eating?” he asks you. You respond, “oh, it’s a Kit Kat!” and then he asks if they’re any good, to which you ask him...","I can't stop listening to CLAT and I have an urge to starting using a producer Michelle line","Air date?","When the grindr hookup gets too attached","LAST KNOWN IMAGE OF TAMMIE BROWN BEFORE GOING UNDERCOVER IN RUSSIA TO GATHER INTEL FOR ROBERT MUELLER","My friend when the tab’s on my sugar daddy","When you live in a convent and one of the novices asks you why the head nun doesn’t engage in games with everyone else","What kinda random ass stupid response is this? Chile....","Shangela vs. Trixie Mattel - Lipsynch for Your Life: “Freaky Money” (2018, colorized)","Tyra exposed","Milk on All Stars 3 Talent Show","When Farrah scouts a donkey with star-quality and is destined to be a Hollywood animal celebrity","Who knew Jeffrey Moran could be so relatable","This girl's wigs have been so amazing and diverse lately and most of you probably can't even rember her name😤","Eureka is quaking, shaking and pussy pounding into the ground","“Trixie Mattel. Your glow up was glow....uhmmm.......”","The Gays after this week’s events","Vixen everytime Raven enters a room","These spot the difference games are getting harder and harder.","Friday Night, 11:58 PM..... the calm before the storm...","Britney’s Peers","Henny and Trisha Paytas Twinning","When your straight crush's profile picture is him holding a fish by putting his fingers in its mouth","When there's so much hot Drag Race tea in your head that it would burn a mere mortal up, but you accept this power.","Milk, how do people think conversion therapy works?","When you travelled all the way to the future to watch your own funeral","Striking while the iron is hot","I found Ongina's car","When Aja got a lesson in fashion history","The straights found out","This extremely underated Kameron look needs more love","Move aside, Violet’s tartan runway","Every time Valentina is on that damn stage.","When I have $-165 in my bank account and try to withdraw $20.","Raven loves Tammie Brown","Roses are red, this show is gay","The butterfly after it escaped Kameron's heel","Saw Head Over Heels last night...","Having flashbacks to the AS3 finale be like","When they hit it juuuuuust right","Peppermint for Gaytimes Mag (courtesy of dragmorph)","[Discussion] Which countries's Netflixes have the most seasons?","When you’re done studying up on vectors and are fairly confident with them but come exam time you get your results back and you realise you forgot to draw out your vectors so all you can do now is cry","Thought this sub would appreciate this brand of cider","When you’re wondering what Melania is going to after Donald is impeached and she’s out of a job","Me since Amethyst Journey came out","Gagged that Vanjie being ‘first’ means she didn’t get a crown looking this good","Hi Asia! I just saw Asia, girl.","PSA by Jasmine Masters to eat your soup so you don't catch a cold","When you remember that you left your wig at home.","Kennedy will forever be my favorite from AS3","When you're a shy girl but they let the camera rolling.","How it feels coming on here every Shitpost Saturday.","Gabriel Zamora's apology video","Canwe start calling this thing the Ru-bellion?","I just (barely) saw derrick gurl","The four horsemen of the producer apocalypse","The moment you realise Trade isn’t at all clean","Did y’all know Chester See (Mz Cookie) is 35 years old?","She looks like Jinkx but her name is Alaska","This just happened❣️💍","Jinkx On Twitter Letting Us Know That Winners Stan Winners","An honest question from a Monet and Monique livestream","EXCLUSIVE look at Trixie’s alternate Red for Filth look — NEVER BEFORE SEEN","Ongina? the high house low!, 2011 by Elliott Hundley","I Can’t Believe That in RuPaul’s Drag Race the Lip Sync is Edited Down","Me entering Gay Heaven after i didn't crystallize and actually died","When you think he's put it all in but he's not even halfway there","Chateau Marmont, Slipping on My Red Dress, Putting on My Makeup, Glass Room, Perfume, Cognac, Lilac Fumes, Says It Feels Like Heaven to Him","“Who better than us two to represent SILICON Valley Pride” - Chad Michaels","For all those that say I owe my career to RuPaul and that I should be grateful for her, I have this to say... The only thing I owe RuPaul...","You get this look from across the bar. What do you do?","So hyped for Milky Kitty’s new direction 😤💦","RuDroid.exe has crashed. Please lubricate parts.","Do you know what Nicki and Raven have in common?","Tatianna Spilled the Tea","Heeeeeerrre’s VANJIE","Leaked audio of roxxxy when producer's asked her to leave the studio","Miracles do happen! Alyssa has changed her Twitter layout in honour of her new show.","Aquaria &amp; Kameron lipsync at Roscoe's Tavern (wait for it)","Monique Heart and her army of Brown Cows have come to Stun us all","Asia’s butterflies when she tried to get them to fly but they hadn’t been properly defrosted","Overanalyzing Thorgy's elimination on AS2, digressing, Thorgy style...","we stan sister asia","Sasha's broccoli","Aja didn’t go to school for f*cking history, gurl","When you ask your friend if her female dog is a point on an infinitely long number line that is part of the complex plane","When you don’t know what ice cream flavour you want to get so your friend just tells you to get chocolate but you had that last week","I’m so excited for Peppermint’s new movie!!","Tyra is a complete ________","Hello 911! Yes officer Blair stole my weave. SNATCHED!","My favorite moment from all the finale episodes. I love these moments where they show all the winners, and Violet look was the cherry on the cake.","Miss Vanjie ain’t playing with her Gay Times showcase.","Sasha's Rose Reveal Slowed to a Full Minute","The Roxxxy Andrews of All Stars 2","met adore yesterday at Manchester pride!","Fashion Photo Review with a Jew?","😍 omg I love Herstory of the World 😍 What was your favorite lerk?","My favourite queens who gave us black excellence, but were sent home at top 4","Bebe as Leo (My second piece of the Zodiac inspired winners serie)","When some dirty south comes on at the club and my friend asks why I’m not dancing..","I refuse to believe this scene from Aggretsuko wasn't directly inspired by our Nancy Drewing process.","Can we just appreciate the real Trade of Drag Race, Ross Mathews!","IT'S MILKIN' TIME","Which producer do I need to fuck to make this a lipsync song?","God is a woman and her name is Katya","Trying to cover up a conspiRUcy by disposing of evidence like...","Trinity doing the GayGods work","All Stars if only queens who are hated by a production participated","When someone asks what noise your namesake makes, but you get your corvids confused.","Let’s get all up in this gig!","Me waking up and realising we have 24 hours for some real Shitpostin’","Roxxxy when producers asked her to leave the workroom","RuPaul’s Sack Race (sorry if this has been done but I’ve been thinking about it for days)","Tammie is canvassing for all stars 5 now","NINA BONINA SQUIDWARD TENTACLES BROWN WENT AWF ON THIS ONE 😍😍😍❤️❤️❤️❤️❤️","When you say that the past is an inevitable progression towards ever greater liberty and enlightenment, culminating in modern forms of liberal democracy and constitutional monarchy:","My cousin was noticed for her efforts!!! Im so proud of her!!!","AS2 Top 4 Look Different","Yuhua’s ready for Enigma!","One of Bebe’s lipstick choices revealed by Aja. Credit to @Insidedrag on IG","Trixie Monet &amp; Monique have all the tea","It’s great to see Courtney earning those dollarydoos","A survivor crossover event? I could not believe it.","Australia has a new prime minister...again (badly explained by All Stars 3)","When Raja came across my string quartet playing in San Francisco! (A little throwback)","Trinity and Eureka on the newest episode of Fashion Photo Ruview!","April being drop dead gorgeous woman.","Let’s not forget when Tammie’s boob was RuVealed during the Destiny’s Child girl group challenge in S1.","Milk MUST be joking... has she seen her own edit on AS3? Smh","when daddy pharaohs dick as big as his treasury","Katya wishing us all a lovely weekend","Shitpost Saturday is now OPEN - August 25, 2018","Santino's Favorite Queens","Nothing You Say Matters Unless The Cameras Are Rolling, But It's A Steven Universe Dub","How much I gotta pay RuPaul to use this song for a future LSFYL...","When it’s Shitpost Saturday and no one’s interested in the same dusty-ass memes you are","Miss Vanjie is Radiating Opulence","Our current reigning looking breathtaking in beige","Airline looking like trade out of drag","I really think RuPaul can change and reconsider what he's done to Pearl. Do YOU know the solution? I do.","Asia has found Gay God aka Carly Rae Jepsen","I love the blatant product placement on this show -- remember how Under The Hood was brought to us by Kellogg's?","tfw your bf has hidden the tool box and won't tell you where it is and also you can't spell","Miss Neyde Miss Neyde Miss…………Neyde","I just HAD to post this picture of Trinity Taylor","Just watched Bianca's From Russia With Hate and couldn't help but thinking... Was Rex Ingrid Beuchamp in Witches of East End?","Pandora inspiring future queens during her S2 Audition Tape","My tattoo &amp; meeting with Katya","Official BTS photo of RuPaul and Michelle Visage filming Drag Race season 52","When Bianca gets cancelled and you have to find a new Queen's brand to ride on","Asia captions again and not a single comma has been found","How do you feel about All Stars finales being not as “big” as the main ones?","Did Trixie spoil AS3?","Asia O Hara reacts to... Queen Radio","Miss Vanjie getting her Love &amp; Hip Hop on the Cover of GayTimes","It was kinda flapping...","Throwback to Trixie vs Jasmine","Doctor Estranga steals the Reality Jem and warps RPDR.","Alaska spilling the ripest T on Season 2 and Tyra Sanchez","Alyssa Edward’s Miss USofA primo shoot in 2006.","Aquaria and Kameron LSFYL at Roscoes Tavern. They hit their jump split unplanned at the same time.","Hey hey hey is the camera rolling?","Youtube is a scary place","What was the worst season fashion wise?","🏁Reddit's Favorite Queen of All Time - 2018 - Part 33 - 8/24/18🏁","Throwback to the most gag-worthy entrance of all time","Raja has the longest neck I’ve ever seen on a human person","Hey y’all. I am looking to get a good sample size for a percentage based ranking","STUN! 💙💙 Alaska wig snatcher Thunderf*ck! Dress by Dallas Coulter!","Take a moment to appreciate our first three crowned queens.","Nina gets more promo coins by reviewing Patrick Starrr's Mac \"Destination\" makeup line","It's based asked before but your dream All Stars (4, 5 casts?)","Come play with us","A day late, but here's a lineart drawing in honour of Trixie Mattel's birthday!","Monique heart looking like the queen of the world she is.","Rupaul making my workout bearable... My cycling machine plays DragRace","Apparently we’re still posting Bianca/Blair memes so here’s mine","Mazel Tov - Sasha and Papa Velour at Sasha's Bar Mitzvah, 2000 (@ Johnny Velour's Twitter).","caption trixie vs the other queens’ reactions to the kitty girl challenge","Alaska &amp; Jeremy having a moment 24/08/18","John Duff - Girly (With Appearance of 3 Queens!)","Adore at Manchester Pride!","This needs to be a Lip Sync For Your Life/Legacy song ASAP!","We've officially taken over nightclubs (Sharon, Todrick &amp; Shangela, Shea... videos being projected at a bar in Budapest)","Meeting Ginger, Monet, Monique, Jinkx, and Trixie at the Comedy Queens tour!","hello? 911? yes i’d like to report miss blair for snatching me bald","Best Season 9 Lipsync Moments Slowed Down and set to \"Glamazon\"","Valentina Spilling the Tea About Beauty Gurus","Does somebody know when Jasmine originally said this?","When mother walks in on you","Drag Queen Video Dates","Alaska on the LGBTQ&amp;A podcast - transcribed for your pleasure and intellect","Tbt to Violet and Fame looking like absolute royalty","Blair St. Clair serving the fishiest C.U.N.T.","the funniest Jasmine Master collab","A wholesome Alyssa and Eureka story","Willam, Mariah, and Bianca in John Duff's new music video","Relaxing time killers👑","This interpretation of Ru’s comment on Pearl’s instagram killed me","The poster for Hurricane Bianca: From Russia with Hate looks like a horror movie about a creepy doll...","Ms. LAGANJA in Vegas!","All of Shangela's All Stars Confessionals","We got to meet Aja at the Capital Pride Pageant in Ottawa! She's so amazing and funny! I'm the super dopey looking one in the grey cat sweater.","Whose nutsack do I have to drain to get this as a lip sync song??","I miss having Monet and Kameron on my tv 😫","A birthday wish from one All Stars 3 winner to another","Bro'Laska - Aliens","Rupaul Drag Race: All Stars 47 🎉 Top 4!","I made a cross stitch for Aquaria.","I owe my life to all ages / 18+ shows (now 😛) I was lowkey nervous as fuck to meet Aquaria because I didn’t know how she is in person but she is so chill and personable. God bless our current reigning &lt;3","Alaska performing in Amsterdam","Boy Manila serving a look while impersonating Alyssa Edwards in the \"15 Fan Favorite Queens of All Time\" special (2014)","Miz Cracker explores Newfoundland in sensible shoes","The Australian Prime Minister was just removed from office by his own party. This is how the gay community reacts","KATYA and her past! This video is so cool!","One of my favorite drag race meme videos","Miss Yuhua looking like a member of Charlie’s Angels","Trixie and Katya engage in some wholesome birthday love. (Cue the screams of a thousand rabid Trixya stans)","Nothing You Say Matters Unless the Cameras are Rolling (Pearl Followup)","Derrick needs body guards for the full Britney illusion!","The Vixen being beautiful as always","When Delta repeats the same wig over and over 💀","[LOOKING FOR] Nina Bonina Brown Clown White Clip!","Max Malanaphy from 2015","Manila's inspiring and wholesome tweet.","Quick drawing I made of Cracker last year stayed in the sun for too long and turned partially grey","Was there ever a conclusion to the PEG/Adore/Detox drama?","Season 10’s top 4","Throwback to Pearl’s shoot with legendary Willy Vanderperre","Violet looked so hot in this video","Everyone look at Violet in Athens—she’s nakey","Trixie is livestreaming Dead by Daylight right now, raising money for Human Rights Campaign!","Alaska's out here triggering Miz Cracker","Amazon couldn't decipher \"Flaccida\" from Pharmarusical","MISS MONIQUE LOOKING STUNNING ON HER INSTASTORY WHY AREN'T YOU FOLLOWING","She's got the whole world screaming \"Halleloo!\"","Rewatching Phi Phi on Look At Huh and she talked about the Butterfly Queen miss Asia O'Hara","Pandora Ivy Boxx 👿","Fanart of the ladies in the 10s Across the Board tour (AKA the Totally Spies outfits)","Raja, your smile is beautiful!","Throwback to Dela looking like a WOMAN","Cucu and Mimi have a DVD. I cannot believe it","Carmen serving... my office job don’t pay me enough to deal with these ppl realnesss...","Bebe practicing Kitty Girl with no drag except her wig is a MOOD","I brought my Haus of Haunt book to an Alaska m&amp;g and this is the page she chose to sign (NSFW)","Me looking a nervous wreck next to our all starssssss 2 winner","Whats the biggest drag race mystery?","🏁Reddit's Favorite Queen of All Time - 2018 - Part 32 - 8/23/18🏁","Kim Chi wishes archenemy Trixie a happy birthday","Two Questions About the Pearl Situation, More Specifically Blacklisting","One of the most colorful Violet pictures","Sasha killing it as a literal drag tot","Detox’s #tbt is perfect! 🧡🧡 from four years ago for Pearl’s bday party! Coat from Lisa C and wig from Hollywood Custom Wigs","Jiggly shutting down a racist fan","HIEEE!!!","Trixie is doing a bday stream on twitch starting pretty much now","So are we ever going to find out who wrote the note to Mayhem after episode 4?","Adore and Raja announced for a Drag Queen Christmas","What’s your favorite time a queen “misunderstood the assignment”?","Derrick Barry comments on BDR’s post... unsuccessfully.","Met our current reigning last weekend 👑","Who would win?","Was mildly surprised to find out what a bop this is! In Derrick we stan!","Did I miss something? Did Ru join the tribe? Shalom and welcome, hunty!","When Newsweek mistakes Alyssa Edwards with Bianca Del Rio at the end","Tatianna, Jujubee, and fan.","Let’s not forget Akashia’s reaction to... Cher just announced that she’s retiring for real.","Already know who I’ll be stanning on Dancing Queen 💋","The nerdy gay Australian gaming intern is quaking. Happy birthday, Trixie Mattel.","What are the lipsync songs edits you like better than the song itself?","Happy 29th Birthday Trixie Mattel!!!","All tea no shade, do you think AS2 would’ve been better or worse had Adore not quit","20-gayteen is a good year for Tracey. Happy 29th Birthday!","Courtney being a relatable mimi queen","Drag Beyond Gender Panel at Dragworld feat. Jinkx and Violet","Throwback to this bonus footage with Lil' Poundcake's interests, favorite foods, and more","Jinkx’s Season 8 finale look needs some love","Jinkx's cover of We Can't Stop with Major Scales is shamefully underrated. The video quality is garbage, mama, but Jinkx just embodies what a DRAG QUEEN is.","The first official poster for Alyssa's Netflix Show (Coming October 5)","What's something from season 1 or 2 you are glad didn't catch on?","My opinion on most of Miz Cracker's Season 10 outfits","Why I’m salty about Aquaria.","TO FREEDOM! - When the new Nicki Meme meets Drag Race Fans","Gay For Play season 3?","The Cracker Lookbook is here!","Variety interview with Delta about RPDR hair","Jushmine Masters ain't your auntie","Miss Netflix clapping back in the comments for the trailer of Alyssa’s show","Kim Chi again snatching my wig and being a walking work of art! Dress by Sho Konishi and hair by Wig Takeout","When Netflix approached Alyssa","Trixie feeling her oats reacting to the sugar pill behind the scenes vid","Who made the straight intern at Twitter write the moment on Alyssa’s Netflix show?","Can someone please do a supercut of judging comments?","Trailer for Alyssa's new Netflix series, Dancing Queen - coming Oct. 5.","Manila being the relatable queen we knew she was","The first ever homophobic pic of Trinity Taylor","why is this trixie and katya doing UNHHH","All Stars 4 is officially a go-go! (Gasp!)","Jasmine’s Not Having It Today 😂","The OG Linda Evangelista moment (Raven talking about Tatianna during Rocker Chicks)","Alyssa Edwards themed party food","A great smile from Santino","Love this Alyssa Edwards lewk from the production of her new Netflix show","BTS Oh Honey Trixie MattelXSugarpill Shoot","All of Katya's All Stars Confessionals","Off-Season Open Discussion Post - August 23, 2018","Detox coming at you with her opinion on Off-Camera Gate.","When are Cheerleading tryouts happening?","American Horror Story: Drag Race","ALYSSA EDWARDS ON NETFLIX coming soon!!!","Interview with Michelle, BeBe, Jinx, Kalorie and Yuhua","Can we collectively GAG over boy Derrick, the underrated trade of the series?","Courtney serving looks AND facts on last night’s You Can’t Ask That (ABC Aus)","The stock photo queen strikes again","Carson, your bobbies! (ft. Fetus X Change serving country realness)","Farrah showing us versatility while still being drop dead gorgeous","I’m new around these parts and I don’t know all the references so sometimes I have to google. And I got this gem. I doubt the real Tyra Sanchez did this but either way it made me laugh.","Throwback to Bebe's gorgeous but divisive Studio 54 gown.","I believe this was one of the worst moments of Tatianna's life","This season 7 moment always makes me laugh","RuPaul wasn't/isn't mean; she's a professional and we're just thirsty for drama","I probably found a good recipe to win the lip sync, or at least to excite the crowud","Category is... queens dancing at the back of the stage during lip syncs","Eureka reacting to a comment about The Vixen &amp; racism in the fandom","If there was a rupaul’s drag race themed bar what menu items / drinks would they be serving??","Let’s not forget Queen Tammie for not even trying to lip sync in S1 against Akashia.","Aquaria recreating memes is my new favorite thing","The Vixen chimes in on Fans/Pearl v Ru","Trixie celebrating her accomplishments","Queen of the people and Queen of confusion Miss Monique Heart","🏁Reddit's Favorite Queen of All Time - 2018 - Part 31 - 8/22/18🏁","Aquaria giving me a little...Courtney Act?","SUGARPILL x TRIXIE MATTEL ❤ OH HONEY! BEHIND THE SCENES","The Evolution of Alyssa Edwards","Asia’s Caption Book? I think yes!","Manila pushes Trinity’s proposal straight to negativity","RuPaul’s Bias","Hey y'all be free, she is elephant queen, who are you going to be?","How it all started: The original pitch for Alyssa's Netflix Show (Coming October 5 Internationally)","I painted Mama Ru as Trixie and here’s what happened..","Found an old gif of michelle visage and rupaul!! Living for their mug!!","If Phi Phi and Kandy Ho in All Stars 2","How do i explain this to my straight friends","The 2nd Annual HEmmys - Official Voting!","Dame Charlie Hides confirming Drag Race UK is officially happening! /s","Has anyone digitally bought the whole series and from where ?","I Will NEVER Get Over Watching Bob’s Perform “It’s All Coming Back To Me Now”","Really Minor Pet Peeves: A Thread","Without saying what the category is, what are your top five?","All of Katya's Season 7 Confessionals","Blair’s look reminded me of this bitch from Pokemon","Second Trailer for Alyssa’s Show ft Shangela and Laganja","We asked 7 Drag Race queens about RuPaul’s “heartbreaking” comments towards Pearl","What do you think about a Mythology Runway?","The most beautiful beautiful I think of Katya","English subtitles for deaf /hard of hearing?","throwback to the time Asia randomly commented on my post and I didnt even follow her","Juju being a woman","Joslyn gives a shout out to some fan she met in 2014! Can the Nancy Drews help her find him??","\"Asia Caption This\": A Project For The People","Looking for Episode of Unhhhhh","Peppermint opening her 'DragWorld' box and her reaction to seeing Sasha","Alternative cast S1 (from the audition videos)","She’s back-back-back again!","I can't believe that Monet was recovering while Manila was dying. (But seriously, I love them both too much 🤣).","Miss Fame is too damn beautiful","Race Chaser with Alaska &amp; Willam S1E6 \"Absolut Drag Ball\" | \"talking the pros and cons of super villain Rebecca Glasscock, the mystery of Shannel's stolen pen, a brief history of Vogue-ing, a breakdown of 'realness' and sub-category 'executive realness,' and so soooo much more\"","Remember when people were coming for Katya for allegedly copying Willam?","Kameron just made me straight","Fanart of Trixie and Katya by bbrunomoraes","shower thought: they should air the queens' audition tapes during the preseason","When you get off of RPDR, but RPDR doesn't get off of you","I'm so happy Mimi found love that supports her unconditionally. She deserves it - we all do.","Kim Chi in pants. A true moment in time.","Kennedy spilling the T on Ru’s iciness in 2016 (41:06)","Queens who were not in their best condition when lip syncing?","Naomi M&amp;G help?","Tips for a first drag show?","I’m sorry it still creeps me out","Always nice to see a drag fan in the wild.... :)","Understated read of Raven from Ginger","Sims Dwag Wace Winners Season Episode 4: Call Me Mother Goose","Throwback to Thorgy and Bob skipping to the sunset in Rupaul's Best friend Race","My dear diary post about the past few months of meeting Cracker a bunch of times. All perfect!","PSA: Jushmine is BACK! 6 brand new YT vids for you gay asses","Sit back and soak in all the Tammie Brown thanks to GayTimes UK. Oh we are blessed this day...","All of Monét's Confessionals","Asian Doll at the VMA’s last night giving me Dida Ritz on Drag Race vibes","UK MERCH","Alaska’s long hair - yay or nay?","Late but, got to meet Dela this past weekend at DragWorld!","Aquaria Shares a Bebe Rexha Beef Update","I met Tatianna at Drag World!","The Vixen has something to say. Sure it's TOO VAGUE, but it's very obvious this is either about Ru or Bianca. Or maybe both. Or maybe neither. Anyway, lap up her words of wisdom bitches.","RPDR x Swish Swish Remix is FIERCE","#bendelathighst","Ok, which one of you was this?","Manila Luzon at Drag World UK 2018 | Marriott Meets Interview","thanks ru, i hate it","So there’s an app coming that helps you find drag...","sHaDe ChI sTrIkEs AgAiN!!1 This time @Boy George","Trannika, Dusty and Laila at PlayLouisville was amazing. ❤️","Jasmine Masters being the most relatable queen for the people’s","Alaska's stunning beauty","Jasmine Masters why do gays have to come out","Ru and her beautiful sisters","If only Ongina and Yuhua had waited five minutes to interrupt Bianca","Kim serving Park Avenue housewife doing some light shopping while taking out the trash realness","Werq The World NYC 9/5 Meetup?","Alaska Talks Alien Folk Music and Racism on Drag Race","Wholesome Alyssa Edwards and Asia O'hara content","Logo's My Name Is Alyssa Edwards","One of the first times in a while I’ve ever been proud enough of how a piece turned out that I signed it. Anywho, this is my fan-art of our Current Fucking [unintelligible], Aquaria!","Has Ru \"retired\" from Drag outside Drag Race?","Full Video of Opening Act by Bianca Del Rio at Montreal Pride","Courtney Act Hosting A New British Bisexual+ Dating Show 'The Bi Life' for E! UK.","Jade Jolie has taken her rainbow aesthetic to the next level","Throwback to this amazing photoshoot. Katya for Plastik magazine in 2016","TBT the Season 4 MTQ which aesthetic I actually really, really liked","Trixie ain’t holding back. OH AT ALL.","Aquaria is coming to Oslo, Norway to perform (for underage youth only)!","I got to draw RuPaul at work today! I love my job 💕","Venus D’Lite vs Bianca?","An old performance of Katya doing a Russian song! Something about the angle and quality makes the video feel unearthly","What would you say to Jinkx if you had the chance to meet her?","Asia and Darren Cross is a pairing I definitely did not expect but definitely like","An interesting thought","Most Underrated Makeup and Fashion?","Fame &amp; Violet at dragworld ughhh yes god","Eureka looking FIERCE in Aquaria’s Instagram story","Two of the most flawless mugs of all rpdr alumni. Miss Fame has has some sweet words about her and Violet","Who is this underwear model on season 5 episode 8?","If Kameron picked Aquaria instead of Asia at the finale, who would have won?","Is lip syncing to English a disadvantage to contestants whose native language isn't English?","The VMAs made it clear they weren’t going to credit Roxxxy for designing their preshow set","Look at these women on Aquaria’s ig story","Sharing this relatable meme from Cracker’s insta","Spotted Laganja in a choreo video for one of my favorite songs.","Tyra Sanchez has re-opened her shop for the next 40 days only!","Raja and Kim Chi 'perform' Endless Love at a karaoke bar in PTown (filmed on an actual potato)","RPDR: The Rankdown","I've finally lost Contact with reality, Katya!","What's the worst/cringiest read in the \"Reading is Fundamental\" challenge?","An interesting promo shot of Porkchop...","This was very much one of Cracker's top 3 looks from the show. The concept. The makeup here. All of it is right.","Bob spills the real T on Pearl’s camera comment messiness","Roem Service reads Rapal Dark Res comments. Stan this bitch.","When a queen is about to cry but the cameras aren't on yet","Great interview with Detox in Uk GayTimes","Tips on ordering Cameo messages from RPDR queens?","Do we hate all the winners yet?","MKD's wigline is a blessing","Bianca's response to fans on her tasteless joke in Montreal","My M&amp;G with the legend Chad Michaels in Australia","Alaska and Jeremy Provide Track-by-Track Commentary for Their New Album, ‘Amethyst Journey’","I wasn't sweaty, so I hope she enjoyed me as much as I enjoyed meeting her! (Details in comments)","I know we don’t talk about this season but","Asia, Kameron, Carson, Aquaria &amp; Eureka on the Emmys PPG Red Carpet","Sharon’s video keeps being taken down, but youtube allow this one bashing her? choices","Vivacious appreciation post cause I feel as she deserves more love.","With the VMAS tonight, let’s not forget this iconic AS2 moment two years ago","Monique on her relationship with Kameron from IG Live 19/08/18","Some top tier Trixie quotes","Katya's and Kennedy's \"Cha Cha Heels\" deserves more praise","KAMERON MICHAELS on Look at Huh!","Off-Season Open Discussion Post - August 21, 2018","What lashes does Trixie use? Or similar to the ones she use.","The simultaneously loved, but still highly underrated crew","Eureka on her lipsync with Aquaria &amp; who deserved to win S10","Does anyone have a full body shot of Naomi in this AMAZING look?","Detox coming at you with a custom coat by Vixt Greenville illustrated by Ninja Rojo 💚💜💚💜","Trixie and Katya, reunited. (She said my look was A LOT). DragworldUK.","The fact that Ru’s nephew is basically Jaidynn has me shooketh","🏁Reddit's Favorite Queen of All Time - 2018 - Part 30 - 8/20/18🏁","Trixie being a shady lady and I found it way too funny","Always good to see visual evidence that Manila would just fit right in with our winners circle - because damn she looks RIGHT.","Even a homophobic photo of Violet portrays a goddess","Thorgy is a great basketball player","Pearl Questions From Reddit Transcript","It's Monday, so here's an album with 40 glorious Trixie and Katya memes screencapped from UNHhhh for your delectation...","Bianca Del Rio Officially Responds to Controversy Over Jokes Made at Montréal Pride","Trailer to Atlanta's A's A Drag documentary project featuring Violet Chachki, Bitqch Puddin' and the legendary Mr. Charlie Brown!","Yuhua looking like a snack","Let’s not forget Nina reading HIT tv show as HIV during the S1 Oprah Challenge.","Jinkx Monsoon being real on Twitter","I watched Detox performance in Zürich and can any of you help me with the title of this song?","Why was Alyssa the only one to be asked to apologize to the star she bombed at impersonating at Snatch Game?","RPDR party games?","What is the episode of \"What's the Tee\" where they discuss Pearls' run on the show?","It’s Santino’s Birthday.. he managed to last the juice fast","I painted Alaska again. I have an addiction to her face, and I can't even be mad about it.","What would everyone think of an 'auditions' episode?","Out of curiosity is there a reason \"666\" keeps getting removed from Youtube?","Panel The Power Of Makeup with Farrah Moan, Violet Chachki, Miss Fame and Jujubee - DragWorld 2018","When will Sharon Needles appear in American Horror Story and other questions of the Universe.","Just once....","just casually seeing ms fan favorite on the streets of sf","Sharknado 6","did yall know shangela was in the x files? was pleasantly surprised watching yesterday! (except for the lowkey transphobia)","Bianca Del Rio launches series of Blair St. Clair rape jokes and the crowd goes… silent","Gia living her fresh tilapia fantasy","Last year Gia Gunn, and this year Miss Kimora Blac, can't wait gurls to come to japan! #AsianSisters","God is a Henny","I made Winner's Circle Mii Fighters ready for your Super Smash Bros / All Winners fantasy","I'm meeting Alaska 🐍 this week! Help me think of something funny/clever to say to her","Kim looking like a Goddess","Disabled queens","That one time RuPaul was on the Weakest Link. She gave the best answers like: Chaka Khan","I'm back, back, back again! Been working on more nail sets for NYC Drag Con, wanted to share this set for Katya.","KAMERON MICHAELS on Hey Qween! Beach House with Jonny McGovern","For Your Consideration: Raven &amp; Delta","Miss Vanjie giving me her cookies at Pride","Let's come up with characters to impersonate for queens who got eliminated for Snatch Game","Naomi being the relatable fish we can relate to","i made psychedelic 60's peter max-style painting of trixie!","Farrah Moan looking stun at dragworld today","Pearlentina","Sharing another nail set I made for Drag Con. This set is going to be a gift for Michelle Visage 👓"]