["Subreddit Of The Month [August 2018]: /r/youdontmattergiveup. Know of a small (under 20,000 subscribers) humor-based subreddit that deserves a month in the spotlight? Link it inside!","Did I ask you to stop, SLAVE!?","A visual representation of when only one person upvotes my post.","Comforting to see in my Doctor's office","Mexican workforce","EA Headquaters while inventing new ways to push microtransactions. Colorized","My Aunt told her dog there was a squirrel on the deck, but the dog couldn't find it.","Oldie but a goodie","Priority seat for pregnant ladies who give free wifi.","Just Normal Supper","That’s savage","Do i need to restart my bird? Is it broken?","This cameraman","me","Kentucky sure has some interesting cards","Every damn time indeed","I want that kind of bond. 😁","Poking a spider in the back","Future Me","In case of emergency!","Brest feeding in public","I *might* need them one day...","Welcome to the future","The face of betrayal","My girlfriend and I broke up yesterday. My friend sent me this today.","I wonder how many customers mispronounce the name of this shop","After years of this guy using my email as a spam account, I got my revenge. He signed my email. Up for SiriusXM which also gives me the ability to beep his horn.","[OC] Fun Fact of the Day: I’m Depressed","American harry potter","It's party time!","Nostalgia","Fucking Karen","Every Time","Bicyclist shoots fireworks like rockets at motorcycle that cut him off","Jasus","Lovely media","Only the real Karen","Yeehaw!","Norway finally got personalized licensed plates. Driving in Oslo today found this one for a driving school - complete with student driver :)","That first coffee mug of the morning","That person is living in 2082","Can it be?","Good job Urban Dictionary","Well, rip this dude","Smooth af","art school","Stupid fish","Good Boy Busted - Grafxart","Clifford the Big Red Douchebag","Why pay more for the same features?","Why Nigeria should be banned from making movies.","I think she’s dead","Calm down, Oreo","The floor is...","relatable","Or the whole last year of my previous marriage really.","Reddit Front Page","Captain insano shows no mercy","You better choose your words carefully..","Real estate description of the year.","Dog learning GoPro skills","Turns out the 99% of them were worth nothing.","I reinterpreted a drawing by my 6 yr old nephew","Am I too old to be supergluing quarters to the sidewalk?","So easy lol","it was a coin flip","Hurry up, open the door!","🐵🐒","A thrilling saga","Do not walk on ceiling.","Surfs up Bruh!","Are you jay?","When your struggling and a friend comes along to help","Stop that","Young Sneezy","The cops are having a hard time taking this guy down","The front page of Reddit","Parenting done right","You don’t say.......","Definitely the truth","A true piece of art","Oh the irony","My Venezuelan wife complying.","I usually say “Guess where are we eating today?”","Nothing to see here..","I think she still haven't got over that tea thing...","A surprise, to be sure, but a welcome one","Awektha","Creative baby photo recreate could have went better....","A game of cat and mouse","Raincoat Dancer","When you play a racing game with cosmetic damage only","Oh My...","Margot","Who needs a cat anyway?","Steve Miller","Stereotyping is bad, mostly because of the hand cramps.","People keep ringing my doorbell as soon as I put my baby to sleep","Let me dive through real quick","Shaky Shaky 😘😘😘","Shoutout to that time Hannibal Buress sent a random dude to the Spiderman press tour pretending to be him","#dead lol","A normal family photo","Toddler prison...","This needs to be a thing","Incredible technique","Sheriff’s Department Humor","If you shits, I fits","Waking up your cat with an airhorn","Cute","5-YR-OLD AND 8-YR-OLD BROTHERS EACH GET THEIR FIRST MINI GOLF HOLE-IN-ONES ON THE SAME HOLE! NO ONE WILL EVER BE THIS EXCITED AGAIN...","Show Me Your Scary Face","Evil mastermind and his deadly duck.","Top 10 Anime fights.","Oof","My mother-in-law’s Safari app...","Woops","Well that backfired...","New advancements in punishments.","This turtle dancing","That's an unlucky way to start your day.","I want to play too!","I M A G I N A T I O N","The Ole Dick Twist!","Some things just restore your faith in humanity..","Nice Beard Dude...","So I got a cat with a pause mode","A local restaurant’s “Walken” freezer","Don't be such a dick, Rick.","NASA struck by heavy budget cuts","\"Safety begins with you\"","Those who like Buzzfeed","Parenting goals","When you don’t have a brain:","This generation is just way too soft.","Petition to make this the official logo of r/funny","Rise to the fame","IKEA","Not sure if it’s a repost or not.","Attac","That's how it's done","Quit playing hard to get.","Peta would be knocking on this guys door for sure","Every time i cook from a box","Hey that is mine!!","If your party isn't this lit, is it even a party?","Hmmm","Love me 🐧","See how it F E E L S","Tease us with a screenshot of a skin","Kermit doesn’t give a damn","Hey Man","Hey ferb, Where's perry?","9mm for sale ...","Cuteness Overload","My very first meme. It's probably not a very good sign for the direction of my life.","Do I have a dirty mind?","BRÖTHER","I wonder what Taco Bell's most popular drink is...","*cartoony ripping sound effect*","I wish I had a sister so I could give her this shirt!","Be ready","Found this little beauty in the cupboard at work","How To Traumatize Your Child For Life","Who even is a ‘real’ adult?!","Oh wow","Selfie with your more attractive friend","How to pay bus fare in Russia","cat playing with fire :))))","Can I haz sum terki plz","Every time","What are you in the mood for?","These crazy Nuggets...","That’s what “salt” sees when you’re trying to pick some of it up 😂😂😂","Just practicing his moves","Oh noooo","TSA has sticky fingers","Walking in for a job interview and this is The first thing I see 😳.","Can't hold back the fabulous","That’s the right way to get amusement in an amusement park...","NyQuil","Cat in a box","Nailed it","Forgot about these old gems. Happy birthday MJ","enjoy every moment","10 minutes into propane and chill and he gives you this look...","Bar chart of how much door I've painted.","Pastor Greg’s got some explaining to do! Seen in Bedford, PA.","Say pumpkin spice 3 times in a mirror and white girl will come tell you her favourite things about fall","Animal Removal Specialists","As the summer nears it's end, the Pumpkin Spice Lord's have taken over everything.","Any, Any, Any","Sign in the toilets where I work","When the barber asks what you want and you pull out a peanut butter cup cause you hungry...","What a genius :)","Whatever I scored anyway","hotkeys it is your time :)","So True","When a friend pays for my food","Family picture.","Starbucks has already rolled out the Pumpkin Spice Latte, so it’s time to bring this one out of retirement for the season.","A sign in the 1 bathroom stall that our office building has for 20 plus dudes to use.","Always careful with judgement","Man - Can you do anything with this mole? —— Tattoo master - no problem ))","Well yes, in fact.","The sign on our front door","When people think they have gotten to know me","The perfect subreddit doesn’t exi—","It's about that time again","I also offered Outback afterward. ( ͡° ͜ʖ ͡°)","How to start a campfire.","Love at first sight.","This guy","Alexa play","Good guy ref","Yes, I know spotify.","Who design this stuff??","True story loool","Kill shot","Seems the right time for a repost","I'll buy a smart watch when they can do this.","Just news in my district","Spotted in San Antonio, TX. Dude even posed for it.","When the person ahead of you in line unexpectedly takes a step back.","My 7 yr old is going places.","Download 75% Complete","*cough cough* Fantastic Four","When ball truly is life.....","Well Played!","Relationships nowadays 😂😂😂","Incognito Mode","Would you go to such a cinema without your spouse","How to take a baby's temperature","Finally this feedback question popped up. I've been waiting a long time for this.","Just taking my pet llama for a walk.","Spotted on a very old car.","Leopard hooked to pot but not stoned...","« God’s plan » starts playing","Witch one would you choose?","One thing I hate about summer...","Sometimes the world gives you gifts","Cursed Image","All I was trying to get was a spoon!","This is how you launch rockets","My dad got a shipment of this at his rocket fizz shop in Colorado Springs....","What could go wrong?","Bit anti semetic from squidward :/","I remember my classmates in my law ethics subject.","choose your fighter","My family is addicted to Lindt and now I keep finding this creepy AF chocolatier everywhere","I feel like the fortune cookie factory may have lost its editor...","Very delicious drink! I love it!","Well then","Fact","What is the meaning behind the square dance?","Language.","As an alcoholic, hungry streaker, I think I found Valhalla.","If god exists he's got to have been on a really bad mood when creating these","Pair Joga","I love messing with scammers on craigslist.","The colours","“Weeeee“","Weight Watchers gone wrong","There is another way!!!","Don’t eat the seeds!","When angles are everything.","Dancing with devil","Seriously?","Long-term parking","So will I have an org-asm every time I get into bed??","Bet this is what bronies look like to everyone who hasn't seen MLP","When you find a funny meme/picture you haven't seen, but turns out to be a repost.","After this photo he was forever known as Nose Picker Andy.","Looks like I'm having a salad for lunch!","Read number 2","Google Photos auto generated collage of my dog. One of these photos does not belong...","My understanding of the dark web.","Wew","I wonder if he measured up...","I miss you so much","Naughty Vault boy","World's Shittiest Chef","The correct way to eat licorice allsorts","Let me see what is popular in Reddit","Didn’t see that one coming!","Income inequality is worse than we previously thought. According to top economists, \"We need a solution to fight this social injustice.\"","Womb Raider","Stop a sooning","Mercat!","I tried my hand at making some inspirational rocks.","Nitinder! 👑","it's okay","That’s no unicorn","Ø shits","It’s a lot to ask if that bandaid","perfect handjob for adults :D","teehee","Are they supposed to eat it while it's lit?","How u do it ? 😂😂","As I was flying into Denver I noticed it, and snapped this picture in about .4 seconds. Almost missed it.","Saving my computer from death makes me feel like Superman","Relieved to know it’s Syracuse","Sharing is caring - said no corgi, ever","Hairy dolphins for sale","Reviewing resumes as HR admin when suddenly...","Think you're having a bad day?","What a fitting price","When someone insults you and it rocked your core.","Seal meets a butterfly","VanTruckFormer!","They be getting busy","I was looking for WiFi in my town. One of them is not like the others","Ikea","Ummm.... ok","Happy happy happy happy biiiirthday","WAI you do dis to me","Wow, Google...","Bill is so friggin' great!","And Caught 😂","I thought we were friends Duolingo","I've arrived in Heaven today.","Me as a ghost","Hmm, that's weird.","Tinder BBQ","Iced Coffee","Was at work today and got to create a fake account to train to make orders and this is what I made","Gotta give her an “A” for effort lol","Sexism explained in a flyer","Even i can't bath this properly","Block.. Block.. Block.. 😂👍","Brennan’s Restaurant Closing in Berkeley because \"not enough people do cocaine anymore\".","So sad","Will Williams","Truly our saviour","How Australian maps are printed","Sorry, but your card has been declined.","When you're a city boy but always dreamt of riding into the sunset.","Business hours","My dad’s look of disappointment in me doesn’t even stop on his birthday.","Mis me with that","When you came to the park to enjoy your evening running, but your park place is taken.","Those feelings","The Unfortunate Trampoline Cat","IT IS SOUP TIME MY BROTHERS","Think, Think, Think","Suddenly...","When the patient scoffs as you tell them....","Me when I'm about to reach a goal","Ya know, he may be onto something...","My birthday’s in three days and I just got this in the mail. Apparently 26 is the new 65.","A comic I made 18 years ago when I was a frustrated underaged college student. Thought you all might enjoy.","How customers give feedback where I work","I thought this looked familiar","What the majority of our tax money is really spent on is shit like this","When Luna attacks our other cat Lilo, she turns into a Kung Fu Master","Shit is getting real","College in a nutshell","Caption it.","Your favourite hero warriors from the justicege leaguece","Post fallout","It’s real","Anyone remember paying $1.99 a month for beeper service? Smart Beep had some of the greatest commercials... [repost link, for those who have never seen it or wish to see it again]","Found this on a video I have to review for spanish.","It hurts to.","So brave","Maybe a little bigger truck?","You can trust me.. honest!","When your parent charges into the bathroom thinking you are masturbating but you just have explosive diarrhea","The coolest duo","How my friend tells a story","When a metal head becomes a sign holder","Cultural differences evident","This flew over my head when i was little.","Don't park near a bus station!","Unfortunate STEAM thumbnail (gaming)","Omg","Target marketing.","The internet never lets you forget. If you Google 1/7:","My cat Henry does this after he’s eaten his dinner","Lock the taskbar","How many times will good people shoot you?","IE plotting in the background","Let’s play CATch","We need these for spiders and snakes too","Moms got no chill","Outback Gambino","You know it happened exactly this way.","Put it back you .£#@^","🤔","Local tv station is the first to report that Canada has invaded and claimed Alaska!!","i dont know who are you talking about..","(W)anker","How Rick and Morty fans have high IQs","Cat hearing amateur singers","It would only happened in a dream","Hey man can you crack the window then?","Be kinder 🐶","This is nuts!!","I’ll just build my nest here.","MAMA MIA","This Amazon question and answer.","I relate strongly to my amplifier","If you have gas please do it before entering bus!","Alaska Problems...","He's talking to the sheep!","setting big goals!","When your mom walks in on you trying something new...","Khajiit has wares, if you have coin.","Ahhhhh, mystery finally solved!","I think my phone is about to break up with me.","Now my cat can be as basic as I am!","Bill Burr Tells Us What Happens When We Die","I am a big fan of tigers, but this one tops it all","I wish I had a better graphics card","Baby plz calm down","An apple a day...","Lol","I got mad trying to fix our security system and Siri heard me....","Me, whenever my siblings tease me.","This greeted me on the way to a network closet","Don't trust people","Could you have guessed that Weird Al made Key and Peele famous?","My favourite playlist for long car rides","Going to party","Dat camera shake in the end though..","Coming thru!!","Haha, 1967. 7-11 offers \"smiles and special pats\" to children. \"Mothers everywhere know we want\" their small children.","Hello reddit, see with amazement I paid about 80$ for these 🔥 pictures of my roommates and I. “Mustaches and turtlenecks”","I finally get why a peach emoji is used for female anatomy. [NSFW]","Couldn't they just take down the sale sign?","This absolute unit doesn’t skip bi’s and tri’s.","It is theorized Aleks is half man half pack mule","Had to explain this great Simpson’s joke this morning.","I thought this was common knowledge","Easy enough. Come on, California!","Have you ever experienced this? 😂","So....whats going withthe person that put those in there? Lol","Danny","Ironic? Yeah I really do think","Change my mind","Really unbelieveable!","Good meme material?","DOG","The nerve of some cats!","Lol Bathroom Graffiti","I was at Ollie’s today, this was the kids’ books","Irish pre drink... still the best video i’ve ever seen! 😂","Swedish Photography Agency","Stone cold killer","When your manager sends an email but doesn’t check the open tabs first","Most Ridiculous Fight Ever","Silly cat spooked by his shadow!","Fifty Cent","Funny","when all is out of prediction you just need to prepare it 😂","My son's kindergarten project. I am so proud. [OC]","Hey Google... Oh God!","KFC Says the first baby born on September 9,2018 named Harland will receive $11k...","Airbnb doing it subtly","This guide on my bottle of orange juice.","I saw your Mexican workforce, I present you a Indian workforce","Right... so, that's called \"the price.\"","Lol.. what coincidence","My 4 year olds attempt at drawing a person. He accidentally drew dickbutt.","Throwback to 10th grade when I jumped off my friends balcony and fell into the abyss","This dog looking longingly at his package.","I think I know why he’s so happy...","The Only Way","Why pay more for the same?","He thinks my t-shirt is another pug 😂","Neat coat rack","This cat has some moves!","What’s in a name?","I found a sign language book today","Evil coupons?","Genius! I would've never thought","PB","Guys quits his job with help of marching band","Even the stall door has an opinion of me","Co-op destiny best moments!","Where dat lil' kitty go?","Hulk got big package there.","Ninja Spy Cat","What is Koala thinking about?","Taking a lil dump","*Slurp*","Its a scary moment when r/funny becomes self aware!","I just saw Post Malone!","Was watching Yugioh Abridged when my phone made a noise.","White Bane","State of Mixed Martial Arts","It’s fake news!!!","Airport security ... Cat nap","We don't do that here","Bad Boi","Um...","Istanbul, Turkey, cats","Smooth","The current global phone number for GoDaddy is someones personal phone.","Grr-ific","Nintendo, then and now","this guy was in front of my uber in heavy traffic","Oh Lord! Who pulled it off the best?","Found my brother committing a terrible crime...","This taxi's license plate I saw in Virginia yesterday","Um......","Can you do this?","Girl wacha thinkin 😌","When you come home smelling like cats","Old reddit is best reddit","The good shit","Perfection!!","They tend too do that","Cloud girl","A story in three pictures","Seems a bit forward to me","Ironic?","Hate when this happens","When you kiss your Duck goodnight and he kisses You back...","actually it's not the wrong","You can't f with her. If you what im saying","Everything is under control","The Pizza Life Chose Me: Baby Georgina trying pizza for the first time is all of us. 🍕🍕🍕","New way to escape my family.","Brutal","My old high school Klamath Union High School decided to repaint the floor in the gym. There’s two M’s in Klamamth right?","A new employee bulletin board went up at work...","I just wanted to make a cup of tea and eat a peach","An unfortunate picture I found of myself and my local church's priest","And the world record for worlds longest uninterrupted study session goes to...","Moved to Florida. My dogs first time at the beach. Notice the drag marks.","When neighbors fight over yards","Like Father like Son?","Who did it better?","Seen this picture and it makes me laugh every single time.","Be happy","📌Granny on the Marijuana Style","Little Cutie Pie Enjoy in the Rain","In a house? Are you sure this is a good college?","I really need to subscribe to Bloomberg, RIGHT NOW!","Cats on the internet...","My daughter's response to math homework \"Dear Math,....\"","FOR THE MOTHERLAND","When you're a star for Mom:)","To sum it up.","fb friend’s baby is over this BS","Toilets in a bar in Amsterdam","Best earbud in #world","Roblox","Boss told me to 'improvise' when my laptop was temporarily being repaired","Dads toilet seat cracked and it \"bit\" him in the butt. He put this warning up for others.","\"Street nuisances\" excerpt from the autobiography of Charles Babbage, an English engineer from the 1800s.","Why you shouldn't use k as a variable","Dinner is Coming...","Walk up in the office like \"Whatap I got a pig smock\"","Castle Crashers is fun together! I insist!","Redditation?","The Casino Royale torture scene combined with footage from Idiocracy.","Just a regular Bronco","Math","We all love arts and crafts","Can you do the Dele Alli Challenge?","My cat this morning... :D","Remove Buzzfood from exsitence","My Dog Likes To Somersault At Speed","Speeddedumeter right?","Battle Royale rn","This guy would be a legend on twitter","i cannot 😂🤣","Bork Wars","That was fast...","Was this the follow up to Jolene?","Do you know how you say \"thot\" in French?","Mod is asleep, hurry and pass me the damn food","i've always wondered","Click &amp; Hold? Don’t mind if I do!","Nice try","This guys tattoo..","Took this picture by accident anyone else see the face on the tomato?","Social media then...","🅱️oneless leg for sale","Mom wasn't the best cook.","God forbid these women had to pay for food ONE time!","And Chocolate Paves The Way","Fellow Kids","An Interesting title","how to pay for bus in Russian way","Creepy Clothes Ad","This pregnant not fat woman..","Found this in my friends toilet","Whaaaaaaaaat???","The art of nutting","Hilarious HONEST salesman from NJ! Tells you how it is!","Who's to decide","Prom Night book in advance","Cat disagrees...","Lol dying","Looks like my cat had a rough day","When mums realise the potentials in soccer!!","I don’t know what this chair is going through, but i’m pretty sure i’ve been through it. It gets better.","A bathroom tile","Saw this on the road a while back. Too good not to post.","4 year old artwork titled \" Deleted Scene\"","Someone at Hallmark has a dark sense of humor","If I can only reach it... need a stool!","On a dark desert highway...","Whoa... What?","The current state of searching for party ideas on the web","Brick Oven Pizza","He really enjoys it","Pro photos sessions for sale","Protecting the weak","Ominous YouTube Comment, found on the, \"Troop Movement,\" video - a Track from the Spongebob Soundtrack.","Ridiculous commercial for 80's clothing brand \"D.J. Smash\" (1984)","Enjoying beer, figured out we were not alone this whole evening. Good boi chillin","Drunk world citizen","So our nose is an ass and it has two holes.","Homemade*","My wife and I always tell our teens, “Don’t do that. But if you do... film it!”","Every semester","When you get your fly swatter and you see a fly","This stuck up woman just played herself","MadTV - Tommy Salami!","gym flyer somewhere in korea.","Looking for a new job. Tired of being micro managed at work","The golden age of SNL","I was laughing tears","When you do something you automatically regret","when you are sad but want to sing 🔉","At the secondhand store in Salt Lake City","Millions Haj to Mecca annually to see the famous penis shaped highway","How to buy a bus ticket in Russia","Cause &amp; Effect","As someone named Randy, I am not sure I can live up to this level of personal accomplishment.","Helping paw","Back when Pokémon Go! was a thing (at least you could catch something other than Ratattas)","IRL Mario Kart :)","Keanu playing rock-paper-scissors with his kung fu trainer on the set of The Matrix.","You’re welcome :)","Can't believe Pawnee is not a real town...","6th grade boys would be like","Please use finger","Playing fetch goes wrong","Putting it out there. At least it’s only carry on size. Could be worse","Which song did this to you? My most recent was a Post Malone song and i don't even listen to him.","In Soviet Russia battlefield 5 plays you","No broplem sun 🤪","Raising a puppy is hard work","Quentin Tarantino’s Star Trek","Finally got my new MacBook!!!!","This church's sign","Do you mind if I.... hahshfcejskd","Every damn time","This heifer knows how to party!","Not sure if this is funny, or creepy. I'm torn. 🤔","Wine chair for pappy!","Ahhh they got me","This is why we can't have nice things","Who are you???","Divers take selfies with Jasan at the lake","eBaum's World nostalgia","The Key to a Good Life - Super Troopers 2","Either he misspelled his name or is really proud of his 5 inches","When you nut and she keeps sucking","Impatience","Signed by the cable man.","A hole’s a hole...","Not even kidding, you gotta go Google it","Irony","Damn son.","Truck for sale - needs parts","You're a Weasel, Harry!","Found this in my attic when I moved in","Ad for accordian lessons on my neighborhood board","Required activity for my online class. I thought I was being funny with the banana...","Ahhhh.... Well yeah...I guess so","A final gift from the internet.","The billionaire playboy we need. Choose Crews 2020!","Coffee guide","🔥🔥🔥","So I get this alert the other day as I’m driving home. Have no idea why I put it there or what, but kind of a trippy thang when you driving and the phone says get out of the car lol","Meanwhile in Wisconsin","What's your useless thing you would buy if you would be rich? Here's mine","How ironic","Baby laughs at his spaghetti!!! :)","It's so bad that its funny","Sorry if it’s blurry I was laughing when I took the picture","Rip Cat.","The Gimp","Love Bird with Heart","Perfect merch doesn't exi-","Max Selby - The Lactose Blues","Hot chicks","We were asked to trace the worm in biology class","Not sure I trust these grapes","Ship?","Not today broke child.","It took me a few tries","Does anyone else miss the old days when you had dance contests at McDonald's?","Oh boy im hyped for the new fortnite skin!!!!","Interviewer: any special skills you can bring to the table? Me:","You're welcome Stan.","I don’t even know","When the “white” company produces heavy duty vehicles.","Down to the Bone","And for the grand champion scooter leaping contest.... the winner is.....","Jet fuel can't melt tinfoil hats. (Found at work)","Don't be an Loser. Not my sign, I saw it on my way to work","That escalated pretty quickly","Make it go away","Nailed it!","You decide.","For some life is all about the destination, not the journey","Spaghetti for dinner tonight and I could only think of one thing...","Thank You for You’re Service","It is Wednesday my dudes","This Trojan condom ad...","The Detroit Metro Times has a new New Banner!","Toilet SIgns","Growing up with brothers","Having been on the internet for a while, I just cannot look at this logo and not think of something very disturbing","Nomination for best clickbait ad ever?","How to summon demon piss","So close yet so far - my wife and I on one of our first dates","I present you Sergej Gleithmann","Saw this on a building on my walk today","Like a curry expert? (I think it’s supposed to say “courier”)","What's kraken","Perfect gift doesn't exis-","Saw arguments about browsers, this was needed.","So my son drew this during his kindergarten class today...","What everyone says when a famous musician dies","“Kiki lock them doors and turn the lights down low”","My flight from Vegas. Why, just why?","The wave [OC]","When your boss ask for proof you're in hospital!!","Those damn Snapchat filters.","Attempted murder","Whe she suddenly say selfie.","Burning Man FTW...","Just a trim please","McDonald’s u had one job!","New phone make an offer","Give me Gold, I’ll give you sauce","My Step Daughter reminding herself to bring her book home from school. 😀","#1","They grow up so fast.","Benadryl Cough Syrup is my favourite actor.","I got an ad for a phone game that said ninja was the dad playing","The one outside is me","so true","Popcorn anyone?","Crab trying to grab a stick","Mitch McTurtle","Mrs Marx","One of the funniest Super Bowl commercials ever created","Hey I had it first!","Today on music class...","Ah yes the two genders women and apples","Pushing my friend past the limit of mental stability via UFC 3","Mom: Don't wipe your hands on your pants! Me: I didn't! Mom: What's that then?","What is the darkest and most disturbing joke you know?","I almost crashed today because I couldn’t see this guy...","Faulty Chipreader","When you self identify as meat but the state of Missouri won't let you call yourself by that name","I also tried to make sushi","First there was ManMan, with the strength of two men, but no one could imagine the almighty deity of God God...","lol","New post Some things just come more naturally to other people","Healthy Eating","Just got some new wireless headphones and trying to understand how to start them up. It seems pretty clear.",":/","Boys feeding laxatives to seagulls","Money kept getting stolen from a box, so the owner sets up a mouse trap in the box and records the results...","They Want My Soul","Come swing with me","They really suck at english and probably at other things too","Why, Kelly?","This singing fish cracks me up","This will teach them","My online chat with Verizon about their \"High Speed Internet Enhanced\" (1.1 - 3 Mbps)","At least she gave it her best...","This GMO bullshit has gotten out of hand.","I'm just trying to enjoy my muffin..","This Loo roll dispenser seems to be saying - \"twist someone's eye out and make them eat it\"","\"Wisdom\"","Damn rite !","When you’re away at work and your misso sends you nudes.","This looks like the most fun cleaner ever, maybe also the most delicious?","Girl gets new cat, cat shits on girl","Wasp on the Train (Original Song by Jack Dearnley)","Back to the Future 4.... oh well","This picture of Trey Parker and Matt Stone in the early days of South Park.","Trick needed. But it's good for you little fella.","When a father figure comes back in your life","Sticker stuck on wrong way on back of car window lol","There's a reason for every sign... Seen in Heidelberg","The Weinstein family ranch 1985","Handy to do list","Illegal telekinetic MMA moves","(OC) Watch The Baby — Chris &amp; Christina","First day photos!","'Murica, where Pizza Hut goes to McDonalds","Iguana give you a kiss","Back to school sign in Michigan","Laugh Track","I'm not sure what you're asking of me.","In the bathroom at my work","Someone was a little overzealous with the labelmaker.","Precious Cargo","One of the most relatable pictures I've seen","Chinese + google translate","Having a religion is like having a penis","who put the Vape in his exhaust? 🤔","Karma Is Quite A (You Know What) Isn't It","So true","Since when did Ben Ten start giving testicle massages","My boyfriend listening to me complain.","Kitty Love","He’s not that lost","A master hunter in action","Everyone Went Through This at LEAST Once.","What is this? A trash can for ants?","Grumpy moonmoon","Somebody forgot their toaster","Mom's will be mom's","But... if he's the airbag... Then who has the wheel?!","HELL","The truth is out","Only some people will notice","“I don’t like salad fingers”","The town I'm in currently, Intercourse sells \"I love Intercourse\" shirts","Yo Rick, what the wocka?!?","I finally.....","Today in Chemistry class..","Has anyone seen him?","CTA. Cat Theft Auto.","Bees looking cool in top hats while keeping their hive cool","This guy from India is smooth af !","TRUTH!","Made my day","Weiner at the CNE","Bad timing, fellas.","If Dad Jokes were as funny as dads think they are.","Noooooo!","Thiccos","Date. Click. Repeat. - Short Sci-fi/Comedy Film","Somebody","My new favorite porn category","Theresa May dancing is like watching a car accident happen over and over again","*Not a big problem*","The shape of the dent on my beer can ..."]