["A guy was surfing in a drainage canal after the hurricane in Hawaii","This guy’s arms","Saw this on the way home yesterday","I'm guessing someone really got yelled at for this.","Just a scratch","fa(face)ce","Bread Crumb Pantry Moth Infestation","[NSFW] Interesting Treadmill Exercise o.0","My bad i sneezed","How to buy a bus ticket in Russia","This is My Network Rack Now","Florida Man does it again! A butt naked cyclist at rush hour in I-95.","This construction site in Montreal got shut down for safety concerns","The only thing worse than having 10 cats.","Diving at the bottom of lake Mead","Cause my boy is hard AF!","Arm Wrestling League Champion Jeff “Popeye” Dabe.","3D printed death blade adapter for a weed eater. X-post from /r/functionalprint","“Works Fine”","Why sit on someone‘s lap when you can be transported like a bike","I came out of the subway and this was at the entrance. They were completely hooded, held creepy girls photos and stared at me while passing through.","Appropriately named \"Spider wasps\" taking its meal to his lair.","WTF?!","First hawks in hoods and now this","Toronto councillor says new sex doll brothel breaks city bylaws","Red Rover, Red Rover, Bring The Lube On Over","This fucking ripped mushroom from my front yard","Barber that only cuts hair with an Angle Grinder","Mystery woman in what could be handcuffs rings doorbells, disappears","Having a wedding at the church or the beach is too fucking boring. Why not doing it on a net hanging in the middle of a desert canyon 400 feet deep!?","This giant wasps nest","Unexploded mine spotted floating near Seattle","Interspecy orgy?","(OC) A hooded figure made from bones covered in schizophrenic writing in the middle of nowhere.","School bus towing a box truck with a pickup truck in the back.","Water main breaks in San Antonio","Airport Roof in China","Middle of the day on a main road, in a bus stop. WTF?","“He sees you when you're sleeping He knows when you're awake He knows if you've been bad or good So be good for goodness sake”","Not entirely sure what 'look' the designer was going for here...","Thunder","Hold your breath bro !","SWAT team member hits his head on building","Beautiful Spider Webs Cover The Island","Not Landing the jump successfully","Friend found out why a breaker kept tripping. Bbq bat anyone?","Procter &amp;amp; Gamble bids to trademark LOL, WTF and other acronyms | Business","Way with water","Caught on Camera","There was a friggin gecko hiding in my son's toy spider's ass!","Heh...","Found this at a local Goodwill...","That's one lucky cyclist.","Unforgettable birthday","Stay blessed","Car hit a fire hydrant","Your Urinal Has None Because of Our Cleaners","Found at the antique market this weekend. Elephant trunk with a human face carved into the snout","Biker loses mirror","Too much? Nah fam","Driving past a wildfire","Genu Recurvatum","Some people shouldn't be driving","What the hell?","[NSFW] This woman's breasts... My god.","I think they're dry now","Down to earth","What's the problem here?","Slap slap slap, Russian Bears championship","This neon light sculpture in Berlin","Hungry?","They should have thought about this Kinder egg toy a little longer...","My sisters psycho cat dreaming.","Cleaning lady not at all fazed by the tiger drinking from the sink.","Thousands of ants came in just to die.","No. Just no. Those are not meant to hold food going into the body.","Man who can turn his head 180 degrees.","Ahh, the Bronx","ET never made it home.","American Pastoral in Centralia Wa McDonalds","Oh deer...","Just a skin suit. Nothing to see here...","Double ended snapping turtle","How *not* to fire a gun. A couple of complete idiots here.","Man Appears to Break Ankle at Music Festival, Just Casually Walks Away.","Outline of your insides?","Let me see what is behind that door...","The fact that they need this sign","\"See you in your nightmares\"","When you get nervous about Netflix and chill","This road in Mexico","Alabama man guilty of shooting son in row over 'really good chicken'. The pair became embroiled in a heated argument as the family watched an NFL game on TV and the father is now set to be jailed.","My neighbor has been using a shop vac on his yard every morning.","Anyone knows this sport ?","A real slice of a man","There is a spider chilling in my toilet, in the water!","Lets Start A Fire","Bit of a fly problem in the bathroom","WHY WOULD YOU DO THIS!?","Buddy drives into the 711 doors, tells everyone to leave, spreads gas every where and then lights it on fire.. Rumour has it he was dared to do it.","Humanoid unicorn","Super-snake: hybrid pythons could pose new threat to Florida Everglades","Mushrooms after a rainstorm","Woman with man-shaped pillows","This just doesn't seem safe... [NSFW]","Can someone please tell me WTF is going on here?","He hits rock bottom.","A monk meditating","Dude was just kept driving into the divider (x-post /r/IdiotsDrivingThings)","This playground in Omsk, Russia.","Weird Drawing I Found Helping a Friend Remodel a Barbershop","Need prostate treatment ? Now with a free tape measure...","Hong Kong doctor accused of killing his family with gas-filled yoga ball","Man suffering from a \"megacolon\"","Includes 2 fishing rods, and 12 shits.","Say hello to Joba!","Aftermath of an accident where a bus flew down a bridge into the railroad tracks today in Kuopio, Finland.","2015 sperm collection","Man goes flying out the back of an ambulance after crash.","Ouch","Kid tries a hover board out","This guy almost falls after a hot air balloon crash.","BMW 530i with factory corvette performance package.","Parked at work. Saw this in the car in front of mine.","I found a mummified frog in a hole while cleaning my minivan","Just pop on down to ol' Tom's","Tires are optional I guess","How NOT to ride a motorcycle","Security guard admits to having sex with corpse at hospital","Doesn't everyone have two elbows ?","Someone I used to go to high school with likes to brand himself... said he wants to do another one soon.","Hmmmm, WTF???","Volkswagen accused of ruining Mexican crops with weather-altering 'hail cannons'","Suspected drug tunnel found in old KFC kitchen","Dashcam footage of accident in Toronto","Dutch version of Need for Sp/weed... this dude drove in public on the Dutch streets..","Guy passes out from tickling","Not sure what’s going on here","Makes you rethink life","How is this possible?","In Hon Dau Resort (Hai Phong, Vietnam) (cr: Dai Nguyen)","Steel holding up a building","The Crocodile Hunter was *not* a 'do it yourself' tv show.","In the wrong place, at the wrong time. A victim of circumstances.","How William Baker actually got his super powers","Must be a terminator.","I don’t know who won","Don't hit a pothole","As someone who works at a Veterinary clinic I thought you guys with pets may be interested to see what ear mites look like under a microscope. This was from a swab sample a cat that came in with dirty ears.","Well, it does say Adult.","Go on, walk across it I dare you...","Coming through","I have no words..","Took a shower before work today, looked down to grab a bottle of shampoo and see this!","Scooby Snacks","The methiest video ive ever seen","18 wheeler shoving Mercedes almost a mile.","The cigarette packs in Laos are definitely something else.","Friend sent us a video of his wake up call today.","Fire safety is overrated.. apparently.","I also had an uninvited guest in my shower today.","Gotcha!","Follow up mosquito bites. This is the foot of the person who's thigh I posted a couple of days ago...","When you're just minding your own business and this happens right in front of you...","Utah Drivers...","One of my neighbors decided this would be a perfectly normal way to install their AC unit.","Condom cookbook","Something you don't see everyday","Old school baby car seats.","Spotted this in SoCal. I didn't know where to post this, but def a WTF moment","Always gotta be prepared.","How the hell does this even happen?","This must be some really good cat food.","3 year old nephew. ....... he lived ....","I got the kiss of frog while pooing in my new house.","Jesus christ forgive my sins challenge..","Nice Tire...","Big Bird Catapult? Help me with this one!","Just rolling along...","So I caught a man using a broken Pepsi can to cut him self open, out the back of my work. (Context in comments)","Like biting into a Hot Pocket right out of the microwave","Just horsing around...","A man took out and started polishing a sacrificial dagger in Starbucks.","Went in the attic of a house we were looking at aannd....","Seen driving to work","From afar I thought this lady was holding a baby....","Mosquito bite!","The middle one is an owl with no feathers","Frog had its eyes grow back into its skull as a result of macro mutation.","Seen abandoned at a local gas station","I hope the bridge is as strong as their will to cross it","Guy throws up off gondola lift at Six Flags.","Bumper sticker: \"Looking for a Cougar or a Kitten\"","Robert Wickens' horrible crash at Pocono","This thing I found hanging from a tree by a creek.","​Flesh-Eating Sea Bugs Eat Teen’s Legs, Leaving Him Very Bloodied","No second trips","family photo!","Man makes a Sally Acorn sex doll from a human skeleton.","Car removal","Yoga instructional video","Chicken on a road","This is not my cat, but she is giving birth on my couch.","Man's finger bitten off in altercation at Massachusetts golf course","A fishing vessel braves the Grey River bar in full flood","Just WHY?","This cats muscles","Found this ring in an estate jewelry lot. Cursed?","This happened","Male zebra trying to hurt baby zebra","I’ll just park it right here.","Happy Birthday!","Who wants some delicious banana water?","This flat-chested dancing dude","Only in Florida..","So I found some teeth on my garden...","River/Nature dumped the waste back to City. (Bridge seems to have done a very good job in filtering the river) A scene in Kerala after flood.","WHEN ITS TOO DAMN HOT","Swimming","Trees near the town of Nowe Czarnowo, Poland.","A statue in Pilsen, Czech Republic.","My son got this in a western toy bag.","When you whip too hard","Felt a bite from a grasshopper butt; Is this normal?!","Valleyview, Alberta. Taken at 1pm. The smoke is so thick.","Florida.... Again.... WTF","In floods and in drought, till death do us part.","You do what with cats?...","This was taken at 09:04 on August 17, 2018 in Prince George, BC. The smoke from the wildfires is so thick, it's blocking out the sun.","Cat lives: 8 out of 9","One last mow with ole faithful","My wife gave birth a few days ago, I just found this in her parents room...","Things that happen in Toronto","Things aren't looking good here in Portugal","\"Just need to check the map\"","Some creative construction right here!","Saw these two characters at Cedar Point","I visited the pathology museum of a London hospital","This wasp nest found in an attic.","Happened today in Maryland just off Annapolis. WTF","Fourth-generation Kentucky snake-handling pastor bitten by snake 4 years after father killed by rattlesnake","Suv drove into a dim sim shop in Vancouver","A vendor in NYC discovered a swarm of bees in one of his crates, says fuck it, and continued beesness for the day.","My fiance's daughter.","The freshest milk.","Heavy flood in South India. Flood water is flowing like a river though a local market road.","Mechanic friend sent me this.","Lady in my area does this to crush her cans...","Just a normal day at the lake","This bird mimicking a little girl, screaming at my friend and I in Vietnam (apologies for filming vertically)","House gets relocated (Kerala flood)","Must be a delicious sandwic.... Ohh WTF!!!","I was looking for Creative Commons videos to use in my band's music video when all of sudden I found the most WTF attempt at a Kids TV show pilot","Power Grid meets Tree","Chemical spill in Georgia.","This guy is onto something, the moon perhaps?","If this is recovery, I'd be terrified to see what they were like before.","I woulda ran away.","Some days, the snake gets you.","Well thats one way to do it...","August 🅱️APE","Gas station after a storm.","This man has apparently seen some shit.","Hairdresser shop window. No, they don't do bikini waxing.","Idiots in forklifts","Bus driver goes GTA mode after hitting someone in Malaysia","This tail-less aligator has a bubble butt instead.","Just hauling some pig carcasses with the tailgate down...","Why, just why ???","The coffee stir spoon at my work.","That's a hobby...I guess?","Spitting Flames","Helicopter shines the light on a Naked man for everyone to see. [NSFW]","Found in the ashtray of my recently purchased car, one human tooth. Please, someone, help me pay for therapy.","Grandfathers cane.....Bull Penis...told to post it over here.","DIY gone wrong","Public Health Alert issued after 76 people overdose in New Haven at one event.","The sight from our bathroom window into our neighbors yard.","Can I help you?!","Ouch!","Florida Woman","Just a guy talking his goat on a bike ride","How to refill your lighter","I think I messed up my knee...","Helicopter footage of the aftermath bridge collapse in Genoa Italy.","I split up with my boyfriend yesterday. I fell asleep while he was packing and he stole my toilet.","Nothing better than a good jump in the swimming pool after a stressful working day 🤕","This can't be safe","How to treat a rabid dog bite according to this medical book from 1896","My friend found a tree wedged full of coins in a forest.","Japanese snack, shrimp senbei (cracker)","Cutting into an octopus egg.","He bearly qualifies for the carpool lane.","Snake after the CA holy fire.","Photographed in 1880, Myrtle Corbin was born a dipygus having two separately functioning pelvises and four legs.","Washed a load of clothes, found a dead lizard after the cycle was done.","Why do you Aussies need to be warned about not drinking toilet water?","Sharks","Feather waving ceremony","Beyblade Let it...","A bridge falls down after a thunder. Genova, italy.","Idk if this is ghetto or scary as hell","Found a cheese flavored woodchip in a bag of munchies.","An owl with no feathers","Wow... What a shocker","Learning to fly 💸✈️🚙","Taxidermy gone wrong","Must be a new trend.","Brand ironing his chest","This is why you don't drink and climb trees","This ummm pig statue I found driving in Taiwan","Somebody used this flea comb at the store to remove their dandruff and put it back on the shelf","\"I really like this milk.\"","Body found in pillar","Dodged an oncoming truck with elegance","Just a woman walking a horse with a doll around an industrial estate in Scotland","This was a kids show in finland.","Currently selling for $850 a pair at Sak's and Neiman-Marcus. Balenciaga shoes are the height of fashion?","Bear walks into CT liquor store and is nonchalantly followed by an elderly customer","Boa Constrictor Found Under Car's Hood in Massachusetts","A cavity search of Smith at the county jail also revealed stolen property related to a separate Palm Desert theft..."]