["Moronic Monday (Aug 27 2018) - Your weekly questions thread!","Android Messages for Web gets its own Material UI overhaul too, with dark theme in tow","Google is revamping the Wear OS smartwatch user interface","Google Measure updated and shows nearly accurate results now. (+/- 1 inch tolerance)","WhatsApp warns that Google Drive backups are not encrypted","Sony Xperia XZ3 leak: P-OLED display, touch sensors in the frame, Android Pie","POCOPHONE F1 kernel source code now available.","Wear OS by Google: Health and help are just a swipe away - Official announcement","Android Developers Blog: Make the most of Notifications with the redesigned Wear OS by Google","Google Duo 39 features new Material icon, preps homescreen contact shortcuts &amp; more rewards [APK Insight]","Samsung Galaxy J2 Core with Android Oreo started at 88$","Using dark mode in messages triggers maps dark mode.","[Why?] Google Maps tests a standalone Map tab, separating it from the driving and transit views","UPDATE: Google has confirmed for me that the company will indeed appeal the ruling in Oracle v. Google copyright case to #SCOTUS:","YouTube Music now available in The Netherlands and Belgium","POCO F1 review: Incredible performance at an unbeatable price [Android Central]","Fortnite's battle royale with Android security problems is just getting started","Note 9 real review","2018 is Going to be a Smartphone Year to Forget","Pocophone F1 : Teardown","Poco Launcher from the Poco F1 is now on the Play Store","Xiaomi Redmi Note 5/Redmi 5 Plus gets stable Android 8.1 Oreo update","ForceDoze pulled from Play Store (Link to Mirror)","Material Design Awards 2018 Entry Form","Android Messages, the future of Google's chat service.","Spotify is now testing Friends Weekly on Android","Google App tests a new layout for the Google Assistant settings page","Budget phones of 2018","LG G7 One is LG’s first smartphone in the Android One program","Will 'swipe to dismiss' ever be made available in the Google Feed?","Adaptive brightness is no longer a battery enemy on Android 9 Pie?","If you have a problem with notification channels disappearing in apps (eg Spotify), it is a problem (possibly on Oneplus phones only) with apps which have implemented notification channels without actually targeting a minimum of Android Oreo","Google Search in India starts showing dictionary definitions in both English and Hindi","Google files with FCC for Wireless LAN + Bluetooth + NFC NGFF Module","LG Builds On Successful G7 Series Platform With Two Even More Accessible Models (LG G7 One and LG G7 Fit)","Dark Mode and Night Light interaction","[DEV][Self Promotion] Tweet2Pic - A tool that makes it easier for you to share tweets","If you can not see your Android Backup, check if your old phone was still subscribed to the beta program","Reminder: There is no such thing as \"Material Design 2.0\"","Nexus 5 AOSP 9.0.0 r3 Pie (Alpha)","Google Phone what's new: \"coming soon - Dark mode\"","In defense of \"Bug fixes and improvements.\"","Huawei is dismembering the community which helped it grow","[DEV] NotiFire - Speaks out your notifications","[DEV] We developed an app that turns you into live cartoon characters. (Redditors say it's better than Samsung's ARMoji).","Building services for every Indian, in their language (Tez rebranded as Google Pay)","The most interesting smartphone innovations in the last year (or so)","Google Pixel 2 XL crushes Galaxy Note 9 in night-time blind camera test","The state of Android flagships","Just a reminder that Spotify still has major issues on Android. E.g. Notification controls disappearing, music randomly stopping and non-functional search.","Sign up for Google One and get $5 Google Play Store credit and you get a new flair around your Google profile picture","Using a Nexus 5 is a surprisingly okay experience in 2018","Phone Addicts Driving the Current Market. Stop buying Phones","Telegram will share data with law enforcement authorities","Bloomberg reports that Google's next Pixel phones will be unveiled on October 9th at a media event in NYC.","Sony Xperia XZ2 Premium review","Paranoid Android: new navigation concept called Blink Navigation, new versioning system, Pie progress, and new OnePlus builds","On a simple digital lifestyle than the \"bloated\" one:","Samsung offers free adapter to use the Galaxy Note 9 with the Gear VR","Google’s ‘Mini’ stickers go official for Gboard, creates emojis from your selfies","Some Galaxy Note9s have an annoying 'light leak' line off to the side of the display","Solid Explorer updated with MD2 white Theme + proper adaptive icon","Liquid cooling - the worst buzzword of 2018","Pocophone F1 launched in France - €329 and €369","Hear me out: Android should switch to a Chromebook interface when plugged into a monitor","[DEV] I just released my 3rd game! It's a hectic arcade game where you keep units from going extinct. I do all the pixel art and coding myself! Please check out 'RPS Arcade'!","WARNING: Google payments + Project Fi billing nightmare","Samsung Galaxy Note9 Teardown - iFixit","Google Play Games tests new leaderboard design &amp; other UI changes","How to remap Bixby 2.0 on the Samsung Galaxy Note 9","Sony’s frustratingly good lineup is held back by nonsensical support, awful pricing, and an outdated release strategy (XDA)","Xiaomi releases Oreo 8.1 kernel source for Mi A2 (jasmine)","Asus ZenFone 5Z Review: The Next Great Android Bargain Is Here","Poco F1 will be available at 329€ and 369€ in Europe","Tools to Take Charge of Your Digital Wellbeing (YouTube)","Chat Export Tool, Better Notifications and More","Oppo Find X review: unrefined ambition [The Verge]","Pocophone F1 is coming to 50+ markets, first Xiaomi product to launch in UK/England!","Upcoming Sony Xperia XZ3 rumored first smartphone to use flagship 48MP CMOS IMX586 camera","Camera/Messages/Photos are a hot P mess","Xiaomi Poco F1, Nokia 6.1 Plus, Samsung Galaxy Note 9 &amp; Xperia XZ2 support ARCore","For those of you who also wanted the \"Save to Inbox\" feature back, reverting the APK to July's version works","Rootless Pixel Launcher now on the Google Play Store with Pixel Bridge","[EXCLUSIVE] Sony Xperia XZ3 Leaked Image Points Towards Four Colour Variants","Android Messages 3.5.052 APK Download by Google LLC - (MD2 redesign is back)","Last year I asked what would be in P, this year, what do you expect in Q?","Google Camera ports work without root on the Poco F1, Mi 8, and Mix 2S","Gmail v8.8 removes follow-up reminders and quick replies, also readies the return of Inbox's snooze until someday [APK Teardown]","HMD Global, maker of Nokia phones, now owns the PureView trademark!","Is it me or does it feel like Android has lost its luster over the years?","What's the best SMS app in your opinion?","LG V40 CAD renders","Why are vanilla AOSP Android ROMs not popular?","What do you think about the Material Design 2.0?","Would you pay Google a monthly fee to have your phone not collect any data, on Android and Chrome?","Huawei Watch 3 release date rumours: All the news about the Huawei's next smartwatch","Android Messages Dark Mode working again","'Fortnite' developer had sharp words for Google after a scary Android exploit was discovered","BLU Vivo XI+ now available","I made my first android game :D I thought i should share here :D","POCO F1 faster than OnePlus 6? | Another speed test, this time OP6 wins which makes more sense.","Researchers reveal Android devices communicating with Google servers almost 90 times per hour","Counterclockwise: Xiaomi shows $300 is all a flagship needs to cost","Galaxy Note 9 (SD845) vs. iPhone X - PhoneBuff Style Speed Test","New Pixel 3XL and Pixel 3 Renders","Sunday Rant/Rage (Aug 26 2018) - Your weekly complaint thread!","Tip: You can easily change Android share menu without root.","How would you feel about more secondary displays instead of notches?","I have a Poco F1. AMA!","How to enable DNS over TLS in Android Pie","The initial release of the Fortnite Installer was vunerable to a \"man in the disk attack\" - allowing any app to be installed on Samsung devices","Firefox Focus increased it's size from 4MB to 39MB due to new GeckoView engine","Saturday APPreciation (Aug 25 2018) - Your weekly app recommendation/request thread!","Some random ideas:","Android Central: The best Galaxy Note 9 cases you can buy.","Poco F1 vs OnePlus 6 Speed Test. Poco kinda won.","[Exclusive] Sony Xperia XZ3 Image Leaked: Flagship Smartphone With Snapdragon 845, Other Premium Features Coming Soon","The Essential phone is an excellent budget phone!","When are we going to start seeing the Pocophone's effects on Oneplus?","Xiaomi Mi Max 3 review","Pixel 3 XL unboxing!","Galaxy Note 9 vs OnePlus 6: The $500 Difference","Why in the world is split screen so much harder to use now?","OPPO R17 Pro launches with variable aperture 3D triple-camera","Zenfone 5z review android authority","Poco phone f1 review","Whatsapp: India's request to trace messages is a no-go","Global Galaxy Note 9 firmware now available for download on SamMobile","I am informed that a new Huawei OTA will make installing Magisk unable to boot at all. At this point I might just simply ignore this brand even exists.","Nova is an open-source video player for phones, tablets, and Android TV forked from the source code of Archos Video Player","Xiaomi POCO F1 vs Mi A2 vs OnePlus 6 Camera Test Comparison","ATtention Spanned: Comprehensive Android Vulnerability Analysis of AT Commands","The $300 Pocophone F1 Amazed Me.","VPN Hotspot lets you share your VPN connection over a hotspot","John Wu (topjohnwu) created a patreon page for those who want to support him on Magisk development.","Alphabet Scoop Podcast: Pixel 3 may launch in red [53:40]","Asus Zenfone 5Z review: As good as it is, buy a OnePlus 6 instead","Looks like the Xiaomi Pocophone F1 will be available from some European retailers for 399€ from August 29","Chinese tech reviewer TESTV tests Vivo Nex's motorised camera to failure (50k actuations)","GSM Arena - Moto Z3 review","Asus ZenFone 5Z update adds Lift to Face Unlock, RAW capture, &amp; EIS/OIS auto switch","New Spotify UI - A/B testing?","Samsung Experience 9.5 Emoji Changelog","Samsung Galaxy J5 (2017) Android 8.1 Oreo update rolling out in Poland - SamMobile","Asus Zenfone 5Z review: The 'flagship killer' killer","The Ultimate Samsung Galaxy Note 9 Experience!","Android Pie and Dark Theme","WhatsApp security and role of metadata in preserving privacy","Steam Link app updated with onscreen controller buttons","Pixel 3's notch area is so big that there is enough room for 2 lines of notification","The Essential Phone was at Least a Year Ahead of Everyone","Is Huawei becoming the Apple of Android OEMs?","Idea Thread: notifications should all go to the bottom while the notification menu is pulled down, and reset to proper order after menu gets pulled up","Seeing a new Google Phone app UI this morning","Can we find someone to trust in the field of emulators (and in general) as users?","The Oppo R17 Pro is out now","New Material Design 2 in Google Chrome Canary","Moto Z3 Review: The Bleeding Edge Paradox","Help to return USB music streaming into Pixel phones - submit the request to Google","Android Pie adds controller mapping for the Xbox One S wireless controller","What is your opinion of Samsung's touchwiz?","I’d take the OnePlus 6 over the Galaxy Note 9 any day of the week","BxActions has been updated to disable the Bixby button on the Note 9 and currently being updated to allow more remapping of Bixby button","Use Android Instant Apps. r/android, are there any advantages of using instant apps?","Improve Bluetooth audio quality on any headphones, without aptX or LDAC","Samsung Galaxy Note 9 smokes iPhone X in Speed Tests!","Paranoid Android: A quick update","2020 Prediction on smartphones","Sources: Google Pixel 3 &amp; 3 XL cameras bring ‘Super Selfies,’ updated Visual Core, more","Chrome on Android to disable JavaScript automatically on 2G connections","POCO is creating a lot of discomfort in the Oneplus forums","Check your My Notifications in the Play Store for $2 Play Credit","FairEmail is an open source, privacy-friendly email app","With all the hate towards the Pixel 3XLs notch, what do you guys think of 'asymmetric' notches?","Don’t run out of data: Two new ways Datally can help","Huawei Mate 20, Mate 20 Pro EEC Certified with Android 9 Pie Ahead of October Launch","Has Anyone Heard Anything New On The Asus ROG Phone?","Samsung Galaxy Note 9 Review: The Total Package! - MKBHD","LG V20 and Q6 being updated to Android Oreo now.","HTC on Twitter: \"Beauty and power meet on August 30th 2018.… \"","Cricket wireless finally udates Galaxy S7 to Oreo","Pixel 3 (XL): Is 1 year not enough for innovation?","Google - Pixel 3XL Review","Poco will support the developer community on the Xiaomi Poco F1","'Leaked' LG V40 press renders are probably fake","[Opinion] The last month has seen the original dream of Android come to fruition.","Lenovo™ Releases its Newest Generation of Android™ Tablets for Household Sharing and Entertainment","Poco F1 vs OnePlus 6 Speed Test | YouTube","Google Photos - Photo book now showing in UK app.","Google may rename Tez as Pay &amp; bring UPI payments to Play Store","List of Android Pie (Android 9) ports for smartphones and tablets","Exclusive: A Ukrainian black market dealer is responsible for recent flood of Pixel 3 XL leaks","Android Messages tests integration with Google Assistant","What should I buy Thursday (Aug 23 2018) - Your weekly device inquiry thread!","Exclusive: Pixel 3 XL in our hands","Xperia X, X Compact and XA1 series get August 2018 security patches","Queather - my first app built using flutter","Despite being shunned in America, Huawei is flourishing in Europe","Xiaomi's Poco F1 phone threatens a price war","We’re Still Waiting for LG’s Global Update Center to Make a Difference","[Pixel 3XL Leak] New camera app UI?? • r/GooglePixel","Crosspost from /r/GalaxyNote9: \"Stayed home waiting for my phone, open it up, powered it up &amp; it's a defective screen\"","Google Photos : Resizing option when sharing to Gmail / Inbox (new feature?)","Another concept for a Pixel 3 XL with a dual-layer notification bar","POCO phone 1st impresssion","[EXCLUSIVE] LG V40 ThinQ Leaked Images Reveal Triple-Camera, Display Notch; Launch Date Could be November 16 - MySmartPrice News","Samsung's new Tab S4 has 6gb of RAM in S. Korea while only 4gb elsewhere.","Pixel 3 Xl back made of plastic?","Apple and Google Face Growing Revolt Over App Store ‘Tax’","Pixel 3 XL Wireless Charging (confirmed?)","[APP] System UI Tuner launcher for Android 9 Pie : GooglePixel","Poco F1 launched in India","These are the best Android phones in 2018 so far","\"Found here Pixel 3 XL. It's kind of embarrassing at first glance. Here Sfotkal and left in a taxi.\"","Google Family now works in Turkey","Inside Xiaomi's Plan To Bring Budget Android Flagship Smartphones To Over 50 Markets","Reflecting back on the LG V20 - One of the last truly great Flagship phones","Evolution of Android Security Updates","Google Play Store now shows application dimensions directly","Chrome dev now tint the Chrome Duet toolbar","Pocophone F1 Review - GSMArena","PSA: Bixby button on Galaxy Note9 cannot be disabled","Why is it that the iPhone X did so well but everything else with a notch failed?","Android P/9 Release Dates","ZTE Releases An Official Render Of The AXON 9 Pro - It has A Notch &amp; Rear Fingerprint Sensor","New Samsung Health App Incoming","How will other mobile manufacturers respond to POCO F1 by Xiaomi?","A new study suggests that Google collects more consumer data than users think (way more)","New YouTube update - swipe for next video","Qualcomm Samples Next Generation Mobile Platform to Customers","So with \"Face Unlock\" Currently not there on the leaked Pixel 3, what else do you think is going to have to be updated?","Introducing the new Google Fit","In less than a year, the $1,000 phone has become entirely normal","POCO F1 Global Launch - Livestream starts at 12:30 PM IST","Oneplus 5 and 5T now have treble.","[DEV][Self Promotion] Looking for some feedback for my News Summary App - Gistt","Magisk API Fixed !","How to install Digital Wellbeing on your Android P custom ROM","Galaxy S9 turning out to be best phone I've ever owned","Google Fit - Fitness Tracking 2.01.18","Google Data Collection research","Google Nexus 6 and Nexus 5X get AOSP Android Pie ports","Hands on with the redesigned Google Fit: More white, no more ugly bitmaps, and new 'Heart Points' (APK linked)","Google is developing an experimental podcast app called Shortwave","EmojiOne v4 released a few days ago. This is how Google could have done the emoji redesign right.","Thoughts on Pie gesture navigatiom","I don't think we should celebrate the POCO phone","Google Assistant now redirects you to a 2013 TC article if you ask it \"where was I yesterday\"","Nokia 6.1 Plus preview: The start of something great","Hey Google, Tell Me Something Good","Samsung Note 9 Teardown! - Is there Water inside?","Samsung Pay Now Available in Six Continents, Accelerating Global Expansion","Has Xiaomi's POCO F1 destroyed OnePlus?","More than half of Note 9 preorder buyers pick 512GB edition","Man sues over Google's \"Location History\" fiasco, case could affect millions","Android Pie for OnePlus One","Streamlining the developer experience for instant games","GSMArena Nokia 6.1 Plus (X6) review","Carrying two phones at once: How to make it work seamlessly","Samsung Galaxy S9 Unlocked Smartphone - Midnight Black - $ 619.99","Samsung Galaxy Note 9 review: This is power user perfection","OnePlus Users Find Themselves Unable to Navigate Using Waze","Nokia 6.1 Plus. Stand out and tell your story","Samsung Galaxy Note 9 vs XZ2 Premium Camera Comparison!📸","Gboard v7.5 prepares clipboard integration, hotkey shortcuts for Chrome OS, and more","Android Pie GSI now available for Project Treble-enabled devices","Samsung Galaxy Note 9 Review: In Praise of Incrementalism","How to back up Android devices: The complete guide","Gaming smartphones are the industry’s next pointless fad","Facebook Messenger Now Supports Adaptive Icons","Instagram testing switching the positions of DM's and profile menus","HMD officially blocked bootloader unlocking. Now is the time to take action.","Nokia 5.1 Plus. Designed to amaze, engineered to perform.","Chrome 69 rolling out ‘Material Design refresh’ next month ‘across all operating systems’","Exclusive: This is the Huawei Mate 20 with a waterdrop notch and triple rear cameras","Gmail for Android can now undo sent emails","Flexible screen tech belongs on the wrist, not the phone","Apparently, Indian users really like the Notch...","JBL Link Bar Android TV and Assistant-equipped soundbar hits pre-order for $400","First Galaxy Note 9 firmware download available now","OnePlus 6T concept video","Pixel 3 XL spotted on TTC again with notch and two front-facing cameras","Galaxy Note 9 and Galaxy Tab S4 get ARCore support","The New Dark Sky App","Source: Samsung is working on a massive 17\" Android tablet, and it's coming to AT&amp;T","A Samsung Galaxy S9 Active looks unlikely this year","Hot Chips 2018: Samsung’s Exynos-M3 CPU Architecture Deep Dive","Hot Chips 2018: The Google Pixel Visual Core Live Blog","Xiaomi responds to Huawei fake ad, a war between chinese companies in Egypt?","Essential Phone in Halo Gray $223.99 On Amazon (US)","Samsung Note 9 Durability Test! - Bixby is not Secure...","Android Pie opens up recent apps customization for third-party launchers","Samsung Galaxy Note 9 Initial Review – A few days w/ the battery life, performance, &amp; S-Pen","[GUIDE] [ROOT] How to lower RAM Usage and Improve Performance on 1gb RAM phones","Nova Launcher LPT: long pressing an app on homescreen, then long pressing the app info button/icon uninstalls the app","Huwaei faked an ad for its new phone Huawei Nova 3i","New Season, New Apps and Updates","Samsung Galaxy Note 9 Teardown","Cross post: paused apps don't allow you to stop audio.","Samsung Galaxy Note 9 review: In praise of incrementalism","Moronic Monday (Aug 20 2018) - Your weekly questions thread!","64GB Samsung Galaxy S8 Smartphone (T-Mobile; Arctic Silver) - $ 350","Poweramp's most recent update contains a Westworld reference. Either that or it's becoming sentient, I'm not sure which.","When Huawei smartphones will get Android 9","[MAGISK][MODULE] Turn on Wifi automatically feature from pixel devices on any oreo device","Google tests a newer Pixel Launcher version with the Google Assistant icon on the search bar","Google last again in Android antivirus ranking (2018) - gHacks Tech News","Why a $100 phone will get Android Pie before your Samsung Galaxy S9","Waterfox for Android update brings huge privacy improvements","[Hands on] Snapchat Alpha is a faster, cleaner version of Snapchat","Essential Phone in Halo Gray – 128 GB - $ 280","Sticky Notes Coming to Mobile Alongside Major Windows 10 Update","Android P users! How do you find the Nav gestures?","Sunday Rant/Rage (Aug 19 2018) - Your weekly complaint thread!","Facebook now supports notification channels!","How to enable the new, faster Snapchat Alpha [Root]","Android Messages for web MD2 custom css styles - get it here.","[Cross Post][0.115.2] Pokemon Go now abusing its permissions to read internal storage to dig through your files and lock you out of the game after identifying what it thinks is \"evidence\" of rooting - follow-up to unauthorized_device_lockout error : pokemongodev","Do We Need 1 Terabyte Storage for a phone?","SwiftKey Emojis are now using Microsoft Emojis...","It Starts. We did it. Reviewers are started justifying 1000$/€ smartphones. Do you agree?","Latest Oreo update for Sony Xperia Touch has the option to stop screening turning off while being moved","I have a Mi Pad 4 for the past 2 days! AMA!","APNewsBreak: Google clarifies location-tracking policy","\"Snapchat's new faster Android UI is underway. It's generally smoother than the old one. Emoji brush is coming to the new UI for Android too!\"","Google is reverting the Android Messages Material Design 2 and Dark Theme changes.","What is your favorite animation scale?","Galaxy Note 5 and Galaxy S6 edge+ get August security patch update - SamMobile","Exclusive: U.S. government seeks Facebook help to wiretap Messenger - sources","Pop quiz - Which phone did it first?","Saturday APPreciation (Aug 18 2018) - Your weekly app recommendation/request thread!","Michael Fisher - Galaxy Note 9 Review: A $1000 Phone That's Actually Worth Buying","[Meta] 1,300,000 Androiders! 🎉","Gboard 7.5 beta preps clipboard manager, floating keyboard, ‘smarter’ search [APK Insight]","Xiaomi Mi 8 launching soon in India; to be priced under Rs 30,000 (~430 USD)","OnePlus X, OnePlus 2, &amp;amp; OnePlus 3/3T get AOSP Android Pie ports","Google removes 'Save to Inbox' feature from Android app","Qualcomm is giving its next high-end phone SoC (Snapdragon 855 aka SDM855 and becoming SM8150) a dedicated Neural Processing Unit (NPU) for the first time","Google Goggles is dead, now prompts users to install Lens","Microsoft Launcher beta update cleans up the feed, lets Cortana read texts","Manual Google Drive backups coming in a future Android release","OnePlus 6T will launch in October with T-Mobile as US partner","Supercapacitors power the Note 9 stylus — but are they ready to replace batteries?","Samsung Galaxy Note 9 Review: More, More, More","Asus Zenfone 5 | 3 Months later","[Unofficial] LineageOS 16.0 for Redmi Note 4 (mido)","Motorola One Power with Stock Android Spotted!","Unpopular opinion (in this sub at least): Samsung has been delivering the past few years, listened and corrected past mistakes and continues to offer top notch devices, far better than everyone else.","Snapchat Alpha (Mushroom) Bug thread","Android Pie “AI” two things that need improvement","Samsung Brazil pulled a Huawei and tried passing two stock photos off as Galaxy A8 camera samples","Sony Xperia XZ3 Cases reveal that may still rock a single camera sensor like the Pixel","Ice universe on Twitter: “The OPPO R17 Pro will be released with a smaller Notch and a ToF sensor with a third camera. Competition has never weakened.” – Could be the basis for OnePlus 6T?","Why Samsung lets Huawei win","Ice universe on Twitter: “Qualcomm is developing the SDM865, which will be a complete 5G SoC”","Anonymous tip: Google has at this point identified three possible causes of ArtemR's (and others) Pixel 2 XL lag issues, one of which would require hardware replacements.","My Nokia 7+ vs Samsung Galaxy S9+ camera comparison. [7+ with stock app and GCam mod]","\"I'm excited for the Pixel 3 XL's notch because screen protectors will be better\" - Tom Westrick, Android Central","Samsung Ruled India's Premium Smartphone Segment in First Half This Year: CMR","Report: Google to open its first flagship retail store in Chicago","Google Pixel 3 XL Spotted in Wild (MobileSyrup)","Chrome now loads Google Search when you are offline and say you're offline.","Android Messages 3.5.048 APK Download by Google LLC - MD2 redesign","Enable Private DNS with 1.1.1.1 on Android 9 Pie","[Crosspost] You can't combine a trade-in with the insight offer","Allo for web css to look like Messages for web - Here you go!","Android P's Accessibility Menu is Half-Baked","Google Pay adds 111 more US financial institutions","Bluetooth connection has improved so much on Android Pie","[ROM][UNOFFICIAL] lineage-16.0 for Pixels (sailfish/marlin)","AOSP 9.0 ROM for the Moto Z Play","Android P Tip: Enable Multi-window Long-Press Shortcut","Android 9 Pie review: the predictive OS [The Verge]","Pixel Experience ROM based on Android Pie released for Xiaomi Redmi Note 5 (whyred)","Nokia Mobile: \"We are thrilled to bring you the Nokia smartphones event for one of the most awaited phones on Tuesday 21st August. Stay tuned for more! #Nokiamobile #BringItOn\"","Huawei confirms 7nm Kirin 980 and launch window for Mate 20 series .","When can I update my Xperia to Android Pie? - Sony Mobile Blog","Android Messages 3.5 preps custom ‘Minis’ avatar stickers, revamped search [APK Insight]","Endadget Note 9 review: \"A better Note for most of us\" [Score: 92]","New \"SMS Connect\" feature in Skype for Android will soon let you send and receive SMS on your PC or Mac","Streaming support spec for hearing aids on Android","Hold square to split screen seems to be back (Android 9 on OG Pixel)","Samsung Experience UI vs Stock Android","Just received the new Android Messages Material Theme update from the Play Store (v3.5.048) - dark mode confirmed!","Gmail: Confidential mode is now available on mobile devices and can help you protect sensitive information from unauthorized access.","Sony Xperia XA3 with SD660 Incoming","Whatsapp backups won’t count as used google drive space anymore","I have the Nokia 7 plus and Xiaomi A2 with me. Mini review. And AMA!","Just wanted to point out that Samsung delivered every Security Patch each month so far this year","Bixby 2.0","Despite all the Pixel 2 XL Is The Slowest Phone In The Universe stories, mine remains unaffected. Just switched back to do some Note9 camera comparisons and I'm struck by how much smoother my 2 XL runs... even as it syncs after being in airplane mode for 4 days.","No Android Pie update for the Moto G5 lineup","Friendly neighborhood app, by Google","MobileSyrup on Instagram: “A @MobileSyrup reader spotted this possible Pixel 3 XL photo in the wild on the streetcar in Toronto, Ontario today. Cont…”","Google Play Games v5.11 brings redesigned game icons and prepares a new hidden mini-game [APK Teardown]","How does Treble influence device purchase decisions and long-term support?","What should I buy Thursday (Aug 16 2018) - Your weekly device inquiry thread!","The shortcut in Google feed to things like package tracking now leads to the assistant version of it.","Nokia 7 Plus has been named the best consumer smartphone of the year by the EISA","The Lenovo Z5 is solid!","Samsung Announces Exynos Modem 5100,Industry’s First 5G Multi-mode Modem Fully Compliant with 3GPP Standards","Xiaomi Mi A2 supports 1080p video recording at 60fps with EIS","Moto Z3 Review: Is the promise of 5G enough?","Exclusive: Google is developing a wearable health and fitness assistant called 'Google Coach'","[discussion] Google seriously needs to revamp Google Play Music.","Baked For You: Android Pie Is Coming To Motorola","Microsoft’s phone-to-Windows app is available for Android","Taskbar 4.0 brings back freeform window support to Android Pie devices","Android 9 Pie (Go edition): New features and more options this fall","Why not V35?","Android 9 Pie – What’s Next flabbergasting Between the Swipes?","Updating Wear OS Google Play Store policy to increase app quality","CNET Galaxy Note 9 Review","Samsung Note 9 vs S9+ / iPhone X / OnePlus 6 / Huawei P20 Pro Battery Life Drain Test","Does the Note9 signal a return to practical devices that do more to fill users' existing needs?","Linus' 1 month review of the BlackBerry Key2","Sony hasn't actually confirmed which Xperia devices will get Android Pie","Upgrade to Google One to get more out of Google","Google Pay in Germany","HTC’s next smartphone won’t be made by HTC itself, leak suggests","Oppo F9 announced for India: unique notch, VOOC, and Gorilla Glass 6 - The Verge","Galaxy Note 9 vs. iPhone X vs. Pixel 2 XL: Which Camera Wins?","Xiaomi Mi A2 Lite review","Galaxy Note9 review: It's $1000, and it's the one to get","Chrome dev 70 now has all buttons in the Duet toolbar","Sale Price! I made an app that works out your selling price for eBay (and amazon) items!","Motorola p30 | Official Specs","Substratum overlays that tweaks (not themes) the system and apps","Nokia 3.1 Review: Skip This Phone","Galaxy Note 9 vs iPhone X Camera Comparison by Casey Neistat","Motorola's next flagship is the most shameful iPhone X clone","Android Pie blocks all non-root call recording apps. ACR developer goes into detail.","Google says a fix is coming for fast-charging problems with original Pixel and Pixel XL","\"App download preference\" now on the Play Store","Asus ZenFone Max Pro M1 gets an Android Pie (Android 9) port","Samsung Note 9 vs S9+ / iPhone X / OnePlus 6 Battery Life DRAIN TEST","That's an impressive amount of white in the Google feed. Well done Google!","The $1,000 Note 9 proves your next iPhone or Android prices will get higher","DisplayMate on QHD screens: they offer \"higher sharpness than can be resolved with normal 20/20 vision at typical viewing distances... for phones it is pointless to increase the resolution up to 4K for a silly marketing wild goose chase into the stratosphere, with no visual benefit for humans!\"","What creative ways have you repurposed your old Android tablets?","\"Bork Google\": Assistant launches in swedish on wednesday (link in swedish)","Two Biggest Android Problems In Recent Updates","Pixel 2 XL owners, hows Android Pie treating you?","The Current State of Dolphin on Android","Oxygen OS, EMUI, and TouchWiz; which is the fastest and has the least amount of bloatware?","AOSP Android 9 Pie now available unofficially for Mi A1 (tissot)","[AMA] I'm the mkt manager of ES File Explorer, AKA \"The Fallen King\"... We need to hear your voice (questions/roast/suggestions all welcomed) (x-post from /r/androidapps)","Opinion: Android 9 Pie's Digital Wellbeing has too little data and too many options, but that can be fixed","Google Duo v38 removes all signs of screen sharing, reveals referral rewards for India, and more [APK Teardown]","The Google engineer and PR person just left after spending about 2 hours analyzing the laggy Pixel 2 XL. Unlike a car that stops making noise when you take it to a mechanic, the phone was extremely laggy to the point that both of them were visibly surprised.","OnePlus 3 vs. Mi A2 Lite daytime camera comparison (Part 2)","Galaxy Wearable, the gear update that allows S gear devices to work on Android Pie","Samsung Galaxy Note 9 Review - IGN","Inbox v1.76 may be bringing back the 'Someday' snooze option [APK Teardown]","People running unofficial Android Pie on their phones, how is your experience with it so far?","Mi Pad 4 Plus is official.","Pixel phone changing color of photos?","Google tracks your movements, like it or not -- An Associated Press investigation found that many Google services on Android devices and iPhones store your location data even if you’ve used privacy settings that say they will prevent it from doing so","Android 9 Pie Feature Tracker: Everything That Made It In","Hands-on: Xiaomi's Pocophone F1 takes aim at OnePlus 6","August Security update for Nokia 7 Plus rolling out now. [List of Markets]","SafetyNet Checker apps (including Magisk) need go update the API","Xiaomi POCOPHONE F1 on Geekbench: Snapdragon 845, 6 GB RAM and Android 8.1 Oreo","What do you think could be done to improve the quality of the apps in the Google Play Store?","Introducing Inware: Inware allows you to see information about your Android device (Hardware and Software). Starting today, you can join the public beta","Sync for reddit dev is back in the play store [xpost r/redditsync]","Why is buying a new Android phone such an exercise in frustration?","OnePlus 6T's blueprint is here with a tiny notch","Battery capacity degradation","Google is working on a \"Face Match\" feature for Google Assistant","In defense of Motorola: how journalist and the community are being unreasonably harsh with the company.","Do Not Buy a Smartwatch Right Now","Moto Z3 Review: We Wanted More","My wishlist for Dex for it be a full-pledged desktop replacement","Unofficial Open GApps for Android Pie brings Google Play apps and services to custom ROMs","Android Developers Blog: Google releases source for Google I/O 2018 for Android","OnePlus 3 vs. Mi A2 Lite nighttime camera comparison","2016 Pixel XL no longer quick-charges after Android Pie update","The Galaxy Note 9 is one step closer to the smartphone-computer dream","Moto z3 can upgrade to 5g when it rolls out soon.","Android Messages Uncompressed Image Sharing","A hidden Android Pie security setting everyone should enable","With Fortnite forgoing the Play Store do you think Google will crack down on side loading apks?","Build AOSP Pie 9.0 - Sony Developer World","Note 9 rom ported to the S9/S9+ (exynos)","Twitter Lite in the Google Play Store: now available in 45+ countries","Another Samsung device exploded and Samsung Taiwan blamed it on the user","EU aims to abolish planned obsolescence","Motorola Moto Z3 review: identity crisis","Fortnite Beta starting to roll out","Ice universe on Twitter: Samsung will launch a foldable mobile phone; Galaxy S and Note merge is a rumor, Note will not disappear; Samsung's first 5G phone is not Galaxy S10; In the face of Huawei's competition, Samsung will remain first","Michael Kors Launches Iconic Runway Watch As A New Smartwatch","Samsung Thailand's preorders on the Note 9 includes a free upgrade to the 512GB model, 1 year screen protection, and all colors available at launch.","Moronic Monday (Aug 13 2018) - Your weekly questions thread!","The best cheap Android phone? | UMIDIGI Z2 review","Samsung’s sales of Note 9 likely to beat predecessor","Man-in-the-Disk: A New Attack Surface for Android Apps","What are some of the features are we gonna see from dedicated npu in Smartphones in the upcoming years?","[Discussion] How is there not a single perfect flagship phone out there? Are phone manufacturers deaf, or don't care?","The Evolution of the Galaxy Note S Pen","Why you should buy the Galaxy Note9","POCO F1 launching in India on August 22","Is Rooting Your Device Still Worth It?","Samsung Galaxy Note 9 vs Apple iPhone X: Camera Comparison","Just got an Honor Play, my impressions so far..","Major Samsung Patent reveals an all-new Single and Multi-Sensor In-Display Fingerprint System","Motorola started to develop Android 9.0 Pie","Sync for Reddit suspended from Google Play [xpost r/androiddev]","Back-To-School Sale | $100 off Pixel 2 XL w/ $50 credit + Home Mini, $749 Pixelbook, and more!","Latest Apple Bionic CPUs way faster than what any Android can provide — how did this happen?","With the Galaxy Note 9, the Note line has a new purpose","Google Engineers are coming to Artem Russakovskii's house to analyze his laggy pixel 2.","Xiaomi Redmi Note 4 gets Android Pie (Android 9) port with everything working","Is audio focus always going to be a mess?","Counterclockwise: an abridged history of LG's phones","The Pixel 3 XL may be the first phone from Google I don't want","Pie controls are the better gesture controls, Android already had. CMV","Sunday Rant/Rage (Aug 12 2018) - Your weekly complaint thread!","Revolut is now available for Google Pay (only Mastercard)","What good feature of iPhones do you wish Android phones did better?","Google removing the holding recents gesture to trigger split screen 😡","Blue light from phone screens accelerates blindness, study finds [TheGuardian]","Google Chrome on Android may soon support Incognito Chrome Custom Tabs","Why does the design of a phone have to change drastically with every generation?","How good would the pixel 3's camera have to be, to be relevant in 2018?","[Hands-on] Fortnite for Android, the most frustrating version to play yet","The Google Pixel 3 is in trouble: this is why","Instagram now targets Android Oreo API 26","Google app 8.16 preps ‘eyesfree’ notification TTS, ‘Confidential’ watermark, more ‘dreamliner’ [APK Insight]","Saturday APPreciation (Aug 11 2018) - Your weekly app recommendation/request thread!","Does anyone not use any security to lock their phone?","Moto P30, P30 Play, P30 Note Listed on Official Site in China Ahead of Motorola Launch Event on August 15","Material Design 2 overhaul for the Google Phone app","HTC: We're pleased as pie to confirm updates to Android Pie for the HTC U12+, U11+, U11, and U11 life (Android One).","Indian companies are the biggest losers in the country’s smartphone race","Xiaomi is creating a new sub-brand to take on OnePlus","Nova Launcher 6.0-beta-2 available","PUBG Mobile Lite: Same game, just for budget devices","Android Pie update may make pressing back in recent apps return to the last app","Note 9 Pre-order in Singapore gives you a free upgrade to the 512GB model.","Samsung Galaxy Note 9 wallpapers now available for download","[Tom's Guide] Android 9 Pie Review: Google's OS Gets Smarter","Google Advanced Protection Program: Everything you need to know","Ukrainian blogger who posted the new Pixel 3 XL leak posts a new video showing off some specs in AnTuTu","It's Time to End the Yearly Smartphone Launch Event","Introducing Pixel Shortcuts – Chris Lacy","Exclusive: This is the BlackBerry Key2 LE","Good guy Google stopping kids from getting scammed by fake apps : google","Six Sony Models To Get Android 9 Pie From September","Spotify is now Samsung's music partner on all its devices","YouTube Signature Devices: smartphones with best-in-class YouTube experience","Vivo Nex Teardown Battle of the Pop Up Cameras [JerryRigEverything]","Essential Phone PH-1 | YEP, it's better on Android Pie!","Samsung Galaxy Note 9 vs The Competition","Flossy Carter: Samsung Galaxy Note 9 unboxin' and first impressions","Redesigned PowerAmp update now available via Play Store (beta channel)","Ice universe on Twitter: Heat pipe area comparison: Note9 is three times larger than Note8!","Asus ZenFone 5Z review: Surprisingly, beats the OnePlus 6 and is cheaper!","Samsung misses the Pie memo, reveals Android Oreo update roadmap instead [Android Authority]","Exclusive: Palm's new Android phone has a tiny 3.3\" screen and 800mAh battery - here it is","Galaxy UNPACKED 2018","[PSA] Don't run modded/untrusted fortnite APKs even with an alternate account, EPIC has been know to use hardware/IP ban to deter people from cheating and modding","PSA: Fortnite is now available for Samsung Galaxy S7, S8, S9 in Game Launcher","Galaxy Note 9 - Specs and Review Megathread","[PORT] Fortnite for Android with device check disabled","I don't trust Signal","Meet the new Galaxy Note9","Epic Games Announces Fortnite Beta for Android Devices","Thoughts about a smartphone without front facing camera?","Fortnite can't be ran on rooted devices.","The New, Super Powerful Galaxy Note9: For Those Who Want it All","Huawei Teases 'Real Upgrade' Following Galaxy Note 9 Launch","Android Pie and Project Treble: Assessing Google's grand upgrade fix","Did IOS Shortcuts leap over the Google Assistant features?","[Infographic] Spec Comparison: The Galaxy Note9 vs. the Galaxy Note8","Most underated feature from Android Pie","AnandTech: LG G7 Review","Pre-order a Galaxy Note9 from 8/10 – 8/23 and choose AKG noise cancelling headphones or the unique Fortnite Galaxy skin with 15,000 V-bucks, for free—or both for $99","New Sony Xperia model numbers revealed (H84XX and H94XX) with FHD+ resolutions","Do you prefer to use Google Maps in Landscape or Portrait mode?","WhatsApp Vulnerability Allows Attackers to Alter Messages in Chats","Android Oreo's \"Turn on WiFi Automatically\" feature is enabled for all in Android Pie","The Machine Learning Behind Android Smart Linkify","Hey Google, what’s the news?","‪Samsung Galaxy Note 9 event in 11 minutes‬‏","Samsung Galaxy Note9: Official Introduction","OPPO's F9 phone to land later this month, and it looks gorgeous","Galaxy Note 9 Water Cooling Tested: Fails to Impress","Four Huawei devices are already being tested with Android 9.0 Pie","Nokia 7 plus gets Android Pie beta 4","Android Pie source code confirms wallpaper support in Always on Display","[Video] Hands-On: Here’s What’s New with the Galaxy Note9","Xiaomi Mi 8X with model numbers M1808D2TE, M1808D2TT and M1808D2TC spotted on 3C certification website","Android P Navigation Gestures is so terrible in terms of UX/UI experience...","There's Too Much Hype Over the Note 9","What should I buy Thursday (Aug 09 2018) - Your weekly device inquiry thread!","Google rolls out Contacts v3.0 with new Material interface [APK Download]","Pixel 3 XL Unboxing","In-Depth Look articles about Note 9","Images of Google Pixel 3 XL production unit leak, with USB-C earbuds in the box","Google Will Lose at Least $50 Million This Year from Fortnite Bypassing Google Play","PSA: DO NOT update your phone to Android P if you have a Samsung Gear product. It will not connect!","Millions of Android Devices Are Vulnerable Right Out of the Box","Xiaomi's Pocophone F1 leaks a ton, may spearhead Baltic campaign | Pocketnow","Galaxy Note 9 is expensive as a phone, but not too bad as a phone + computer?","Android Pie source code details internal SystemUI customization platform","Introducing the new lead for Android Open Source Project","Google Pay and Samsung Pay are now supported on Tangerine","Google Photos v3.26 prepares for editing VR images, enables captions in photo books, and adds more suggestions [APK Teardown]","Android Auto Fixed in Android Pie","New icon and more for google voice","TIL Google assistant knows when you make a mistake and correct yourself in a command","So is this a thing, nokia 6.1 at least does not accept OTG gamepad controllers.","Snapchat’s redesign cost it millions of users - The Verge","Introducing Snapdragon 670 for superior performance, camera capabilities, and AI tech","New renders of Samsung Galaxy Note9 show the Metallic Copper variant","Exclusive: Fortnite Mobile on Android gameplay before Galaxy Note 9 launch","Seems Amazon has finally relented, YouTube casting is working again on Firestick!!","Android Pie UX feedback from a Pixel user","Remember the Motorola Atrix lapdock? The concept may still have some life at Lenovo, where a graphic designer was apparently collaborating on an Android desktop UI/UX for a product referred to as the Moto ModBook (note the Z2-era wallpaper)...","Question of the Day: How has Battery Life Been on Android Pie?","Fortnite Mobile on Android min requirements released!","New pic of 3 XL and packaging","There's no longer an excuse for late Android updates: If this tiny smartphone company can support Android P on the same day as Google, so can everyone else.","Fortnite for Android interview – Epic Games CEO Tim Sweeney on breaking away from Google Play","Asus Zenfone 5Z vs OnePlus 6: which one should you pick?","Phones at all major US carriers filled with vulnerabilities, say researchers","Nova Launcher 6.0 beta 1 just released","What Android Pie means for the future of smartphones","Galaxy Tab S4 review","How to force refreshed material in messages (tasker + root) Difficult-ish","If you had to reinvent the name Android OS - What would you call it and Why?","Android Go would have way more adoption if they were able to update existing low spec smartphones instead of releasing new ones with it","Two days ago I broke my HTC U12+s screen, now HTC offered to replace it.","Samsung Galaxy S7 smartphones vulnerable to hacking: researchers (Meltdown)","AIMP for Android beta testing program begins","FML Android P on Pixel 2 and Project Fi","Same ad-riddled VLC copycat is in Google Play","Android Dark Theme for the Rooted Tasker User","Android Studio's new version to coincide with the release of Android Pie is numbered 3.1.4.","YouTube paid subscriptions just turned up on my Phone","Note9 has a GPU turbo like feature?","USB-C is far less confusing for fast charging than the predecessors (Wall of text warning)","Mi A2 4GB/64GB launched in India for price of Rs 16,999/$248/€214","Xperia XZ1 and XZ Premium get August 2018 security patches (47.1.A.12.270)","Pixel 3 Rumour Round Up","Android 9 Pie review with comparison to performance on Oreo (Oreo was faster)","Meizu 16 and 16 Plus Announced","Charging Sound Android P","Android 9.0 Emoji Changelog","Michael Fisher: Hmmm. Just got a save-the-date from Qualcomm. Wonder what's happening September 10?","Android Pie's new Overview is giving first-party launchers a big advantage","Google Digital Wellbeing First Look!","Experiences with Android 9 on OP5T","EU regulators to study need for action on common mobile phone charger","Newton Mail is shutting down in September","Phones used by Verizon, AT&amp;T, T-Mobile, Sprint filled with vulnerabilities, say researchers","Official Android 9 Pie Update!","Android Central: Google did not confirm that future Pixels will only have gesture navigation, simply that the default navigation system in Pie is gestures.","Digital Walkie-Talkie Phone with 10300mAh battery","Android Pie SDK is now more Kotlin-friendly","HTC revenues continue to plummet in July","AndroidCentral Xiaomi Mi A2 Review: A Great Sequel with a Fantastic Camera","Hands on with Android 9 Pie's Digital Wellbeing: Phone control for those without self-control","Probably my favorite new Pie feature, iPhone-like text selection.","Custom DnD profiles would be really cool","Here's all we know about the Samsung Galaxy Note9","Mi8 prices in Greece have been announced","Android 9.0 Pie Review on the Essential Phone","My brief view of Android 9","Android 9 Pie: Powered by AI for a smarter, simpler experience that adapts to you","Finding the security balance with lockscreen notifications","TWRP 3.2.3-0 Released.","Essential: \"We’re proud to bring Android 9 Pie to Essential Phone the same day it’s released! Check your phone now for the update\"","Android Pie adds Bluetooth volume memory feature to remember headset volumes","Android 9 Pie – App Actions &amp; Slices to Redefine Mobile Search","Hows Android Pie for everyone!?","Android 9 requires so many steps to enable split screen.","It's been over 4 years since Google started making VR more accessible, but the platform hasn't grown since Daydream launched","Using a Floppy Disk Drive on a Smartphone","Android Pie adds feature to prevent killing RAM-heavy games if you accidentally exit","Unveiling the Android Pie lawn statue at the Googleplex","Introducing Android 9 Pie","How to Get Gesture Navigation on Any Android Phone","Tentative RED Hydrogen Release Dates Announced","Android 9.0 Pie AOSP source published","I stumbled onto the Slice feature on the developer site, and I think it gives us insight into what direction Android is headed.","Google Play Store - I wish there would be an option to filter out search results.","Android 9 (Pie) Factory Images (and OTAs) Release","Verizon Seems to Think Android 9.0 “P” is Coming to Pixel Phones Today","Get Google Pixel's Digital Wellbeing on the Essential Phone on Android Pie [Root]","Digital Wellbeing beta sign up (no need for the invite)","If you're still using Apex Launcher, here's a warning : the new 4.0 \"huge\" upgrade just erases all your settings, removes core feature and turns it into an advertisement platform."]