["2018 /r/CFB Season Pick 'Em","The /r/CFB Store is now Live! (v2.0)","We wrote a haiku for you...","Tulane's Helmets for Week 1 Are incredible","Washington agreed to play in this year’s Chick-fil-A Kickoff game only if the roof was closed","The 2018 Fulmer Cup Awards for Criminal Achievements in D1 Football","Jim McMahon On Going To BYU: \"I Only Went There Because My Dad Wouldn't Let Me Go To UNLV.\"","Brian Ferentz Overflows Toilets in Newly Renovated North Endzone After Late Night Chipotle Run","Louisville Plans to Dominate Alabama","Because of an equipment issue w/New Mexico State, Minnesota will be wearing its new white uniforms instead of a traditional dark jersey at home Thursday. New Mexico State's white uniforms have not arrived yet, so their only option for the game is a dark uniform","Boise State–Troy Is a Group of Five Showcase with New Year's Six Implications","FSU Will Wear Black on Labor Day Night vs Virginia Tech","Illinois gets $20 million Donation","Big Ten Announces 2022-25 Conference Football Schedules","AP: Ohio State says Texas’ Herman was with Smith at strip club","Utah has officially accepted their new national champion status.","HUNDREDS OF TRANSLATORS BEING FLOWN IN TO HELP LSU AND MIAMI FANS COMMUNICATE","[Week 1] Prediction Thread","If your team were to go 1-11 for the season for some nightmare reason, what one game win would make it acceptable to you?","Week 1 Match-up Preview Thread: Oregon State Beavers @ #4 Ohio State Buckeyes","Favorite sign in a game","'Messy': QB transfers the new normal in college football","UNT to immortalize ‘Mean Joe' Greene with statue outside stadium","Week 1 Match-up Preview Thread: Appalachian State Mountaineers @ #9 Penn State Nittany Lions","Texas ran the ball 73% of the time in the red zone in 2016 and only 58% of the time in 2017. Interactive chart compares what % of a team's plays are run vs pass before the red zone vs in it. Can highlight all FBS teams to see how their % of run vs pass changes.","Hot Off The Press: Oregon State Game Poster","\"Battle of the Bay State\" will not be televised in Boston.","Big Ten Week 1","With the new Big Ten Conference schedule, Michigan will play Minnesota twice in the next 8 seasons, both times in Minneapolis. So much for one of the oldest rivalries in football.","Weekly Pac-12 Discussion Thread","Whose Line Is It Wednesday","Weekly SEC Discussion Thread","SEC will implement use of a visible TV timeout countdown clock for 2018 season. The on-field display will allow fans, game officials &amp; both teams to view remaining time during each TV commercial stoppage from anywhere in the stadium","Arkansas breaking out All White uniforms this Saturday for the first time in school history","College football 2018 polls: 3 overrated teams","The Expansion of the Pacific-8 Conference To Include The University of Arizona &amp; Arizona State University","Maryland LB Nihym Anderson transfers to Rutgers","Proposal to have the highest ranked G5 team play the highest ranked P5 team that does not play in a conference championship game to play each other during conference championship week.","What opinions are uncommon among casual fans but common among some die-hards?","Week 1 Match-up Preview Thread: Northwestern State Demons @ Texas A&amp;M Aggies","THE FCS BELT","The NFL Can't Wait: Boston College Tailback AJ Dillon Is a Rare Talent","G5 Summit: The Reckoning (Week 1)","Kennesaw State University will open up and close out their regular season in two different Atlanta Braves stadiums.","On the eve of the season:Football, a Justification","Straight Forward Aggression: Analyzing Florida State's \"Quarters\" Defense","Has anyone seen a game at every stadium in their conference?","/r/CFB's 2018 NCAA Football Simulated Season - Bowl Prediction Results and National Championship Predictions","How scared are you of your first opponent? Why?","Off Tackle Empire's Week 1 Preview in MS Paint Infographics","College football strength of schedule rankings and how to make them much more useful","New to college football, what can I expect!","Jawon Pass nearly picked Alabama as a recruit. Now his first career start comes against the Tide. No, Pass isn't Lamar Jackson. But he's going to \"shock\" some people (247 Sports Article)","Georgia Southern 2018 Hype Video","What are some underrated conference games to keep an eye on?","Virginia Tech looking for clues in preparing for FSU’s new football coaching staff","Everything to know about Eastern Michigan football for 2018 season","The Blessing and Curse of Being Lane Kiffin","Week 1 Match-up Preview Thread: Furman Paladins @ #2 Clemson Tigers","Iowa adds four non-conference games to their future schedules: Kent State - 2021, South Dakota State - 2022, Illinois State - 2024, Northern Illinois - 2025","CFB fans that are indifferent/in favor of neutral site games, why?","Shea Patterson: From the outside looking in.","Week One: Division 2 and 3 Review, Preview, and Discussion","@RedditCFB is back on Twitter.","‪St. Thomas (FL) announces plans to launch an NAIA football team in 2019; located in Miami Gardens, the Bobcats aim to hire coaches by December, begin in spring, and have their inaugural game next Sept 7‬","Arkansas mascot Tusk gets gameday ride upgraded.","Kickoff Eve! Made a hype video celebrating villains","Recruiting Round-Up-8/28 Edition","If Vegas is right about these 10 Power 5 teams, will they fire their coaches?","Kyler Murray balances football and baseball while replacing a legend","North Alabama Players Awarded Scholarships","Tennessee-Chattanooga unhappy with present financial arrangement with publicly-owned Finley Stadium (prev home of FCS title game); may look to build own facility or adapt historic Engel Field, which it purchased in 2008","P5 Schedule Visualization: P5 opponents by Neutral/non-Neutral by Home/Road","Fresno Bee: Bulldogs defense could take another big jump this season","QB Curve: Jalen Hurts or Tua Tagovailoa? There is no wrong choice in Alabama's QB derby (but one is more right than the other)","The college football games you need to watch in 2018","Northwestern State Dedicated an Entire Page to Player Nicknames in Game Notes","Ohio State Releases Further Documents on the Zach Smith and Urban Meyer Investigation","Small College Football Pick'em Week 1","College football's most entertaining teams in 2018","It's theoretically possible to have a Circle of Suck playoffs, where all four teams have only one loss to another team in the playoffs","How is defensive line play like a ballet? Big Ten's defending sack champ explains","Sophomores with best NFL Potential","South Carolina to wear Script logo helmets vs Coastal","Video: Badger Sports Report with Paul Chryst — 2018 season preview","Stadium Seating Chart Maps?","South Bend's Michigan Street temporarily renamed \"Fighting Irish Drive\"","DL Gerald Willis looks to finally make splash at No. 8 Miami","r/CFB People's Championship: Final Four","Currently bored, job-less, and football-hungry, so here are my attempts to draw some CFB logos by memory. Enjoy!","San Diego State Aztecs wants to play football game in Tijuana, Mexico","2008 Week One","Kinnick Stadium partially flooded this evening","Dip 'Em and Pick 'Em Week 1","Paul Finebaum says Urban Meyer won't coach at Ohio State in 2019","ARISE - 2018 BYU Hype Video","Week 1 Match-up Preview Thread: #13 Michigan Wolverines @ #12 Notre Dame Fighting Irish","What was the best college football game you’ve ever watched that didn’t include your favorite team?","LSU to Host Army in 2023 at Tiger Stadium","Urban Meyer allowed to meet with Ohio State football team before suspension","Week 1 Match-up Preview Thread: #17 West Virginia Mountaineers @ Tennessee Volunteers (Charlotte, NC)","Wyoming and BYU Schedule Home and Home Series","FEI's Most Difficult Schedules of 2018: (1) Texas A&amp;M (2) Auburn (3) LSU (4) Tennessee (5) Michigan","5 reasons to be optimistic about UNC football. And 5 reasons to worry.","Week 1 Match-up Preview Thread: #7 Washington Huskies @ #8 Auburn Tigers","Maria Taylor signs new multi-year deal with ESPN","Kansas mascot mocked after trash can photo","Find someone who loves you like @Alioneye loves Illinois Football. His annual 20k+ word Illini Sesason Preview is truly special. (Yes. Over Twenty Thousand words.)","What were some “David vs. Goliath” games where the majority of the country was rooting for the Goliath?","2019 3* ATH Falcon Kaumatule commits to University of Utah","Week 1 Match-up Preview Thread: #20 Virginia Tech Hokies @ #19 Florida State Seminoles","Luke Falk’s likely successor chose WSU over Alabama: Meet Cougars QB Gardner Minshew","Nebraska QB Tristan Gebbia to Transfer","Week 1 Match-up Preview Thread: #10 Miami Hurricanes @ #24 LSU Tigers","Week 1 Match-up Preview Thread: FAU Owls @ #6 Oklahoma Sooners","Week 1 Matchup Preview Thread: Charleston Southern Bucaneers @ Florida Gators","I rescued a Notre Dame flag from the trash here in Michigan. Help me figure out how to give it away to a Redditor.","Once homeless, South Carolina's Javon Kinlaw found new lease on life through football","LSU Wide Receiver Tiger Scheyd was awarded a scholarship along with three other players.","Week 1 Match-up Preview Thread: Ole Miss Rebels @ Texas Tech Red Raiders","Week 1 Match-up Preview Thread: Utah State Aggies @ #11 Michigan State Spartans","Homecoming during Miami (OH) Season Opener?","Vanderbilt football player Zaire Jones suspended after assault charge on off-duty police officer","Week 1 Match-up Preview Thread: #25 Texas Longhorns @ Maryland Terrapins","United Airlines adds flights and seats for college football fans","Alabama, Auburn, Georgia, and Georgia Tech were all established in the same year, 1892. How many othee schools were \"born\" with their rivals?","In the CFP era, 3 of 4 QBs on field in 2nd half of title game for eventual nat'l champ didn't start the season opener. Deshaun Watson is the only exception.","How Jim Harbaugh saved Michigan-Notre Dame football series","Week 1 Match-up Preview Thread: Colorado Buffaloes @ Colorado State Rams","To celebrate Gameday in South Bend I made a hype video . . .","Follow-up: Former Penn State linebacker Manny Bowen decided last week to leave the program and focus on academics/graduating, according to Nittany Lion LB Cam Brown","Week 1 Match-up Preview Thread: Northwestern Wildcats @ Purdue Boilermakers","Alabama hype video by Funnymaine (Narrated by Thanos)","Plagued by injuries, once-promising Wyoming RB retires from football","Weekly Big 12 Discussion Thread","IU football will no longer have the names of players on the back of their jerseys. \"Team over self.\" #iufb","College football’s biggest overreactions to Week 1 games, ranked","[Week 1] Pick 'Em Thread","Week 1 Match-up Preview Thread: Army West Point @ Duke Blue Devils","Weekly ACC Discussion Thread","Notre Dame tickets this season to incorporate augmented reality.","What 1 thing would you change regarding CFB broadcasts?","Week 1 Match-up Preview Thread: Austin Peay Governors @ #3 Georgia Bulldogs","Week 1 Match-up Preview Thread: North Carolina Tar Heels @ California Golden Bears","Week 1 Match-up Preview Thread: Louisville Cardinals @ #1 Alabama Crimson Tide","Week 1 Match-up Preview Thread: Nicholls State Colonels @ Kansas Jayhawks","Week 1 Match-up Preview Thread: Cincinnati Bearcats @ UCLA Bruins","Week 1 Match-up Preview Thread: Akron Zips @ Nebraska Cornhuskers","Orlando area attorney purchased a banner to fly over Camping World Stadium before the Alabama/Louisville game that says “UCF ‘17 CO-NAT’L CHAMPS 13-0 ...” This will fly around for 3 hours and will end one hour prior to kickoff per Florida Law","College Football Belt Championship","Week 1 Match-up Preview Thread: Western Kentucky Hilltoppers @ #5 Wisconsin Badgers","Reminder: Underdog Pickem 2018 Edition","The First GBH Tailgate of the Season","Week 1 Match-up Preview Thread: #18 UCF Knights @ Connecticut Huskies","Trivia Tuesday","Kennesaw State vs Georgia State Game Preview - Underdog Dynasty","For those interested, no Power 5 team has played more than 10 road games vs Non-Conf P5 teams since 2008. The team that leads the way - Georgia with 10. USC, Georgia Tech, Stanford have 9. Wake, Clemson, UCLA have 8. Excludes Notre Dame which isn't in a conference.","Week 1 Match-up Preview Thread: Navy Midshipmen @ Hawai'i Rainbow Warriors","Flames Football agrees to multi-year agreement with ESPN | Liberty University","[Week 0] Best of /r/CFB Thread","Week 1 Match-up Preview Thread: Northern Illinois Huskies @ Iowa Hawkeyes","Geaux Tigers?","Week 1 Match-up Preview Thread: Coastal Carolina Chanticleers @ South Carolina Gamecocks","What a Jim Harbaugh spread offense could look like in 2018","Weekly G5 Discussion Thread","Neutral Site Games","Report: Baylor Secretly Infiltrated Sexual Assault Survivor Groups","Teaser for Civil ConFLiCT documentary by TheUConnBlog","Houston's Ed Oliver is too good to emulate","Week 1 Match-up Preview Thread: BYU Cougars @ Arizona Wildcats","USA today Bowl projections: College Football Playoff predictions include one party crasher","Compilation of Best Reporters for Each Team","Who Makes the Playoff? The Final Simulated Season","Week 1 Match-up Preview Thread: Missouri State Bears @ #21 Oklahoma State Cowboys","Week 1 Match-up Preview Thread: UNLV Rebels @ #15 USC Trojans","Week 1 Match-up Preview Thread: Stephen F. Austin Lumberjacks @ #19 Mississippi State Bulldogs","From the Army to the sidelines, Curtis Luper is the key cog behind TCU’s recruiting","ND Michigan Preview as written by NDNation Commenters - Notre Dame, Our Blogger","Week 1 Match-up Preview Thread: UMass Minutemen @ Boston College Eagles","ESPN+ Reviews?","Week 1 Match-up Preview Thread: Syracuse Orange @ Western Michigan Broncos","[Follow Up] Miami continues to hold the #1 recruiting class in 2020 and 2021","Best young college football coaches and staffers under the age of 30","Boise State at Troy could be one of the best Group of 5 games of 2018","College football predictions: Nation's most overrated, playoff picks, 2018 Heisman favorites","Kickoff Games, Part II: 2008–Present","Expert picks: Who will make the playoff?","What determines how long ago a team and fans can claim to be a legacy/blue blood/etc? When does a team become a new blue blood?","Skip Bayless National Champion Pick....University of Michigan","Widow of former GVSU QB Cullen Finnerty files lawsuit against NCAA","College football's rising stars: The 30Under30 for 2018","How to Rank FCS Teams?","Tua Tagovailoa and Jalen Hurts listed as co-starters for week 1 vs Louisville.","What if Universities Gambled Endowment on Football? Week 0","Michigan Needs Notre Dame In Football More Than The Other Way Around","What would happen to college football, if state colleges become free?","Deondre Francois named FSU’s starting quarterback for 2018 opener vs. Virginia Tech","Minnesota is giving out tickets with the purchase of frozen pizza","Anyone going to GameDay? Would you like to take this r/CFB Flag?","Former Texas A&amp;M and Arizona LB Santino Marchiol no longer at Arizona","Recruiting Round-Up-8/27 Edition","How Each SEC Fan Base is Getting Ready for Week 1","Baylor Announces Greg Roberts, BJ Thompson, and Ashton Logan are suspended for the entire season opener vs ACU and first half of the UTSA game. Also, JaMycal Hasty is suspended for the first half of their B12 opener vs kansas","18 Things to Watch in 2018: Storylines, controversies kicking off the college football season","Team ATS records, cover % and avg point diff vs spread so far this decade (2011-2017)","Felipe Frank's will be Florida's starting QB.","Team with the Most Wins since Each Year","Nebraska LB Avery Roberts transfers to Oregon State","Friendly reminder that GVG is the best way to schedule your Saturday","Mississippi State QB Nick Fitzgerald suspended for Stephen F. Austin game.","Kellen Mond to start at quarterback for Texas A&amp;M in opener","Kelly Bryant Officially Named Clemson’s Week 1 Starter","Dwayne Haskins Named the Starting Quarterback for Ohio State, But “The Plan is to Play Tate [Martell]”","Recently reinstated Penn State LB Manny Bowen is no longer with the program.","College football's Top 25 most quotable coaches","New Endzone at Ross-Ade Stadium featuring Train Tracks for out of bounds lines.","The NCAA records book now lists Oklahoma State for 2011, Notre Dame for 2012, and Alabama for 2016 (in addition to Utah for 2008 and UCF for 2018).","Nebraska Quarterback Discussion &amp; Speculation Thread","SB Nation falls for fake internet rumor that yesterday's video of the Civil ConFLiCT trophy is fake","What record would Kansas need this season for HC David Beaty to keep his job?","Marble Run: SEC Championship Marble Race (2018)","Coaches Film Room to return for FSU vs VT on Labor Day","AJ Bush will be starting QB for Illinois vs Kent State","Final Drive: Humboldt State (D2) video series is documenting the team's last season","Miami QB Malik Rosier knows title chances depend on him","Michigan State's Raequan Williams won't let brothers' murders stop him","KU offensive lineman arrested on suspicion of DUI in Lawrence","What “narratives” are most likely to form after Week 1?","Week 0 - Applaud Your Team","What's the best example of, \"It's XXX's Heisman to lose\" that didn't end up winning the Heisman?","B1G increases size of travel roster for 2018 season","AP: Meyer’s texts raise open records question for Ohio State","The B1G Roast: We Back - After an uneventful, scandal-free offseason, the Big Ten is back!","Quarterback News","ESPN having a Goodyear BlimpCast as part of Virginia Tech vs. FSU Game","Arizona plays every version of the cougars this year","[Bruce Feldman]: Devin Asiasi, Soso Jamabo, Osa Odighizuwa, Mo Osling, Moses Robinson-Carr and Boss Tagaloa won't play for #UCLA this week vs #Cincy for a violation of athletic dept. policy.","Good podcasts for learning more about the mechanics of football?","Time-lapse of field replacement at Williams-Brice","Would Kansas have the patience to allow Craig Bohl to rebuild their program?","Which top 10 college football team is the most likely to finish the season unranked?","Terry Wilson will start at quarterback for Kentucky","Michigan State football schedule: Game-by-game predictions","UNC Football and the definiton of insanity","USA Today NCAA 1-130 Re-Rank","An in-depth look at Clemson DC Brent Venables' defensive scheme","The Bayou Bucket trophy has been updated","The History of Aggie Football Since the Internet (2018 Update)","Former JUCO star Kamilo Tongamoa suspended for Iowa State opener","/r/CFB's 2018 NCAA Football Simulated Season - Week 14+ Results and Bowl Predictions","Austin Allsup Awarded a Longhorn's Scholarship","Drake Stoops stepping out of father's shadow, ready to make name for himself at Oklahoma","An early entry for the All-Name Team: 2021 QB General Booty.","Quarterback Brandon Dawkins leaves Indiana's program","Gamecocks' field ruined by Jay-Z, Beyonce show","Ryan Day deals with new role","The Uni Watch college football preview","USC Names JT Daniels the Starting Quarterback","Dear CFB: Going to a Game Advice Thread","The 2018 G5 Super Cup: Semifinals","Pitt 1934 national championship not recognized?","Lee Corso picks Wisconsin Football to win National Championship","Alabama and Auburn have a chance at history with both starting the season in the AP top 10","24 times Florida’s NCAA-record scoring streak was in peril","Meet Michigan Tech’s incoming freshmen QB, Steele Fortress","The Way Back to Syracuse | By Rex Culpepper","Troy Selects Kaleb Barker as Starter vs Boise State","A Look Inside the New North Endzone at Razorback Stadium.","MS Paint Monday - Week 0 Recap / Week 1 Predictions (8.27.2018)","Michigan 2018 Hype Video - \"Prove Them Wrong\"","Week 0 Matchup Thread Poll Results","2018 Depth Charts Discussion","Opening lines for week 1 games","To UConn Program, 'Block C' Represents More Than Just A Logo","Sorry, Lane. Hello, Chip: Revisiting 2017 predictions and making new ones for 2018","[11Warriors Film Study] A Preseason Primer on the Ohio State Running Game","2018 American Athletic Conference Football PSA","r/CFB People's Championship: Elite Eight","Family finds way forward after QB Tyler Hilinski's suicide","The Way Back to Syracuse (Rex Culpepper in the Players' Tribune)","The anatomy of a Bryce Love 50-yard touchdown run","Penn State Football Tries Out New ‘Call Of Duty’ Game Thanks To Saquon Barkley","FBS Playoff Eliminator - 2018 Week 0 Bingo Board","College football gambling cheat sheet for 2018","Athlon's predictions for the 2018 FCS season","Maryland football’s troubles are further proof athletes need more power","NCAA \"Recognized\" National Titles in 2018","Nebraska ends QB battle and releases depth chart: Freshman Adrian Martinez is listed as starter over redshirt freshman Tristian Gebbia","The Civil ConFLiCT trophy shows up on Twitter and apparently has not been destroyed.","In 1991, UVA's Matt Blundin had a 19-0 TD-Int ratio in the regular season. Because of the NCAA not counting bowl stats at the time, he owns single-season records for most pass attempts without a pick (224), and lowest interception percentage (0%)","Three University of Michigan walk-ons awarded scholarships","Michigan starting WR Tarik Black injures foot","Ranking college football's 10 best offensive masterminds","Recruiting Round-Up-8/26 Edition","Lane Kiffin on OU’s Kyler Murray, “These are the guys you want to play the least”","CFB Wallpaper Generator","Are preseason polls any goods (part 3): overrated college football teams - Fat Tailed &amp; Happy","I created a Microsoft Access database of every college football game for the purpose of keeping track of scorigami","Previewing the 2018 College Football Season (247)","Whats the deal with ESPN+?","Peterson: Iowa State Football is in the best shape it's ever been in","In honor of Hawaii's upset win over Colorado state, here's one of the most underrated jerseys in college football history","Arkansas LB Grant Morgan, PK Connor Limpert and DB D’Vone McClure get awarded scholarships after practice.","Say something nice about your week 1 opponent.","Canadian Universities Open Their Season This Weekend","Ohio State coaches finally to talk with the media on Monday","/r/CFB Game Threads","Grizzly football roster full of Montana natives, highest number of Treasure State players since 2007","Do you have a player on your team that is/could be the best player in your school's history at his position?","Successful True Freshman Quarterbacks","Wisconsin band director Michael Leckrone announces that he will retire after this season. He has been the Badger's band director since 1969.","Chaos is the key to Notre Dame's CFP hopes","[Postgame Thread] Hawai'i Defeats Colorado State 43-34","[Week 0] Weekly Wind Down","2019 3* CB Brandon Crossley Commits to SMU","10 years later, the 2008 Utah Utes are your national champs according to the updated NCAA record book.","Retired Number / Ring of Honor Qualifications?","The NCAA has officially recognized UCF's 2017 National Championship. Page 115 of their just released 2018 Records Book.","[Postgame Thread] Wyoming Defeats New Mexico State 29-7","[Postgame Thread] Rice Defeats Prairie View A&amp;M 31-28","Recruiting Round-Up-8/25 Edition","Sanders Names Logan Marchi Bucs Starting Quarterback","[Postgame Thread] UMass Defeats Duquesne 63-15","[Game Thread] Hawai'i @ Colorado State (7:30PM ET)","The 2018 G5 Super Cup: Quarterfinals","[Postgame Thread] North Carolina A&amp;T Defeats Jacksonville State 20-17","I can't wait to watch those horrible Chevy commercials again now that College Football is back. What's your most hated repeated commercial during the season?","Ottawa-Arizona beats CETYS Universidad 51-19 in international friendly and inaugural game for OUAZ","[Game Thread] Wyoming @ New Mexico State (10:00PM ET)","Dreaming about the playoff - Week Zero","[Game Thread] Duquesne @ UMass (5:30PM ET)","2019 4* LB Jashua Allen commits to Colorado","Barry Sanders vs. The 2017 Field","Today marks 0 days until kickoff! Let us remember November 22, 2014 when Virginia Tech and Wake Forest slugged it out to a 0-0 score at the end of regulation.","Penn State OL Charlie Shuman awarded scholarship in video when \"Big Helping Little\" family is visiting.","[Game Thread] Jacksonville State vs. North Carolina A&amp;T (7:00PM ET)","WE MADE IT BOYS FOOTBALL IS BACK TODAY","[Game Thread] Prairie View A&amp;M @ Rice (7:00PM ET)","2020 4* DT Jamil Burroughs commits to Georgia","What are some gameday recipes you all have?","Washington State takes different route in hopes of moving past Tyler Hilinski's suicide","Fans of the smaller schools, especially in the Mountain West, MAC and Sun Belt, what's the gameday atmosphere like?","Name a moment involving you rival that honestly gives you chills.","BOLD Predictions","2018 Season Prediction","The 2018 G5 Super Cup: Round of 16","Beyond Camp - Documentary of 2018 Texas Tech Football Fall Camp","[Week 0] Saturday Tailgate","Kentucky OL Landon Young out for the season with a knee injury","Anyone Made Your Own Cornhole Set or Other Tailgating Game? Tell Us About It!","The College Football World Cup Part III","[Week 0] Picture/Video/GIF Thread","Records set in 2017","Your Heisman predictions?","Bottom 10 Since 2014","Today marks 1 day until kickoff! Let us remember when Auburn's Chris Davis ran 109 yards with 1 second left on the clock to upset No. 1 Alabama in what is infamously known as the Kick Six.","Memphis Football Preview: Quarterbacks, Former Top 10 QB Brady White Set To Lead Tigers","2019 4* LB Kane Patterson decommits from Ohio State","Michigan State RB Austin Andrews announces transfer","Mexico's Monterrey Tech goes 17-all tie with ranked No. 2 D-III Mary Hardin-Baylor","Matt Campbell’s Victory Day is a really special event.","Wisconsin Football: Five Young Badgers Poised to Make an Impact in the Future","The most experienced team in FBS? The two year old UAB Blazers","A statement from Urban Meyer.","I received season ticket awesomeness!","Chick-Fil-A Is Coming To Notre Dame Stadium For The 2018 Football Season","What if every conference was only allowed one team?","If the Rankings were Flipped - Preseason","Illinois and, briefly, Michigan QB Jeff George Jr. to transfer to Pitt.","As Maryland AD, Anderson used school funds to defend football players in sex assault case","Iowa State suspends 4 players indefinitely for \"multiple incidents of poor choices and behavior.\"","ESPN has neglected Colorado State in their countdown to football videos, so CSU made their own","Recruiting Round-Up-8/24 Edition","\"Time waits for no man\". - Tre Bryant's statement about retiring from football.","With kickoff happening tomorrow, here is a reminder about the rule changes going into effect this year","Bobby Hauck’s return to Big Sky has ripple effects across the league","True Freshman Artur Sitkowski Named Rutgers Starting Quarterback","The Ultimate 2018 College Football Preview based on 9,000 simulations of every game","Comcast reaches a deal with Big Ten Network [John Ourand]","What was the CFB worlds biggest-ever overreaction to a Week 1 game result?","Bryce Love: Why I Turned Down the NFL for One More Season of College Ball","On the eve of the 2018 College Football season, let's do W/L predictions for your team's 2019 season","2019 3* ATH Deonte Stanley commits to UCF","Big Ten statement on Ohio State: \"We support the findings of the investigative team led by Mary Jo White, the recommendations of the Board of Trustees &amp; the decision made by President Drake in consultation with the Board.” The B1G had no further comment","Attorney for two Maryland players accused of sexual assault in 2017 says he was hired by DJ Durkin, not Anderson","Should they go undefeated again, do you see UCF getting any real playoff consideration?","Big XII Uniform Tracker Episode 0: “SEASON PREVIEW”","Nebraska running back Tre Bryant retires from football because of knee injuries","Remember the Laremy Tunsil draft night scandal? SB Nation recently released a compelling documentary on the subject.","After an embarrassing month for football, are coaches out of control?","Why is there college football a week before Labor Day? Thank Hawaii","LET’S WATCH A VIDEO ABOUT 1991’S HOTTEST 5-6 FOOTBALL TEAM: VIRGINIA TECH","EVERY 2018 COUNTDOWN VIDEO FINAL LIST!","Interactive FBS Schedule Map","Hello again, Bottom 10 friends","Jimbo and TAMU open to inquiries after Santino Marchiol allegations.","If you had a college football monkey's paw, what would you ask?","Ryen Russillo is launching a weekly college (and pro) football podcast on The Ringer. Starts August 29th.","LSU QB Justin McMillian Transfers to Tulane","What new starter are you most excited to watch?","Weekly SEC Discussion","130-team 2018 college football rankings and strength of schedule","Which teams will have their season basically over if they lose their first game?","CFB Balderdash","SBNation's Jason Kirk gives two full bowl projections: The Boring Ones vs The Fun Ones","Sagarin preseason ratings 2018","Offseason is finally over! Here's a top 25 ranking of the best(worst?) offseason posts!","#ScholarshipAlert - Texas WR Philipp Moeller receives scholarship.","Indiana Running back Morgan Ellison suspended indefinitely","Updated 8/23: S&amp;P+ Win Total Probability Distribution Graphs","Unnamed Ohio State assistant at strip club with Zach Smith? Tom Herman","Which preseason top-10 team will finish 2018 unranked, and vice versa? from the SBNation Crew","what's with all LSU's QB transfers?","History of Kickoff Games, Part I: 1983–2004","All About the Northwestern Eagles — An /r/CFB Original Look into the D3 Program","Erskine bringing back football for 2020 season.","Wazzu WR Rodrick Fisher arrested for driving under the influence","2018 ACC Power Rankings: It's Clemson and everyone else","How to win a national championship in Texas, explained by a team that did","For the best viewing experience, do you need to get ESPN+?","The Gospel of Herm Edwards: New ASU Coach on How He'll Defy Expectations","Deshawn McClease receives Medical Redshirt for 2016 season, now listed as a RS Sophomore","247 Sports Just Released Their Top 100 Recruits for 2021","Records from the past 10 years, the ACC (2008-2017)","SEC Predictions","Who Make the Playoff? Simulated Season #3 of 4 (this one is a *dandy*! Come in, UGA fans)","Does an undefeated SMU get a playoff nod?","The 10 best FCS uniforms, according to fans","The 2018 G5 Super Cup: Round of 32","'The Camp' 2018: Episode 4 - Inside look at the Wisconsin training camp.","CFB Stadium Bucket List","Free Talk Friday, 8/24/2018","Anyone else here that miss these CFB intros?","Recruiting Round-Up-8/23 Edition","The AAC just released their commercial for this year.","All 2018 Schedules in One Table","South Dakota State Sends Strong, And Very Wrong, Message With Stiegelmeier Penalty","Virginia Fourth Year and Walk-on CJ Epps Earns a Full Scholarship","IU football’s tight ends strive to emulate NFL rookie Ian Thomas","A day-by-day guide to Kickoff Week","Common Match Ups on College GameDay","Freindly Reminder that Pitt holds the CFB Winners Belt going into Week 1","Urban Meyer Decision Megathread Overtime: Opinion, Discussion, and Reaction Thread","Breaking: #LSU CB Kristian Fulton has been reinstated by the NCAA, his father tells @SInow. He must pass a drug test, and he's in and eligible.","Has there ever been a major rivalry where the two teams just stopped being rivals?","ACC teams as Simpsons characters","Blake Barnett will be USF's starter","Pre-Season Freshman Friday - Got Questions About CFB? Get Answers Here!","New alternative Louisville mascot looks like it has genitals.","[Post-Game Thread] NAIA: Keiser defeats Pikeville (OT) 24-17; Keiser's inaugural game","Cut UNR Football player goes scorched Earth on Twitter","Distractions abound for Warriors and Rams","Former Maryland AD Kevin Anderson intervened in sexual misconduct case involving football players","r/CFB People's Championship: Sweet Sixteen","How the internet created, and then revived The $5 Bits of Broken Chair Trophy","College Football Playoff's Bill Hancock tells The Athletic CFB that the Ohio State suspension \"does not affect Gene Smith’s status on the selection committee.\"","Vince Testaverde will be the Albany Great Danes' starting QB","Senior Texas DB Jarmarquis Durst earns surprise scholarship","Penn State’s ANTH 140 course covers the anthropology of drinking, using tailgating at football games as a case study.","Colorado State, CU sign deal to renew Rocky Mountain Showdown in 2023 and 2024","Where do you see the state of college football in 10 years, 20 years from now?","2020 4* CB Isaiah Dunson commits to Florida State","The Penn State University Police Department has made an arrest related to the recent social media threat that targeted Beaver Stadium during the upcoming football season.","[Game Thread] 2018 NAIA Kickoff - CCU @ Union, SWAG U @ Evangel, Carroll @ RMC, Reinhardt @ Bethel, DSU @ DWU","Weekly Pac-12 Discussion","Today marks 2 days until kickoff! Let's remember the 2 timeouts Florida took in the last minute of its 49-10 win over Georgia in 2008 on its way to winning the BCS!","Clemson DE Richard Yeargin Medically Retires","PRE-SEASON TRASH TALK","Last time teams won back-to-back conference titles","Urban Meyer suspended 3 games","I'm getting into CFB, but I need a FBS team to follow. Anyone wanna pitch their teams' cases to me?","/u/Rivalrybot 2018 off-season in review","2019 4* ATH Tamauzia Brown commits to TCU","What's your favorite HYPE song?","I'm here to pay off a bet. Please upvote for visibility.","North Dakota announces 2018 football captains","Reverse Sheep, a weekly futures prediction game: Play Week 0 here!","K-State defensive end arrested for unpaid parking tickets in Manhattan","Average Opponent FPI","What if we had an 8-team playoff from 2005-2017?","After McMurphy dropped the text messages, Brian Voltolini and Urban \"discussed at that time whether the media could get access to Coach Meyer’s phone, and specifically how to adjust the settings on Meyer’s phone so that text messages older than one year would be deleted.\"","Are there any historical or current 3 way rivalries? (With equal hate)","Urban Meyer Decision Megathread Fifth Half: Cinco de Meyer-o","Jeremy Pruitt flashes comedic side in insurance commercial","Which state wins the most?","Sure-handed tight end Evan Butts poised for big final season with Virginia.","Summary of BlauGelb's nuke posts","What school do you think has the best fight song in the NCAA? (Preferably other than your own)","Why is \"recruiting\" always cited as a benefit to neutral site games... isn't meeting with players face-to-face in off-campus settings that aren't in-home visits not allowed?","Peyton Ramsey named starting QB at Indiana","2019 3* RB Tony Mathis commits to WVU","New Louisiana-Monroe Uniforms!","UNT's Graham Harrell on QB Mason Fine: \"If he were just taller, he’d be the No. 1 overall draft pick in a year\"","UW's Rafael Gaglianone, sidelined early in camp because of back problems, kicking again","Trotter: Inside Barry Sanders' record-setting season","Brett McMurphy releases copy of 2015 police report indicating Zach Smith was arrested, was \"revised\" 3 years after the incident by Powell police department","The Last Urban Meyer Decision Megathread: It's About Time (We Hope)","SMU’s Jordan Wyatt will wear #23 this season, continuing a tradition of honoring former player Jerry LeVias.","Board of directors from @SDSU came to (Tijuana, Mexico) to announce that they are looking forward to host a college football game here @FOXSportsMX @SDSUFootball","2019 3* RB Darwin Barlow commits to TCU","What is the highest number of TDs your team has scored against a rival in modern history?","2019 3* S Tykee Smith commits to WVU","The Dakota Marker: What SDSU vs NDSU tells us about rivalry","Urban Meyer Decision Megathread: Fourth Half","What position group on your team are your fans potentially overrating?","Deputy Title IX Coordinator Miechelle Willis Informed Gene Smith of 2015 Zach Smith Incident.","Why are there so many people in the meeting rooms?","Earthquake Games from CFB Kings","Pac-12 Predictions","Can CTE Prevention and Football Coexist - A Former NCAA D-Lineman Perspective","Wisconsin WR Quintez Cephus seeks dismissal of sexual assault charge","Urban Meyer Decision Megathread: Third Half","Does Wisconsin need to go undefeated in order to make the playoffs?","Dave Campbell's All-Texas College Team Offense","UNC Football: Aaron Crawford suffers injury","Texas reportedly offered Texas A&amp;M a home-and-home series in '22 and '23 but was turned down","Why is Michigan-OSU a bigger rivalry than Michigan-MSU?","Division II Preseason Poll (d2football.com)","Season-Long User-Friendly Bet","Urban Meyer Decision Megathread: Second Half","Marchiol's allegations against Texas A&amp;M could be way of future with college free agency","Is Arizona JUCO football dead after the 2018 season?","Public Records related to the investigation into allegations involving Urban Meyer","Insider's Guide to College Football Tailgating","Dawgs Insider Pre-Season Preview Part II (x-post from r/UGA)","[Game Thread] Ohio State - Urban Meyer Press Conference (8:50 PM ET)","Keeping with the trend, here is UL giving a walk-on a scholarship","Georgia State names Aaron Winchester as team captain. Likely an indication that he won the starting QB spot?","Recruiting Round-Up-8/22 Edition","Idaho State cornerbacks have tall task with limited depth in offensive-minded Big Sky","Pat Narduzzi on playing Duquesne Dukes, Robert Morris: 'Why not?'","Urban Meyer Decision Megathread","2018 Preseason Coaches All-SEC Football Team announced","The 2018 G5 Super Cup: Rounds 6 &amp; 7","OSU statement on Urban Meyer and Gene Smith","UGAs 25 Biggest Questions 2018","Question... Does a conference have any real power in a teams operations? In THEORY could a conference take action to suspend a coach?","Interview with Mark Dantonio recollecting on his 100 wins as the Spartan's head coach. The levels of hype are too real right now!","Every stadium nuked - ACC edition (+ Notre Dame)","Former UF QB Luke Del Rio says former Coach Mcelwain would abruptly pull walk ons scholarships while at UF","[College GameDay] tweets picture of former UGA QB Jacob Eason instead of Jake Browning to represent Washington","[Dan Hope] Gene Smith has also been suspended from Aug. 31 through Sept. 16.","Recommended sites for following live scores on gamedays?","Jimbo will owe $0.00 if he leaves A&amp;M but is owed every cent that is left on his $75 million contract if he is fired (without cause).","Are college preseason polls any good?","2019 3* OT Ben Scott commits to ASU","4* 2019 OLB Mohamoud Diabate commits to Florida","8 Rutgers football players charged in credit card fraud scheme","r/CFB People's Championship: Round of 32","Guys, the RedditCFB twitter account is suspended!","Kyler Murray named starting QB for Oklahoma","Neutral site games shouldn’t be in either of the states of the two teams playing."]