["WV State Police seize $10K from couple without charging them with a crime","California Highway Patrol officer tickets driver for going too slow in fast lane.","$109k personal bill for heart attack - even when insured","Judge dismisses all charges against 3 'extremist Muslim' New Mexico compound suspects","Teen missing for a year after witnessing murder found alive in Ohio basement","Drinking water to be shut off at all Detroit public schools","Elon Musk doubles down on 'pedo' claims against UK cave diver","California Hunter Mauled By Bear After Shooting It With Arrow","Mom of 5 killed in crash after boyfriend cut her brake lines to make crack pipe, cops say","More than 150 arrested in massive ICE raid in Texas","Black candidates win primaries for governor in 3 states","In Pennsylvania, Defendants Pay A Fee Just To Plead Guilty","Muhammad cartoon contest in Netherlands sparks Pakistan protests; Islamist leader says ‘only jihad’ is sufficient to punish ‘blasphemous’ Wilders stunt","Former Virginia police chief charged with rape, abduction","North Texas meth bust. Over 600 pounds of methamphetamine valued at over $6M seized from the small town of Electra,TX.","Nevada collects $69.8M in marijuana tax, exceeding expectations","Dozens at Facebook Unite to Challenge Its ‘Intolerant’ Liberal Culture","Opiate addicts are intentionally hurting their pets in hopes of getting their veterinarian to prescribe pain killers.","Boyfriend of distressed woman seen in doorbell video found dead in Lake Conroe home","Louisiana asks the Supreme Court to limit LGBT protections","FBI rebuts Trump tweet about China hacking Hillary Clinton's email","Moody's downgrades Ford's credit rating to one notch above junk bond status","Marines 3D-print concrete barracks in just 40 hours","Scientists unpick how cannabis component may fight psychosis","Key witness in prison sex case dies in car wreck","The Latest: Ex-cop guilty of murder for killing black teen","Gun policy, Under Armour weakness hit Dick's Sporting sales","California becomes second US state to commit to clean energy","After weeks of uncertainty, Papadopoulos decides to accept plea deal with Mueller","Sweet surprise: Lab tests reveal all 13 pounds of white powder is sugar, not dangerous drug fentanyl","Several staff members sickened by unknown substance at Ross Correctional Institution","Officers arrested a mom for trying to pick up her child from school drunk","Charleston officer charged after leaving his two kids in locked car, court records say","Missouri raises the minimum marriage age to 16.","Japan to lay groundwork for developing flying cars","L.A's newest street: Obama Boulevard","Cody Wilson, founder of Defense Distributed, speaks out on court order banning 3D-printed gun blueprints from being posted online","Feds: Utah biofuels company owners stole $511 million in IRS renewable energy credits","An entrepreneur in China has turned the cockroach into an eco-friendly creature to deal with kitchen waste.","Blood pressure drug recall: FDA warns of potentially 'life-threatening' labeling mixup","More than half of Michigan students failed M-STEP literacy exam","Mom charged after drugs in breast milk killed baby, prosecutors say","Uber driver in Florida shoots man chasing him","Charge: Mount Vernon man decapitated girlfriend after he 'had spoken with God'","Father of the Modern Steel Drum, Ellie Mannette dies at 91 - Trinidad and Tobago Newsday","U.S. is denying passports to Americans along the border, throwing their citizenship into question","Morgan Stanley raises its Amazon price target to the highest on Wall Street, predicts $1.2 trillion valuation","Nurse under investigation after posting on anti-vaccination page","A Serial Cat Killer Is on the Loose in Washington State","STDs continue rapid rise in U.S., setting new record, CDC says","Winston-Salem women charged with helping children smoke","Former South America football boss Juan Angel Napout jailed for nine years in US","States Ask Supreme Court to Limit LGBT job Protection","Rare insects and reptiles stolen in what is suspected to be an inside job from Northeast Philadelphia insectarium","US Navy seizes hundreds of weapons from boat in Gulf of Aden","Brad Pitt's Charity homes in the Lower Ninth Ward are falling apart 13 years after Katrina, residents say","Winter Haven officer arrested for breaking suspect's leg","'40-Year-Old Virgin' Actor in Prison for Attempted Murder To Be Released","Pa. man kills wife with ax, then himself: cops","College Board's SAT exam may have been leaked ahead of test","Louis C.K. performs stand-up for the first time since misconduct allegations","Hundreds of endangered turtles killed in illegal fishing net","California Becomes First State to Eliminate Bail for Suspects Awaiting Trial","'They're liquidating us': AT&amp;T continues layoffs and outsourcing despite profits","Canada says NAFTA agreement possible by Friday, but hard work ahead","San Jose Diocese buys bishop $2.3 million retirement home","The police officer who fatally shot an unarmed black man in Tulsa now teaches a course on how other cops can 'survive' controversial shootings","Caught On Camera: Waffle House Employees Fight Over Who's Does The Dishes","New estimate raises second quarter economic growth to 4.2%","Oregon man bemoans van lost to sea: 'It was everything I owned'","Live World War II grenade found in Murray, Kentucky","San Jose family billed $13,470 for half-hour of iPhone internet","Mystery woman in what could be handcuffs rings doorbells, disappears","Clint Dempsey retires from Seattle Sounders, United States national team","Ex-con who kidnapped 2-year-old gets 24 years in prison","In Chilean desert, global thirst for lithium is fueling a 'water war'","Magnitude 4.4 earthquake strikes southern California","Woman claims 'marriage scam' tricked her into marrying complete stranger during mock wedding","Gov. Brown signs bill eliminating money bail in California","Hurricane Maria Caused 2,975 Deaths In Puerto Rico, Independent Study Estimates","Swarm of 20,000 bees attack New York City hotdog stand","'Unexploded' naval mine floating in Puget Sound near Seattle, WA.","Deep-sea coral reef discovered near Charleston, South Carolina","Activists block Boeing entrance with bus 'in solidarity with the people of Yemen'","Judge denies Larry Nassar's request for new sentence","Air Force investigates report of child abuse at one of its child care centers","Owner of company that makes untraceable 3D-printed guns says he’s begun selling plans online, despite court order","FERC changes tune, partially lifts Mountain Valley Pipeline construction ban","Man rescued from baling machine near Golfcrest","Video: NYPD beekeeper tackles swarm in Times Square","3 men face almost 1500 charges of beastiality.","Police investigators say 5 Arizona officers were justified in beating man","Vatican erases pope's remarks about psychiatric help for gay children","Pompeo’s NK visit cancelled because of demands for immediate end-of-war declaration, NIS says","SF police checked on missing man 3 times before finding headless torso in fish tank","Report: Headless corpse found in fish tank in San Francisco - Story","Portland mom punches stranger in face to stop her child from being abducted, records show","Philly refiner plans $120M plant to convert food scraps to fuel for trucks and buses","Germany, seeking independence from U.S., pushes cyber security research","Health District: Kissing bug tests positive for Chagas-carrying parasite in Wichita County","San Jose: Body seen hanging from tree investigated as suicide","Police in New Mexico praise men who shielded others after gunfire broke out","600 homes repaired, 26 million meals served and thousands helped through JJ Watt's relief fund","“Fleshlight” Discovery leads to Spring Man’s Conviction on Three Child Pornography Charges","Class-action lawsuit launched against Ontario government over cancellation of basic income pilot | The Star","School resource officers caught illegally selling soda to students","LATAM Airlines to lay off 1,200 Brazilian employees","Cheddar’s confirms 500,000 customer credit cards targeted in cyberattack","ASD: Dimond HS hazing incident being investigated","2 Workers Die in Scaffolding Collapse Near Disney World","Members of Eastern European Organized Crime Syndicate Convicted Of Racketeering and Other Violent Crimes | USAO-EDNY","Child services employee shoots, kills herself inside Paramus NJ office","Official resigns amid debate over 'Drag Queen Story Time'","Woman sues ex-husband, a Fort Bragg soldier, in revenge porn lawsuit","Britain starts work on satellite system to rival EU's Galileo","Canada rejoins talks to stay in NAFTA, deal possible this week","Plans rolled out to deploy 2,000 hydrogen buses in China","Burger King banned from hiring migrant workers, placed on Employment NZ's stand-down list for year","Comcast's Cord Cutting Losses to More Than Double in 2018","Convicted Russian mobsters may face life in prison","Germany: 6 people injured during violent far-right protest","Missouri becomes first state to regulate use of the word 'meat'","US consumer confidence rises to 18-year high","Polling locations across Maricopa County plagued by computer issues","For a lark, and some funding, city of Mayo, Fla., changes name to 'Miracle Whip'","16-year-old charged with shooting German tourist in Alberta","U.S., Syrian security officials met in Damascus: official, report","4 Ohio children missing, believed to be in danger","Three-judge panel rules unconstitutional gerrymandering in North Carolina","Texas prison system slashes price of inmate phone calls by 77 percent","Fans pay their respects to Aretha Franklin in Detroit","Judge declares Utah women, 1 dead, to be legally married","Methadone clinic looks to build in Pearl River County, residents say otherwise.","Survivors of Jacksonville shooting to file lawsuit","Utah man threatened mass school shooting using 3D-printed gun, police say","US boy, 9, killed himself after homophobic bullying, mum says","Kushner Companies and Michael Cohen Accused of Falsifying Building Permits to Push Out Tenants","Preschool director admits she pulled knife, threatened to cut fingers off 4-year-olds","Nasdaq Hit Record Highs As Trade War Fears Recede","WI residents protest for justice after stabbing death with no charges","Vietnam demands Monsanto pays compensation for Agent Orange victims","Florida shooting: EA suspends events after gamers killed","South Sudan Rebels Refuse to Sign Peace Deal","Army builds new self-propelled Howitzer - cannon will hit 43.5 miles","UPDATE: 2 Kansas sheriff's deputies shot in Jewell Co., suspect shot himself","The Tesla Semi truck is already crossing the US alone","U.S. and Mexico have Reached a Trade Deal, paving the way toward Replacing NAFTA","Altice Files Opposition to T-Mobile and Sprint Merger","Toyota invests $500m in Uber as companies pair up to create driverless cars","3D-printed gun blueprints ban extended","Thieves replace Paraguay police rifles with toy replicas","Exclusive: Saudi king tipped the scale against Aramco IPO plans","Huge military exercise 'justified' - Russia","'Dine-and-dash dater' faces 10 felony counts for allegedly skipping out on dates before bill: report | Fox News","Olympia 6-year-old ends up in hospital after standing up to bullies","Illinois mom says cops were called when 8-year-old daughter walked dog alone","NASA Astronaut Candidate Resigns, a First In 50 Years","Archdiocese of Washington denies it was warned about sanctions against cardinal","U.S. government to pay $4.7 billion in tariff-related aid to farmers","Jacksonville shooter had history of mental illness, records show","North America’s first sex-doll brothel opening in Toronto","Nation's top student loan official resigns.","25,000 pounds of ground beef recalled due to possible E. coli contamination","Israel demolishes family home of Palestinian attacker","China could scrap two-child policy, ending nearly 40 years of limits","A Middle Georgia hospital is suing patients for unpaid bills","Dog sitting gone wild: Owner comes home to find shirtless men, lube in living room","Amazon hired an army of employees to say nice things about it on Twitter, and it shows how big its reputation problem has gotten","3D Gun Proponent Cody Wilson Defiant, Offers Firearm Blueprints for Sale","Pope Declines to Confirm or Deny Knowledge of Abuse Claims","Iran says it has full control of Gulf and U.S. navy does not belong there","U.S. judge extends ban of online 3-D printed gun blueprints","Saudi Arabia allows medical trainees to stay in Canada","Myanmar army 'must face genocide charges'","Ugandan pop star Bobi Wine has kidney problem after jail","Bad blood between North Korea and Japan keeps Abe on the outs","New Panama Papers Leak Includes Offshore Links To Lionel Messi, Cartier, Argentine Leader","Judge in 9/11 case at Guantanamo retires from military","Nasdaq hits 8,000 for the first time as US and Mexico move closer to striking NAFTA deal","These are the liberal memes Iran used to target Americans on Facebook","Man detained after scaling fence at LAX, approaching Delta plane","Lawrence police officer charged in shooting of black man during traffic stop","Tenth group of refugees fly out of PNG to be resettled in US","100 pounds of cocaine found hidden inside pineapple boxes","North Dakota woman dies after rare rodent-related illness","Tesla shares slip after company decides to stay public","A new dimension to marine restoration: 3D printing coral reefs","Center City Antifa counter-protest to Blue Lives Matter march ends in arrests","Middle school assignment asking ‘whom to leave behind’ sparks uproar","Intrepid Grandma Removes 2 Pythons From Barbecue Grill","DA: Teen who stopped attack was taught to shoot by late dad","30,000 turtle eggs seized but conservationist says thefts are down","Man Busted With 800 Pounds of Stolen Lemons","Jos Brech The killer of an 11 years old child is arrested after 20 years","Crisis counselors meet with kids at Denver elementary school after 9-year-old commits suicide","Lil Uzi Vert concert-goer throws Bible at the rapper during his performance","This Ferrari GTO is the most valuable car ever auctioned. It sold for $48 million","Rouhani vows to defeat 'anti-Iranian' officials in the White House","Report: Gunman Opens Fire at Madden Championship Event (Video)","Md. Officer Referred to 'Black Bad Guy' in Kids' K-9 Lesson","Instagram combats misinformation and trolls with three new features","Panel finds Baltimore Police Det. Sean Suiter's death was likely suicide, not murder, source says.","German antitrust watchdog plans action on Facebook this year","Bride cancels wedding, breaks up with fiancé after friends and family refuse to pay for $60G nuptials","Tech Industry Pursues a Federal Privacy Law, on Its Own Terms","NEISD to require clear backpacks for all middle and high schools students","Gamecocks' field ruined by Jay-Z, Beyonce show","Volkswagen’s Effort to Stop Scandals Needs More Work, Report Says","Sri Lanka mass grave: Dozens of skeletons found in Mannar","Verizon makes changes as lawmakers decry firefighters’ woes"]