["The /r/books book club selection for August is The Calculating Stars by Mary Robinette Kowal","Nick Mamatas, here. My short fiction was recently collected in The People's Republic of Everything, out today from Tachyon Publications. Feel free to ask me anything, about people, or everything.","\"Books on the Run\" trailer filled with free books for kids makes 20-minute stops in the community every two weeks; kids can take what they want","Margaret Atwood: ‘Things can change a lot faster than you think’","Some time ago a co-worker decided to use his locker as a free-access library, and it has been an excellent source for varying my reads and, basically, reading more.","I just finished Jane Austen’s *Emma*, and it completely changed my perspective on classics.","The Encyclopedia of Science Fiction: 17,500 Entries on All Things Sci-Fi Are Now Free Online","Letter from T S Eliot (Faber) to George Orwell rejecting Animal Farm, 13 July 1944","Literature of Uruguay: August 2018","'Pride and Prejudice' copy from 1813 to hit auction block in November","Fetishizing books and reading less","Is it normal to make notes while reading?","Just finished Haruki Murakami's THE ELEPHANT VANISHES","Why is Bret Easton Ellis’s novel titled after Elvis Costello’s “Less Than Zero?” (&amp; Imperial Bedrooms?)","How did your view on The Catcher in the Rye evolved over the years?","Finished A River in Darkness by Masaji Ishikawa and Wow, What a Read","Is social media influencing book cover design?","From Russell Brand to Cinderella, these are the books that are banned at the Guantanamo Bay detention camp","Guns of the South - Is there any time travel novel aching for a film adaptation as hard as this one?","East of Eden - questions and observations","Ten books to read in September","My library has added a running savings tally to their checkout receipt!","All the New Sci-Fi and Fantasy Books You Need to Put On Your Radar This Fall","Ever start a book at the wrong time, as in it followed a \"wrong\" book?","How to enjoy reading?","The 150th Anniversary Edition of Little Women by Vintage","A neuroscientist explains what tech does to the reading brain","Problematic Classics: Four Questions to Ask When Beloved Books Haven’t Aged Well","Have you ever read a comic? If not, why?","What book have you spent the most amount of time reading?","The quest to find William Shakespeare's library","'The God Delusion' by Richard Dawkins - Didn't really suite me!","Alien Civilizations by Issac Asimov","Wrongful termination suit filed against B&amp;N by former CEO Demos Parneros, revealing a failed deal to sell the company in June 2018","E-books sales are down by 3.8% over the same period in 2017, while downloaded audiobook sales are up 36.1%","I can't \"read\" Audio books","Where do we go when we read?","Do you find when reading in Public","What is the best book to open a bookcase that leads into a hidden room?","Michael Chabon fans what's your favorite book, of his?","Just completed 'The Girl on the Train' by Paula Hawkins, a bit disappointed.","Anybody suffer through Axis 360?","I just finished \"IT\" by Stephen King and have mixed feelings [Spoilers]","Don Quixote is like the medieval version of I Love Lucy.","I Wish I Hadn't Read That","Is this a bad habit?","Donna Tart's The Goldfinch - a poor man's Dickens isn't worth a Pulitzer","How do you encourage your parents to read?","I recently read Enter Night by Michael Rowe, and I don't think I've ever been more frustrated by a book.","40 Writers’ “Rules for Writing”","Online Tracker, Spreadsheet, or Notebook?","Finished Hard Broiled Wonderland and The End of the World, can you help me?","Just finished the first book \"Annihilation\" in The Southern Reach trilogy, is it worth reading the other two?","I’d like to thank you all for inspiring me to get back to reading. Just completed Flowers for Algernon","My Experience reading a Ranger's Apprentice","Why is it so hard for me to read?","Thank you","Dostoevsky's Notes from Underground is the best depiction of anxiety I've read","Just finished Norse Mythology by Neil Gaiman","“The Wind Cave” - Haruki Murakami","Barnes &amp; Noble Is Sued by Former CEO for Breach of Contract","I can't stop buying books!","Simple Questions: August 28, 2018","Just finished \"American Gods\" and I feel robbed of a good story.","Picking up reading as a hobby","Chronicles of the Second Circle...English translation?","Bricks &amp; Mortar &amp; Paperbacks","Borrowing e-books from a library in another country?","Book with most impact on you?","What are your thoughts on modern epistolary formats (text, social media, IM, emails)?","Southern Gothic authors","Crying at A Thousand Splendid Suns","Library Book Club Kits","Amazon's children's book subscription \"Prime Book Box\" opens to all in the U.S.","Just finished 11/22/63 ... I know I'm late to the party but THAT WAS SO GOOD","Favorite and Most Memorable Quotes From Books!","Which extract from Fahrenheit 451 summarizes the novel best?","The plot of how to train your dragon is actually amazing for a book","I’m Jeffrey Ford. I’m here to talk about my new novel, Ahab’s Return, and to answer all questions about my fiction and the writing life. Ask Me Anything!","What are some books that have challenged your opinions?","What Books Did You Start or Finish Reading This Week? August 27, 2018","Steve Jobs' widow blasts stepdaughter's memoir, Small Fry by Lisa Brennan-Jobs","Should I keep reading Dune? Spoilers ahead!","The Three Questions by Leo Tolstoy","I just finished reading The Outsider by Stephen King","Reading Science Texts for Fun","If You Could Add One Book to the High School Curriculum, What Would It Be?","I reccomend The Dry to anyone and everyone!","Feelings on 'New Adult'?","What’s your favorite book from a genre you usually hate?","Guilty pleasure: CJ Box","I just read \"All the Light We Cannot See\" by Anthony Doerr. I am amazed!","Genres? Does Not Compute!","I’m not crying, you’re crying...","The Master and Margarita - on Chpater 21 and utterly bored - should I continue to read?","Just read Andrew Sean Greer's \"Less\"","What would your fictional book be?","just finished: The Night Market by Jonathan Moore","Just finished Don Quixote part 1","\"A Tale of Two Cities\" - Charles Dickens","I'm looking for a book reading app, but not an app for reading books","How to read self help books?","RIP Kate Daniels series, what are some of your favorite parts? Also what do you hope will happen?","Should I just start a different book?","The Master Key System.","Knut Hamsun's Hunger made me feel like I was going to have a panic attack. Any books ever impact your mental state like that?","Lou Berney—Amazing Crime Fiction","John Dies @ The End by David Wong","Anyone else a fan of The Story of My Teeth by Valeria Luiselli?","Robin Hobb's Elderling Universe and feelings of deflation","Tired of obnoxious, uninteresting book advertisements.","Which one of you bitches is my mother?","Weekly Calendar - August 27, 2018","I finished Stephen King’s 11/22/63 last night. I’m still shaken up.","Martian Time Slip by Philip K. Dick","Skim reading is the new normal. The effect on society is profound","Just finished Louis de Bernieres’ “Corelli’s Mandolin”. I’m absolutely blown away.","Which director would you like to adapt which book?","The literature curriculum in American high schools seems to be a contentious issue. Do you agree with his writer's take on what should stay and what should go? What would you add?","What's your comfort book?","The Perks of Being a Wallflower is one of the greatest books I’ve read and ever will read","What book would you love to see get a high budget movie in 2018/2019?","*Spoilers* What book death hurt the most?","What book have you read and for the life of you not understand why others dont love it?","Websites like FanFiction.com but with original stories?","I love listening to conversations with authors, yet their books do nothing for me","Do you actively summarize paragraphs or chapters when you read?","The Stand - Stephen King. Thoughts?","Just Finished Lord of the Flies by William Golding and would like to discuss - Possible Spoilers","Marcel Proust’s Dream of Art: Proust’s mid-career struggles with writing led him to art criticism, which provides clues to the qualities prized by readers of In Search of Lost Time.","Educated by Tara Westover","Just finished reading 'American Psycho' - un-believe-able!! Best book I've read in years ~","Wuthering Heights - Tough Read","What do you guys think of Haunted by Chuck Palahniuk?","I read The Dark Tower #1, thought it was bad, so now I have no desire to follow it up","What are your favourite middle grade books? Do you still read middle grade stories as an adult?","Is Literature Dead?","eTextbooks improve learning and raise grades","The greatest gift I've ever received. A Copy of, \"A Study in Scarlet\" from 1914.","Just finished reading The Exorcist and I'm slightly conflicted.","Just finished 'Bonfire of the Vanities' - Wow!","A Man Called Ove (possibly spoilers?)","How does Asimov exposit so unobtrusively in the Foundation trilogy?","I have a questions about The Book of Lost Things by John Connolly.","Weekly FAQ Thread August 26 2018: What book changed your life?","The Ending of Fahrenheit 451","From the Guardian - The implications of skim reading as the new normal","Why do so few middle grade books feature LGBT characters?","About Gray - E.L.James","Question about \"Killing Me Softly\" by Nicci French","Mini-rant on troped up villains.","Escapism via Travelogues: \"The Kingdom by the Sea\" and \"Deep South\" by Paul Theroux","What does this line from Blood Meridian mean?","Is the Appendix in a book considered part of the book?","Concord Massachusetts' Main Library maintains a collections of over 6000 works dating back to 1646 of authors that have lived in Concord","Am I missing something about The Gunslinger?","Good books primarily for reading experience","Just finished the Mistrborn Trilogy - Wow.","Tor Publishing Issues a 4-Month E-Book Embargo on Libraries, Cites Retail Sale Concerns","Kurt Vonnegut: \"You will see this story over and over again. People love it and it is not copyrighted. The story is 'Man in Hole,' but the story needn't be about a man or a hole. It's: somebody gets into trouble, gets out of it again.\"","Is Stephen King worth it at all?","Why do people believe in trainable speed reading?","H is For Hawk by Helen MacDonald (Contains Quotes From Book)","The real Emily Bronte was red in tooth and claw, forget the on-screen romance","Just finished Blood Meridian...","I decided to make August a month of thrillers. Here's what I thought (NO SPOILERS) of Ultraluminous, Before I Go to Sleep, Bird Box, and The Innocent","Have you ever half listened to/half read a book?","Koestler’s Darkness at Noon often reads like a literal description of certain political climates. In particular is this one quote, which is uncanny:","\"It really is something\" is how ended the short story Cathedral in Raymond Carver's masterful anthology of short stories _Cathedral_","[Spoilers] Almost done with Throne of Glass! A question/plot hole:","What am I missing of The Black Company by Glenn Cook?","Kings collection in macrouniverse chronilogical order","Finished Dune (Book 1) Questions [Spoilers]","What one author is most representative of your culture's literary style?","Finished reading the ABC Murder by Agatha Christie","When Breath Becomes air - Paul Kalanithi","Sense and Sensibility Question (Spoilers)","My absolute obsession with The Kingkiller Chronicles","What's your opinion on the PoV characters style of narration like in The Expanse or ASOIAF ?","Simple Questions: August 25, 2018","International literature as a genre. What is international literature, how do we define it, and does it matter? Do you tend to read translated books?","Just finished \"The Art of Racing in the Rain\"","The Silmarillion","Is there an equivalent to Oscarbait for books? And if so, what might one consider to be some examples of it?","What's a first-edition-copy book that you have?","[Spoiler] What’s one thing your favourite book does that it’s Film/TV show doesn’t?","How to read books above your level. I thought this may be helpful for somebody.","The Prague Cemetery by Umberto Eco","Behind her Eyes by Sara Pinborough [Spoilers]","Just finished my monthly book club: Provinces of night written by William Gay","Snoop Dogg to publish cookbook, From Crook to Cook","I finally read The Giver, and may take a long time to recover...","Literature involving pregnancy/childbirth?","Book Brief #4 - Sapiens by Yuval Noah Harari","Everyman's Library are publishing the collected LA Quartet and Underworld USA trilogy (by James Ellroy)","Random International Book Generator","Book Review: Lost in Math by Hossenfelder","Candide by Voltaire","Pynchon’s Gravity’s Rainbow is disorienting","Unicorn books or books you want that are rare/expensive","Birdy Books for Kids (and the Kid Inside of You)","Book Brief #5 - ISIS: Management of Savagery by Ambassador Abdullahi Alazreg","Censorship and The Martian Chronicles by Ray Bradbury","Book Generalities","I'm 30 &amp; have only just discovered how awesome libraries are!","Weekly Recommendation Thread: August 24, 2018","Just read Prince of Tides by Pat Conroy. (Spoilers)","Reading non-fiction","How do you treat your books?","Any podcasts like Dissect but for books?","The National Book Festival is in one week","The Strange and Beautiful Sorrows of Ava Lavender","From James Baldwin to Carson McCullers, 10 Little-Known Children's Books by Famous Writers","Wandering Through the Uncanny Valley of Laura van den Berg's Fictions","Tom Hallman (The Oregonian): Want to make new friends by reading old books together?","One of the most incredible revelations in Bad Blood by John Carreyrou (about Theranos)","'Classics' are not a genre","Anyone else who doesn't get \"The Sirens of Titan\"?","Reconsidering The Astonishing Literary Legacy Of James Michener","Well, I officially have 333 books on my to read list.","Misery by Stephen King.","The Three Body Problem by Cixin Liu","The Blind Assassin - book within a book confusion","What is your unpopular book/author opinion?","I’m Emily M Danforth, author of the novel The Miseducation of Cameron Post, now a major motion picture. Ask me anything!","Just Read the Book Already: Digital culture doesn’t have to make you a shallow reader. But you have to do something about it.","A monstrous primer on the works of H.P. Lovecraft","Not sure if anyone else does this. but Whats a book you read that you only picked up bc you saw a total stranger reading it, and what did you think of it? Would you ever consider doing this if you havent?","Time to start my reading journey at 22...","No friends, love of discussing books, what to do?","Why We Forget Most of the Books We Read","Question regarding Jane Eyre's finances","What is so great about The Idiot by Dostoevsky?","Just started my book collection, about 20-30 books in of all 20th century warfare books, how can I accurately judge them?","I have 4/5 of the Assassin’s Quest left and I’m already feeling a great sadness at the coming loss","What are your ‘must buy’ books, or books that you need to keep handy on the shelf for the future (compared to borrowing from library)?","I drew (and colored) an alternate cover for The Cleric Quintet","I’ve read Gone Girl by Gillian Flynn, but Sharp Objects is really blowing me away.","Ray Bradbury recommended reading essays. What are some resources to accomplish this?","A Third of Teenagers Don't Read Books for Pleasure Anymore","Ernest Hemingway’s Guide to Life, In 20 Quotes","In praise of The Terror by Dan Simmons.","“Is there anywhere on Earth exempt from these swarms of new books?” moaned Erasmus in 1525.","I have recently begun reading World War Z","Reading retention and comprehension","Which books would you Gift, Write, or Destroy?","The Secret History - how do you imagine the characters?","45 Ways To Avoid Using The Word 'Very' - Writers Write","[crosspost - AMA in r/fantasy] I’m David D. Levine, author of the ARABELLA OF MARS trilogy and many short stories. I’m here to answer your questions and support The Pixel Project’s work to End Violence Against Women. AMA!","Reader Response: Is web content reshaping readers' expectations for books too?","Discussion Thread for Chapter 23 - 31 for The Calculating Stars by Mary Robinette Kowal - August Book Club","Literature from the 1930s: August 2018","Preserving paperbacks","In ‘Small Fry,’ Steve Jobs Comes Across as a Jerk. His Daughter Forgives Him. Should We?","How many books do you carry in your personal library? Would you ever consider borrowing your books to other people, and vice-versa?","Gave up on \"Children of Blood and Bone\" roughly halfway through and wanted to give my thoughts on it, just because I've got no one irl to talk with.","Secondary characters more interesting than the protagonist?","Just finished The Autobiography of Assata Shakur and wanted to share my thoughts","Empire of the Summer Moon by S.C. Gwynne","What's the most misleading book summary you've read?","Question about To all the boys I've loved before","N.K. Jemisin becomes the first Science-Fiction author to win the Hugo Award for Best Book 3 years in a row, one for each book in her Broken Earth Trilogy.","Going in Blind: Children of Time by Adrian Tchaikovsky","Best way to support authors through ebooks?","My Review on Call Me By Your Name by Andre Aciman","What do I need to know about the historic context of Under The Volcano","Read what you want","I just read The Great Gatsby by Fitzgerald for the first time and here are my thoughts","I just finished The Lord of the Rings: The Two Towers and I'm so reluctant to start the third book.","One of my favourite book series that I never see discussed by anyone","I just finished reading a simple favor by Darcey Bell.. (rant/review) (Spoilers)","The Library Library of Congress has changed their logo again. No it's not a typo.","What’s the worst novel ever? It might be this 19th-century train wreck","The Apology - Ross Watkins","The Void Trilogy - Not as good I hoped it would be - Personal Opinion","Read like the presidents: Obama's and Trump's summer reading lists","Read a Book from your Teenage Years challenge","Just finished Lord of the Flies, and I’m curious if anyone else struggled like me.","Bible readers, do you prefer KJV or ASV?","I'm Martin Myers, the author of the off-the-wall metaphysical fiction novel The NeverMind of Brian Hildebrand. Technically, I helped a man in a coma write it. How did I do it? AMA!","Top 10 books about strange towns","NYC Library Takes Novel Approach, Posting Books to Instagram","20 Quotes From Children’s Books Every Adult Should Know","Literature of Indonesia: August 2018","Just finished “The Natural” by Bernard Malamud. Anyone want to discuss?","For the first time ever, I bought a book on a whim, doing no research, knowing nothing about it.","Have you ever had a spiritual experience while reading a book?","Subtle Romance in “Never Let Me Go”","Everything wrong with HG Wells' time machine","Advice for reading when depressed","Is there a way to find a specific edition of a book?","The Judgment (Das Urteil) by Franz Kafka. In short, I don’t get it. Do you?","I just started reading Neuromancer, but I got confused and must understand something before going deeper in the book.","Literary Classics Come to Instagram With This Lovely New Project by the New York Public Library","Mary Reilly by Valerie Martin","Will the movie ever be better than the book?","Reading While Tired","What are some of the best books you remember reading for school that weren't normally required reading at most schools?","(Personal Opinion) People dump on him a lot, but Dan Brown has one great thing going for his books.","Just can't stay focused today, how to read on days your mind just can't focus ?","Question about edited length of \"The Wind-Up Bird Chronicle\"","Walmart and Kobo launch Walmart eBooks, an online e-book and audiobook store","Is there anyone else here who didn't like 1984?","I was forced to read \"The Kite Runner\" before school started","What is your best and worst pick on book-to-movie adaptation?","Question for artists about sketching (but it is related to reading, too)","How Scottish Bookseller Shaun Bythell Hits Back at Amazon and Rude Customers","Haruki Murakami is good but...","What are your general thoughts about the books of Canadian writer Douglas Coupland?","The magic of books","What are some of the most unique crimnal punishments , in fictional/fantasy books or stories that you've read?","I started reading \"Do androids dream of electric sheep?\" and I'm confused","[SPOILER ALERT] What do you think of Kristin Hannah’s The Nightingale?","100 Best Horror Novels And Stories: NPR","Author reveals all but one movie studio wanted to whitewash the film adaption of her book where the lead character is Asian-American.","An analysis of gender balance in Australia's top-selling 100 kids picture books, told as a picture book","Tablets are terrible for reading.","On not having the right context/knowledge for novels","Ender's Game/Shadow might be my favorite books of all time","N.K. Jemisin makes history at the Hugo Awards with third win in a row for best novel","An interesting read from one of the jurors for the Pulitzer Prize on how books are chosen and about not giving out the award in 2012","Why has no one told me to read books???","Heavy use of social media by UK children has been linked to lower levels of literacy for the first time.","I completed by book challenge after two years of struggling!","Is there a difference between an authorised biography and a autobiography written by a ghost writer?","When will the next Wolf Hall book be published?","Hello. I’m Rick Gekoski. I was born and educated in America, but have spent my entire life in England, where most of my books have been published. I’m now a dual citizen, and feel equally ill at ease in both countries. AMA","Collaborative authors question","I finally finished Atlas Shrugged by Ayn Rand. What a ride.","Weird turns of phrase, annoying errors","A James Baldwin Book, Forgotten and Overlooked for Four Decades, Gets Another Life","The Neapolitan Novels by Elena Ferrante","Great interview with the authors of \"Who Will Speak for America\"","Camus' The stranger: Meursault is a sociopath","Sad after the Perks of Being a Wallflower because i didn't get it directly","Anyone here who improved their reading speed?","Best job in the world? Luxury resort in Maldives seeks bookseller","I am actively disliking a tale of two cities [spoilers]","Simple Questions: August 21, 2018","Just read Battlefield Earth for the first time","Trouble understanding Bertrand Russell","I had to remind myself to breathe after finishing We Have Always Lived in the Castle","The Mistborn (no spoilers. I promise none and would appreciate in-kind)","I am a couple hundred pages into Seveneves and it is not the hard scifi I expected (mild spoilers)","Thoughts On Reincarnation Blues by Michael Poore","Today is H.P. Lovecrafts birthday - here are some free ebooks from r/FreeEBOOKS","Peacefully battling \"War and Peace\" books","I want to regain my passion for reading.","Haruki Murakami posters","Leo Tolstoy Creates a List of the 50+ Books That Influenced Him Most (1891)","A Third of US Teenagers Don't Read Books for Pleasure Anymore","Happy 128th Birthday to the master of horror, Howard Phillips Lovecraft","Self-published authors who write +20 books a year. It has to be shit, right?","Obama shares list of recent reads","Teens lower attention span indeed due to texting and using social media instead of reading books - The Washington Post","8-year-old girl crushes summer reading goal at more than 300 books","Getting rid of the habit of reading sentences multiple times before moving on?","Does East of Eden get better?","Tom Clark, renowned poet and biographer, dies in Berkeley crash","Terror. I think i liked it...","Hi! I’m Kia Corthron. I wrote a longass novel and a whole bunch of plays. Ask Me Anything!","White nights... Friendzoned in 1848","Hugo Award winners announced","Placing a premium on characters written by writers who are closely related to the character in background.","I think I missed the genius of A Confederacy of Dunces.","HBO has done an amazing job with Sharp Objects, but what about Gone Girl?","What Books Did You Start or Finish Reading This Week? August 20, 2018","Who fights fires in the Fahrenheit 451 universe?","I read, but most books don't make me feel amazed me","The Iron Druid Chronicles by Kevin Hearne is an excellent series","Irvine Welsh: 'I thought Trainspotting would be a cult book, but not generation-defining'","Stories as Prayer: A Conversation Between Joshua Cohen and Harold Bloom","I just finished Wind-Up Bird Chronicle and I'm a bit disappointed.","Anyone else have trouble following along with books that are not novels?","Looking to get back into reading: What's the best dirt cheap eReader I could get? (preowned is an option)","How long can you read before you become mentally exhausted? How long did your longest reading session last?","Weekly Calendar - August 20, 2018","I just finished Gaiman’s Neverwhere and I was completely entranced. This book is fantastic.","What science fiction has stood the test of time?","I just finished listening to the Complete Edition of the World War Z audio-book.","Death, Grief, and Comedy With Adam Cayton-Holland","The Dark Tower","I just finished reading The Way of Kings, and it went from 'meh' to 'more, please' in the last 10 chapters","The Anabasis of Alexander – Arrian [audiobook]","Short story by Alastair Reynolds (possibly?) about simulated universe and AIs?","What are some books that you'd like to forget you read just so you could experience them again?","Question about The House of Government","How to walk away by Katherine Center","The strength of Patricia Highsmith's mundane prose and structure in The Talented Mr. Ripley","Reading Dante's \"Divine Comedy\", question about the difference between two of the circles of hell.","Just read my first Hemingway novel and loved it (first book I’ve read in 2 years), The Old Man and the Sea","Any of you read Dark Matter by Blake Crouch?","Just finished Sapiens and Homo Deus, what do you guys think about them? And do you know any books that are similar?","Eight underrated novels by great writers that deserve a wider audience","The Big Book of Alcoholics Annonymous","'Ghachar Ghochar' by Vivek Shanbhagh (transl. by Srinath Perur) – a nifty little novella about an Indian middle-class family and the crises brewing underneath their rags-to-riches success story","Are any of you slow readers?","What character do you wish you were like? What character are you actually like?","An independent bookseller talks about the challenges he faces in Singapore.","'Book bragging' row as author's claim to be reading 50 books at the same time is criticised by fellow writers","I finally got into the Stormlight Archive series...","[Rant] Renumbering the Narnian Chronicles (or any other series for that matter)","What are some books you HATED as a youth, but really appreciated as an adult?","[crosspost - AMA in r/Fantasy] Hello Fantasists from WorldCon 76! I’m DW Draffin,self-published author and Audible narrator. I’ve written for DC and Marvel in the 90s, had my own science fiction theater company in San Francisco, sold spec features in Hollywood, and climbed mountains! AMA!","Struggling with “The Name of the Wind”.","I just read Feed by M.T Anderson","Click if you dare: 100 Favorite Horror Stories","Time to talk about my favorite book, ever: Shogun. Spoilers, be warned.","Weekly FAQ Thread August 19 2018: What are the best reading positions?","I just finished Dune for the first time.","How not to get distracted while reading?","I think John Fowles is up there, with the very best of the modern era (post 1950's) fiction","Ever read anything aloud to yourself because it's that good?","In the wake of the Pennsylvania Diocese I think The Golden Compass deserves a reread.","Mr Darcy's Guide to Pemberley - a new way to explore Pemberley. Complete with gorgeous illustrations and diary entries.","Keanu Reeves Is Doing a New Thing: Publishing Books","First Fifteen Lives of Harry August Questions (spoilers!)","Zafon „Labyrinth of Spirits“: Any thoughts about the parents of Alicia Gris?","John Adams, by David McCullough Review","Re-organizing Book Shelves","Has anyone here read Scythe by Neal Shusterman?","Looking forward to the next book while reading another","Dilemma about owning books","Likely identity of Oscar Wilde’s American sweetheart ‘Hattie’ uncovered","Just finished the emporor's blades.","Toronto Public Library hits milestone with 20 million ebooks borrowed","Seven books our English teachers tortured us with at school","About those Barnes and Noble customer surveys..","Why Little Women Endures: A new book reveals the powerful frustrations and sharp wit that shaped Louisa May Alcott’s classic novel.","Are unpublished books / fanfics something bookreaders could read?","What's going on with novels these days?","Anyone ever start a book club?","What do you do to get more out of the books you read?","Acclaimed books you just didn’t get?","Will Self: 'Harry Potter ushered in the dumb kidult era we’re currently having to endure'","I'm finally making the effort to get back into reading books.","Do any other families love the work of Ben Hatke?","[SPOILERS] Am I alone in thinking The Shining was more sad than scary?","After reading a book that engrossed you have you ever felt underwhelmed by everything else?","Writers Have Always Loved Mobile Devices","Robert Heinlein Classics Reissued With Hot New Covers","The Shotgun Rule by Charlie Huston was the fasted book I have ever read.","Ying Chen is a Chinese Canadian author who writes mainly in French and published several French novels on the Chinese experience. While studying in China, only Japanese, English, and French were offered and she chose French as it was the rarest of the three","Whoever recommended The First Fifteen Lives of Harry August...","Will there be a sequel to Norse Mythology by Neil Gaiman?","x-post r/japan: A university in Kochi Prefecture burned 38,000 books (scarce, historical, out of print) because of \"space\"","Crime and Punishment; A question about \"extraordinary men\"","From Star Trek to Fifty Shades: how fanfiction went mainstream","What was your favorite book growing up? Does it hold up upon re-visit?","Possibly censored/edited book?","Any Dungeon Masters here read a lot of variety?","Simple Questions: August 18, 2018","NPR assembled a panel of judges to make a list of the 100 best horror novels and short stories","The meg novel of deep terror revised edition?","Summer reading? What and why?","After reading Kafka on the shore","Damon Lindelof's 'Watchmen' Series a Go at HBO, Sets 2019 Release","For those who have read the book \"The Strange Death of Europe\"","The Odyssey by Homer is a type of book I thought I'd never pick up at my age","Things Fall Apart by Chinua Achebe is mediocre at best and I don't see why it is considered such a classic.","Just finished Stephen King's The Stand","How much do you guys read a day?","Who's a Good Boy? 10 Good Dog Books"]