["/r/conspiracy Round Table #16: Solutions","The Tin Foil Hat Podcast With Sam Tripoli -- #119 The Return of Magnora7 - Black Cube Co., Anthony Bourdain, Sabotaging the Iranian Nuclear Deal and more","Judge dismisses all charges against 3 'extremist Muslim' New Mexico compound suspects","r/\"science\" weekly propoganda in their war against questioning things (conspiracy theories).","The Conspiracy of Scientific Fraud = 70% of Experiments Cannot Be Replicated, 50% of Researchers Cannot Reproduce Their Own Results","We should all be worried about Google’s power","Am I the only one who thinks Kushner shouldn't be allowed to negotiate an Israeli Palestine deal? Netanyahu literally used to sleep in his bed. Whether you support Trump or not, this should be an obvious thing both sides agree on.","Boyfriend of girl in doorbell video found dead. The plot thickens.","The Invention Secrecy Act of 1951: A secrecy order bars the award of a patent, orders that the invention be kept secret, restricts the filing of foreign patents, and specifies procedures to prevent disclosure of ideas contained in the application.","Smartphones being the hot conspiracy topics they are these days: You can build your own","Israel Behind Facebook Behind Censorship - Ben Swann 5 min","Facebook Takes Down NPR Report Questioning The Accurate Number Of School Shootings From 2015–2016, claiming: “it looks like spam and [it] doesn’t follow our Community Standards.”","Pretty much everything most people know about the North American Indians is wrong","Scientologist Responds To My Escape Of Their Compound","In a rare example of actual journalism, NPR admits that nearly 90% of the “school shootings” we hear about when gun-control activists cite absurdly high numbers never actually happened.","Has reddit always been this bad in terms of US government propaganda? The whole news section and front page is trump and republican slander 24/7","Daily Caller shown to be making up fake news about FBI finding Clinton's emails hacked by China, FBI says it never found any evidence the servers were compromised","Leak From Censored Israel Lobby Film Exposes Anti-Palestinian Operatives","More evidence of storm modification. Watch this storm going north completely change direction as they pulse this nexrad system.","Bookmark This: Over 400 Links Google Doesnât Want You To Visit","City Drops Poison on Foxes, Risking the Lives of Dogs: “They seizure, they froth, they die”","Not suspicious at all... Belgian Vice-President at Russian steel company mysteriously falls to his death in Moscow","Nikki \"gaslighting\" Haley once again epitomizes the sheer audacity of our government regarding its blatant refusal to accept responsibility for its actions in the middle east.","HOLY SH*T!!! Mattress Firm is changing the Money Laundering Conspiracy Narrative! The New Conspiracy Twist is changing to Conspiring to \"Knocking Off Tempur-Pedic Mattress Design\"! Blatant Keyword/Narrative Direction! Amazing to watch this unfold.","CNN = The Onion, Russia's Anti-Vax Troll Farm. 250 Tweets Out of 600 Billion Threaten Democracy, (Jimmy Dore YT 5 min) Funny As Fuck !!!","TPTB vs the Shamans","Pedophile sentenced to 336 years. He was Naval Intelligence. He predicted 9/11 from his jail cell one month before it happened in a note given to his jailers.","I know there are a lot of arguments about what is and what is not a conspiracy, and that the “news” is not a conspiracy. I’ve finally stopped even monitoring the mainstream to see how crazy they are. I’m trying to limit the noise, for what it’s worth I come here for my “news”.","Researcher links diplomats' mystery illness to radiofrequency/microwave radiation","Regardless of political or social leanings, everyone seems to agree that nothing in our modern culture makes sense anymore.","Terrorists in Syria Receive Chemicals for Upcoming False Flag Chemical Attack: History repeats itself and apparently only needs a few weeks. This is why TPTB feel so confident in their ability to launch airstrikes against Syria for the third time on the basis of false chemical weapons claims.","The government can't account for $21 Trillion dollars which, coincidentally, is the same amount as our national debt...","Bill Cooper Warning to All..","Jimmy Dore: \"Facebook announced it was partnering with the Atlantic Council, a NATO-allied think tank with men like Kissinger, Mike Morell, Michael Chertoff..Do you want those people doing the censoring of information in America?\" + Abby Martin on Chaos in Venezuela + Censoring of Telesur","China Locked Up 1 Million Muslims In Western China Because They Threaten Their Silk Road Initiative","Google is making it harder and harder to log out of their apps to collect more data about their users","SWIFT payments","The Dog-Whistle Loop: how the economic elites manipulate policy by sowing racial and ethnic division","debunking Tippy Top","They Admit They Are Paid To Create Fake Of Their Religion Called Scientology. Here Is Proof:","How much of your thoughts are influenced by other people's thoughts? Discussion about common consciousness","Internet notice-and-takedown in the new NAFTA agreement (from /r/canada)","PSA: There is no reason for massive amounts of chemicals and psychotropics to be in the water supply. And any person stating it should be for our 'teeth' shows that they are truly ignorant of the issue. With all the genius of the world you would think actual clean water would be of high importance","Everything is an opinion piece these days","Video - The absurd CNN narrative about Russian bots leading the anti-vaccine movement gets pulled to shreds on The Jimmy Dore Show","Vice President Mike Pence congratulated Martha McSally on her primary win in Arizona....Before a single ballot was counted.","The Truth About Dr. Andrew Wakefield","Why doesn't Conspiracy have a chat function?","Everything is a Rich Man's Trick: JFK to 9/11","Another Death of a Holistic Doctor Who Claimed a Cure for AIDS: Aaron Traywick’s body was discovered “face down” in a Massachusetts Avenue spa room in downtown Washington D.C. on Sunday, and a police spokeswoman said no evidence has been found to suggest foul play.","Has Trump made any statements about the existence of aliens?","Let's not forget about the time the U.S Government killed Reuters journalists.","Trump cancels FBI HQ move because a Trump Hotel is right across the street of the existing HQ.\"This looks like a cover-up.\"","Facebook Censorship, Mad Ben Nimmo and the Atlantic Council - Craig Murray","Facebook is listening.","Archbishop Vigano who blew the whistle on Pope Francis' cover up of abuse has gone into hiding and fears for his life.","There Are Way Fewer School Shootings Than The Government Says — Only 11 Out Of 235 Reported Shootings from 2015 to 2016 Confirmed, 161 were errors and four were miscategorized incidents.","The Palladian Skull and Bones and a trail of crimes and corruption in Arkansas","More Lost Ancient High Technology Artifacts In The Cairo Museum Of Egypt","Remembering \"Dancing Panda\", when China hacked emails of US top official's around the time of Hillary's personal email server scandal.","All the Queen's Horses (2017). The Rita Crundwell story. On Netflix. Details how she embezzled 53 million over 20 years from Dixon, IL as Comptroller. Link to trailer.","Big Dairy slithering into my town's Conservative Party.","CONFIRMED: FL Shooter Prescribed Psychiatric Drugs Linked To Violent And Suicidal Behavior","Did I just witness the BBC 10 O'Clock News being hijacked? (28/08/2018)","Crowd Funding for Abby Martin's THE EMPIRE FILES Hits $40K in Five Days (Goal $50K)...Empire Files will hopefully start back up soon","[LONG AF] Secrets in Plain Sight (Full video)","Town near me has 5 MatressFirm stores on one road, and another nearby","Alex Jones claims that porn is always flooding his phone. However, this isn't his porn phone. He leaves his porn phone out of the studio. Oh! And he definitely doesn't look at trans porn.","The craziest alien Theory on the net and it is one of the scariest.","I post about an upcoming Syria false flag, all downvotes. Meanwhile nothing of substance is on the front page.","Botched CIA Communications System Helped Blow Cover of Chinese CIA Agents, and Contributed to their death","Mystery as woman in T-shirt and possibly shackles appears on Texas homeowner's doorstep","Introducing the New “Conspiracism” Canard - Obviously, “teleological thinking” — an openness to seeing intelligent causes at work in ways not everyone can agree on — underpins arguments for design, and it would have to underpin most conspiracy thinking as well.","Madden Gunman Held \"for nearly 100 days\" at Controversial Boot Camp","\"We Saw Nuns Kill Children\" From Buzzfeed of all places. \"They were forced to eat their own vomit. They were dangled upside down out windows, over wells, or in laundry chutes. They were sexually abused. They were mutilated.\"","A confirmed link between the deaths of Chester Bennington &amp; Chris Cornell (?)","I posted a askreddit question relating to the influence of Facebook over its users, is there a way to word this properly so it doesn't break the rules? I have a hypothesis about Facebook's influence over the golden years.","High-ranking CIA and Saudi officials conspired to bury details about their 9/11","Full Nicholas Cruz interrogation/questioning","Trump: 'Violence' if GOP loses midterm elections, control of House - Business Insider","Curious what secret societies actually believe? Check out \"The Secret Teachings of All Ages\" by 33rd degree Freemason Manly P. Hall","Trustworthy Media","There’s nothing on most of Reddit about Bruce Ohr and Lanny Davis outside the far right subs. Censorship? This is a potential MASSIVE conspiracy!","A girl in what appears to be restraints and barefoot rings a few doorbells in the middle of the night and disappears. Police are now looking for her and no one knows who she was.","Geoengineering - the single most dangerous threat outside of nuclear disaster","CongressAnon - no warranties expressed or implied... But wtf","\"South Africa Calls for 300,000 Gun Owners to Turn Over Their Weapons\" With the coming Land Seizures, this will turn into a nightmare.","Illinois Law Legalizes Industrial Hemp Despite Federal Prohibition: The U.S. is the only developed nation that hasn’t developed an industrial hemp crop for economic purposes.","Lecture on the forbidden history of zionism and sabbateans. Video by Robert Sepehr","Disclosure: Clinical evaluation of Morgellons disease in a cohort of North American patients","Looking for hard indisputable evedence to support anti vaccines. How can you prove this to a skeptic doctor?","Surprised? The Madden shooter was on mind altering psychotic drugs.","Inside Hillary Clinton’s Secret Takeover of the DNC.... By Donna Brazile interim chairperson for the DNC 2016-2017.","OC Google searches for \"how to delete instagram\" recently surpassed searches for \"how to delete facebook\" [OC]","Ancient X Lines link so many megalithic sites together. Do you think they are a coincidence? Or could they be a sign of lost advanced civilization? Could mainstream academics be conspiring to conceal the truth? Submission statement--","Trump’s economic adviser: ‘We’re taking a look’ at whether Google searches should be regulated","Not sure if the userbase here is aware, President Trump had an extensive relationship with convicted pedo Jeff Epstein. Epstein pled the 5th in court when asked if Trump had been present at underage sex parties. Trump was also taken to court over the rape of a 13 y/o girl at Epstein’s property.","Antarctica: pretty coherant history of the continent","Nearly all of Europe's leaders are childless.","Two posts on r/All from this subreddit and there magically happens to be a anti-conspiracy theorist post to r/science that is rapidly rising to the #1 spot on their page","This is BREAKING NEWS and you can't find it ANYWHERE on the front page of any subreddit! China hacked Clinton's private email server in real time. It's being suppressed all over this website and it needs to be addressed!","The deal with The Purge","Thread of quality videos. Microchip/transhumanism/Operation Paperclip/Surveillance and facial recognition pre crime/how words affect reality, why we must not fear/the moon and more.","Why We Know So Little About the U.S.-Backed War in Yemen? What the U.N. calls the “world’s worst humanitarian crisis” is an unhappy confluence of American media taboos","NPR: The School Shootings That Weren't","Dr Malakart dies - a career full of conspracy","Imperial College Podcast – August 2018: Cancer virus | Feeding the world | The Planets updated","Might be an interesting read.","My hypothesis about Alien visitors. It's purely a thought experiment and I have no evidence for it at all.","Lew Rockwell and Judge John V. Denson: Hidden History of WW1 (podcast + transcript)","Proof of Sweet Jesus and the Occult","A New World Order","Now that we know China had real time access to Hillary Clinton's email server while she was Secretary of State - those 18-20 dead CIA sourced murdered from 2010-2012 makes much more sense.","\"Meet Jared Holt, the guy who’s getting Alex Jones kicked off the internet\" This article is from August 8th. I wondered who spearheaded the campaign, thought some of you might have too.","The Trump administration is talking about how to regulate Google search results","9/11 Suspects: The Dancing Israelis (2016) - We now have thousands of pages of FBI, CIA and DOJ documents about mysterious groups of Israeli Mossad agents that were arrested on 9/11 setting up tripods to record the attacks and celebrating when they happened.","Does the brace position from airplane crash instructions actually make you more likely to survive?","FBI agent says bureau leaked stories, then used them to get FISA warrants","Is being Vegan even that much of a healthier alternative anymore?","UN calls for impartial investigation in Yemen: “What is happening in Yemen is unimaginable. The time has come for everyone to wake up to the terrible reality of the war and its human cost, and the need to work together to end the hostilities.”","World’s Leading Human Rights Groups Tell Google to Cancel Its China Censorship Plan","Theory: Facebook might be reporting user activity to debt collectors.","Question arise on Rudy Giuliani’s relationship with company that manufactures OxyContin","China Hacked Clinton's Private Email Server Alleges Daily Caller: A Chinese-owned firm with operations in Washington D.C. hacked Hillary Clinton's private server \"throughout her term as secretary of state and obtained nearly all her emails.\"","Jeremy Corbyn claims Israel controls speeches made by British MPs","Belatedly, Square’s iconic reader gets a Lightning plug","Did the 1999 Stanley Kubrick film Eyes Wide Shut give us a glimpse into the bizarre practices of the elite?","There have only been 4 hurricanes that hit Hawaii in over a century. Tell me how there's another hurricane that's going to hit it after Lane","Archbishop Vigano, who exposed the Vatican Bank in 2009-2010 which led to Pope Benedict's resignation, has gone into hiding after calling for Pope Francis' resignation, fearing for his life.","Social Studies in US Universities have became into a religion","The secret inspiration behind George Orwell’s 1984.","Proof of Black market organs, adrenochrome, missing kids, and human traficiking - wheres the outrage?","Jared Holt, Alex Jones, and George Soros: A story of vindication.","Two Guys From Canada Are Making $230,000 A Year By Selling Cans Of Canadian Air","Senior US official: China has been accessing the Obama administration's private emails since 2010","Textbook pre-genocide move: gun confiscation in SA","Directed Energy Weapons - audio evidence of impact - Covert Torture","The Crucifixion of Jeremy Corbyn - Israel's friends demand total surrender","Can we stop throwing the word shill around just because someone has a different opinion/ perspective/ theory.","The SL-1 Accident: The first U.S. nuclear accident is little-known. It happened in Idaho in 1961, 3 weeks before the JFK inauguration.","Rush Limbaugh on Sara Carter’s Latest Piece: “You’ve Got to Read This!” Rush Limbaugh cited Sara Carter’s explosive report about Department of Defense whistleblower, Adam Lovinger, who exposed the long history of questionable behavior by FBI informant, Stefan Halper","I need to quit my iPhone","Thomas Paine unveiled","Six Passengers Set Sail that Day for a Three Hour Tour... A Three Hour Tour.","Facebook Engineer's Stunning Admission: \"We are a political monoculture that’s intolerant of different views...we are quick to attack anyone who presents a view that appears to be in opposition to left-leaning ideology. We tear down posters welcoming Trump supporters.\"","Quick question about Studio71 and the associated channels.","On the late Al Qaeda leader’s (bin Laden) nightstand are America’s “War on Terrorism” by Michel Chossudovsky, The Conspirators’ Hierarchy: The Committee of 300 by John Coleman, Crossing the Rubicon by Michael Ruppert, and New Pearl Harbor: Disturbing Questions about the Bush Administration and 9/11","Did the CIA and Saudi Arabia conspire to cover up 9/11? New book.","CNN Weaves Sob Story for Child-Abusing Muslim Radicals in New Mexico","So the media and tech narrative today is, \"No, we don't collude to censor conservatives...\" Two weeks after colluding to shut down InfoWars?","Why is there no recent pictures of the McCann’s other children? (Most recent being 2007)","CIA blacklists in America the film called \"Magnistky Act: Behind The Scenes\" (Americans can't view it on Amazon, Netflix, anywhere). I thought we were suppose to be a \"free\" country with \"free\" press? And why Putin jailed Russia's richest man, former Yukos Oil CEO Mikhail Khodorkovsky","In a week full of distractions, NATO prepares for more war and false flags","Court orders ban of top-selling pesticide, says EPA violated law, ignored scientific studies","Trump says White House counsel McGahn to leave in the fall | Reuters","How a twenty-year-old movie foretold the Mueller witch hunt","Bitcoin is a government creation.","Coleen Rowley on the death of John McCain. Interviewed by Medea Benjamin of Code Pink.","‘Most beautiful silicone ladies’: N. America's 1st sex doll brothel to open in Toronto","Donald Trump Calls Into WWOR/UPN 9 News on 9/11...At 6min 45sec Trump states: \"I happen to think they had not only planes but had bombs in the building.\"","Welcome to the PC Nanny State: 10-year-old Boy Punished for Calling Teacher “Ma’am” and a Mother Gets Investigated for Letting Her 8-Year-Old Walk the Dog","I predicted 9/11?","Bruce Ohr: FBI Knew About Bias Before Getting a FISA On Carter Page","Heard a rumor the Florida Democratic Primary was rigged. Is there any evidence to back this up?","Reddit is Beholden to Marketing Agencies With Agendas - Reddit is regularly manipulated by marketing agencies who use the platform to shill for fake news, products, and reputation management","Ben Garrison's website GrrrGraphics suspended","Black Cube &amp; fortnite","ISIS comment appears to have been removed from Military porn picture","China Treats Uighur Islam as a Mental Illness in Camps","A family is being persecuted for exposing high ranking pedophiles","WOW... Joe Rogan is shilling harder than ever these days... Watch this whole interview. Joe supports big tech censorship and can't change the subject quick enough when Shooter talks about the Illuminati","Conspiracy theories from GatewayPundit and Mike Cernovich are fake.","David Rockefeller Gloats About 9/11 in 1967","Did BBC personnel collude in the fabrication of an atrocity with the aim of influencing public opinion in favour of war against Syria?","Tin Foil Hat With Sam Tripoli #119 The Return of Magnora 7","Don't expect charities to give back tainted donations or blood money","Tribalism","REVEALED: Chinese Govt. Killed and Imprisoned 18-20 CIA Spies After Penetrating Hillary Clinton's Private Server","Madden Tournament shooting in Jacksonville, Florida is a hoax","Judy Mikovits claims she proved viruses were being spread through vaccines amd claims she was thrown in prison. She worked for the National Cancer Institute as a cancer research, retroviruses like HIV. Can someone please help me find some hard data to back up her claims? Video inside...","Reminder that on September 10th, 2001, then Secretary of Defense Donald Rumsfeld announced that 2.3 trillion dollars was missing from the Pentagon","Anybody doing the podcast tonight?","Earth is as smooth as a cue ball!","Today is Tuesday, August 28, 2018 It's been 4 years since CDC whistleblower gave his press release where he admitted omitting statistically significant data that suggest AA males who receive MMR vaccine before 36 months were at increased risk for Autism","Vox - truth is irrelevant","Debunking the claims about \"40000 sealed indictments\"","The allegedly pedo complicit Pope had a massive pizza party populated by children.","Islamic currency being promoted in the UK","The DNC Trump opposition report","Madden shooter","GOP rep touches off firestorm with claim FBI leaked info, used stories to get FISA warrants","Discussion on my recent conspiracy theory...","What the Hell Is Going On In West Virginia? (Entire state Supreme Court impeached)","Boer from South Africa shares what is actually happening there directly to twitter.","Verizon Wireless","The Holohoax thoughts please...","When was the original publish date of...","Whats your most plausibly truthful yet still pretty out there document you've encountered on the web?","Russia holding biggest war games since the days of the Soviet Union.","Body Double? Or Manipulated Fake Image?","Looking for videos where the camera fitted to the rocket is pointing up during launches to space.","Is Mark Dice serious or is he a troll?","Razorfist rants the eulogy that McCain deserved - MCCAIN: A One-Man Case for Term Limits","UFOs in NASA Archives","YouTube Facebook Twitter RIP","Am I the only one who has noticed a surge of left leaning post?","Do any of you here believe Reincarnation works?","US Government Admits It's Making Fake Social Media Accounts to Spread Propaganda in Cuba","Dutch Officials Request DNA From 20,000 Men To Solve Single Murder","A Concern: Talk of Obama/Clinton/Soros being involved in the ousting of Pope Benedict being blocked","Sources: China Hacked Clinton’s Private Email Server","Eli Clayton (Jacksonville) w/(o) Red Laser Dot near Collar Bone [is anyone able to find the video? it's being scrubbed from the internet faster than the james rothschild alefantis/ comet ping pong stuff]","Happy Tipping Tuesday! Now that this sub is the main Bitcoin sub in terms of activity, it's time for everyone to get some Education and some free Bitcoin. Post here and get free bits! Bitcoin Cash will defeat the legacy banking oligarch system! (x-post r/btc)","Meadows: \"We've Learned NEW Information\" Suggesting FBI/DOJ Leaked To Press, Used Articles To Obtain FISA Warrants","If terrorists actually existed in the USA, aka not all blackflag propaganda nonsense, wouldn't they be lighting wildfires, derailing trains, or something far more damaging than the low impact shit they do? truck attacks, etc","The Jacksonville gaming tournament shooting is a perfect example of why we need to assign it to its own megathread.","Iran has siezed control of 1/3 of Global Oil Supply. \"Iran says it has full control of Gulf, U.S. Navy does not belong there.\" \"Tangsiri said Iran had full control of the Gulf and the Strait of Hormuz that leads into it.\" Do you hear the war drums beating?","What the actual hell","I hear conspiracy that 'they' are destroying economy on purpose.","John McCain: Privileged 'War Hero' Fraud, Liar, Colloborator, Traitor: Part 1 , interview with Ret. Col Earl Hopper ((Feb. 8, 2008)","Top student loan official resigns, says Trump team betrayed families","Moscow 1867 -- Where are all the people???","In Pearl Jam's '96 Music Video, Do the Evolution, Groups of People Throughout History, Including KKK Members, Perform the Same Ceremonial Dance -- Symbolizing a Dance of Death, Destruction and Tyranny that is a Common Thread in Human History: Are we Still Doing this Dance Today?","Russia is going to destroy us all! (Part II)","We now have Soros' Manifesto For Online Censorship.","The Aurora Project","Interesting theory on the \"Pee-pee dossier\"","Charity Hospital Conspiracy: Why the second oldest free hospital in the United States was abandoned after Katrina.","The influence to people thru media","Does anyone know what's going on with 666 5th Avenue?","Is Whole Foods adding stinkbombs to their paper bags?","I think John McCain was dead a while before it was announced","Pope Francis exposed for covering up abuses","Lanny Davis Admits to Being a Source For CNN’s Bombshell Report Trump Knew About Russia Meeting in spite it being not true.","Pro-Life Pedophilea","KEATING ECONOMICS: John McCain &amp; The Making of a Financial Crisis - never trust political hero worship","A certain letter","Michael Moore AKA Thomas Paine of True Pundit, details his encounter with FBI agents in new Write-Up","Inspector general report: Trump involved in FBI HQ decision","Roger Stone predicts he'll be indicted next in Mueller probe","Why would they release 5G, thereby increasing communication speeds and communication levels of quality, while at the same time censoring us, attempting to divide us, and dumbing us down?","New Mexico compound suspects planned attack on Atlanta hospital, prosecutors say","Cohen Has No Dirt for Mueller and His Lawyer Totally Trolled CNN---Backing off claims Trump knew about Russia tower meeting","Bolton asks Al-Qaeda to launch new chemical attacks in Syria - AWDnews","Instagram","InfoWars host Alex Jones ‘caught looking at transgender porn’ despite anti-trans rants · PinkNews","There’s a Jewish supremacist plan to systematically eradicate the white race by breeding it out of existence by flooding white countries with millions of nonwhites. It’s called the “Kalergi Plan”","Why the US ruling class mourns John McCain — The late senator from Arizona represented a bipartisan consensus in support of militarism and the defense of corporate America.","Shitpost for shithawks","🚨 Russia Deploys Warships in Response to New False Flag Threat","Immortality practices of the elite","Guantanamo Military Judge Announces Retirement--Just One Week After Making Controversial Ruling In 9/11 Case Which Excluded 2006/2007 FBI Interrogation Evidence Against KSM, et al. &gt;&gt;&gt;New Judge Announced Aug. 3rd He Would Be Involved At Gitmo With \"KSM\" Case","\"flat as a pancake mate\"","ATOMIZED: Why Our Culture Creates Mass Shooters","Dave Brock and George Soros outline their totalitarian control of Internet through Facebook,Google, Twitter, and across all social media platforms. We just watched this implemented to ban Alex Jones off the internet, and app stores.","Finally old enough // 5G conspiracy??","For the 1000th time: Criticizing Clinton is not support for Trump. Criticizing Trump is not support for Clinton. A person is capable of criticizing both. In fact, I think every person should.","I apologize in advance...but just had an Alex Jones wtf moment.","Michael Jackson turned white not because of vitiligo but because of his acne","PSA: The CIA constantly patrols Wikipedia articles on controversial subjects like coup d'etats, assassinations or corruption allegations, to warp and retouch them to follow their narrative. Do not trust Wikipedia and ALWAYS read the article and talk page edit logs.","Strong radar evidence we blasted away hurricane Lane with ionispher heater. Watch and is suddenly vanished and then trys to reform.","Skripals - When the BBC Hide the Truth - Craig Murray. Possibly the most important Freedom of Information request ever. The mother of all conspiracies.","The Reddit Flippening has begun. The free speech Bitcoin sub /r/btc now surpassing the censored /r/bitcoin in 7-day activity according to cryptosub.live with 20,036 posts and comments on the censored sub compared to 20,763 on /r/btc sub. Its time to educate the masses. (x-post r/btc)","The Mark Zuckerberg Conspiracy","Fahmy M. Abdel-Malak MD Obituary - Clearwater, FL","Danny Masterson accuser confronts stalker outside her Los Angeles home","Jacksonville Gunman's Father was Engineer in NASA's \"Instrument Electronics Development Branch\"","IG Confirms Trump’s Involvement in FBI Headquarters Project Across From His Hotel","5G towers are actually called Gwen Towers","Confirmed: crisis actors with prosthetic \"injuries\" were deployed at staged \"terrorist attack\"","Why is Shareblue Media attempting to influence public opinion concerning the NM terrorist compound?","A Reality Outside of the Matrix","Q has been posting again.","Why is McCain getting so much praised so much after his death?","John McCain, Ted Kennedy die from same cancer, on same day","Bullying Drove 9-Year-Old Boy to \"Suicide\", Mom Claims","I believe I found a strange connection between IBMs satanic-esque culture in front of its building, it's creator and their work","U.K. Green party regional HQ used for child torture, what did party know and when?","Krazy Konspiracy Kooks = Do you ever get tired of reading the same shit over and over again? Now, for something completely different...","False Flags &amp; Hitler","The Yellowstone super volcano anyone?","Was the Church behind the Holocaust","Crazy Theory: Batman vs The Joker","The Science of Black Extermination","This sub has lost its touch with the purpose it was created in the first place.","Even more evidence on mind control and me too victims","Light is NOT an electromagnetic wave","An in-depth look at the current lack of Anglo-Saxon footballers in the England national team.","CNN, Credibly Accused of Lying to its Audience About a Key Claim in its Blockbuster Cohen Story as to Trump Foreknowledge of Trump Tower Meeting, Refuses to Comment","Hundreds of tiny graves across the American West: Faith-healing groups cry religious freedom to perpetuate a protected form of child-abuse","Facebook is now removing Myanmar accounts after UN report","Dr. Jack Kruse explaining the technology of 5g and also how they started the Santa Rosa fires.","Eric Dubay: Dinosaurs Never Existed!","Soros' Role In Social Media Censorship Exposed In Leaked Document","Kansans drank contaminated water for years. The state didn’t tell them.","How do you post a submission statement?","Drill going on by Jacksonville Police at the same time of the shooting. Happens every time.","What’s up with that thing where you fold the american bills in a specific way and it shows tragedies throughout human history and stuff like that","For anyone interested in what a vote brigade looks like...","What if 5G is a new form of mind control?","The Occult World of Asia Argento - Anthony Bourdain's ex-Girlfriend","Conspiracy to make Europe islamic","Eyewitnesses: Two Shooters at the Jacksonville Madden Tournament (1:58 &amp; 4:32)","Endtimeproductions exposed a church they sent him this letter. He removed the video. If anyone has downloaded the video please let me know where to find it.","Conspiracy Theorists Run 'Pizzagate'-Style Campaign Against Small Businesses | Craig Melvin | MSNBC","Why can't we prove the Earth is round?","FARRAKHAN Exposes ROTHSCHILD Bankers / Banksters and their NEW WORLD ORDER Agenda","11 years ago, Frank Winstead, recorded footage outside of Comet Ping Pong in Washington, D.C. If you listen closely, you can hear the screams of a young girl: \"Help me! Help!\". These cries are coming from the restaurant/manhole(?). The family at 0:41 is turned around by the pleas for help. Alarming!","Racism confirmed ---- South Africa's Malema: \"We're coming for white farmers\"","96 Percent of Google Search Results for 'Trump' News Are from Liberal Media Outlets","Trump is taking on Google's censorship.","Why don’t we ever talk about peak oil on here. It seems with all the political messages we are exposed to climate change, etc, no matter what we do, within 30-40 years, oil is going to become a very scarce resource.","Obit Omit: What the Media Leaves Out of John McCain’s Record of Misogyny and Militarism","Bernie Explains Need For Third Party - \"...debate after debate, tv program after tv program, the progressive third party people would in fact get the best response from the audiences, and people would say \"You guys make a lot of sense\"","In \"Historic Bombshell\", Vatican Official Accuses Pope Francis Of Covering Up Sexual Abuse, Calls For Resignation","RFID Microchipping ~ The 2018-2020 Illuminati Agenda","Z Anon predicts recent Florida shooting 1 day before it occurs (2% chance of getting it right) and Venezuela earthquake 3 days before","\"Active Shooter Drills\" - A Curious Pattern (Constant Updates)","Rest In Peace John McCain (Bomb Bomb Bomb...)","Dept. of Homeland Security and the U.S. Flag code.","McCain has (had) a foundation specializing in human trafficking. Lyn De Rothschild is one of the trustees.","Where's The Live Steam of David Katz Losing in Madden Today?","James Corbett Interview - The Social Media Regulation Psyop","\"Pope: 'I will not say a single word' on Vigano's allegations of cover-up\"","Leftist who made baby rape \"comedy\" says \"discourse is over, war has begun\" and \"you die if you don't say you're not a nazi\".","Paid Saudi Shill Brigade removes post with automoderator abuse, moderators respond and undelete: \"Tesla going private with Saudi money - A message for Elon Musk: Your fans saved you. :)\" - This is what psychological warfare looks like!","Yanny v Laurel: the conspiracy angle that nobody mentions","Time for change","THIS IS CONSPIRACY. Does the government/FCC see how many viewers video game steaming receives? And is making their move?","Flashback: The Independent’s glowing 1993 interview with Osama Bin Laden","9/11 was a literal black swan event","WBAL-TV: Alleged Gunman's Father Worked for NASA, Mother Worked for FDA","Donald Trump has Topped the Google Image Search Result For 'Idiot' - (Totally organically too! /s)","Jacksonville: OK, I've seen the video footage of the black guy with the headphones. And in the video, we can see the red laser scope. So... not to be a dickhole, but why have we not see any video of anyone actually getting shot?","Head Of Russian Church To Youth: Watch Out, New Gadgets “A System For Controlling the Masses \"","\"There was ACTUALLY a Training With JFRD During The Time of the Shooting\" Isn't That Just Convenient That a Training Exercise Was Happening at the Same Place and Time of The Jacksonville Shooting Today.","Experiment Shows Quantum Spooky Action Approaches Human Scale","Daily Discussion threads?","When asked how to solve the U.S. deficit, Warren Buffet responded: \"You just pass a law that says that any time there's a deficit of more than three percent of GDP, all sitting members of Congress are ineligible for re-election.\"","Jacksonville shooter showed all the earmarks of a Manchurian Candidate style preprogrammed asset.","What if dreams are us from a different dimension?","Anti-Vaxxer posts online are just bots, operated by the government to encourage the uninformed to not vaccinated their children, in order to cull the population","John McCain a fraud and directly responsible for the deaths of 137 sailors + POW Fraud.","Nibiru Planet X Pole Shift Update #5","The catholic conspiracy; the device for deception of man","Rosenstein Moved Cohen Case to New York - Then Ordered Trump-Appointed US Attorney Geoffrey Berman to Recuse Himself","Trump [Accurately] claims Google has rigged search results to make him look bad","Ebola outbreak now at 105 cases: On Tuesdays and Fridays, an estimated 19,000 people stream down the hill from Congo’s North Kivu province to cross the border...","Bitcoin Satoshi is NK?","Nearly 100% of Google Search Results for Trump News from Left Wing Sites - Android News","You Could Be Kicked Offline For Piracy If This Music Industry Lawsuit Succeeds...","A theory on Russian assets in the US","Inner Earth Civilizations Exist and I Can Prove It: Agartha &amp; Hollow Earth","Pentagon: Chinese Military Using Powerful Energy Beams To Control The Weather","Mandela Effect Field Study: Appearance of the Sun in the Past","FAKE NEWS - An Army of FBI Whistleblowers Are Ready To Testify Against Mueller","Is there an archive of the old Clinton Body Count Website?","Scientific Heretic Rupert Sheldrake on Morphic Fields, Psychic Dogs and Other Mysteries","Google (owns YouTube), Facebook (owns Instagram), and Twitter have removed hundreds of Iranian social media accounts that have been accused — without any evidence — of being linked to the government in Tehran. A Banned Student Journalist Speaks out","BREAKING: Lanny Davis, Michael Cohen's lawyer says he was lying when he said his client has info about 'Russia collusion'. - WaPo","The US and Israel will unveil their Middle East peace plan soon. They want to pay every Palestinian to relinquish their right to return and create a 1 state solution. Your taxes will pay for Israel's invasion and American troops will die fighting those who refuse the payout.","Antarctica mystery solved: David Wilcock &amp; Corey Goode","David Katz's eyes sure look an awful lot like Nikolas Cruz's eyes and the Denver theater shooter's eyes.","‘Foreign specialists’ may stage chemical attack in Syria in 2 days to frame Assad – Russian MoD","Water Fluoridation: Bernays helped the Aluminum Company of America (Alcoa) and other special interest groups to convince the American public that water fluoridation was safe and beneficial to human health. This was achieved using the American Dental Association in a highly successful media campaign.","'Up to and including his final year in office, McCain’s bold declarations of principle were often later reversed, or quietly abandoned. Many of his maverick moments covered for less-noble motivations – of pique or public relations. McCain opened a Pandora’s Box of right-wing populism.'","Any theories on who is behind QAnon?","Iran's Strait of Hormuz control stokes tensions, could prompt US response","Why I Changed My Mind ~ Waney Squier","Someone confronts \"Vaccine Expert\" Dr. William Schaffner about Merck and CDC fraud","Just banned from resist","Terrorists are allegedly preparing a false flag chemical attack in Idlib province, which will be blamed on the Syrian government","New shill tactic: made every discussion into an argument about Trump","Lost ancient high technology and the mis-dating of humanity.","XPost /r/LivestreamFail: shooting at the madden tournement just now live on stream","Shooting reported at Madden Tournament in Jacksonville","Was Laurel/Yanny Predictive programming for Lanny Davis?","Jewish suspected gunman in gamer tourney shooting described as loner","Just a thought..How We Arrived","What's the deal with WTC7? Busted plan? Or as-intended?","Israeli Spying on Trump","The Next Pope. Who will he be?","In Stunning Reversal, Michael Cohen's Attorney Backpedals On Trump-Russia Claims. MSN got their narrative out and are not going to make a correction.","The concept of 'GENIUS' (as we know it) is a lie*.","Truther Cartman on Flat Earth v. Scientists","‘Foreign specialists’ may stage chemical attack in Syria in 2 days to frame Assad","How Instagram creates fake news, and by proxy skews public opinion, by injecting sketchy code into your profile.","The US is building a drone base in Africa that will cost more than $280 millions by 2024","Top student loan official resigns, says Trump and his 'team' have betrayed and turned their back on the families and Americans they are supposed to be protecting and assisting.","15 Trillion+ in missing money? Starts at 30:00","Looking for more material witness testimony of the Roswell UFO incident","Just another little anecdote about phones and privacy.","Why Democracy Needs Solidarity for Julian Assange's Freedom - Efforts to free Julian Assange from his imprisonment challenges us all to uphold the sacred free speech right, even if it also demands the moral courage to love our enemies","Odd verbiage used on spaceweather website.","We Will Force You To Be Free - Adam Curtis (Documentary On Negative And Positive Freedom)","GlaxoSmithKline on Vaccines","Insignia Gate. Dropped on 8chan today is a 11GB file on Dropbox or Mega, Goes over large scale corruption. Please check out and share!","NBC Cuts To Awkward 'Talent' Scene After Solemn McCain Report, properly honoring him","If people actually had to care for their family it would resolve too much division.","Real eyes realize real lies.","What the eff is up with Neil Armstrong","High Velocity Bursts of Debris From Point-Like Sources in the WTC Towers","Zionist World Order and internal Judaism Divisions","India’s Biometric Database is creating a perfect surveillance state. And U.S. tech companies are on board.","That’s What They WANT You To Think","I’m neither left nor right. Both sides have good and bad ideas. Love truth, common sense and peace. Hate corruption, lies and war. Political tribalism is wrong. To make the world a better place we must support the best ideas and find common ground to achieve progress together.","The mother of all deceptions.","BTC and Blockstream/ AXA Insurance/ Bilderberg conspiracy","John McCain's Mob Connections","Rest In Peace Senator John McCain","Alex Jones' Browser Tab Suggests Frogs are Not the Only Thing That Chemicals in the Water Are Turning Gay ;)","Psalm 19 - New International Version (NIV) For the director of music. A psalm of David.","I know this is not true but I think this is the place to say this lol.","If marijuana is so great for you, why is it becoming legalized?","Weird timing for bee simulator?","Noam Chomsky: “The population of Gaza is being caged in a prison, with savage restrictions on food. The US has reacted by cutting its funding to the UN organisation that keeps the population barely alive. This is one of the most extraordinary scandals in the modern world.”","Odd surge in left/right politics as of late in almost every subreddit?","The End Game result...","Fight breaks out at a high school game in Little Rock. Over 100 people claim to have heard gunshots. Police say no shots fired.","Israel has an army, literally, of trolls whose job is to post propaganda online. So, that pro-Israel bigot you are engaging with on social media is almost certainly a paid Israeli professional. (Video)","Pope Francis covered up McCarrick abuse, former US nuncio testifies","Jewish Video Gamer Kills 2 Before Turning Gun On Himself At Jacksonville Tournament","What is the cause of this? Weather modifications?","The Jewish Conspiracy is itself a conspiracy.","Questions about being woke","(not sure where else to post) What changes if we didn't go to the moon?","Congratulation's, You're real!","TIL when seeing it on the front page \"After closely investigating Michael Jackson for more than a decade, the FBI found nothing to suggest that Jackson was guilty of child abuse.\"","David Seaman (Fulcrum News) has been theorizing that Trump has been illegally detained: \"No Tweet re: Florida shooting; Twitter \"tone\" not normal;","(1036). I'pad (8/26/2018)","A message from Al Qaeda of the Pacific Northwest","The Great Green Energy Conspiracy","Alarming levels of Glyphosate found in popular American foods.","How did Wikileaks get Podestas Georgetown.edu emails???","Nikolas Cruz \"FULL\" Interview has missing time, what was said when the cameras were off?","Why did Reality Winner reveal details of Russian Military Intelligence efforts to hack at least one electronic voting software provider and more than 100 local election officials nationwide ahead of the 2016 presidential election. I understand why the Trump DoJ went medieval on her.","Shooter was a Communist - Quick! Blame something else other than Guns! Blame Video Games!","If we have money and motive, CAN we go back to the moon?","They Are Killing Us Off By Poisoning Our Bodies And Minds","Every time you take a contract the moment that contract ends the item you have been financing seems to die","Q is the topic of Richard Hoagland's radio show tonight.","Theatre corporations had faked Avatars box office to push studios to make films in 3D","The Alex Jones trans hitpiece was coordinated by Media Matters and planted as early as April","The Brainwash of Scientific Dogma","Solar warden Question","This is not the first lady!","Pole Shift May Cause Earthquakes &amp; Volcanoes","To Show For it; Response to \"Solutions\" Round Table","Monsanto liable for Agent Orange damage, Vietnam reiterates. Vietnam's Foreign Ministry has reiterated its demand that Monsanto and other U.S. firms compensate Vietnamese Agent Orange victims.","If the only thing you read about 9/11 was that one of the hijackers passports was found in the rubble in the immediate aftermath while bone fragments were still being found a decade+ later, it would sound like a bad movie script","Annunaki","Wall Street is coming for your crypto","Micheal Salla on the secret space program staring with Antartica - This guy really does his homework - Must Watch!","A Memphis jury unanimously found, on December 8, 1999, that this guy was in a conspiracy to murder MLK","Fringe theory time! Post all of your favorite fringe theories. Aliens, cryptos, other dimensions. Anything!","Being spied","9/11 Suspects: The Dancing Israelis","Truth and Lies of 9/11 looking forward and backward : putting it all together","Ancient Israelites had Blue Eyes and Fair Skin","Madden mass shooting - During the chaos, one victim is heard asking \"...what did he shoot me with?\" I keep trying to play out different scenarios where if I were a gun shot victim, why this would be the first thought that pops into my head.","GenocideWatch was reporting on the South African farmer genocide in 2013","The US senate has purposely ignored the crisis on Yemen that has taken the lives of many civilians.","Why doesn't mi5 and mi6 use their intelligence powers to create a more intelligent nation and educate the masses in the best possible way?","Weird thing that's being going on with me the last few weeks. Was wondering your opinion.","My Post About Mark Zuckerberg Was Deleted On Collapse, Here Is That Post, It's Very Short.","And you don't want to be a shill, 'cause shills are living contradictions, shills are full of unfulfilled ambitions, shills wax and wane, shills love to complain, shills love to hear themselves talk but hate to explain, shills love to be another man's judge and jury","Which radical reinterpretations represent reoccurring righteousness, resulting in rampant reckoning?","'Rich' Americans Have Never Been More Comfortable Relative To 'Poor'","Audio evidence of \"Covert Torture\" weapon using \"Directed Energy\"","Another day, another shooting. What are they trying to distract from this time?","Did Trump have an illegitimate love child with his housekeeper? A former Trump Tower doorman says \"Yes!\"","CDC Data Raise Concerns about taking the flu shot.","[NOVA] Can We Build a Brain? AI and it's possible futures","People seem to have forgotten all this, don't forget the shit FCC has pulled","Ex-Obama Official: We Fueled the Syria War Rather Than Stopping It","So, cops can use these? Is this even legal?","Satanic Pedophilia, Torture and Blood: Dark Satanic Secrets Revealed","In 1994 Hillary Clinton illegally copied over 900 FBI security-clearance files (including the intrusive personal full scope lie detector tests) of Republicans and other DC Elites to be used as blackmail. She has been untouchable ever since. (Any pedes with full scope experience, please comment.)","“I absolutely want to replace Assange” — Barrett Brown. I suspect Brown has been compromised and is a mole for US intelligence.","Stealing the Brand","Iranian False Flag incoming?","What does Edward Snowden think about 9/11?","If God was a woman, it would be a Goddess","Russia Warns Staged \"Chemical Provocation\" Coming In Syria After Bolton Cites New Intel","Assad is enclosing Idlib and is about to win the war, who wants to bet when the next chemical attack will be staged?","Have there been things that were believed to be frauds but were later proven real?","When entertainment is passed off as a real event","What are your local conspiracy theories?","Did the Oklahoma bomber have help from al-Qa'ida's explosives expert?","For mobile reddit users","Donald Trump, a good part of his team and the current chairman of the federal reserve are jesuit trained.","'Battlefield America The War on the American People': John Whitehead at RPI Media &amp;amp; War Conference","Next level phone snooping?","Rapid-onset gender dysphoria in adolescents and young adults may spread through groups of friends or online sources, and may be a harmful coping mechanism like drugs, alcohol or cutting, a new study suggests. More research is needed to determine whether it is temporary or likely to be long term.","Catacombs of Paris - Walking Through 6 Million Dead","Las Vegas Shooter's Girlfriend Lists FBI as Place of Employment","JFK assassination and The Beatles Tavistock mass-population psyop occurred 20 years after Hiroshima and Nagasaki nukes; What do you think will coincide 20 years after the 9/11 nuke?","Les Brown: Physics Of Crystals","I've Become a Believer in the Flat Earth Conspiracy","Catholic Church spent $2M on major N.Y. lobbying firms to block child-sex law reform","Highly suspicious latest poll shows corporate Democrats will promote Joe Biden against Bernie Sanders","Dream interpretation in a Jungian way.","Linguistics Are How You Win: Everyone Must Hear the Term \"Moral Panic\" (9:43 long)","29 Pages Revealed: Corruption, Crime and Cover-up Of 9/11 | HuffPost","Julian Assange: Obama and Clinton discovered that, \"Reasons for his protection remain.\"","Documentaries about institutional paedophilia","Las Vegas Massacre: three confirmed suspects and they found 3 phones, 3 drills, 3 beds, 3 refrigerators, 3 carts, 3 active LCD monitors, 3 shooting areas dirty clothes in both bathrooms","The occult symbolism of Saturn.","Pre Ice Age Construction That we would be Hard Pressed to Re-create Today","Banned from r/offmychest for commenting on a r/The_Donald post","Mollie Tibbetts killer lived rent free at top Republican fundraiser's property.","Psychological Warfare and the Pennsylvania Priest Scandal","Kabbalah, Freemasons, Evil Secrets &amp; Satanic Illuminati","The Jesuits were responsible for the creation of the Anti-Semitic myths, which started with their demonization of the Jews and the Rothschilds in their magazine La Civilita Cattolica as part of an international Jewish conspiracy.","Canadian Politics Subreddit Blatantly Censors Me","All you need to do is follow the worms","Technology drives ECONOMY","Top Minds of Reddit Call 9/11 Families who Questioned the Official Version \"Fuckwads\"","Political Blackmail Tapes Exposed","Help us find the \"Angola, Africa militia E.T footage\"","If you're still thinking in terms of Democrat/GOP or liberal/conservative, you're doing it all wrong. There are 3 categories of people in U.S.: (1) a huge number of people who are asleep; (2) a small but increasing number of patriots; &amp; (3) a tiny but powerful group of traitors.","Comments that don't fit the narrative are being slowly removed on r/science in favor of an echo chamber of 'acceptance'","How To Push A False Narrative 101: The Pope","Creepypasta Jr.","John mccain make believe maverick","Nibiru Planet X","The Occult Server &amp; Library [DISCORD][2000 Members]","[Video]Are the royal family pedos or do they just like hanging out with pedos?","A reminder that pope Francis supports the war on drugs.","The media lies.","Alex Jones Community Discord server","Venezuela-The Country On A Verge Of Destruction","Look at the new royalty and you'll see clues as to who is really in control","Astral Projection and Lucid Dreaming.","CIA Whistleblower: John Brennan Is Out For Himself, Not the Resistance","Is Our Food Becoming Less Nutritious?","What if the whole point of Disney buying up so many companies was to make an insane crossover event; ala Wreck it Ralph 2: Ralph Breaks the Internet","CIA whistleblower says that the mainstream media is laser-focused on the recent Cohen plea and the Manafort conviction, both of which have nothing to do with “Russian collusion.” He says this is because the mainstream media are conspirators and have nothing to do with real news.","Reddit seems to not care about pedophilia in Hollywood. Everyone's just upset at Disney for firing James Gunn because muh super hero movie might not be as good","Antifa protests an anti-pedophilia rally","How to convince someone the moon landing was real?","NBC The More You Know kids show closing credits (Naturally, Danny Seo Show)","How hacktivism intersects with the law - I think a lot of people consider the Aaron Swartz prosecution to be a massive example of prosecutorial overreach.","Stephen Paddocks girlfriend Marilou Danley worked for the FBI","The only power that truly scares the establishment.","mccain has been dead for months.","\"I have the right to defend my property by force. And I will\" - White farmer who is set to become the first to have his £10m game reserve seized says South Africas land grab policy is THEFT","My boyfriend told me frogs are being effected so much by the water that it really is changing their hormonal makeup by seeping into their endocrine glads and literally turning frogs and salamanders gay and bisexual. Could someone help me understand this better? I thought this was a joke...","AMALIA COMPOUND - New charges filed against defendants related to child's death at compound near Amalia. the 8th Judicial District Attorney's Office filed two new charges against Siraj Ibn Wahhaj and Leveille. Both charges are first-degree felonies","Scientology owns rehab centers all over the world. They are placed in tiny towns in the middle of nowhere. The entire town of Caliente, NV appears to be owned by Narconon Fresh Start. It turns out to be more like the beginning of the end for most people.","Attention “leftist” or “progressive” conspiracy theorists. Don’t forget that Tulsi Gabbard is a member of the Council on Foreign Relations.","If it’s a Fata Morgana shouldn’t we’ve been able to identify the building/city?","Man who threatened to kill Trump considered armed and dangerous: On the run since June eluding the FBI, Secret Service and other law enforcement. Will he assassinate Trump at one of his rallies?","The Pyramid. Explosions, Cracks, and Lightbulbs.","JFK Assassination Lie","US House Candidate claims she was taken aboard a spaceship as a young girl by blond extraterrestrials who told her that the “center of the world’s energy is Africa” and that thousands of non-human skulls were once discovered in a cave on the Mediterranean island of Malta.","Prosecutors: Excluded FBI interviews of alleged 9/11 plotters is their \"best evidence\" [Guantanamo Farce Continues 6,192 Days After 9/11/2001]","Reversal conspiracy theory. Instead of just \"Alex Jones is Bill Hicks\", what if the \"real Alex Jones\" was killed in the late 90s and replaced by Bill Hicks?","Reddit Mods found an organized state propaganda effort on Reddit — but their warnings were ignored by Reddit admins","Real Estate Scam Disguised As Treatment Center. Owned By Scientology. The Scientology Subreddit Keeps Deleting This. It Is Called Narconon Fresh Start. It Has Nothing To Do With Narcotics Anonymous.","The Pentagon’s New Stealth Bookkeeping: Government accountants may “modify” spending levels and allow spending “to be excluded from one reporting entity and consolidated into another reporting entity” to keep work on classified programs secret.","Dele Alli Challenge came from the Illuminati","John McCain has finally died.","Google Search: Reddit Conspiracy, why doesn't r/conspiracy make the first, second or even third search page?","so.... i know this is probably completely fake but....","Longtime Trump Organization CFO Weisselberg granted immunity in Cohen probe","MASSIVE Chem Trail spreading in UK - False Flag incoming?","Sony Music Concedes in Court They Released Fake Michael Jackson Songs on Posthumous Album","Saudi-led Coalition Team to Investigate Civilian Casualties Is “Covering Up War Crimes” in Yemen.","Fun Fact, 1 President and 3 Future Presidents were all in Dallas on November 22, 1963.","Since we've gotten an influx of shills, I think it's time we revisit the handbook of common shilling tactics. Come to the comment section and see how many you can find!","Earth's increasing population will be a problem.","Coincidentally as Merkel visits Azerbaijan to diversify gas supplies away from Russia","Excellent video explaining how Geoengineering works with radar gifs showing active spray. You simply cannot deny it. They are burning down the forest to try and cool the planet.","New Israeli Law Would Ban Public Display Of Palestinian Flag Within Israel","Facebook deletes alternative health pages as the war on fake news escalates","Egypt hotel deaths","Russian Trolls Have Found an Insidious Way to Turn People Against Vaccines (front page, yes seriously...)","How China’s Mobile Payment Ecosystems Are Making Banks Obsolete","Bosnian Pyramids Report (Edge TV, 2012)","After the recent sockpuppeted post here about the FCC, I think this needs to be shared. When you remove Russian bots and fake emails, the comments to the FCC were overwhelming for the repeal of net neutrality. We've been gas-lighted to believe that the public supports net neutrality.","EUROPA - The Last Battle. Communism was not created by the masses to overthrow the bankers, Communism was created by the bankers to overthrow and enslave the masses. Rothschilds funded the Bolshevik Revolution, and got US into WWI in exchange for British promise to hand over Palestine.","Reddit Censorship Update: I am now banned on r/collapse","Nibiru Planet X Footage","Maybe Life Really Is a Game After All huh?","Does anybody else find it kind of annoying that you can't criticize anything that's happening in the modern world without coming across as kind of crazy?","FBI on Instagram","For the past six years I have recorder every second of my life. My second backup proof if my security's testimony leaves any doubt. Only a fool would risk prison over conspiratorial fraudulent accusations if those accusations are leveled at me.","QAnon Leaders Crack Down on Mentions of Cohen After He Turned on Trump","What else are they doing?","Satanic Pedophilia, Torture and Blood: Dark Satanic Secrets Revealed [Must Watch Documentary]","Dr.Steven Greer scamming spectators out of thousands of Dollars.","Facebook gives users trustworthiness score","Meme Wanted","Socialists are openly pushing to infiltrate schools.","Don't forget that earlier this year a federal agency shut down a $100 million program after corruption came to light","Judge allows sex trafficking case against Harvey Weinstein to move to trial.","Paedophile ring on Omegle?","Dr Andrew Wakefield Congressional Testimony 2000","UK to put people In prison for reading online material not approved by the government.","Sony denies claims it admitted to faking several Michael Jackson songs on posthumous album","El Dorito is pissed. Do our \"IT\" ... \"aha\" ... To Si (Silicon) or not to B (Bored, I mean \"on\")","Fire breaks out at Russian National Bank in Moscow. One can only wonder what records were conveniently destroyed with everything that's going on.","AP Investigation finds US allies, al-Qaida battle rebels in Yemen: “Elements of the U.S. military are clearly aware that much of what the U.S. is doing in Yemen is aiding Al-Qaida and there is much angst about that.”","President Obama's Legacy Is Endless War","The Money Mistake","NASA's budget peaked in 1966. 3 astronauts died in Jan 1967, and the budget fell like a stone before and during their missions to the moon.","Overview about Targeted Individuals and Organized Group Stalking","Apollo-Defenders, Learn the Facts! \"TV From the Moon: Are You Insane?\"","Pyramids: Cosmic Antennas (2011) [english subtitles]","Alex Jones completely DESTROYS Kony2012 poncing LGBTQ Public Masturbator Trendy","Facebook escalates censorship of left-wing, anti-war organizations: Last week the company removed hundreds of user accounts and pages, many opposing the crimes of the American, Saudi, and Israeli governments in the Middle East.","This economic indicator is almost never talked about in the media when they report on the economy. Probably because people would march in the streets if they understood it.","John McCain, war hero or war criminal.","Former Center for Disease Control Director Tom Frieden charged with forcibly touching woman","Possible Causes for Violent Crime?","What The Hell Is Going On? (Part one)","US-Saudis Enlist Al Qaeda for Yemen War: This confirms as fact what was widely dismissed by Western politicians and a complicit Western media as a “conspiracy theory” since 2011.","Whats happening with pizzagate?","Volkswagen has been using weather altering cannons in Mexico. Farmers have been complaining about dry spells and crop damage due to VW's use of the sonic boom cannons.","This is from the coursebook at Narconon Fresh Start which is owned by Scientology. I left shorty after I read this there. I escaped and stayed in a hotel, The owner let me stay for free. He claimed to be Mormon, scared me to death about hitch hiking, then offered to lend me his gun.","Elon Musk is sending a message","According to new information, Comey's crew only combed over roughly 3000 of nearly 700,000 emails in Weinergate, deleted the rest.","Van Allen belts and Moon landing second question","The 2016 election was a huge success!","PROTIP: Instead of complaining about the shills and brigaders, add them to a list and monitor their posting behavior to obtain invaluable information about their operations","Why does Trump pick such slime balls?","Let's take a look at the new Russian Trolls creating discord with the Vaccine Debate Story.","ISIS has been now recorded receiving a weapons drop from ‘unmarked’ helicopters.","Is Trump a time traveler? How is this so?","Many environmentalists was to “save the planet” for the future of humanity. The population is expected to expand to 11 bil. That will be bad for the environment. Anyone who doesnt support the immediate termination of access to healthcare for irresponsible breeders is a fake environmentalist.","Extremely creepy video including an 11 year old “drag queen” flanked by 2 flamboyant men, one of whom is a convicted murderer. The sign is the name of a date rape drug.","HIV is a Fraud/ AIDs does exist","Friendly reminder. It is ALL or nothing.","No, the UN Did Not Report China Has ‘Massive Internment Camps’ for Uighur Muslims","Pearl Harbor Wrongly Blamed","Trump Tower: The Inverted Black Obelisk • r/TheGreatDeception","Joe rogan, a non believer in the moon landing hoax, argues that its a hoax","Found in the Rising section of r/All. Several paid for bot accounts in the comments I'm sure.","It's an amazing coincidence that the \"fake accounts\" and \"fake sites\" that Facebook, Twitter and Google are busily taking down are invariably associated with countries the US is waging covert/overt war on. I have yet to hear of a \"fake\" Israeli account.","Saudi-led coalition airstrike reportedly kills at least 20 more kids","Amid Calls to End US Role in Yemen, Ex-Obama Official Rob Malley on How It Began","Remember the children in cages thing? Heres a timeline of what happened. In headlines","serious research on the alien abductions phenomenon by Dr. David Jacobs","Baphomet's blue marbel","Mag 7 Quake in Peru - that is the 17th(!) 5+ Quake just this month! Ten of which during the last 5 days...","Crypto Zionists","Study: Google Android Phones Collect Almost 10 Times More Data than iPhones","When They Decide to Get You - Craig Murray. Concerning allegations of impropriety against people who transmit information that is uncomfortable to elites.","British Newspaper THE GUARDIAN Claims There Isn't Such A Thing As A White Genocide In South Africa. :-/ Says Farm Murders Are Only Everyday Violence","I asked 3 weeks ago but is it really the lack of shill money or did the mods get active to clean up this sub?","(Paper) Creationism and conspiracism share a common teleological bias","I debated Chomsky on the Fake News/Media, Trump, &amp; Global Warming/Environmentalism -- he said I am \"living in some different universe\", which I am compared to him -- but I did win the debate. It's unfortunate that you can be well known with a PHD &amp; still be uninformed. We can change this though!","Matching Serial Numbers - The truth about Ambassador Stevens In Benghazi","There was a post to a website or a book about critical thinking and ways to wore the brain. It was posted on here a few weeks back any one remember ?","Chinooks over Texas","I didn't see much on this and the story keeps getting stranger - federal air marshal on US flight demands passenger manifest and then shows flight attendant his gun.","Excerpt from Russian documentary: Why were Tesla's discoveries forbidden?","I wrote this for a post that is a few days old, but thought it might deserve its own post... A Taste of the Truth Behind Charles Manson from Someone That Was There.","Artificial Intelligence - Alex Jones predicts future","Fortnite cube is like the Kaballah in muslim teachings!","Cat scooper conspiracy","Censorship is not enough. Now they are cutting off the use of credit cards for conservative groups. Mastercard and visa.","Big Tech Superheroes Meeting in Private to \"Protect Midterms from the Russians\" - Big Tech has a problem. Their narrative doesn’t work in the real world. The only meaningful meddling is coming from Big Tech itself.","Quick thing about Chemtrails I can’t wrap my mind around","Vaccination as Religion: Dr. Chris Shaw Discusses NYT \"Anti-Vax\" Op-Ed","Comey DELETED Obama's Name From Hillary Hacked Emails Report","When did people even start classifying themselves into different sexualities? Has been in my mind lately.","How are doomsday preppers reacting now it actually feels like the end of the world?","Nearly 40 percent of borrowers are expected to default on their student loans by 2023.","White House blocks bill that would protect elections","The War on Consciousness - Graham Hancock","Admins are shadowbanning comments in the James Alefantis thread about Ryan O’Neal’s police report following the threat on his life by James.","Reminder that the Washington Post is owned by Amazon oligarch Jeff Bezos, who has a $600 million contract with the CIA","Are Your Tax Dollars Subsidizing Soda and Candy?","Why is no one talking about americaneveryman.com and other wordpress pages being deleted?","an interesting conspiracy theory","The \"the only power that truly scares the establishment\" post is the dumbest post of all time, explained.","A theory, of conspiracy against a nation to reduce it's power in the world, thereby increasing the power of Britain at that time.","Verizon throttled fire department's \"unlimited\" data during Calif. wildfire: Fire dep't had to pay twice as much to lift throttling during wildfire response.","Whoah! Vitamin industry has a dirty secret! Their synthetic Vitamins are made from petroleum! Sulfuric acid etc. They make you sick!!!","Breaking: 22 Children And 5 Women Killed By Saudi/UAE Strikes On Another Bus, And The MSM Is Silent","Just to clear things up, there was a couple threads made about a woman who was being harassed by Aliens. It started with a video of her daughter dancing and an alien peering in the window behind her. She admitted an hour ago it was fake after someone threatening to go to the police etc.","Democratic donor claims cloning islands exist","Is the TV quiz show Jeopardy training viewers away from critical thought?","Alex Jones is a victim of MK Ultra","Inside America's Meddling Machine: The US Funded Group that Interferes in Elections Around the Globe","How the secret service and the far-right AfD control German politics","Bill Clinton has an engraved locker room at one of Trump's golf courses. They are and have been part of the new world order. Video in comments might open your eyes","How the United States created ISIS","NYTimes Dares Call It A Conspiracy: This Conspiracy Theory Should Worry Trump","Am I misinformed in stating that it seems like people seem to be just fine with the genocide that’s about to take place in South Africa?","WikiLeaks paper confirms Angela Merkel had no real intention to take action against the bankers","Why hasn’t Elon musk put anyone on the moon?","PUBG bot training CHINA","Cancer Link Confirmed in Largest Ever Cell Tower Radiation Study","Pyramid UFO Menacingly Stalking The Helpless ISS","Old newspaper accounts of people encountering live dinosaurs in California","The Hessdalen Objects: Are they intelligently controlled?","How the MSM manufacture consent for the CDC’s public vaccine policy by systematically misinforming the public about the science","David Pecker Granted Immunity in Cohen Case","Ivanka Trump admits she is best friends with Chelsea Clinton while their parents were \"seemingly\" trying to kill eachother.....odd....hmmm","Michael Cohen's Lawyer - Lanny Davis email to Hillary Clinton. I reverted to my old role as your crisis manager.","theyrule.net Mapping the influence of the ruling class","Question: Why is the owner of a pizza shop the 49th most powerful man in Washington DC?","Nothing new happening in South Africa.","Second Kevin Spacey sex assault case under review by Los Angeles prosecutors","Younger dryas comets = alien crash landing?","\"Crazy Jesus Guy\" Warned of Threat Russia poses since 2014 #ResistanceFounder","Why Aren’t There ANY Pictures of Earth with Skyscrapers Sticking Out Sideways &amp; Upside Down ??","Michael Cohen’s attorney Lanny Davis admitted on Thursday that he erroneously confirmed a CNN report about Trump’s knowledge of the 2016 Trump Tower meeting with the Russians","These DNA kit services true goal is to source a genetic bank from people for future unknown reasons.","Fugitive charge dismissed, release granted for man held on Georgia abduction case. Motions to dismiss cases against two women filed, four defendants still in jail related to compound case","For those of you that have not watched JRE #1157 with Shooter Jennings you need to.","The \"Bullet Hole\" On Front Windshield Of JFK's Car","Unmarked Black Helicopters spotted dropping weapons to ISIS?","Nerds/Anonymous/Occupy","Anybody ever seen this clip of Duncan Trussel sort of subtly calling out Joe Rogan as potentially compromised? Joe’s body language and reaction is a little strange too.","The Sun is changing.","Assad: Secret Agent for Zion?","Report exonerates Kavanaugh from accusations of illegal leaking in Clinton probe","Former Police detective that wrote a book on a massive pedophile network in South Africa found dead in an apparent suicide. The book was released this month. The crimes covered the apartheid era and Bird Island, where they took the kids to abuse and murder. Sound familiar? This people are sick","Alex Jones talked about SH once six years ago and never even pursued it . WTF is that the talking point to bring him down?","Herbalfe being sued for $1 Billion! A new controversy arises...","AP: National Enquirer’s safe held damaging Trump stories","The World Today With Tariq Ali - Jewish Arabs and Cultural Cleansing","Rabbi Harry Rozenberg​ has a discussion with Dr. Gerald Schroeder about Psychedelics in the Bible. Even mention fluoride's negative affect on brain stem.","Honest Government Ad: My Police State!","Cannot uninstall certain social media apps.","Despite Comey Assurances, Vast Bulk of Weiner Laptop Emails Were Never Examined","Trump, Corporate Media Are Both Enemies of the People","I love you guys","The Empire Files exposes a lot skeletons in the US closet.","The establishment is using Infowars as a guinea pig for upcoming internet restrictions","Kroger to ban plastic checkout bags by 2025. CEO Rodney McMullen says 'The plastic shopping bag's days are numbered.' this will be a world saving","US Sanctions Against Venezuela Force Abby Martin’s “Empire Files” to Shut Down","They've known about Ascorbic Acid (Vitamin C) Treatment of Whooping Cough since the 1930's","‘Kill 50 cops’: Russia begins probe into Ukrainian radicals’ call to murder police officers","ISIS is a US-Israel Proxy Army Evidence Thread","Russian trolls and Twitter bots are driving the global anti-vaxxer movement online, study reveals","Excellent lecture on Advanced Ancient Stonecutting impossible to replicate today (Megaliths,Pyramiths etc).","Got this notification after updating my Galaxy S8. Why would snapchat use my camera when I'm not in the app?","EPA Scientist Sounds The Alarm On Geoengineering Contamination And The Overall Onslaught In The Skies.","Maryland girl dies fromHPV shot and MD Dept of Health is accepting pharma money to promote to schools","We Sleep","Interstellar Travel Archetype - Tribes Of Israel - Time To Denuclearize","US Leaders Aid and Abet War Crimes in Yemen: “They came to the hospital in cars and ambulances. Dozens of children with an array of grisly wounds. Some were screaming, some were scared, many went straight to the morgue.”","Kevin Spacey's brother says 'Nazi' father sexually abused him","Facebook Pulls 652 Pages For 'Coordinated Disinformation'","This comes up when Googling BitChute (YouTube competitor). Could just be an algorithm, but seems an awful lot like they're trying to make it look bad.","One of the biggest conspiracies of modernity","Imams in Britain are MI5 agents who are protected and used to radicalize Muslims!","Asia Argento The Hole Truth!","Has an old hippie ever told you about mkultra and syd barret (pink floyd founder)","The current state of the Illuminati world government agenda.","DEEP STATE - Why the World is Now","Any flat earthers wanna provide detailed information and evidence on why the earth is flat","Russian trolls 'spreading discord' over vaccine safety online | Society","[Numberphile] James Simons: Billionaire Mathematician interview","Former Canadian minister of defense talking about aliens","DNC collusion with Ukraine that predates alleged russia hacking/collusion #UkraineDNC","Making Diseases to Kill Black People - Project Coast and The International Bioweapons Mafia [Podcast]","Looking for a Discord Server...","Autonomous killer drones","Does this project/website seem weird to anyone else? \"Climate change denial strongly linked to right-wing nationalism\"","Columbine: Conspiracy?","Actor Christopher Lee describing his involvement in black magic","What if Alex Jones was a government agent that both monitored public leaks of classified information via his tip line AND discredited said leaks by virtue of his reputation?","Rap industry exposed","It looks like the next wave of bots/trolls hack into old/dormant accounts. This appears to be happening on Reddit too.","101 On The Real CIA","Whistleblower: It Was A Failed Coup, Mainstream Media Are Covering Up Phony DOJ Dossier","Hurricane Lane heading for Hawaii, thoughts?","Descendants of Julius Caesar Announcing Themselves Through TV, Movies, Music, Music Videos and Through MK Ultra Programs","Ultimate Proof of Mckayla Maroney under mind control","Though these were some pretty good points reg. the whole ISIS (FBI) camp.","So just a little first hand information on the Iraq War and Saddam","Story of a Purdue Pharma Sales Rep","Fluff Piece Hypothesis: The mobile game \"choices\" is nothing more than cleverly disguised market research.","FEC complaint accuses Clinton campaign, DNC of violating campaign finance law with dossier payments","Proof the black sea was flooded twice from Mediterranean impacts","Has anyone heard of surreality: a modern american epic?","Comedy Central Interviews Jordan Sather And QAnon Supporters About QAnon - Makes Them Look Like Idiots","Shitstain McCain caused the USS Forrestal Fire that killed 134 sailors and injured 161. His daddy, the Admiral, covered it up. Shitstain McCain would later go on to found ISIS.","Lanny Davis says to Anderson Cooper that Cohen “does not” have information that Trump had prior knowledge about the Trump Tower meeting and that the Steele dossier’s allegations about Cohen are “false.”","Hawaii is about to be hit by a major hurricane, yet I’ve literally seen nothing on reddit about it?","\"Democracy Dies In Darkness\" and the Washington Post helps by turning off the lights","How Churchill Made—And Lost—A Fortune in 1929","The National Endowment for Democracy Peddles American Propaganda to Disrupt Legitimate Governments","The New World Order Exposed (Part 1)","Who’s behind the porn industry that is one of several things wreaking havoc on western civilization?","Schumann Resonance Info","Massive Iceberg Breaks Away from Antarctica","Tin Foil Hat With Sam Tripoli #118: China’s One Belt, One Road with Punch Drunk's Johnny Woodard","Volkswagen In Trouble For Altering Mexico's Weather","Sound, Phonons, and Anti-Gravity: New research corroborates speculation that ancient temples were deliberately placed on certain key nodal points of the world to modulate information into the \"planetary field.\" The chief means of doing this was via sound.","QAnon | A Mouthy Buddha Project","The outer limits by nasa","What is the Deep State? How bout we put it in terms of Obama's Presidency....","Russian Robocop: Kalashnikov reveals its 'controlled bipedal walker'","Russian Government prosecuting teenager over anti-Christian memes","Illegally Produced Ammunition Linked to October 2017 Mass Shooting in Las Vegas","A Conspiracy of Cowardice","Facebook is now giving out social trustworthiness scores","Third party looked at reddit chat message","I believe Pope Francis was appointed as an emergency effort to protect the Church from progressive attacks","Geoengineering interview with former EPA scientist","FIFTY8 Interviews Debbie Solaris / Part II Akashic Record Reading","No outer space conspiracy vs free energy conspiracy","Government agent watching me - KnowYourMeme","Lead was one of the factors that led to the fall of Rome.","Founder of Meetme claims Dems - Including Pelosi are involved in Cloning.","Alex Jones says he's Bill Hicks","Lanny Davis says that Cohen “does not” have information that Trump had prior knowledge about the Trump Tower meeting and that the Steele dossier’s allegations about Cohen are “false.”","Joe Rogan Experience #1161 Moon landing is back on the menu boys.","I forgot how convoluted the Boston bombing incident truly was. Anyone have a semi recent documentary of the ordeal?","I'm not saying he's a Muslim, I'm not saying he's from Kenya, I don't care how many people are offended by this because they think it's a right wing hoax, and I don't care that he isn't the president anymore. Barack Obama's birth certificate is a forensically-proven forgery.","Anyone care to discuss the theory that Hitler survived the bunker in Berlin?","Cohen's lawyer says he's completely flipped and will give evidence that Trump colluded with Russia","Alex Jones in Star Fox","Infowars..the message lives on","Remember when those that supposedly hijacked the 911 planes that went to flight school?","Security Brief: Trump Cancels Military Parade; Erik Prince Reups Plan to Privatize Afghan War","Man Proves Radioactive Uranium Is Safe By Eating It","US voices alarm over Russia satellite's 'very abnormal behaviour’","Haven't seen this here yet: RIA Novosti claims the White House has encrypted Russian comms facilities from Rostek-based Concern Radio-Electronic Technologies","Is it just me, or have people been unusually testy / weird today?","A Quote From Orwell's 1984 Reflecting Where We Are Headed with this Censorship Purge We Are Going Through","Nasa Is Releasing A Time Lapse Of Arctic Melting Scientists are Extremely Woried","Cohen's Lawyer Debunks CNN Collusion Report. CNN Appears To Hide His Statement.","Joe Rogan Discusses The Moon Landing (Episode #1161)","Censoring Alex Jones was a plot by Alex Jones and the elites to divide us further and sell more penis pills to the lesser educated.","Advanced Ancient Civilizations DOCUMENTARY Puzzling Archaeology Discoveries 2018","Asia Argento and 17-Year-Old Boy in Bed in Sexual Encounter","How Central Bankers reshaped the world economy following the 2008 economic crisis","Ant1fa made a plugin to mass report videos they don't like on Youtube","Bryan Callen - What Does He Know About PizzaGate? Everything or Nothing?","Paul Manafort went to Kyrgyzstan to 'strengthen Russia's position'","Invisible Dragons: The Santilli Telescope and the Discovery of Invisible Terrestrial entities","Tech giants' next target: conservative entrepreneurs?","There should be ‘consequences’ for platforms that don’t remove people like Alex Jones, Senator Ron Wyden says (D-OR)","5 Non-Americans || Who are/have fighting/fought against the Secret Society(Alleged)","I think the government is probably subsidizing the porn industry.","'What Is The Empire's Strategy?' - Col Lawrence Wilkerson Speech At RPI Media &amp; War Conference","The illegal immigrant killer was a setup","It's surreal seeing this being said on live TV.","Facebook identifying posts with conservative content as spam","Lift the Veil suggests Jen Moore and Seth Rich are psyops to silence potential leakers. \"This is a school play\"","Volkswagen will stop using 'hail cannons' after farmers protest","When baby boomers say \"We got vaccines and we're fine\"","New York state subpoenas Cohen in Trump Foundation probe - Associated Press","What do you guys think?","Michael Cohen paid a mysterious tech company $50,000 'in connection with' Trump's campaign","Michael Cohen's court transcript has been leaked. This is the page that is going to cause major problems for Trump.","An Inforwars reporter confronts Jim Acosta about his support for censorship. (5:14 long)","Eventually, marijuana strains will have fact backed classifications for different types of illness in my opinion. Each strain will be recommended for different ailments (pain, bipolar, etc). This is what the Big Pharma fears most.","Cohen lawyer Lanny Davis suggests his client has knowledge implicating Trump in ‘criminal conspiracy’ to hack Democratic emails","In an Eerily Similar Move to Hitler and the Third Reich, Mastercard and GoFundMe Shut Down The Ability For 2 Jewish Authors to Receive Donations On Account of the SPLC Branding Them as \"Hate Groups\"","Why do you really think we exist?","Trump On Brink Of Privatizing War, Letting Blackwater Control It","Can you please fix your broke brain? This is annoying MAVIS is a pure acting like a juvenile.","Cohen’s lawyer on Trump Tower meeting: Cohen was ‘present at a discussion with' Trump and Trump Jr.","Author Christopher Bollyn claims Zionist threats have forced a Sept. 8th event discussing USS Liberty to change venue. Authors of \"Erasing The Liberty\" Phil Tourney (a survivor of the attack) and Dave Gahary (a US naval submarine veteran) will also speak at the event in San Antonio, TX.","Is the murder of Mollie Tibbetts a Trump Administration conspiracy?","i see 10 posts talking about unlawful data collection then this \"praise google location\" with 82k upvotes at this time. trying to steer the narrative ? go check the comments.","What should we discuss for the next Round Table?","Israeli Responds to The Greatest Story Never Told","The Anthropocene is Fake","An anon on the real reason for mass migration. Thoughts?","Climate change is governed by hundreds of factors, or variables, and the very idea that we can manage climate change predictably by understanding and manipulating at the margins one politically selected factor (CO2), is as misguided as it gets.","plan to defraud the united states","The myth of Nixon’s ‘Southern Strategy’","How McDonald's and Justin Timberlake Secretly Mind F*k'd the World","Why is Dystopian literature a part of the US school curriculum? Huxley, Bradbury, Orwell...","China Is Going to Outrageous Lengths to Surveil Its Own Citizens","Gobekli Tepe - Mega Tsunami 500 mile boat throw *not UFO* (Durupinar Archaeological Site )","New book \"Blood In The Water\" by Joan Mellen claims Israeli attack on USS Liberty in 1967 was ordered by LBJ [November 13, 2018 release date]","Charles Manson claims he is a victim of a conspiracy.","USS Liberty Truths","A NASA Investigation! Something HUGE Just Hit The Ocean!","Project Blue Beam? Don't mean to alarm you – but NASA is about to pummel the planet with huge frikkin' space laser.","The Clinton dynasty continues---Chelsea 'definite maybe' run for politics..","Since ive been posting often here I've got pretty positive feed back on my discoveries. Today i thought i'd share how the will to learn can overpower our will to depression.So i decided suicidal thoughts won't overpower me so i downloaded fruity loops for mobile, and made my first beat to focus.","The 12 year relationship between Donald Trump and Michael Avenatti ~ The Trump Show","Glaring omission by NPR of House Bill 15090, which is a Congressional Record, not a “theory”","Think this?","FINRA allows “Bad Actors” in the Securities Industry to exist because a large percentage of its revenue is derived from fines imposed on “Bad Actors” that should be kicked out of the industry.","This isn't a conspiracy, just a warning for you guys. You're pals, each and every one of you. If you live in Hawaii, start preparing yourselves. Something massive is coming your way.","Flashback to 2014 -Putin's allies channelled billions to Ukraine oligarch- Which included Cohen's lawyer, Lanny Davis.","r/news mods ban and censor literally everyone in a thread about white farmers’ land being seized. Guy who posted it was banned for racism","Reminder about Reddiquette","How can we as Redditors fight against mod abuse on Reddit across default subreddits?","I don't know where else to post this, I found an USB Stick with puzzling content - I need Help to figure this out.","Steele Dossier Pushers Lay Low After Lanny Davis Bombshell","What if Trump is just a weather balloon put up by the ruling class?","Joe Rogan - I Can't Have Alex Jones Back on The Podcast","Who rules our planet? Watch The Pope's Giant Reptilian Audience Hall in the Vatican.","New False Flag In Syria? US, UK &amp; France Accuse Assad Of Chemical Weapons Use, Again","Snipers Destroyed 17 Giant Transformers in Silicon Valley in 2014. Since then Attacks Have Continued Almost Yearly.","Michael Cohen's lawyer says he will not accept pardon from 'criminal' Donald Trump","Podcast","Aluminium and multiple sclerosis","The Fight for Affordable Housing in California","Bones of Love Child From Two Different Hominin Species Discovered in Cave","OC Theory: The Burlington Air National Guard Base in Burlington, Vermont; tests aircrafts when the sky is overcast.","Manafort juror: Mueller team's star witness 'deserves a special place in Hell'","The First Great Deception: The Neolithic Revolution • r/TheGreatDeception","The shills aren't going home at 5 pm east coast anymore.","Something off about TV these days","Michael Cohen told prosecutors he made the illegal campaign contribution \"at the direction of the candiate.\"","What Is Americas Secret Space Shuttle For?","I figured out where all of the new shills came from... Looks like we're going to have some company until the election.","Mollie Tibbetts Challenge! Post a video of someone giving an interview about Mollie’s so-called murder who shows what could be called normal human emotion.","The Tunguska Event, 1908: Actually, it Was a UFO","My God Even the Eyebrows are the Same","Is David Brock alive?"]