["A new treatment for Alzheimer’s disease has been successfully tested in mice. It reduced the buildup of amyloid plaques in the brain and blocked the toxic effects of amyloid β.","Nearly a third of US young adults in a new study (N = 3,050, 18–24 years) were found to be “financially precarious” because they had poor financial literacy and lacked money management skills and income stability.","People with a conspiracy mentality tend to view experts and non-experts as equally credible sources of historical information, suggests new research.","A newly developed pain relief compound, called AT121, appears to deliver more powerful pain relief than morphine, but without being accompanied by the feelings of euphoria that drive addiction","The world's first human trial uses Stem Cells to treat Parkinson's Diseases","A single dose of the cannabis extract cannabidiol can help reduce brain function abnormalities seen in people with psychosis. Results from a new trial, published in JAMA Psychiatry, provide the first evidence of how cannabidiol acts in the brain to reduce psychotic symptoms.","Goats are drawn to humans with happy facial expressions, scientists find","Toddlers know when they're being judged - By the age of 24 months, even before they can form a complete sentence, toddlers are attuned to how others may be judging them and will alter their behavior to seek a positive response.","Acne vaccine candidate 1st to target bacteria already in human skin - A new pre-clinical study in mice demonstrated for the first time that antibodies to a toxin secreted from bacteria in acne vulgaris can reduce inflammation in human acne lesions.","Scientists discover hidden deep-sea coral reef off South Carolina Coast","New study shows that non-invasive detection of coronary inflammation using computed tomography can predict fatal heart attacks","Researchers have discovered a network of brain cells that expresses our sense of time within experiences and memories.","Arctic sea ice isn’t just threatened by the melting of ice around its edges. Warmer water that originated hundreds of miles away has penetrated into the interior of the Arctic. That heat, currently trapped below the surface, could melt the region’s entire sea-ice pack if it reaches the surface","New therapy spurs nerve fibers to regrow through scar tissue, transmit signals after spinal cord injury in rodents. UCLA study could lead to new treatments for patients","Wild dolphins learn to 'walk on water' by copying tricks from captive animals, study finds","Scientists report that bumblebees who are exposed to the controversial neonicotinoids class of pesticides (banned in the EU, but popular worldwide), develop an increased affinity (addiction) towards such pesticide contaminated foods compared to uncontaminated foods","Cannabis extract helps reset brain function in psychosis","In 2016, firearms killed approximately 251,000 people worldwide. More than half of those deaths occurred in just six countries. These statistics come courtesy of the first global tally of firearm deaths, which estimated numbers for 195 countries","Ketamine, A Promising Depression Treatment, Seems To Act Like An Opioid","Researchers have fully 3D printed an image sensing array on a hemisphere, the first-of-its-kind prototype for a \"bionic eye\"","Neurobehavioral correlates of obesity are largely heritable","Serotonin system is way more complex than we thought","You can get STDs in your eyes. Ocular Syphilis is on the rise, with 38% of patients in one study suffering vision loss as a result.","The more pesticides bees eat, the more they like them. Bumblebees acquire a taste for pesticide-laced food as they become more exposed to it, a behaviour showing possible symptoms of addiction","Improving soil quality can slow global warming","More remote islands might be more susceptible to invasive species. Geographical isolation does not protect islands from alien species, and island species richness may reach a new dynamic equilibrium at some point, likely at the expense of many endemic species.","At Vanderbilt University Medical Center, deep brain stimulation shows signs of slowing spread of Parkinson's tremors","Bumblebees acquire a taste for pesticide-laced food as they become more exposed to it, a behavior showing possible symptoms of addiction.","AWAKE successfully accelerates electrons using plasma wakefields at CERN","Wandering Bose-Einstein condensate may lead to scalable quantum computer","Peace of mind and anxiety in the waking state are related to the affective content of dreams","HAARP opens its doors to the public, but some minds prove hard to change","Scientists have used machine learning to calculate the pattern of aftershocks following an earthquake.","1,500 scientists lift the lid on reproducibility","As carbon dioxide levels climb, millions at risk of nutritional deficiencies","Gay men who feel lonely are 67% more likely to have unprotected anal sex, Chinese study shows","Arctic sea ice isn't only threatened by the melting of ice around its edges, a new study has found. It turns out that warmer water that originated hundreds of miles away has penetrated deep into the interior of the Arctic.","Cambridge team have solved the 3D structure of the tau filaments that misfold to cause the neurodegeneration that underlies Pick’s Disease, a relatively rare form of dementia.","Using 29 DNA codes that are common to species across the tree of life, researchers have placed the emergence of the last universal common ancestor (LUCA) at an extraordinarily early 4.5 billion years ago – just an eye-blink after our planet formed.","Global warming is intensifying El Niño weather","Regenerating nerve fibers across spinal cord injury","Pain-killing Compound Blocks Abuse Potential of Prescription Opioids","Minoxidil (Rogaine) improves vascular compliance, restores cerebral blood flow, and alters extracellular matrix gene expression in a model of chronic vascular stiffness","Artificial intelligence nails predictions of earthquake aftershocks - a neural-network analysis outperforms the method scientists typically use to work out where these tremors will strike.","Beavers have an impact on the climate","We may believe we can make objective moral assessments and be impartial judges. But a new study suggests we are in fact influenced by the most subjective of factors: how much we like someone. Overall, researchers found that simply liking a person makes us think they are more moral (N =645).","Scientists report on ancient parasitic wasps (named Xenomorphia after the Alien movies) that resided inside fly fossils","One in seven US adults used marijuana in 2017, with smoking being the most common manner of consumption, according to a new study in the Annals of Internal Medicine.","Modeling tools can be used to identify specific locations in Fiji where conservation actions would yield the highest benefits for downstream reefs in terms of mitigating harm to coral communities and associated reef fish populations.","Associations of fats and carbohydrate intake with cardiovascular disease and mortality in 18 countries from five continents","A new study sheds light on the roles both genetics and neuroanatomy play in obesity. Researchers report those with higher BMI had reduced cognitive flexibility, reduced ability to delay gratification and worse verbal memory.","Gravity’s strength has been measured to its greatest precision yet","Electrophoretic drug delivery for seizure control - Implantable brain device could stop epileptic seizures in their tracks. The technology might one day also be used to treat brain tumors and Parkinson's disease.","Unprecedented real-time 3D images of macrophages gulping surrounding fluid show they use projections with membrane strung between, like tent poles.","Hippocampal place cells cannot be seen with fMRI, says new research that disproves previous work","Quantity discrimination in angelfish, Pterophyllum scalare: a novel approach with food as the discriminant","Close ties with fathers help daughters overcome loneliness. Researchers found that girls tended to report less loneliness as they went from first grade to fifth grade. But loneliness declined more quickly among girls who had a closer relationship with their fathers.","A study has found adults are able to accurately read a range of emotions in the voices of teens. Meanwhile teens are far less able to understand what is going on with their peers, particularly when it comes to tones of voice which express anger, meanness, disgust, or happiness.","Air pollution causes ‘huge’ reduction in intelligence, study reveals. Impact of high levels of toxic air ‘is equivalent to having lost a year of education’","Before the dinosaurs, a million-year long volcanic eruption destroyed the ozone layer. Scientists concluded that the large reservoir of halogens that was stored in the Siberian lithosphere was sent into the earth's atmosphere during the volcanic explosion, effectively destroying the ozone layer","Scientists have designed a new model to predict how temperatures will impact the transmission patterns of the mosquito-borne Ross River virus. The study provides strong evidence that temperature drives infection patterns at the continent-wide and seasonal levels.","What quantum-interference assisted molecule metrology can tell us about reality and non-locality (Markus Arndt) | EmQM17","Un-picking Pick’s Disease: Scientists solve the structure of filamentous tau isoform that causes Pick’s Disease (Frontotemporal Dementia) at atomic resolution using Cryo-EM","New Study Is the Most Successful Attempt to Gene Edit Human Embryos So Far","Republicans Suffer from \"Backfire Effect\" in Study on Exposure to Opposite Views on Social Media","Traffic noise may be associated with an increased rate of telomere loss in Zebra finches that have left the nest, making them age more quickly.","Scientists tweak DNA in viable human embryos: Correction of the Marfan Syndrome Pathogenic FBN1 Mutation by Base Editing in Human Cells and Heterozygous Embryos","Study finds that legislation to increase HPV vaccinations did not increase adolescent sexual behaviors","Adults ages 45 or older who experience psychological distress such as depression and anxiety may have an increased risk of developing cardiovascular disease, according to new research","Hurricane Maria and its aftermath caused a spike in Puerto Rico deaths, with nearly 3,000 more than normal","Franklin expedition lead exposure: New insights from high resolution confocal x-ray fluorescence imaging of skeletal microstructure","Dietary carbohydrate intake and mortality: a prospective cohort study and meta-analysis","False Polarization and False Moderation: Political Opponents Overestimate the Extremity of Each Other’s Ideologies but Underestimate Each Other’s Certainty","Researchers have developed a new technique that can measure the position of every single gene in the nucleus to build a 3D picture of the genome's organization.","People who don't read the news better at predicting which articles will go viral. \"Frequent news readers may be bringing to mind idiosyncratic information that's more unique to them,\". \"Infrequent news readers, responded in a way that was more reflective of how people in general respond\"","Researchers unearth secret tunnels between the skull and the brain: NIH-funded study suggests immune cells rush through channels to get to injured tissue quickly.","Laughing gas, nitrous oxide (N2O), may explain why Earth's oceans didn't freeze over during the so-called Boring Billion, between 1.8 billion and 800 million years ago.","Researchers have identified a pair of genes that regulate how much REM and non-REM sleep an animal experiences.","Accurate Genomic Prediction Of Human Height","Ant groups with as few as six individuals experienced significant benefits from group living, as measured by better-surviving and faster-growing babies. The results could hint at how societies evolve.","Climate change will make hundreds of millions more people nutrient deficient | by the middle of the century about 175 million more people develop a zinc deficiency, while 122 million people who are not currently protein deficient could become so.","Clinical evaluation of Morgellons disease in a cohort of North American patients","Psychology continues to face a replication problem: researchers attempted to reproduce 21 high-profile studies published between 2010 and 2015. Of the 21 tested, only 13 could be replicated, and the effect sizes were about half as strong.","UCLA-led study reveals the mechanism that helps malaria parasites take over human red blood cells. 3D imaging could lead to new targeted therapeutics","GW Study: Excess Mortality From Hurricane María in Puerto Rico","Relative fat mass (RFM) as a new estimator of whole-body fat percentage","Most healthcare organizations have adopted electronic health record systems, but their effects on patient health has been unclear. After analyzing 5 years of Medicare data, researchers found that the tech is improving patient mortality rates, especially as time goes on.","Marijuana found in breast milk up to six days after use - Researchers report 63 percent of breast milk samples from mothers using marijuana contained traces of the drug","Watching the clock: Faster countdowns may make people more patient - In a series of experiments, the speed of a countdown clock affected the patience and decision-making of video game players, both during and after the game","As algae bloom increase, scientists seek better ways to predict these toxic tides","Using a combination of deidentified aggregated data from vital registration, verbal autopsy, census and survey data, and police records in models for 195 countries and territories, There was an annualized decrease of 0.9% in the global rate of age-standardized firearm deaths from 1990-2016.","Ancient parasitic wasps found in fossil fly pupae - Scientists reported the discovery of 55 cases of parasitation by four extinct wasp species. The parasitation events were found inside phosphatized fly pupae from the Paleogene, the period spanning 66 million years ago to 23 million years ago.","Eating poop makes naked mole rats more motherly","Application of SEO Metrics to Determine the Quality of Wikipedia Articles and Their Sources","How new sex chromosomes evolve: A sex-determining DNA sequence in wild strawberries has repeatedly jumped around the genome, bringing along genetic souvenirs from its previous locations.","Studying the Cognitive Map of the U.S. States: Ideology and Prosperity Stereotypes Predict Interstate Prejudice","Boosting ATM activity alleviates aging and extends lifespan in a mouse model of progeria","Record electron spin lifetime of 60s measured in a nanostructure spin qubit device","Leukemia mRNA Processing Pathways Contribute to Disease Progression","Genome Sequencing Reveals a Large and Diverse Repertoire of Antimicrobial Peptides","White challengers from the same party running in the same state for the same office around the same time as black challengers are about three times more likely to win and receive about 13 percentage points more support among white voters (controlling for confounding factors).","Extinct Cave Bear DNA Found in Living Bears. The discovery is the first of its kind outside the human lineage.","No Ovarian Failure Risk After HPV Vaccine, Study Finds","Researchers develop a modular metal-organic framework with highest electron charge mobilities ever observed","Belugas, narwhals go through menopause - Prior to a new study, only humans and 2 other species were known to experience menopause","In experiments replicating bubble blowing, scientists have discovered two ways in which bubbles can be made: one, by pushing with a steady but strong wind on a soap film through a circular wand and two, by pushing with a gentle wind on an already-inflated film in order to drive its further growth.","Study: Only two percent of teens read newspaper, one-third have not read book in last year","Stone tools reveal modern human-like gripping capabilities 500,000 years ago","A first-of-its-kind online scoring tool allows doctors to access a numerical prediction of how patients might respond to drugs that target cirrhosis. Researchers say the tech can help clinicians determine whether a patient is a good candidate for a liver transplant.","A recent study (n=1.4 million) in the Journal of the American Medical Association found a significant relationship between frequent moves in childhood and adolescence and nonaffective psychosis. It is thought that frequent disruption of social network contributes to these short bouts of psychosis.","A new type of human brain cell has been identified that isn't found in mice","A small study (N = 168) on the online \"filter bubble\" found that liberals and conservatives were actually recommended similar stories on Google News, representing a fairly homogeneous set of mainstream news sources","Sex in plants requires thrust","DNA shows cave girl was half Neanderthal","Weight-Loss Drug Lorcaserin Clears Cardiovascular Safety Hurdle - A drug already approved in the US for weight loss in overweight and obese patients does not increase the risk of cardiovascular events, according to the results of a large safety study.","Study finds parents tend to be more socially conservative and judgmental than non-parents.","Impact of anthropogenic CO2 emissions on global human nutrition","\"The Great Dying\" caused by a nearly-million-year-long volcanic eruption, flooded the Earth’s atmosphere with halogens that depleted the ozone layer.","Transgender-Positive Approach Overdue in Acute Care. Offensive Terminology, ‘Dearth of Formal Education,’ May Undermine Medical Care for Vulnerable Population, UCSF Physicians Say","On-again, off-again relationships,is associated with associated with increased symptoms of depression and anxiety a new study says.","A Volcanic Eruption Blew Away the Ozone Layer in the End-Permian Extinction","Levels of chronic pain after trauma in car accident vary depending on variants of a gene that moderates the stress hormone, cortisol","Researchers find that there are potentially substantial benefits to minimizing the time between influenza vaccination and influenza activity in U.S. older adults. With modest delays proving beneficial.","Report on two dinosaurs found in China, bridging 90M year evolutionary gap between early Alvarezsaur finds (3 major claws), new find (one major, 2 minor claws), later finds (one major, 2 tiny claws) - confirming the steady evolutionary reduction of claws between early and later fossil record","Naked mole rats prepare themselves to take care of their queen's babies by eating her dung","Brains of doers differ from those of procrastinators - Procrastinators have a larger amygdala and poorer connections between it and part of the cortex that blocks emotions, so they may be more anxious about the negative consequences of an action, and tend to hesitate and put off things.","Scientists sequence the wheat genome that should help wheat breeding efforts to improve wheat yields in the face of climate change (200 scientists in 73 research institutions from 20 countries participated)","Clinical trial shows that fish oil has no positive impact on prevention of cardiovascular risk (n= 15,480)","The impact of exposure to air pollution on cognitive performance","A Systematic Review of the Next‐Day Effects of Heavy Alcohol Consumption on Cognitive Performance","Women may need a more nutrient-rich diet to support a positive emotional well-being, according to new research.","Researchers take first 3D image of a microscopic crack propagating through metal damaged by hydrogen. The only way to analyze such a failure now is to look at separated pieces of a completely fractured component. The work could help prevent the failure of everything from bridges to dental implants.","A new study has demonstrated a method that produces novel light beams from synchrotron light sources, opening up a new way to generate X-ray beams.","How our fat ‘rheostats’ make it tough to lose weight - Scientists identify function of protein that has been confounding metabolism researchers for more than two decades. It may have implications both for treating obesity and for understanding weight gain during pregnancy and menopause.","Happy older people live longer, say researchers. The likelihood of dying due to any cause was 19 percent lower for happy older people. Further, the inverse association of happiness with mortality was consistently present among men and women","Students' ratings of depression have been shown to peak at the end of the first semester in December (though not at the end of semester 2 in April). This increase in depression has been associated with students' perceptions of a higher than average workload, rather than the amount of the workload.","Random prospective trial of omega-3 supplements in 15480 diabetic patients finds no effect on risk of serious cardiovascular events","How Neutron-Star Crashes Could Help Aliens Call Us","JCI Insight - Hepatocyte ALOXE3 is induced during adaptive fasting and enhances insulin sensitivity by activating hepatic PPARγ","Chemical disruption of the pyroptotic pore-forming protein gasdermin D inhibits inflammatory cell death and sepsis","Mutations in the molecule TRPV3, a skin-cell ion channel that plays important roles in sensing temperature, may have helped mammoths tolerate the cold","HIV Prevalence is Higher in Circumcised Men compared to Uncircumcised Men in South African Study.","Animals that develop epilepsy after an infection can be identified as early as three months prior to their first seizure by measuring interactions between the brain and the heart, according to new research.","New treatment for advanced ovarian and lung cancer could give patients months longer to spend with their loved ones, early trial results suggest. Combination of targeted drug vistusertib and paclitaxel chemotherapy stopped growth of cancer for nearly 6 months and caused the tumours of some to shrink","Government rules aimed at curbing opioid prescriptions may have backfired - once prescription refills became tougher under new DEA rules, surgeons simply ordered a larger number of pills so the patient had a \"stockpile\" of opioids to use at home, finds new study in JAMA Surgery (N=21,955 patients).","Fish oils do not prevent heart attack or strokes in people with diabetes.","How sleep loss may contribute to adverse weight gain - Study finds a night of sleep loss has tissue-specific impact on the regulation of gene expression and metabolism in humans. This may explain how shift work and chronic sleep loss impairs our metabolism and adversely affects our body composition","Study finds religion influences how you experience psychedelic drugs - The study of 119 participants found that religious people and those who took psychedelic drugs with religious intent tended to report stronger mystical experiences.","Shifting the limits in wheat research and breeding using a fully annotated reference genome","Living close to urban green spaces is associated with a decreased risk of breast cancer. The study, which analysed data from more than 3,600 women in Spain, concluded that the risk of breast cancer was lower in the women who lived closer to urban green spaces, like parks or gardens.","First-ever 3D-printed electrolyte for lithium-ion batteries","Children with certain types of brain tumours who undergo radiation treatment are less likely to recall the specifics of events they experienced after radiation than to remember pre-treatment happenings","Materials scientists use molecular models to demonstrate the theory that nanotubes of the right diameter can prompt water inside to solidify into a square tube, transitioning into a kind of ice. The discovery could lead to new types of nanochannels devices, like nanoscale capacitors or syringes.","New study finds financial fallout from breast cancer can last years and cause series of cascading economic consequences for survivors and families. Many reported use of savings, loans, or debt to cover medical costs, often so large that they compromise ability to manage needs like utility bills.","ASCEND: Aspirin Doesn’t Look Good for Primary Cardiovascular Prevention in Diabetic Patients","Burning fossil fuels contributes most to global oxygen drop. It is estimated that the world’s oxygen concentration will drop from its current level of 20.946 percent to 20.825 percent as the annual atmospheric oxygen consumption increases sharply to 100 billion tonnes by 2100.","Dreaming and awareness during dexmedetomidine- and propofol-induced unresponsiveness","Predicting landslide boundaries two weeks before they happen. Researchers can now predict when a rubbish landfill might break in a developing country, when a building will crack or the foundation will move, when a dam could break or a mudslide occur","A major study has found promising results for the safety of a weight-loss drug available in the US. The study, published in the New England Journal of Medicine, says adults using the drug lorcaserin lost an average of 4kg (8.8lb) over 40 months.","Effects of Aspirin for Primary Prevention in Persons with Diabetes Mellitus","Cooking with coal, wood, or charcoal associated with cardiovascular death","Paleolithic Venus statues don't show exaggerated features from an outside perspective- they were made by women who were examining their own bodies and sculpting them from their own point of view","Our brains have “auto-correct” feature that we deploy when re-interpreting ambiguous sounds. Study shows the brain uses information gathered after the detection of an initial sound to aid speech comprehension. Findings point to new ways we use information and context to aid in speech comprehension.","Comprehensive systematic review on Disorders of consciousness","UCLA researchers identify link between gut bacteria and eating for pleasure, as opposed to hunger","Viral outbreaks could be predicted two years in advance by mathematical model","Scientific discoveries through the trivial","Listening to music while exercising activates specific brain region, and could help stave off fatigue, finds a new neuroimaging study.","Our brains process sarcasm conveyed by emojis in the same way as sarcasm conveyed by words","Scientists have developed a new biological drug with a success rate of 50 percent for lab mice with acute leukemia. It attacks several leukemic proteins at once, making it difficult for the leukemia cells to activate other proteins that can evade the therapy","Neuroscientists restore significant bladder control to 5 men with spinal cord injuries. In UCLA study, magnetic stimulation of lower spine eliminates need for catheter for up to 4 weeks","For people with treatment-resistant depression, adding vagus nerve stimulation to medication can drastically improve their quality of life, concludes a new study. The team examined the effects of VNS on nearly 600 people with treatment-resistant depression.","The world's cleanest water droplet","Observation of Dicke cooperativity in magnetic interactions: Physicists show first proof of Dicke cooperativity in a matter-matter system","Effects of n−3 Fatty Acid Supplements in Diabetes Mellitus","Alzheimer’s disease may be predicted by using a non-invasive eye exam to detect retinal thinning before any symptoms appear, finds a new study in JAMA Ophthalmology.","A meta-analysis of 10 large trials including 78,000 individuals found no effect of fish oil supplements on rates of cardiac events.","Pregnant seahorse fathers spontaneously abort or divert fewer resources to their embryos when faced with the prospects of a superior mate — in the case of the recent study done, an exceptionally large female.","Tools of Ancient Easter Islanders Hint at Sophisticated Society","Russian trolls have found a way to turn people against vaccines, according to a new study. \"Russian trolls promoted discord. Accounts masquerading as legitimate users create false equivalency, eroding public consensus on vaccination.\"","A new material developed by University of Colorado Boulder engineers can transform into complex, pre-programmed shapes via light and temperature stimuli, allowing a literal square peg to morph and fit into a round hole before fully reverting to its original form.","Racial beliefs can lead some Americans to minimize President Barack Obama’s economic accomplishments, finds a new study (N = 1,100).","A new study shows that the Milky Way galaxy is currently in its second life, having previously died over a 10 billion year time period.","Observation of the 1S–2P Lyman-α transition in antihydrogen","CTA plus standard care for those with stable chest pain resulted in a much lower rate of death from coronary heart disease or nonfatal myocardial infarction at 5 years than standard care alone, without resulting in a significantly higher rate of coronary angiography or coronary revascularization.","Researchers’ model could help stem opioid crisis. Increasing the availability of naloxone, cutting opioid prescriptions by 25 percent and expanding drug-treatment programs could reduce opioid-related deaths by 6,000 over 10 years, Stanford researchers estimate.","A new study by researchers show that people with more peace of mind in the waking state have more positive dreams, whereas those with more anxiety in the waking state have more negative dreams","Gift givers tend to focus on the \"big reveal\", leading them to choose whichever gift is more likely to surprise and delight the recipient in the moment of seeing it, even when other gift options are more likely to bring recipients the greatest satisfaction.","Scientists find an association between thinning of central portion of retina with incidence of Alzheimer's disease, which could lead to an eye-exam test for pre-Alzheimer's in the future","US government failing to provide recovery plans for some endangered species. US agencies have no official recovery plans for almost one-quarter of the plants and animals protected under the landmark Endangered Species Act.","Strange gamma rays from the Sun may help decipher its magnetic fields","Three new Eocene omomyine (primate) genera from the Friars Fm of San Diego County, California","No amount of alcohol is good for your overall health, global study says","Opportunistic Measurement of Skeletal Muscle Size and Muscle Attenuation on Computed Tomography Predicts One-year Mortality in Medicare Patients | The Journals of Gerontology: Series A | Oxford Academic","Lost city with pyramid and human sacrifices is rewriting history: The remains of Shimao, an ancient walled settlement in today's northern China, is revolutionizing archaeologists’ understanding of the country’s history","Epigenetic Modifiers Induce Bioactive Phenolic Metabolites in the Marine-Derived Fungus Penicillium brevicompactum","SNIPP Proteins May Point to Why We Get Sleepy | Quanta Magazine","New ‘micro-organ’ was hiding in plain sight - For the first time in decades, researchers have identified a new anatomical structure within the immune system, that ‘remembers’ past infections and vaccinations, and where immune cells gather to mount a rapid response.","Saturated Fat Is More Metabolically Harmful for the Human Liver Than Unsaturated Fat or Simple Sugars","Canadian laser breakthrough has physicists close to cooling down antimatter","A new quantum experiment breaks the idea of \"before\" and \"after.\" Physicists from the University of Queensland designed a race course for light that forced a single particle to traverse two pathways at once, making it impossible to say in which order it completed a pair of operations.","Natural sugar cuts diabetes risk in mice - A natural sugar called trehalose blocks glucose from the liver and activates a gene that boosts insulin sensitivity, which reduces the chance of developing diabetes, according to new research.","Additive manufacturing of complex micro-architected graphene aerogels\"We've been able to show you can make a complex, three-dimensional architecture of graphene while still preserving some of its intrinsic prime properties,\"","Candidate for Universal Flu Vaccine Protects Against Multiple Strains in Preclinical Study","Green Biobatteries: Hybrid Paper–Polymer Microbial Fuel Cells","After decades of searching, scientists have finally pinned down the protein responsible for turning the mechanical wiggling of hair cells in the inner ear into electrical signals for the brain to interpret as sound.","Efficacy of Multimedia Learning Modules as Preparation for Lecture-Based Tutorials in Electromagnetism","Climate change denial strongly linked to right-wing nationalism, finds a new study.","Drinking Alcohol Increases Risk of Breast Cancer","A team of investigators from across Canada, including a trio of Western researchers, have raised serious doubt about the popular belief that lead poisoning played a role in the death of members of the famed Franklin Expedition.","Chickens prefer beautiful humans.","Research has found positive effects of day-to-day prosocial behavior on mood for teens with high levels of depressive symptoms. The study found that providing help can make individuals feel appreciated by others or promote their sense of purpose and self-esteem.","First signs of autism appear in infancy","Two new Chinese dinosaurs discovered","A team of investigators from across Canada, including a trio of Western researchers, have raised serious doubt about the popular belief that lead poisoning played a role in the death of members of the famed Franklin Expedition","Elite discourse about fake news leads to lower levels of trust in media and less accurate identification of real news","Gender and bias in the International Relations curriculum: At the London School of Economics, 79.2% of texts on reading lists (N = 12,399) are authored exclusively by men; level of study, subfield, and the gender and seniority of the course convener matter","New research uncovers 'one of the tobacco industry's greatest scams' - Evidence that big tobacco companies are still facilitating tobacco smuggling, while attempting to control a global system designed to prevent it, and funding studies that routinely overestimate levels of tobacco smuggling.","Russian trolls 'eroded public consensus' on vaccination, says report","A new study says women want men to be smart, but not too smart; it also suggests very high levels of IQ might be associated with negative characteristics such as “social competence difficulties,” and that men who are too smart are perceived as too high-maintenance, so women would rather steer clear.","Ruffled head feathers and blushing may signal positive social interactions in Macaws. A new study observed head feather ruffling is associated with states of lower arousal and positive social interactions while rapid skin color changes (blush) was demonstrated in situations associated with emotion.","Epigenetics of Sleep Loss Linked with Weight Gain and Muscle Loss in Humans","New study finds that, contrary to expectations, female sexualisation on social media is *not* related to gender inequality. Instead, they found that local income inequality was a far better predictor of whether women tended to post sexualised pictures of themselves on social media.","Air pollution leads to cardiovascular diseases. International team of experts from Mainz, London and Cleveland reports on mechanisms that cause vascular damage. \"The fine dust particles are chemically formed mainly in the atmosphere from emissions from traffic, industry, and agriculture","Although it has been described as one of Italy's most influential seaports during the Middle Ages, the Pisa harbor is not there anymore. New insights into the evolution &amp; eventual disappearance of Portus Pisanus, the lost harbor of Pisa, have been revealed","Laziness may be an effective survival skill, study finds. Researchers analyzed the energy used by mollusks—snails, scallops, mussels, slugs—and found species that survived over millions of years possessed a \"statistically significant difference\" in their metabolic rates than those that went extinct.","The disproportionate placement of racial minorities into special education for learning disabilities may be due largely to social inequities outside of schools, researchers suggest, rather than racially biased educators.","Explosive case of poop-packed 'mega colon' prompts warning from doctors","Scientists have developed a probiotic \"cocktail\" derived from gut bacteria strains found in infant feces that may help increase the body's ability to produce short-chain fatty acids","How Insulin Helped Create Ant Societies","A group of researchers have investigated a novel Polyelectrolyte complex (PEC) that provides a barrier to prevent adhesions in post-operative complications. This has the potential to avoid the need for a second surgery to remove the adhesions.","Research finds bots and Russian trolls influenced vaccine discussion on Twitter","Study finds alcohol hangovers hamper learning and reward processing in the brain","International collaboration studies economics of turning Idaho manure to biogas","Lack of sleep has long been linked to obesity, but a new study suggests late night snacking may not be the primary culprit. The latest findings provide the most compelling evidence to date that disrupted sleep alters the metabolism and boosts the body’s ability to store fat.","Bones of ancient teenage girl reveal a Neanderthal mother and Denisovan father, providing genetic proof ancient hominins mated across species.","The spotlight of our attention is more like a strobe - four times per second, it rhythmically cycles between periods of maximum focus and periods of a broader situational awareness. In other words, every 250 milliseconds, we have an opportunity to switch attention, finds a new neuroscience study.","Cardiac arrest patients given epinephrine are more likely to have severe neurological impairment according to the full NHS study on withholding epinephrine from patients in cardiac arrest, published in New England Journal of Medicine today.","New study details how antibodies attack the brain and muddle memory. In mice, these immune molecules gone awry target a key message-sensing protein on nerve cells. This insight may ultimately lead to better ways to stop the ensuing brain damage.","Eye diseases have been linked to the development of Alzheimer's disease in a new study. Glaucoma, age-related macular degeneration, and diabetic retinopathy were associated with increased Alzheimer's disease risk. Cataracts were not associated with increased risk of Alzheimer's disease.","Elusive mitochondrial connection to inflammation uncovered","Using data from 78 patients, researchers have developed an algorithm to analyze brain scans and pick apart the subtle differences in mood disorders like bipolar 1 and major depressive disorder. The algorithm correctly classified illnesses 92.4% of the time.","Landslides triggered by human activity are on the rise, according to a new study of over 4800 fatal landslides occurring around the world from 2004 to 2016. The study also found that landslides killed over 50,000 people during that period.","Mammals and birds have evolved their large brains by breaking strong ties between body size and brain size. This was likely only possible due to strong changes in early brain development, and parental care has likely played a crucial role.","On-and-off relationships take a mental toll - New study shows these type of relationships are associated with higher rates of abuse, poorer communication, and lower levels of commitment. Researchers did not find meaningful differences between same-sex and heterosexual relationships in this pattern.","First 3D printing of graphene structures with arbitrary shape complexity, fine features, enhanced strength","COMPASS Pathways Receives FDA Approval for Psilocybin Therapy Clinical Trial for Treatment-resistant Depression","A natural sugar called trehalose could help treat metabolic syndrome, as well as related conditions such as obesity, diabetes, and fatty liver disease.","Fragmentation of rods by cascading cracks: Why spaghetti noodles do not break in half. MIT research based on an unsolved question posed by Richard Feynmann.","Analysis of social media posts about vaccines finds that malware-spreading bots are pushing anti-vaccination messages, while Russian trolls are using the subject to promote discord.","Crystallographic character of grain boundaries resistant to hydrogen-assisted fracture in Ni-base alloy 725","Top geneticist loses £3.5-million grant in first test of landmark bullying policy","Air Pollution Reduces Global Life Expectancy by More Than One Year, Study Finds","Scientists tackle 150-year-old mystery about the nature of light-matter interactions, and were able to measure the force that light exerts on matter. The results confirm that light possesses momentum, an idea first proposed by Johannes Kepler in 1619.","While some develop PTSD after trauma, most people recover, and some even report better mental health than they had before, so-called “post-traumatic growth”, which has to do with trauma triggering a form of mental training that increases some survivors’ control over their own minds, finds new study.","Porn use does not predict problems with porn, but religiosity does, finds a new meta-analysis, which suggests that Pornography Problems due to Moral Incongruence (PPMI) appear to be the driving force in many of the people who report dysregulated, uncontrollable, or problematic pornography use.","The war over supercooled water - How a hidden coding error fueled a seven-year dispute between two of condensed matter’s top theorists.","Air pollution shortens human lives by more than a year, according to a new study.","Nucleus of the Solitary Tract Serotonin 5-HT2C Receptors Modulate Food Intake [triggering the POMC nerve cells (to produce the same fullness hormone the body would send out after a meal) has a 'significant and rapid impact on feeding behaviour' – meaning it squashes the desire to eat.]","Pay attention to the “noise” in your brain","An international team of researchers has uncovered a destructive mechanism at the molecular level that causes a well-known phenomenon associated with obesity, called leptin resistance","Laughing gas may have helped warm early earth and given breath to some life - N2O modeling and lab experiments add possibilities to what could have made faint young sun paradox work","Akin to noise-cancelling headphone technology, ETH Zurich physicists invert the electric and magnetic structure of materials -- Nature","Italian scientists use bacteria to recreate the Mona Lisa","Scientists at Wake Forest School of Medicine have developed a probiotic \"cocktail\" derived from gut bacteria strains found in infant feces that may help increase the body's ability to produce short-chain fatty acids (SCFAs).","Scientists ID sensor protein responsible for hearing, balance","Pyramid of Giza is able to interact with external electromagnetic waves of the radio frequency range 200-600m (roughly the length of the pyramid base). Interactions include first multiple resonances and energy concentration.","Men who exhibit high social dominance make faster decisions than low-dominance men even outside a social context, finds a large behavioral study from EPFL.","Why are eggs shaped the way they are? Study tests latest theories about the advantages to the specific parameters of eggs of one bird species, the Common Murre.","A Nature paper on perovskites has been flagrantly plagiarised line-for-line in a competitor journal","Newly analyzed amber fossils have helped scientists characterize the evolutionary history of myrmeleontiformia, a group of lacewing insects that includes antlions and is distinguished by predatory larvae and unusual morphologies.","Largest Brain Study of 62,454 Scans Identifies Drivers of Brain Aging. Schizophrenia, cannabis use, and alcohol abuse are just several disorders that are related to accelerated brain aging","Electrically charged volcanic ash short-circuited Earth’s atmosphere in 1815, causing global poor weather and Napoleon’s defeat, says new research","Genomic and Strontium Isotope Variation Reveal Immigration Patterns in a Viking Age Town","Study shows diminished but ‘robust’ link between union decline and rise of inequality, based on individual workers over the period 1973-2015, using data from the country’s longest-running longitudinal survey on household income.","A new method combining a fluorescent timer with pulse chasing has revealed the “see-saw” balance of protein synthesis and degradation in single cells.","A Milestone for Forecasting Earthquake Hazards - Researchers Replicate Latest California Earthquake Projections with Physics-based Model","Pigmentation and the melanocortin system modulate aggression and sexuality in humans as they do in other animals","Research has found that antibodies in the brains of mice can lead to them having memory problems","The benefits for E. coli - Microbial Siderophore Enterobactin Promotes Mitochondrial Iron Uptake and Development of the Host via Interaction with ATP Synthase","Laughing Gas May Have Helped Warm Early Earth and Given Breath to Life","Scientists discovered a new species of tiny seahorse off the coast of Japan. It is abundant but only the size of a grain of rice and well camouflaged, so it’s been hiding in plain sight.","Exploring the Impact of Personal and Partner Traits on Sexuality: Sexual Excitation, Sexual Inhibition, and Big Five Predict Sexual Function in Couples.","Study says Earth’s magnetic field has shifted rapidly in the past, and if it happens again it could be catastrophic.","EPFL neuroscientists have found that the output synapses of certain interneurons in the cortex show long-term plasticity. This plasticity occurs during a critical period of brain development and might contribute to the experience-dependent rewiring of brain circuits.","Role for the longevity protein SIRT6 in primate development | nature","Scientists Show That Parrots Will Make the Most Economic Decisions When Choosing Between Immediate Food And Tokens That Can Later Be Traded For Other Food","New research reveals that many lakes in the continental United States are becoming \"murkier, with potentially negative consequences for water quality and aquatic life. In the 5 years between 2007 and 2012, the dominant lake type in the United States shifted from clear, blue lakes to greenish-brown","A study has found significant improvements in the social skills of children with Autism Spectrum Disorder (ASD) after a month of working with robots. The robots helped the children learn social skills such as emotional understanding, taking turns, and seeing things from others’ perspectives.","This Element's Weird Behavior Could Lead to Faster Electronics","In a new study, researchers discovered ancient pink pigments from rocks that are more than 1.1 billion years old in the Sahara Desert, specifically in the Taoudeni Basin in Mauritania, West Africa. Those pigments are the oldest known colors on record.","Breastfeeding may reduce the risk for stroke in post-menopausal women who reported breastfeeding at least one child, according to new study.","Survival of the laziest - A new large-data study of fossil and extant bivalves and gastropods in the Atlantic Ocean suggests laziness might be a fruitful strategy for survival of individuals, species and even communities of species.","Carers of terminally ill up to 7 times more likely to have mental health problems. The study reveals 83% of family carers of people with cancer have clinically significant distress - compared to just 15% of the general population.","Engineers use bacteria to create stronger biosynthetic silk threads","Scientists have found for the first time evidence that naps and overnight sleep may work together to benefit memory in early childhood. The researchers say another highlight of their work is finding that naps do contribute to emotion processing in preschool children","Climate change is helping trees grow more quickly—but lower wood densities are making them weaker, a new study in Forest Ecology and Management reports","New research finds that over the past 30 years, wildfires have directly caused nearly a quarter of all permafrost thaw — about 2,000 square kilometres — of peatlands in Alberta and the Northwest Territories","These Bats Make Tiny Igloos to Survive the Winter","A study has found that in the last 32 years of annually-assessed student opinions, it is clear that belief among students that a god is the ultimate or contributing cause of human origins has steeply declined from being a majority view in 1986 to being a small minority view in 2017","In type 2 diabetes, controlling 5 risk factors almost completely eliminates the augmented risk of death, stroke and myocardial infarction usually associated with diabetes, finds study on 1.6 million individuals","Yune Lee from Ohio State University talks about his research into how even minor hearing loss can increase the cognitive load required to distinguish apoken language.","A new large-data study of fossil and extant bivalves and gastropods in the Atlantic Ocean suggests laziness might be a fruitful strategy for survival of individuals, species and even communities of species.","Universal Flu Vaccine Candidate Effective in Mice","Storm petrels, seabirds with an excellent sense of smell, use it to select mates genetically distinct from themselves","'Spooky' Quantum Entanglement Confirmed Using Distant Quasars","Water ice confirmed on the surface of the Moon for the first time. The ice deposits were found near the lunar poles in deep, frigid craters (often called \"cold traps\") that are shielded from direct sunlight and only reach a maximum temperature of about -250°F (-121°C).","Stanford study shows how head and neck positioning affects concussion risk - the way our head and neck are positioned during a head-on impact may significantly affect the risk of concussion – but tensed up neck muscles seem to offer far less protection.","Consuming brands ironically is a way to secretly signal our identity or beliefs to people who know us, new research finds.","Scientists discover water ice on moon's surface..","NATURE: Observation of topological phenomena in a programmable lattice of 1,800 qubits","The \"new kind of aurora\" discovered earlier this year, and subsequently named \"STEVE,\" isn't an aurora after all. Physicists have concluded that the erstwhile aurora is in fact an entirely new celestial phenomenon.","A new smart wristband can count the number of blood cells in the user and measure toxins in the air. Researchers say it can also be used by doctors to monitor discharged patients' data remotely, in real time.","New study found significant correlations between blood levels of EPA plus DHA omega-3s in \"cognitive\" (as opposed to \"somatic\") depression among heart failure subjects.","The Militarization of Police Does Not Reduce Crime - new study reveals that SWAT tends to be deployed in majority black communities. Further, militarization doesn't reduce crime or increase officer safety. Lastly, militarization was also found to reduce trust in police.","Moderate drinking associated with lower risk of heart disease but consistency matters","How climate change will affect dairy cows and milk production","Meet STEVE: Citizen scientists lead to the discovery of optical structure in the upper atmosphere","In such high-transmission settings like sub-Saharan Africa, it takes a long time for drug-resistant strains of malaria to take hold, but once they do, they can spread very rapidly, according to a new study.","LSD administered as a single dose results in sustained reduced alcohol consumption in mice","When adults are participants in school recess — leading games, monitoring play and ensuring conflicts are mediated quickly — children are more likely to be engaged in recess activities, a new study has found.","A common ancestral gene (Sox21b-1) causes body segmentation in spiders and insects. Silencing the Sox21b-1 gene in the spider parasteatoda tepidariorum results in the loss of three leg-bearing segments and the posterior segment addition zone.","A New Method For Having Lucid Dreams Has Been Discovered by Scientists.","A resurrected gene may protect elephants from cancer | Science News","The current U.S. political climate might be harming the mental health of teens, especially minorities, a new study suggests. Fear of discrimination became more common among LA-area teenagers between the 2016 election and months following Trump's presidential inauguration in 2017, researchers found.","Deforestation possibly contributed to the collapse of Mayan civilization more than 1,000 years ago. A new study shows that the forest-clearing also decimated carbon reservoirs in the tropical soils of the Yucatan peninsula region long after ancient cities were abandoned and the forests grew back.","Players of MMO Eve Online help in large-scale classification of fluorescence microscopy images as part of mini-game. Now the same players are helping discover exoplanets in real space","A new study finds that a thinning retina corresponds with a known sign of Parkinson’s disease, the loss of dopamine-producing brain cells - the thinner the retina, the greater the severity of disease. Neurologists may eventually be able to use a simple eye scan to detect early Parkinson’s disease.","New research has found that African Americans who believe that society values them less than others are more likely to believe in race-related conspiracy theories.","A new study suggests that the disproportionate placement of racial minorities into special education for learning disabilities is largely because of social inequities outside of schools rather than racially biased educators.","Men assign less importance to care-oriented careers than women do, possibly because men internalize different values than women. A study found that men place less importance on more basic communal values, such as how important it is to help others, and that others are taken care of.","Summer weather is getting 'stuck' due to Arctic warming. Rising arctic temperatures mean we face a future of ‘extreme extremes’ where sunny days become heatwaves and rain becomes floods, study says","Brand-name medicines that combine multiple drugs into a single pill may be more expensive than buying each drug separately, a U.S. study suggests.","Direct evidence of surface exposed water ice in the lunar polar regions","Researchers restore vision in blind mice by reprogramming other retinal cells into functional photoreceptors that integrate into the retinal circuitry","Star-sized black holes can gorge on material surrounding supermassive black holes, which helps them grow 3 times larger than they would otherwise. This new find helps explain why merging pairs of black holes (detected through gravitational waves) are bigger than astronomers thought they would be.","Quantum Fluctuations Successfully Imaged.","Creationism and conspiracy theories, two seemingly unrelated beliefs, share a common core thinking error, teleological bias, finds a new study (N &gt; 2,000).","Scientists warn of ‘unprecedented changes’ on Japan’s marine life as amount of CO2 increases. Their findings show rising CO2 emissions in the atmosphere have reduced the ocean’s alkalinity (a process more commonly known as “acidification”) and harmed biodiversity.","Children more likely to believe robots' answers than their own, study suggests. This raises opportunities as well as concerns for the use of social robots with young and vulnerable cross-sections of society; although conforming can be beneficial, the potential for misuse cannot be ignored.","A.I. camera could help applications ‘see’ better - Engineers creating hybrid optical-electrical computer designed specifically for image analysis. The hybrid is a faster and less energy-intensive image processor that can be used in autonomous vehicles, security cameras, and medical devices.","Heavy alcohol drinkers attempt to acquire alcohol despite the threat of a negative consequence more so than light drinkers. This behavior is associated with unique activation of brain circuitry in heavy drinkers.","African palm oil expansion is bad news for the continent’s primates: Primate habitats overlap with the best regions for new palm oil plantations.","In this randomized, double-blind, placebo-controlled, multicenter, Phase 3 study, a quadravalent HPV vaccine showed 100% efficacy against HPV16/18-related cervical intraepithelial neoplasia, adenocarcinoma, and cervical cancer.","Tide of lies: Sato's fraud was one of the biggest in scientific history. The impact of his fabricated reports—many of them on how to reduce the risk of bone fractures—rippled far and wide.","Enormous water worlds may account for one-third of known exoplanets. According to new research, many of these planets are about half water by mass. Meanwhile, Earth is only 0.02%.","A new method of interpolating satellite measurements that takes into account the wind motion.","Natural Disasters Widen Racial Wealth Gap, Rice Researchers Find","Researchers have created a model of the blood-brain barrier interface, using “organ chips” to look at how the brain’s vascular system influences and regulates metabolic function.","Simple leg exercises could reduce impact of sedentary lifestyle on heart and blood vessels - I have DVT, so this data is directly applicable to me","Love vine sucks life from wasps, leaving only mummies","Gene therapy vectors carrying the telomerase gene DO NOT increase the risk of cancer","Scientists have discovered that fragments of the stomach enzyme pepsinogen have antibiotic activity that can kill food-borne and lung pathogens","Observations of waves and magnetic field measurements in the solar corona with Low Frequency Array (LOFAR)","Sexually fantasizing about one’s partner inhibits relationship-damaging behaviors, suggests a new study.","Lower radiation doses and 'bystander effect'","A study of people with OCD found that fear of guilt evokes feelings of doubt in decision-making, with greater fear of guilt being associated with greater self-reported difficulty making decisions, less satisfaction with the decisions made","New study identifies strategies in U.S. climate litigation. \"This first-of-a-kind study outlines the types of climate change lawsuits that are more likely to win or lose, and why,\" said lead author Sabrina McCormick.","Light from ancient quasars helps confirm quantum entanglement: Results are among the strongest evidence yet for “spooky action at a distance”","Pro-inflammatory effects of e-cigarette vapour condensate on human alveolar macrophages","Researchers have detailed the effect of radiation exposure on the development of hormone deficiency in pediatric and young adult patients treated for brain tumors. Their findings support minimizing the dose of radiotherapy to the hypothalamus and pituitary gland and could help predict risk.","A study which included 1,028 married couples age 60 and over has found that having a depressed spouse can increase one’s own depressive symptoms as well as cognitive decline over time in late life","Vaping often pitched as “safe” alternative to smoking but researchers are learning there’s much more to the story. Here’s new research from Nevada, where 26 percent of HS kids have used e-cigs.","Core thinking error underlies belief in creationism, conspiracy theories","New study compares the molecular effects of heart disease drugs PCSK9 and statins","Low carbohydrate diets with high animal proteins/fats associated with higher mortality, while low carb diets with high plant protein/fats lowered mortality. Meta-Analysis with implications for \"keto\" diets.","Ice found on moon surface","More women running for political office may hurt chances for down-ballot candidates. A study found a consistent pattern in which female candidates are not adversely affected when they are the only woman, but they are disadvantaged when other women appear on the same party’s ballot in other races","Hybrid optical-electronic convolutional neural networks with optimized diffractive optics for image classification","A passing rogue star may explain why Pluto's orbit is so tilted and other idiosyncrasies in our outer solar system.","Targeting ceramide synthesis may be a viable therapeutic option for treating obesity, according to new study","Chagas Cardiomyopathy: An Update of Current Clinical Knowledge and Management: A Scientific Statement From the American Heart Association","Contrary to popular psychological theory, believers in free will were no more generous or honest, and cheated just as often, finds a new study (combined N = 921).","The Status Signals Paradox: From the perspective of would-be friends, individuals who display high-status markers are found to be less attractive","A new study tapping into 50 years of data suggests that personality may stay somewhat the same from birth and also change. For decades, personality was considered unmalleable; who you were at 15 is who you’d be at 75. But within the last 20 or so years, this view has changed.","Researchers have published the first study to analyze all U.S climate change lawsuits over a 26-year period. Litigants asking the courts for more regulations to curb emissions more frequently lost than won such lawsuits, they found.","Radiation therapy algorithm could reduce side effects, maintain effect against tumors","News Arctic permafrost may thaw faster than expected","A simple method of improving the speed of support vector machines and other kernel classifiers","Battle of the parasites - Two parasites, love vine and gall wasps, share the same host, oak trees. But the new research suggests it's not the tree the vine is interested in, but wasp larva hiding inside the pea-sized growths found on the underside of oak leaves.","New research shows invasive crayfish help let mosquitos thrive and spread disease.","High-momentum nucleon pairs challenge the nuclear shell model","Scientists at the University of British Columbia have discovered that the Nipah virus and other similar viruses assemble themselves in a much more haphazard manner than previously thought. They made this discovery using their newly developed optical super-resolution microscope.","Engineers create most wear-resistant metal alloy in the world. It's 100 times more durable than high-strength steel, making it the first alloy, or combination of metals, in the same class as diamond and sapphire, nature's most wear-resistant materials","New study by Harvard Medical School researchers sheds light on the molecular repertoire of neurons responsible for encoding sound in the inner ear, which could inform efforts to develop therapeutic strategies to treat or protect against hearing loss","California drought: Study shows surprising winners and losers from prolonged drought (2012-2015)","Physicists Demonstrate How Hydrogen Becomes Metallic Inside Gas Giant Planets","New study on adolescent friendships offers support for belief that misery really does love company. Researchers from FAU and collaborators examined the degree to which internalizing symptoms - anxiety, depression, social withdrawal, and submissiveness - predicted the dissolution of teen friendships.","Pregnant women of low SEP were exposed to higher levels of environmental hazards in some cities, but not others, which may contribute to inequities in child health and development.","Heatwaves, rains may become more severe as weather stalls-study | Scorching summer heatwaves and downpours are set to become more extreme in the northern hemisphere as global warming makes weather patterns linger longer in the same place, scientists said on Monday.","Scientists have identified two proteins that allow plants to respond to changes in surrounding light conditions and thereby make photosynthesis more efficient.","Strict policies to curb the effects of climate change could leave millions more people hungry than would climate change","CDC Researchers find emerging plasmid‐mediated quinolone resistant Salmonella in the US, likely fueled by reptile and amphibian exposure, contaminated food, and international travel.","DNA nanostructures strenghtened to survive harsh environments - enhanced durability now makes DNA nanostructures functional for in vivo applications","NASA launches Parker Solar Probe mission to ‘touch’ the Sun","Researchers find potential new gene therapy for blinding disease","Identification of Novel Cryptic Multifunctional Antimicrobial Peptides from the Human Stomach Enabled by a Computational–Experimental Platform","In a recent study, scientists estimate that the annual economic cost of five common antimicrobial-resistant (AMR) pathogens to be $0.5 billion in Thailand and $2.9 billion in the United States.","A filter that turns saltwater into freshwater just received an upgrade. Smoothing out the rough patches of a material widely used to filter saltwater could make producing freshwater more affordable, researchers reported in the August 17, 2018 edition of Science.","Scientists develop CRISPR-SKIP, a new CRISPR technique that skips over portions of genes that can cause disease, instead of turning them off by breaking the DNA. Such targeted editing could one day treat genetic diseases such as Duchenne’s muscular dystrophy, Huntington’s disease or some cancers.","Chemical nature of the 3.4 Ga Strelley Pool microfossils - Microfossils, possibly world's oldest, had biological characteristics","Interneuron simplification and loss of structural plasticity as markers of aging-related functional decline","New research shows that a big earthquake can not only cause other quakes, but large ones, and on the opposite side of the Earth. The findings, are an important step toward improved short-term earthquake forecasting and risk assessment.","Tagged Walls: The Discovery of Ancient Maya Graffiti at El Castillo, Xunantunich","Swiss researchers find antibiotic resistance is an increasing threat in Switzerland nursing homes","Sleeping in contact lenses increases the risk for contact lens–related eye infections by six- to eightfold. Approximately one third of contact lens wearers report sleeping or napping in their lenses. CDC reports on six contact lens–related corneal infections associated with sleeping in lenses.","Dark Energy May Be Incompatible With String Theory","High Protein Intake is Associated with Low Plasma NAD+ Levels in a Healthy Human Cohort","Toward Ending the Polaris Parallax Debate: A Precise Distance to Our Nearest Cepheid from Gaia DR2","Primary school students are more likely to eat a nutritional breakfast when given 10 extra minutes to do so. The number of school breakfasts consumed increased by 20% when students were given 10 extra minutes to eat in the cafeteria, and an additional 35-45 % when served inside classrooms.","The use of an active learning approach in a SCALE-UP learning space improves academic performance in undergraduate General Biology","Brain connectivity study helps explain the neural link between depression and poor sleep quality - the functional connections between the areas of the brain associated with short-term memory, the self, and negative emotions are increased in both poor sleep and depressive participants.","A new study has found that historically, black colleges and universities (HBCUs) pay higher fees to issue tax-exempt bonds than non-HBCUs. And the evidence points to racial discrimination as the cause.","World's smallest transistor switches current with a single atom in solid state - Physicists have developed a single-atom transistor, which works at room temperature and consumes very little energy, smaller than those of conventional silicon technologies by a factor of 10,000.","Link between defective brain insulin signaling and Alzheimer's disease leds to study of diabetes drug liraglutide as treatment for AD, seeing a reversal of cognitive impairment in mice and attenuates insulin receptor and synaptic pathology in a non‐human primate","The mouth region of the larvae of the diving beetle Hyphydrus japonicus is specialized for feeding on ostracods. The larvae have a horn on their head which they use together with their mandibles to feed on the soft body of the prey without breaking the bivalved shell.","Differences in neural stem cell identity and differentiation capacity drive divergent regenerative outcomes in lizards and salamanders. Neural stem cells in the spinal cord prevent the reptiles from regenerating nerve cells.","Banana flower thrips (Thrips hawaiiensis) influence the nutritional quality of banana (Musa acuminata) fruits and banana flower bud by-products","New research finds that hostile marital relationships, particularly when coupled with a history of depression, can seriously harm gut health, raising the risk of leaky gut syndrome","In a study of out-of-hospital cardiac arrest outcomes, the use of mechanical CPR devices was associated with decreased return of spontaneous circulation and decreased survival to discharge, when compared to the use of manual CPR.","A new study, the first to test how personality might change over 50 years and relying on the same data source at both time points, finds that broad patterns of thoughts, feelings and behaviors – personality – do change, and this change appears to accumulate with time.","Structurally 'inside-out' planetary nebula discovered - Researchers have discovered the unusual evolution of the central star of a planetary nebula in our Milky Way galaxy. The finding sheds light on the future evolution, and more importantly, the ultimate fate of the Sun.","Artificial Intelligence Allows For Faster Diagnosis of Stroke (and other acute neurologic illnesses)","Radar-Based Heart Sound Detection","A major new study involving researchers from the University of York has measured a global shift towards more sustainable agricultural systems that provide environmental improvements at the same time as increases in food production.","A new study finds that 1 in 15 Americans over the age of 40 detect strange odors like burning hair or rotting food when nothing is actually there.","Among couples who are trying to get pregnant, eating a lot of fish is associated with more frequent intercourse, and with higher rates of conception. This holds even after controlling for background factors such as age, education level, and physical activity.","In just three years, physician burnout increased from 45.5% to 54.4%. New research found that three factors contribute: The doctor-patient relationship has been morphed into an insurance company-client relationship; Feelings of cynicism; and Lack of enthusiasm for work.","Future effects of climate and land-use change on terrestrial vertebrate community diversity under different scenarios","Princeton study reveals an emergent electronic behavior on the surface of bismuth crystals that could lead to insights on valleytronics, which refers to energy valleys in crystals that can trap single electrons. These valleys could be used to store more information than modern electronic devices do.","A study on personality change carried out over 50 years finds that broad patterns of thoughts, feelings and behaviors – personality – do change, and this change appears to accumulate with time.","Hypnosis may help reduce distress of cancer treatment in children. New research led by the University of Exeter found promising evidence that hypnosis can reduce the distress associated with injections and other needle procedures, such as extracting bone marrow and giving chemotherapy.","People who believed they needed to be socially accepted in order to have worth as a person were at higher risk of using Facebook in compulsive and maladaptive way, finds a new study (total N = 417).","Ants are most efficient when 30% of them do 70% of the work.","Origin of life in the light: Light-induced evolution of microaggregates: transformation to vesicles, cyclic growth and collapse and vesicle fusion","Scientists identify enzyme that could help accelerate biofuel production. Harnessing energy from algae that does not need to be stressed to increase energy production. The study shows algal energy can be increased over 56 times through glycerol-3-phosphate acyltransferase manipulation.","A new brainwave study suggests that it is provocative sexual posing, not revealing clothing or bare skin, that leads to automatic sexual objectification at a neural level.","Insecticide Netting Could Keep Beetles Out of Your Breakfast Cereal","The smart glasses developed by Microsoft Research’s Glabella Project use optical pulse sensors to detect the blood flowing through different artery locations in a person’s head to unobtrusively monitor blood pressure during daily routines","Harlequin Bug Coloration Influenced by Temperature During Nymphal Stages","Vascular smooth muscle cell proliferation as a therapeutic target. Part 2: Natural products inhibiting proliferation (web-link for a 50 days' free access to the full text)","Ibalizumab effective in phase 3 trial for Multidrug-Resistant HIV-1","High maternal levels of the stress hormone cortisol during pregnancy increase anxious and depressive-like behaviors in female offspring at the age of 2. The study supports the idea that maternal stress may alter brain connectivity in the developing fetus","Men and women show surprising differences in seeing motion. On average, men pick up on visual motion significantly faster than women. In comparison to men, women regularly took about 25 to 75 % longer at reporting whether black and white bars on a screen are moving to the left or to the right","Rice to the Rescue - Researchers develop transgenic rice plant that expresses 3 different proteins that can stop HIV from entering human cells. The finding could lead to a less costly, easier way of producing prophylactics that could stop the spread of HIV, particularly in the developing world.","The science of food security","Discovery of single key protein involved in the development of autism - Researchers discovered that CPEB4, a molecule that regulates protein synthesis, is impaired in most cases of autism. Defects in CPEB4 lead to the dysregulation in the expression of most of the 200 genes associated with autism.","99M year old Cretaceous Period beetle found in amber, complete with pollen grains from a species of cycads, reveals first evidence of pollinators from a period predating bees and butterflies as pollinators","A recent study shows that recess is being underutilized as a time to help children cooperate, resolve conflicts amicably and learn skills of emotional as well as social health.","Electric cars could be charged in a matter of seconds using a revolutionary battery system developed by a team of Scottish scientists, Researchers at have adapted nano-molecules so they are able to store either electric power or hydrogen gas, creating a flexible dual-output battery system.","Meteorite bombardment likely to have created the Earth's oldest rocks","Pre-sleep treatment with galantamine stimulates lucid dreaming: A double-blind, placebo-controlled, crossover study","Reconstructing Four Centuries of Temperature-Induced Coral Bleaching on the Great Barrier Reef","Stanford engineers create new AI camera for faster, more efficient image classification for use in autonomous vehicles, security cameras and medical devices","Scientists have linked ever-fashionable low-carb diets to shorter life expectancies in a study published in the journal The Lancet Public Health","Jupiter's signature stripes stretch downward 1,900 miles, but scientists still don't know why they aren't deeper. New research suggests Jupiter's intense magnetic fields (20,000 times stronger than Earth's) may hamper the flowing cloud bands, allowing most of the planet to rotate as a solid body.","We’re finally learning how much environmental damage tax havens have helped cause","Mothers with high levels of the pesticide DDT in their blood during pregnancy are more likely to bear children who develop autism, according to a study of blood samples from more than one million pregnant women in Finland.","Impact of 1.5T MRI Linac fringe field on neighbouring conventional linacs","Evidence for the impact of the 8.2-kyBP climate event on Near Eastern early farmers","Plate Tectonics on Earth may end in 1.45 billion years as the mantle cools","Sequencing the wheat genome has been achieved through a worldwide collaboration of researchers spanning 13 years. Obtaining a high-quality reference sequence of bread wheat genome has been an important goal because, as the most widely grown crop worldwide, it is essential for food security.","Why we dance to the beat of the drum: A new study reports that while listening to music, brain activity becomes synchronized to the rhythmic structure of the sound, specifically the frequency of the beat.","Neuroscientists uncover a surprisingly rational feature of the human brain: A previously held bias can be set aside so that the brain can apply logical, mathematical reasoning to the decision at hand.","Pigs form a visual concept of human faces","Study Indicates Bionic Knee Brace Designed for Osteoarthritis Reduces Joint Load Across the Entire Knee Offering a New Non-Surgical Option for Patients","Darwin's Moth - Scientists revisited and confirmed one of the most famous textbook examples of evolution in action. They showed that differences in the survival of pale and dark forms of the peppered moth are explained by how well camouflaged the moths are to birds in clean and polluted woodland.","Machine Learning Links Major Dimensions of Mental Illness in Youth to Abnormalities of Brain Networks - Penn study pinpoints four brain-guided dimensions of psychopathology—mood, psychosis, fear, and disruptive behavior","Letting people with post-traumatic stress disorder (PTSD) choose between treatment methods improves their quality of life and reduces the disorder’s symptoms, according to new research from Case Western Reserve University.","The impact that aerosols have on the climate varies greatly depending on where they were released, a new study finds.","Scientists Calculate the Speed of Death in Cells, and It's Surprisingly Slow","A galaxy 11.3 billion light-years away appears filled with dark matter","Does Rain Follow the Plow - There are many factors that play a role in whether or not it rains, and new research shows that human activity, such as cultivating agricultural fields, may be one of them.","Researchers Discover New Molecular Properties of Water","Researchers were able to isolate metastatic circulating tumor cells using a protein from malaria parasites","2018-2022 expected to be abnormally hot years. Using a new method, a study shows that at the global level, 2018–2022 may be an even hotter period than expected based on current global warming.","People believe online harassment is more deserved and more justified—but not more appropriate—when the target has committed some offense. Exposure to a bystander intervention reduces this perception.","New CRISPR technique skips over portions of genes that cause disease","A new study reports prenatal interpersonal violence can affect emotional regulation by toddlers toward their mothers. Researchers report children of mothers who were victims of domestic abuse during pregnancy, are more likely to exhibit aggression toward their moms in toddlerhood.","Medicaid expansions in New York, Arizona, and Maine in the early 2000s caused a 6% decline in the mortality rate for 20- to 64-year old adults. HIV-related mortality declines accounted for 20 percent of the overall mortality effect.","NTU scientists discover natural plant-based food preservative which is more effective than artificial ones","Weedkiller found in wide range of breakfast foods aimed at children","Scientists discover why some people with brain markers of Alzheimer’s have no dementia - Resilient individuals had a unique synaptic protein signature which may underscore synaptic resistance to amyloid beta and tau, that set them apart from demented Alzheimer’s patients and normal subjects.","Presence of a threatening humanoid robot, like that of a judgmental human improves human performance on an attention task","A study has found that students appreciate when instructors tell jokes in science class, but that female and male students differ in what topics they find funny or offensive. Funny humor tends to increase student attention to course content, instructor relatability, and student sense of belonging.","The Date of The Legendary Volcano Explosion of Thera (One of the largest volcanic eruptions in recorded history) Has Finally Been Traced","In the first study to evaluate YouTube videos on facial plastic surgery procedures, Rutgers University researchers found that most are misleading marketing campaigns posted by non-qualified medical professionals.","Recyclable metal fuels for clean and compact zero-carbon power (actually for energy storage and logistics, but still interesting)","Adults with long-term exposure to secondhand smoke as children are at increased risk of early death from (COPD). People exposed to secondhand smoke 10 or more hours a week in adulthood had a 9 percent higher risk of early death overall; a 27 percent higher risk of death from heart disease","Strain Tracking Reveals the Determinants of Bacterial Engraftment in the Human Gut Following Fecal Microbiota Transplantation","Higher social dominance linked to faster decision-making in men. Study suggests that high-dominant men respond faster in situations where a choice is needed, regardless of social context. This promptness in decision-making can act as a \"biomarker\" for social disposition.","Antibiotic-resistant superbugs have infected an estimated 2 million people. But researchers found that 3 interventions, baked into the electronic prescribing system, can help. They were shown to decrease inappropriate prescribing, antibiotic resistance and costs.","21st-century modeled permafrost carbon emissions accelerated by abrupt thaw beneath lakes","MIT scientists have uncovered a sprawling new galaxy cluster hiding in plain sight. The cluster, which sits a mere 2.4 billion light years from Earth, is made up of hundreds of individual galaxies and surrounds an extremely active supermassive black hole, or quasar.","Study on Animal Model Market Trends, Growth, Forecasts, Applications and Demand Analysis Report 2017 to 2024","Widespread declines in life expectancy across high income countries coincide with rising young adult and midlife mortality in the United States. The decline was concentrated at younger ages, particularly those in their 20s and 30s","Life expectancy drops in the U.S. and the UK, but rises in Australia, a new study finds.","Hottest of 'ultra-hot' planets is so hot its air contains vaporised metal - The temperature on Kelt-9b is 4,000C and its atmosphere contains iron and titanium vapours, say astronomers in the journal Nature. This is not as hot as our Sun, which is almost 6,000C, but hotter than many stars.","NIH study shows how MERS coronavirus evolves to infect different species","In the first study of its kind, UCLA researchers have found that cholesterol-lowering statins may improve the conditions of people with a rare lung disease called autoimmune pulmonary alveolar proteinosis","Both low- and high-carb diets can raise risk of early death, study finds","Astronomers discover a gigantic black hole inside a teeny, tiny galaxy. At just 300 light-years across, the dinky galaxy is only 0.2% as wide as the Milky Way, yet its supermassive black hole is almost the same size as ours.","New drug target for cocaine addiction and withdrawal - A class of proteins with the potential to treat psychiatric and other diseases may also be effective in reducing relapse, or drug-seeking behaviors, a new preclinical study suggests.","Individuals shot by police exhibit distinct patterns of recent prior hospitalizations and arrests. Multiple encounters with healthcare and law enforcement institutions foreshadow firearm injuries and present opportunities for crisis intervention","A new study finds that while females still make up a minority of the onscreen population in blockbuster movies, they are now being depicted in leadership roles more often.","Fracking operations are using more and more water. The study found that water use per well increased by as much as 770 percent from 2011 to 2016, while wastewater volumes rose by as much as 1,440 percent in two Texas shale formations","The ‘zombie gene’ that may protect elephants from cancer - With such enormous bodies, elephants should be particularly prone to tumors. But an ancient gene in their DNA, somehow resurrected, seems to shield them, by aggressively killing off cells whose DNA has been damaged, finds new research.","A study of more than 1 million pregnancies in Finland reports that elevated levels of a metabolite of the banned insecticide DDT in the blood of pregnant women are linked to increased risk for autism in the offspring.","World's oldest cheese found in Egyptian tomb of Ptahmes, mayor of Memphis in Egypt during the 13th century BC. Biomolecular proteomic characterization shows that the constituting material was a dairy product obtained by mixing sheep/goat and cow milk.","Ancient Egyptians had been making mummies longer than anyone thought","If you thought this year was hot, wait until you hear about the global warming 'hiatus' that's about to end | CBC News","Scientists use Plasmomic Pixels to create color images that never fade - with ability to create 2000 different colors, by selecting the size of pixels and the gaps between them to create color and saturation","Testosterone and cortisol interact to predict caregiving quality in fathers, study finds","Certain Cancers Use Body Fat for Fuel, Says a New Study.","A global study has shown that children in 27 developing countries have better nutrition--when they live near forests.","Autoimmunity plays a role in the development of chronic obstructive pulmonary disease, according to new research.","The Status Signals Paradox : When it comes to making new friends, status symbols actually repel people from making friends with us","A rechargeable battery technology developed at the University of Michigan could double the output of today's lithium ion cells--drastically extending electric vehicle ranges and time between cell phone charges, without taking up any added space.","Migrating Songbirds Reach Altitudes of Up To 13,000 Feet, Study Shows","DMT Models the Near-Death Experience","A new U.S. study examines whether quitting cigarettes is worth the weight gain, and finds you are still better off in the long run. Compared with smokers, even the quitters who gained the most weight had at least a 50 percent lower risk of dying prematurely from heart disease and other causes.","The organization of stingless beekeeping (Meliponiculture) at Mayapán, Yucatan, Mexico","A new study has shown that the Tasmanian devil is under severe threat from a newly emerged contagious cancer, Devil Facial Tumour 2 (DFT2), which could jeopardise its future in the wild.","Genome editing can reduce LDL cholesterol in macaque monkeys","Bee friendly' pesticide cuts colonies by half, study finds. Neonicotinoids are the most commonly used insecticide in the world, but the evolution of resistance by pests, as well as bans and restrictions on their usage has resulted in a demand for alternative pesticides","A number of swirls (swirling patterns of magnetic polarizations called B-modes) recently detected in the faint echo of light at the edge of space could be signs of a previous universe existing before ours, according to a new study.","After trapping and cooling helium gas, scientists measured a helium atom's quantum jump, its transition between two energy states, using an ultra-stable laser, accurate to a million times a million. Measuring distance from Earth to the moon, it would be accurate to within a fraction of a millimetre.","When forced to make a decision that benefits either a parent or a close friend, young adults are more likely to choose the option that benefits the parent, according to a study which examined 174 people between the ages of 18 and 30.","High-efficiency Window Coating From Beer Waste","Fossilized Beetle Is Earliest Evidence of Insect Pollinator","Achieving Ultralow Wear with Stable Nanocrystalline Metals - Curry - 2018 - Advanced Materials","People who are impressed by seemingly profound statements that are actually nonsensical tend to be less charitable, suggests new research. The study indicates that bullshit-sensitivity is linked to prosocial behavior.","A new study finds that in online dating, men’s sexual desirability peaks at age 50, while women’s starts high at 18 and then falls from there.","Mummy Yields Earliest Known Egyptian Embalming Recipe - The salve predates the peak of mummification in the region by some 2,500 years.","A buoyancy, balance and stability challenge to the hypothesis of a semi-aquatic Spinosaurus Stromer, 1915 (Dinosauria: Theropoda) [PeerJ]","Researchers reverse congenital blindness - The findings advance efforts toward regenerative therapies for blinding diseases such as age-related macular degeneration and retinitis pigmentosa","Scientists discover new method of diagnosing cancer with malaria protein","Cancer drugs may help the liver recover from common painkiller overdoses. Thousands of people overdose with Tylenol or other acetaminophen-containing drugs each year, leading to liver damage. In a new study, researchers found a way to repair the liver damage in mice.","Small molecule drug disrupts energy metabolism in human glioblastoma cells and reduces tumor growth in mice","Spacewalking Cosmonauts Toss Tiny Satellites From Space Station","'Millennia of human activity': heatwave reveals lost UK archaeological sites | Science","Phase 3 Study of Ibalizumab for Multidrug-Resistant HIV-1","Researchers report that women whose mothers lived to at least age 90 were more likely to also live to 90, free of serious diseases and disabilities. Results show a 25 percent increased likelihood of living longer and healthier if mom lived to age 90 and a 38 percent increase if both parents did","We were walking upright earlier than paleontologists previously thought. - Study finds that adaptations for bipedal walking in primates occurred as early as 4.4 million years ago, and in that process early hominin feet may have retained some grasping ability.","Group loyalty is inherent, not learned: The simple status of belonging is enough to trigger defence and aggression","New research suggests sea level rise caused by man-made global warming is likely to increase the risk of devastating tsunamis. Scientists estimate that a minor rise of just 12 inches of sea level would put coastal communities in greater danger.","School Selection and the Social Class Divide : In a series of studies, social psychologists show that educational tracking - grouping students based on their achievement levels - encourages evaluators to artificially create social class inequalities.","Duke Team Finds Missing Immune Cells That Could Fight Lethal Brain Tumors","A new pesticide may be as harmful to bees as the old one. Chronic exposure to the sulfoximine-based insecticide sulfoxaflor produced significantly fewer workers than unexposed controls, and ultimately produced fewer reproductive offspring.","In a new study examining peer pressure from robots, school-aged children tended to echo the incorrect but unanimous responses of a group of robots to a simple visual task, while adults who often go along with the errant judgments of human peers resisted such social pressure applied by robots.","Researchers engineered a molecular matrix, a hydrogel, to deliver muscle stem cells directly to injured muscle tissue in patients whose muscles don't regenerate well. In lab experiments on mice, the hydrogel successfully delivered MuSCs to injured, aged muscle tissue and boosted the healing process","Climate change has doubled the frequency of ocean heatwaves","Researchers have discovered that the hearts of newborn piglets do can almost completely heal themselves after experimental heart attacks. This remarkable ability has clinical implications for humans.","Stone Age mass graves unearthed on Scottish islands could have been used to house prehistoric tsunami victims, according to a controversial new study. The Orkney islands is home to at least 72 stone tombs – known as 'cairns' – dating back as far as 6,000 years ago.","Higher rifampin doses for TB appear more efficacious with no greater risks","New evidence from the University of California Berkeley shows that sleep deprivation spurs a vicious, self-sustaining cycle of loneliness.","A study suggests that long-term exposure to secondhand smoke during childhood, as well as adult secondhand smoke exposure, increase the risk of chronic obstructive pulmonary disease death in adulthood.","“Facial feedback”, the idea that our facial expressions can feed back into our psychological state and behavior (for example, if your mouth is forced into a smile, you become a bit happier) has been supported by a new study, but if you feel like you’re being observed, this effect may be reduced.","In a breakthrough approach that combines virtual reality and artificial tactile sensations, two amputees feel as though their prosthetic hand belongs to their own body. Moreover, the scientists show that the phantom limb actually grows into the prosthetic hand.","Chemo spray may offer alternative to conventional chemotherapy. Compared to conventional intravenous therapy, the topical spray promises lower risk of systemic toxicity and better healing effects","Atomic iron and titanium in the atmosphere of the exoplanet KELT-9b","DMT, a powerful psychedelic compound found in ayahuasca, can model near-death experiences in the brain, a study has found","Socio-economic position determines the environmental hazards—such as air pollution and noise—that pregnant women are exposed to in urban areas, although the nature of the association varies from city to city.","Researchers have found that children who need assistance improving their social skills might benefit more when grouped with peers who have similar social skill levels, rather than with peers who have a similar disability or disorder.","Atomic iron and titanium has been detected in the atmosphere of the exoplanet hotter than most stars, KELT-9b","Researchers find that isoniazid-resistant tuberculosis expressed diminished katG protein and switched from a glycotic metabolism to a fatty acid metabolism potentially exposing a new therapeutic target.","A supermassive black hole has been discovered in a tiny galaxy: 'The galaxy, called Fornax UCD3, belongs to a recently discovered, rare and unusual class of stellar systems known as ultracompact dwarfs (UCDs), which are populated by older stars.'","Researchers have created a polymeric synthetic wood that matches wood's natural strength and is also flame resistant to boot.","People with prediabetes who go to bed later, eat meals later and are more active and alert later in the day — those who have an “evening preference” — have higher body mass indices compared with people with prediabetes who do things earlier in the day, or exhibit morning preference.","A team of local scientists has found that the size of South Koreans’ heads grew rapidly after Korea’s liberation from Japanese colonial rule in 1945.","The North American Southwest was home to scarlet macaw breeding centers as early as 900 AD. Prized by the people of Chaco Canyon for their religious &amp; cultural significance, macaws appear to have been raised in one of the first sustainable systems of non-agricultural animal husbandry in this region.","Scientists and students will be aboard a ship on a research expedition through the Northwest Passage in the Canadian Arctic archipelago","A new HIV drug (ibalizumab) reduced viral replication and increased immune cells in individuals with advanced, drug-resistant HIV infection. Used in combination with existing HIV medications, the drug is a promising strategy for patients who have run out of effective treatment options.","Nanohydrogel Delivers Healing Muscle Satellite Cells to Injured Elderly Muscles, Duchene MS Muscle in mouse models","Infection Hypothesis May Explain the Beta Amyloid Hypothesis of Alzheimer’s Disease","Humans are pushing the Earth closer to a climate cliff | John Abraham | Environment","Immune Cells in the Developing Brain Determine Adult Sexual Behavior","Tax havens and global environmental degradation","Wage gap between hospital executives and doctors is widening, study finds - Over the past decade, salaries for hospital CEOs have risen much faster than for surgeons, physicians, and nurses.","Quantum physicists look for fundamental particle of gravity (gravitons) using a microchip.","How ugly marital spats might open the door to disease. “We think that this everyday marital distress – at least for some people – is causing changes in the gut that lead to inflammation and, potentially, illness.”","Each insect olfactory system is tailored to a species' particular habitat and needs. And a new study suggests that this versatility is facilitated by the unique structure of odorant-gated ion channels.","Chemicals produced by vegetables such as kale, cabbage and broccoli prevent colon cancer in mice","New study investigates how adolescent high school students (N = 1203) perceive sexual relationships between students and teachers.","Eating breakfast before exercise may \"prime\" the body to burn carbohydrates during exercise and more rapidly digest food after working out, University of Bath researchers have found.","Lab-made fossils could reveal how dinosaurs really looked","Signal-to-Noise and Time-Reversed Structures in Gamma-Ray Burst Pulse Light Curves","People are averse to machines making moral decisions","Researchers discover that the brains of bees and wasps can recognize faces. This is despite the tiny size of the insects' brains. They contain fewer than one million brain cells, compared with the 86 billion that make up a human brain.","NIH Study Shows How MERS Coronavirus Evolves to Infect Different Species","The genetics of merle coat patterns in dogs","Seabird species have responded to changing Arctic environmental conditions over the last four decades. Declines in the Black-legged Kittiwake are tied to deteriorating zooplankton productivity, while the Red-legged Kittiwakes, also declining, are more sensitive to warming ocean surface temperatures.","Chemists from the University of Glasgow have developed a flow battery system - using a nano-molecule - that can store electric power or hydrogen gas. Giving a new type of hybrid energy storage system that can be used as a flow battery or for hydrogen storage.","Parental Life Span Predicts Daughters Living to 90 without Chronic Disease or Disability","Scientists have just discovered scotoids, an entirely new geometric shape previously unknown to science or mathematics, and it's been hiding in your skin all along. As for why the scutoids exists at all, they say that the twisted prism enables a more energy-efficient shape as epithelial cells bend.","For the first time, scientists have shown that in certain people living with HIV, a type of antibody called immunoglobulin G3 (IgG3) stops the immune system's B cells from doing their normal job of fighting pathogens.","Although chemotherapies have been highly useful as targeted treatments for cancer, unwanted side effects still plague patients. Now, researchers have demonstrated that specialized nucleic acid-based nanostructures could be used to target cancer cells while bypassing normal cells.","CASE STUDY: Breakthroughs in Brain Research with High Performance Computing","Chemicals produced by vegetables such as kale, cabbage and broccoli could help to maintain a healthy gut and prevent colon cancer. mice fed on a diet rich in indole-3-carbinol - produced when we digest vegetables from the Brassica genus - were protected from gut inflammation and colon cancer","Remote quantum clock synchronization without synchronized clocks","The largest star cluster in the Milky Way—Omega Centauri—is basically uninhabitable. The cluster's 10 million stars are so tightly packed together that they're only separated by about 0.2 light-years, which disrupts orbiting planets. For comparison, the Sun is 4.2 light-years from its nearest star.","Expected patterns of local ancestry in a hybrid zone","Efficient but unpredictable CRISPR- New research highlights the usefulness and intricacies of CRISPR/Cas9 technology","Global Highlights in Neuroengineering 2005-2018","A team of astronomers led by George Becker at the University of California, Riverside, has made a surprising discovery: 12.5 billion years ago, the most opaque place in the universe contained relatively little matter.","Infection Dynamics of a Bloom-Forming Alga and Its Virus Determine Airborne Coccolith Emission from Seawater","A study has found babies in strollers or prams can be exposed to up to 60 percent more pollution than their parents, causing potential damage to their frontal lobe and impacting on their cognitive abilities and brain development.","A large population study in Manitoba, Canada finds that there is no increased risk of autism from early childhood antibiotic use.","Elephants rarely get cancer. Here's why this matters to humans","Reports from cannabis users that the drug reduces the symptoms of inflammatory bowel disease (IBD) may finally be explained by new research that shows for the first time that endocannabinoids help control and prevent intestinal inflammation in mice.","Seizure-prediction tools work for only some of the 65 million people with epilepsy. So, researchers crowdsourced 10,000 algorithms from 646 developers, hoping to expand access and personalize the tech. The top algorithms improved seizure prediction by 90% for patients who were hardest to forecast.","The world is likely to see more extreme temperatures in the coming four years as natural warming reinforces manmade climate change, according to a new global forecasting system.","Ancient Ceramic Cups Reveal Oldest Direct Evidence of Beer in Mesopotamia - Researchers are working on resurrecting the recipe.","Men are better at navigating than women due to discrimination and unequal opportunities than any innate ability, according to a test conducted of more than 2.5 million people from every country in the world.","U.S. Bird Population Plummets in Piñon Forests. In just a decade, three quarters of birds have vanished after drought, heat stress, and beetles killed millions of piñon trees in the southwest","Tax havens shielding companies responsible for deforestation and overfishing | 70% of vessels implicated in illegal, unreported or unregulated fishing are registered in tax havens, report finds","According to new research, shark repelling magnets could ward off sharks and rays, preventing them from being accidentally caught by baited fish traps.","A Zombie LIF Gene in Elephants Is Upregulated by TP53 to Induce Apoptosis in Response to DNA Damage","Vaping may damage immune system and lead to lung disease, study suggests","Using observations of interannual climate variations covering the period 2000 to 2017, researchers estimate equilibrium climate sensitivity is likely 2.4 ‐ 4.6 K (median value 3.3 K) - Providing no support for the bottom of the IPCC's range (1.5 ‐ 4.5 deg. Celsius).","Physicists find solution to the breaking spaghetti in two pieces problem that baffled Richard Feynman","Dental cavities and root lesions suggest human ancestors had the same dental problems as us – even without fizzy drinks and sweets","A new study shows that the long-term use of either cannabis or cannabis-based drugs impairs memory","Endangered monkeys and apes could face new risks if Africa becomes a big player in the palm oil industry. Most areas suitable for growing the oil crop are key habitats for primates, a study suggests","\"hybrid-electric-hydrogen\" flow battery fluid that can release either electricity or hydrogen as fuel developed at Glasgow University","'Back-and-forth' conversations with young kids may aid brain development, finds new research in the Journal of Neuroscience. These ‘conversational turns’ are strongly related to the physical strength of white-matter connections between two key language regions in the left hemisphere of the brain.","Ductile deformation mechanism in semiconductor α-Ag2S","The number of people with food allergies has exploded in recent years. A dream team of Chicago researchers may have figured out why.","A Kaiser Permanente study of more than 80,000 children born over a 4-year period showed that the prenatal Tdap vaccination (tetanus, diphtheria, acellular pertussis) was not associated with increased risk of autism spectrum disorder in children.","Natural products with anti-aging potential: Affected targets and molecular mechanisms (web-link for a 50 days' free access to the full text)","Chemical genetic-based phenotypic screen reveals novel regulators of gluconeogenesis in human primary hepatocytes","Defensive communication (e.g. debunking and fact checking) about vaccines may not be effective. Focusing on messages that highlight the positive values of immunizations - should be explored and experimentally evaluated.","Researchers say new 'flow battery' could charge electric cars in seconds","An impact melt origin for Earth’s oldest known evolved rocks","Resurrected Zombie Gene Protects Elephants Against Cancer","Babies in prams can be exposed to up to 60 percent more pollution than their parents, causing potential damage to their frontal lobe and impacting on their cognitive abilities and brain development.","Scientists determine that the symbiotic relationship between coral and algae can be traced back to the Jurassic Period","Visualizing supernatural support heightens perceptions of victory in a simulated battle: A new study sheds light on the role of religion and spirituality in violent intergroup conflict","Climate change is emptying the desert of birds","Cuban 'acoustic attack' report on US diplomats flawed, say neurologists [wth summary of objections to study]","How we explain the behavior of others depends on our beliefs about their ‘true selves’. Research has found we are not aware we have these prior beliefs, and we don’t tend to examine them, but they deeply influence how we explain people’s actions","According to a new scientific forecast, the next five years will probably be “anomalously warm,” even beyond what the steady upward pace of global warming would produce on its own","Scientists have found that our big toe was one of the last parts of the foot to evolve, a study suggests.","Age, sex, and specific human genetic variants are the key factors behind differences between immune responses among healthy humans, finds a study of 1,000 individuals carried out by EPFL and the Pasteur Institute.","Pterodactyls: New species of ancient flying reptile with 5-foot wingspan discovered in Utah","Shrinking Protected Areas Can Hurt Genetic Diversity","A team of scientists has uncovered new molecular properties of water—a discovery of a phenomenon that had previously gone unnoticed.","Study reveals broad genetic patterns of traits and diseases, particularly traits related to mental health and ability, such as IQ, depression and schizophrenia","Researchers develop new way to supercool liquids without freezing them. Scientists used the method to significantly decrease the freezing points of water and water-based solutions, allowing them to keep the liquids at extremely cold temperatures for a long period of time.","Integrating educational knowledge: reactivation of prior knowledge during educational learning enhances memory integration","Microglia and Beyond: Innate Immune Cells As Regulators of Brain Development and Behavioral Function","Archeologists use ancient dirty dishes to reconstruct climate shifts. Hydrogen isotope analysis reconstructed the impact of a Neolithic climate shift.","Whole Exome Sequencing Identifies New Alzheimer’s-Related Genes","Chronic pain like Migraine is up to three times more prevalent in women than in men. Research shows that Estrogen and other sex hormones play a pivotal role for higher prevalence of migraine in women.","Siberia: sensational find of world’s only completely preserved ancient foal, aged just three months when it died 40,000 years ago. Dug out of the permafrost in the Batagai depression, it was buried at a level of around 30 metres","5-HT release in nucleus accumbens rescues social deficits in mouse autism model","Scientists engineer plastic-eating enzyme that could help fight pollution","Scientists trace atmospheric rise in CO2 during deglaciation to deep Pacific Ocean","MIT researchers have developed a machine to apply force to a spaghetti so that it reliably breaks into just two pieces","Opponents of vaccination think they know more than medical experts, also known as the Dunning-Kruger effect, suggests a new study of US adults (N = 1,310)."]