["Find Your School's Dota Players","Post-TI8 Shuffle Thread","Fogged made a promise on Merlini's Stream...","New ex VGJ Storm roster","Crystal Maiden Airlines","PogChamp bulldog and synd new team.","Moving from League to DotA","Thread for those moving/new to Dota.","WK crit with the camera tied to the blade","Respect to Machine!","The Gabe Newell megakill announcer pack is fantastic.","TI8 during one of the outdoor segments Slacks was silently violated by a red beard Asian man","why is grimstrokes model so big?","Post-TI-rtz-stream waiting room","Perfectly normal Crusader 2 account.","Dota 2 Update - MAIN CLIENT - August 29, 2018","Dark willow TI8 cosplay finalist","Ana when asked about N0tail/Johan","Moo: \"Big thanks to Complexity for the last two years Looking for a team for the next season\"","[TI8] Meta Poster [7.19] - Toss Your Carries","In case you're curious, this is the team who made the broadcast that you watched on Twitch and Steam. 42 cameras in total!","OG.ana confirms True Sight","Empire twitter guy: \"Cryptic tweets about reshuffles are getting extreme smh.\"","Sumail on OG winning TI8","My TI8 comic summary - (part1)","Do your part","World map TI winners per million inhabitants (improved legibility)","The tutorial is garbage. Looking for help.","The International 2018 in my view - AutumnWindz","Dear Valve, since a lot of people are quitting the game that shall not be named, It's time to improve the tutorial.","Meepo gets ganked, life on the edge","Front page of Finnish newspaper Ilta-sanomat (Young gaming millionaires returned to Finland)","Best news since TI from MoonDuck!","Petition to make a new player thread","I was gonna take another break/quit after this ti but idk anymore - ana","With the afflux of new players let's sticky a newcomer guide","$60,000 DOTA 2 Tournament - Free to Enter!","Ticket images are gone except TI8","Sunsfan is Lft","Сеb TI2 xd.","VGJ Thank you to VGJ.Storm","Finally hit 10k!","Me when the battle pass got extended","Waga Grimstroke getting triple ganked mid and getting a triple kill","The OG &amp; TI8 Effect","iceiceice is going to play for Chinese team","Instead of \"11 million dollar shopping trip\" what about \"11 million dollar 1hp TP!\"","s4 knew all along that Ana would win TI8","There are 2 kinds of people who ban Grimstroke.","Reminder that Razzil's Midas Knuckles &amp; Midas Knuckles Immortal effect is still broken","Little Grimstroke Ult Combo","SUmail confirms EG staying the same","I just noticed this now (from TI9 announcement video)","@valve can we have new exclusive dota+ sets pls?","Forev deserves an award for being the best wingman","Winstrike Coach: no roster changes in team.","Ana does a \"Q/A\" on Forev's stream - considering taking another break/quitting but unsure now after TI","Polish version of Dota 2 won't let you see how many more matches you need to be ranked when you solo queue because the text is too long","Tips for new players learning Dota","Now that Ana's heroics at TI8 Grand Finals has brought Ember back into the spotlight, can Valve please add these in Dota 7.20?","Ranked roles = less toxicity for newcomers","Notail with the important questions","List of Grimstroke bugs","Update on the fogged cosplay","notail 💪","We famous bois!","as ti8 ends i feel kinda proud to be owner of battle pass , and part of something amazing and will cherish the ageis that i get for long time ...........","Define DOTA?","TI 8 - Distribution of games based on time","TI8 inspired me to draw a lil tribute to our winning team","Players reaction to OG comeback in Semis","Sheever is a candidate for best esports profile for stockholm esport awards. Let's show our love","So I spent all of TI8 making this for you guys...","TI8 was so good, my PARENTS were freaking out over the finals","Resolut1on no longer on VGJ.Storm?","TI9 Foulfell themed pls","Now that TI is over are we getting DotA plus sets","The true reason OG won","OG breaks the cycle","All Chat and Chat Wheel Stats from TI","Just deduct 10 starting gold from every hero and auto buy and drop couriers","Even the first tutorial from pre-release Dota 2 was better than what we have now","Suggestion For Dota Plus.. Sample I made!!","Pajkatt - NA Dota is Special... It Grows on You","Ranked role matchmaking is fucking awesome","BigDaddyn0tail broke his keyboard when he won.","Valve should add new queue mode for newbie players.","Grimstroke and lack of captions","TI8 Fantasy League Results Visualization","Why was Limited Heroes removed?","hastr0, CEO of EnvyUs and Dallas Fuel : \"Really considering signing a DOTA team. Every year I watch TI and wonder why I don’t just make it happen already. Open to talk with players/teams who would consider Envy.\"","I've spent two months making a set for my favorite Dota 2 hero, Legion Commander.","Valve used the same stats as most picked hero for most banned hero","Bring TI 2020 to the Netherlands.","Sumail explaining OG TI win","Here's Dota Alchemy's analysis of Ceb's TI8 grand finals game - where are all the other match analysis vids? Last year Kyle had a great hours-long breakdown of all the GF games for TI7","I’ve not played Dota or watched it in over 2 years, but I played it since the Dota2 client was released, and had some experience with DotA Allstars prior to that- WHAT HAVE I MISSED?","Guess the hero please kill me edition","My pub games and Infinity War have something in common","The difference 0.15 scale can make","Gh being racist on Twitter","Valve, we need an explanation","Streaming some divine 1 gameplay","As Rubick has won arcana contest and a TI, I wanted to share my Rubick t-shirt design for TI8 secret shop.","PPD to Team Envy wth. USH and Black?","We can never get back our true king, are we","It seems like the MMR required for medals just went down a lot","I would like to personally thank steamsupport.","The Must-Watch Games of The International 8","xNova's had enough","Dead Meme","Dota 2 Update - MAIN CLIENT - August 28, 2018","Is 2020 the time for TI in EU?!","Can't reconnect to the game, only option is to abandon","I keep bumping into toxic people.","Our favorite rapgod (ODPixel) is streaming! Show him some love!","How do you know if your team mate in your pub game is a C++ programmer?","Typical Anti-Mage teamfight contribution","Valve can you fix those clipping in WR new immortal? It really annoys me","The most beautiful flower","Annual Reminder about Battle Pass 2017","TI8 Secret shop merch is up on WeLoveFine *sigh*","Jason Lake on PPD's advice to hastr0","Feelings of a supp.","Replay Bug : The cursor's position and the clicks are a bit off from each other after the Grimstroke update","Another day in Archon","Hi, does anyone know if the chinese comic summery for TI is already released?","Why Pugna is amazing... (Lion Fingering Himself)","I need dota friends","Rubick right after stealing Black Hole","volvo pls fix (SEA Server)","Find someone who looks at you like 7mad looks at a Notail","VP bad performance related post","Can we get Dota Plus Shards to work on Turbo Matches?","Pro players on Twitter right now:","Why I can't report a player?","Dear Valve, don't you think THIS was something worth noting in the tooltip?","The International 8 reportedly peaked at nearly 15 million viewers","It should also be mandatory for people to register a phone number for playing non-ranked matches","Iam rdy and hyped","OG's state 3 month ago compared to now (Seb's friend tweet)","Something concerning new players coming.","Looks like a lot of the prints from TI8 are available on the For Fans By Fans site","I've never played or seen a match of DOTA 2. I couldn't even name you on character, but I just found out about the Fly and Notail drama and how Notail went on to win the Championship.","Idea for next year's Battle Pass chatwheel","The bots are evolving! 5 Mekansms new meta","believe him or not ?","Pog Inhouse League is looking for players! Offering an experience superior to solo-queue.","A small detail from game 4 GF","Grimstroke shouldn't have a Slow, a Stun, Nukes, AND a Silence","Thanks valve, for abandoning a finished game because the game coordinator was slow.","Shanghai International 2019 questions","Please allow disabling help in Overthrow","For anyone wondering who ppasarel is, here's a replay of his romanian team playing against kky+ppy almost 10 years ago","WESG Canada and USA Online Qualifiers","Are they going to make True Sight for the TI8 final?","Ana kisses Jerax on the cheek after winning TI &lt;3 KappaPride","Can we get AMA from our perfect flower, 4x Major winner and the best of all, 2018 TI Champion BDNotail. :)","There was a major bug in last Battlecup in SEA. Teams which had a disconnected player had their ancient randomly destroyed in the middle of the game and forced a loss. I contacted steam support, and they asked me to post here if I want the devs to take notice.","In case you were wondering what tearing down TI8 looks like. This is Day 2 of the load out.","6k mmr, 4k hours and i only realised this stupid thing","SEA server are dead! FIXXXX plss","Hmmm","Reminder that S4 can finally talk to the OG members","Anybody else got a streak like this? Show yours!","This Year, 'Dota 2' Gave Us A Cinderella Story for the Ages","Epulze | Same game, more at stake finally open for SEA REGION!!!","Dota client affecting computer performance.","European dota merch store is super duper bad.","Trove immo 2018","Is it possible to download replays from the TI8?","GabeN after hearing about all the things going on at Riot","TI8 Chinese Meme comic waiting room !!","Grimstroke Stroke of Fate suggestion!","I thought the IO movementspeed issue got fixed?","NA PjSalt","Collector's Aegis of Champions shipment","Offering Help For New Player Who Want To Join The Game","Whenever you feel sad..","Want to buy weather effects","Can we please have more serious punishments for game ruining?","Do u experience where you cant reconnect?","Old VG.J Storm roster -Sneyking + Universe No org yet","Low Priority Issues","Guess the hero, 2k Edition.","Weird stutter with input","Funny things that non-gamer parents hear...","Who is the most successful dota player at this point, after TI8?","I'm a coming back dota player and I wanna complain about something","Bug involving dota plus hero global trends","Dota plus worth it?","Nerf Aussie Dotes","What's going on here? Dire kills one of their own and gets gold for it?","The LP count is too small to read","Daily reminder that the fantasy points havent been updated correctly","Was introduced to Dota2 through TI8, I have some questions!","Dota official birthday?","someone else on 71+ Trove Carafe and no Mirana Drop?","We need a Licky courier","Fantasy Team","Petition to make it so we can choose which hero win rates we display on our profile?","Most overlooked impact of TI8","Dear Valve","I just got into Dota 2, how much levels can I still get if I buy the battle pass now?","SEA server is fcked","can we get noob guide at side bar","(BUG) Cannot see how many games in Low Priority","Rubick crashing the game randomly when loaded in the menus?","Immo treasure 3 worth saving for next year?","The International 2018 Main Event Data Analysis","Just noticed I was in the 90.0% percentile for fantasy but only qualified as the top 75% FeelsBadMan","Got email for Crimson treasure but doesn't appear in dota 2?","It's happening.. EE &amp; Kpii.. PogChamp","Huge Monkey King bug","Team Statistics for TI 8","500 Stacks + Ult + Bloodlust = Insane Height","New geforce driver that came two days ago makes dota crash?","Regarding on Matumbaman's Military Service for Finland","Confession: Sometimes I disconnect in ranked before 00:00 and jerk off for 5 minutes and make all other players wait for me","First time playing dota 2","Finally hit 3k boys","TI8 on stage music","List of all Soulbind bugs","Dear Valve: Please make 1v1 have a matchmaking rating so people play it again.","What goes around comes around, I guess...","Ember Spirit Malestorm vs Battle Fury","Attended TI Finals - Wholesome Story","normal mode unplayable","Razor Level 15 Talent: AC/DC","MIBR Dota 2 squad?","He deserved the Aegis","8 years ago I introduced DoTA to my 3yrs old nephew.","Does anyone else think Grimstroke's model is a little bit too big?","what is your dream 5 team and why?","Valve, can you please show us the actual results for the correct predictions so we can tell which ones were right/wrong?","I just ranked up from ancient 4-&gt;5 with 2 losses in a row AMA.","No[o]ne LFT.","Pudge arcana don't have custom portrait. Valve, please add this feature. Each arcana has it, only not Pudge","Please stop building Meteor Hammer on invoker.","Took me a while but I finally made it","Woah","Battlepass doesn't give the 100 daily hero bonus point","Disabling and allied Vengeful Spirit's help should stop her from using Nether Swap on you.","Grimstroke's model isnt big. Tiny, Tide, etc. are just small.","Why don't we get big patches immediately after TI? It seems the perfect time.","Treasure III","Estimated price of TI7 treasure chest","Meepo only to Immortal Rank","Gabe Newell Mega Kill Announcer pack is OMG ITS SO GOOD","Game alt-tabs when getting messaged via steam","Purchase battle pass error?","Players' reactions OG vs PSGLGD The International 2018 Final","Ogre Magi guaranteed multicast - new script / hack / cheat?","Best VideoTutorials?","Envy Cryptic Tweets Part 2","Offlane legend 1 player trying out the TI8 meta!!","Can't find a single match","Grimstroke easter toad","When EG.Cr1t crits N0tail but N0tail has blade mail!","Opened my first Trove Carafe then this happened feelsgoodman","TI8 ended, switch the subreddit style","Dota plus suggestion","How to boost your fps from fps drop?","unconfirmed","Bots playing like retards?","The fucks wrong with the server","Can someone put the notail flower, river and rainbow meme in 1680x1050 and 1366x768?","Question for TI8 Attendees about autographs","Disruptor advice needed","So Rubick Won the Arcana Vote...","Noob question","ti9 mushi chat wheel \"lets play some dota!\"","Please Valve TI20 in Philippines!!","Please release a winter battlepass","Guess the hero (500mmr edition)","There’s no better game","TI8 Team intro music","When is grimstroke getting a nerf?","One cool detail about Jerax game winning echo against LGD in UB Semi-finals","Bulldog to join syndereN?","1hr queue timeout","Queue broken? 1 hour queue on role ranked on USE","Thanks Valve for building not only viable competetive esport, but also making game interesting for all the players.","What’s going on with “the game that shall not be named” and players quitting it?","Dutch Dota 2 players can now see “loot” before buying","Kindly reminder that DOTA 2 is not profitable for 99,999% of its players, including competitive ones.","Indian Team Entity Gaming looking to train aspiring pro Dota 2 players under Coach Scantzor and Filipino Captain Jobeezy","[help] Does anyone remember the Jersey numbers of the PSG LGD squad?","When was the last time you bought or saw a Meka ingame?","Glow in the dark Evil Geniuses (EG) coasters I made for TI","I just found this in my Dota2 image folder. Can You name them all?","5 Minuet Ban","In 90 minutes from this post I will be casting Entity Gaming's tryout matches.","When is the next patch?","Mirana the Princess of the Moon, art by Igor Artyomenko","Lionel Messi spotted helping N0tail at TI8 grand final","What to do as a support if my teammates are terrible?","Hype Japanese caster likes cheese a lot.","Cryptic Tweet by Flee","My Earthshaker self deny somehow. Help?","Broodmother Crown of the Glutton's Larder visual glitch","cant reconnect after accepting the game (SEA)","have to vent ignore","Where are the trivia questions now?","My Anti-mage had a plastic surgery","TI 8 was the best viewer experience I ever had as an old e-sports fan, thank you DotA2 community!","Most banned hero prediction is bugged, people are missing 400 points for it","\"Grimstroke - Ranged - Support\"","What bots from the workshop would you recommend ?","Turbo mode statistics question","Can you still get rare items from past Trust of the Benefactors?","World map of TI winners per million inhabitants","Na’Vi or General’s team will be announced in a few days. He played a lot of semi pro tournaments with Crystallize and Sonneiko","tRIVIA POINTS","Underhollow not rewarding points when finished!","Parmigiano Regiano for TI9 chatwheel","Looks like VGJ.storm just kicked the guys who literally throw the game","Patch 7.20 Waiting Room","the cavern prizes","Seriously Valve","When BattlePass was over, and you least expect anything.","Fall 2018 Battle Pass","Dota 2 Team Players","4.9k Serious 4th position improvement stream","New season info?","Ice3 confirms Abed's new team","I have Two Suggestions for Dota...","Where to find OG attire?","Sunderstroke","Where's jeff?","Bug: For any command you can execute during a tp (shadow blade, ghost walk), using teleport requires stop will ignore that command if you don't wait for TP to start.","why does grimstrokes latch duration for phantoms embrace go up with levels?","Is Abed joining a chinese team?","Quick question, how do I progress my Dota Plus gems? Just got assists in my last game (obviously), but got no progress on this gem?","The real MVP of TI8","Bracket prediction?","Iceberg is looking for a new team","If Meepo were reworked: BKB now grants spell immunity to all his clones when activated. Will this be OP?","OG overcame a ~90% chance of defeat to win the final game of Ti 2018","TI8 Fantasy Point Averages By Hero","What Bulldog has been up to after he couldn't make it to TI","It's still impossible to play custom games without quiters, especially Overthrow and 10vs10","Carl","After watching TI8, nothing is the same","Matchmaking still broken? When fix?","Captains Draft League (CDL) - Season 2 Starts 09.09.18","Morphling PL bug","i finally got 4k commends","IceIceIce new team ? ? ?","Total Hours Watched for The International on Twitch Up 12.6% Over Last Year","Ti 8 grand finals","Any chances for TI10 to be held in Europe?","The post-TI8 roster shuffle mill: Where is everybody going? (UPDATED AUG. 29)","After sevral attempts...","Gorgc High Level MMR Clicking","Who is this girl at TI8 commentary?","Should I recycle immortal from Treasures III? Or save it and sell it next year?","Parmigiano Reggiano by the Legendary Japanese Caster","After clicking accept in match making, it will not connect causing failure to connect","Cryptic tweets time FeelsGoodMan","Little streamer streaming some dotes. Come and socialize if you'd like. I have a mic :)","Amy newcomer or a person transitioning from LOL(yeah, we can take the name of games beneath DotA) interested in free coaching?","[bug] shuriken toss doesnt work with Grimstroke's ultimate.","Whats NAVI really need now ?","Please add a \"skip\" feature to the relic random chance","The Dota kill yield algorithm makes absolutely no sense.","just another noob streaming on Twitch","Please add Grimstroke to 10v10, Ability Draft and Underhollow","Can someone explain why Spectre gets free terrain walking permanently?","do anyone suffer from low fps on the new update?","Sumail is streaming","Is it normarl to have no ultra rare drop at level 655?","This Video/Music by far gives great goosebumps.","No battle pass points from predictions and bracket","Question about dota plus/ battle pass","Using recalculate build list still lags out the game for all players","Valve, don't you think Mars is a brilliant opportunity for this?","Not a petition to ban Russian analyst Dread from Dota tournaments for working for competitors","Looking for Noob Dota players such as myself!","SEA server","Is there a TI8 True Sight?","I want to see this team (From current free agents)","Please make unopened player card packs recyclable!","VGJ.Storm -&gt; C9?","Do you watch Dota 2, but not play? Or vice versa?","Can anyone beat this?","Excuse me, what the fuck?","Special Thanks to these guys for making Ti8 so beautiful - They were invited to Ti8 or not?","Fy 's wife Weibo after TI8 final","Valve pls fix SEA Servers","Since an EU open qualifier team won Ti8 can we expect more slots for Eu next year?","I'm so glad I got a photo with these guys on day 2. I even got a little smirk out of Ana. (I don't know who the guy in blue is)","persistent lag","Few words from esports fan. Yo dota 2 boys! You should really be happy about current state of the game/esports scene.","Turbo is more toxic than ranked.","It's pretty amazing looking at this picture and thinking that OG actually managed to win the series","10 games to decide rest of my life ;)","How to get 2 Couriers in a Ranked Game? It's extremely funny","no baby rosh...but heres 2.5 lvls","Delete techies","Is there any chance for bulldog to make it in TI9?","&gt;OG hit the throne &gt;Dota Plus \"LGD still got this\"","Viewership stats from TI8","The International Grand Champions 2018","Hi, Valve. Can you please update this sentence from the Kiev Major Grand Finals episode of True Sight? Thank you Valve.","Calling all new Aussie / Kiwis to Dota 2","The strokes of his brush marks your fate","Dota 2 the international 8 fails","Most banned hero is bugged - its the same as most picked","🇯🇵🇺🇸 I skipped to a random point in Mara's stream vod from yesterday and was instantly blessed 🇯🇵🇺🇸","Muted for spamming TI Chat Wheel","Really awesome queue times","Dota 2 Update - MAIN CLIENT - August 27, 2018","How do you like this idea of ​​loading screen ?","I've created Rubick Arcana.","Lol player with 5 year account and all characters and $900 of skins looking to make the switch","Booster / Smurf Epidemic in Ancient Bracket (EUW) - with proof","Can we talk about how big Grimstoke is?","Failing to connect on SEA","The International 8 Battle Pass/Compendium.","Petition to get a tinker rework","The True Value of OG's TI8 Victory","Sumail with the arrow play ! (Not.)","New rap star ti8 edition","How many games a day do you play?","Just a small indie company.","Volvo please just give us 100bp per ranked challenge token.","Can you still buy the battle pass?","Complete Noob need advice","How do you stay positive in matchmaking?","Natus Vincere New Roster Waiting Room.","I tried to write a TI8 summary for people who don't know or care what DOTA is","I didn't see this posted here before... Secret Shop 2018","Team Braxstone sign Infamous trio and Turos Gaming duo","Alpha Gaming Community Discord server.","It will be ridiculous if China gets more slots than EU and NA in Majors and Minors when the new season starts.","I know this is a long shot, but Volvo, can you please describe for us the English language experience at next TI?","Effect quality doesn't make a differences?","Help! My game crashes when I click \"Change\" and my steam crashes too. Help Valve!","I wanna hear your dota stories!","25 minute que","DotA in the middle-east, a narrative","Everything 322 is epic.","Ranked roles broken? 2 hour que","SEA is bugged and i got LP","Dota 2 most popular game on Twitch over the past week","n0tail on twitter: Keep looking at your moral compass, never lose track of yourself or your principles.","Siractionslacks, I demand ANSWERS!","Nerf venge when?","Just wanted to share this pic of the arena on grand finals day. Chills from seeing how many passionate fans turned up.","First minor of DPC 18/19 will start in 2 months (29 Oct) and we still don't have any information about it","sea server dc issues","Didn't get my autograph from TI8","Still not get reward from bracket predictions","The \"Most Banned Hero\" prediction is currently glitched to have the \"Most Picked Hero\" results displayed.","wish i could play this game","Average Skill per Join Dota League Divisions?","I just got lvl 1000 and signed up for the aegis delivery, do I still receive it?","I can't add my 10 Battle Pass Levels. What am I doing wrong?","What you see vs what she sees","Creep stops XBOCT's monkey jump","My Grimstroke fan art","After cheering for OG at the arena and almost losing my voice, met N0tail, Ceb and Jerax today outside one of my favourite coffee spots in Vancouver. N0tail, you look peaceful.","Underhallow is not giving battle points after the BP extension!","The Japanese Legend Mara is streaming! lets give him some love boys!!","Dota 2 Reborn Main Theme EDM Remix (played during the TI8 cosplay contest)","Tips on gaining mmr","why there is no valve game in asian games 2018 ... especially dotA2 , kind of surprised from mobile gAYmes in there","If anyone is wondering what Charlie is up to.","Ana is our MVP of The International 8","Dont take out Ranked roles","Is OG being underrated ? :-) (after groupstage)","Rolling for mid like","Valve, how to get new players to check out doto","SA Server Really Need Put Everyone With Your Own Language","No luck with Immortal Treasure III","How to stop Windranger ultimate?","I'm a 2.5k scrub go!","Double Deck","Lost a game because of this... tooltip edition","Bug Daily hero quest points","AhJit","I have also quitted league","An unreal International","Annual reminder that Chinese GL comics need translating.","Bug: top left rune does not appear in 50% of my games","The man behind OG’s TI winning strats","You either play to relax or you play long enough until you tilt and relax by taking a break...","No[o]ne-lft","Sea server comnection issues","Truesight","From all the working and college players, thank you NoobFromUA!","Lina painting I made","Lion - Hell-Spar Anathema + Fin King's Charm of Eminent Revival","Update broke match making?","A reminder that this exists.","Add ti chat wheel to dota plus","Sometimes you get tilted so hard that not even the game tips can help","Dota 2 que times","Respawn CD and TP-Scroll CD do not tick down to 0 at the same speed?","I just love Grimstroke man.","Discord overlay","Witch Doctor GG Enters Dota 2 Scene","Valve Time(TM)","Rogers Arena which seats 19,000 was 90% full during Grand Finals","I'm a big OG fan, this is what I drew on the door of my college dorm room with chalk. What do you guys think?","Interesting bug I have found.","Tal, what did you feel when you looked into his eyes?","The International 2018 Predictions Results (Excel)","BUG on Dota 2 Predictions Results","When we are getting this updated?","SEA team TI winner ever gonna happen?","Computer hardware specifications that has been used in The International 8?","When you're SumaiL but are surrounded by Arteezys..","A cheater every 5 to 6th game. What's your experience?","The problem about facing Grinstroke","Post TI Best Player by position (strawpoll)","LFT for \"WESG CANADA - DOTA 2 - ONLINE QUALIFIER\"","How is this possible ? I don't understand DotA anymore","n0tail has a new gymbuddy. FeelsBadMan","Dota Plus Bug ?","Could we please have the collectors cache re-added along with the extension of the compendium?","Celestial maiden by igor artymonkey","Trove Carafe Question","When i heard TI9 will be in Shanghai, I'm like...","What’s your standard camera movement?","Ti9 - when will the main event start? Need to book flight to Shanghai soon.","It's amazing how fast TI ends every time.","Some TI winner nationality and region statistics","Guard distance rocks/bones dillema","Grimstroke OP","Reports won't count? anyone?","Midas Mode","EU East in a nutshell - part 2","The 1k curse.","N0tail's Cr1t shoulder being mended before the finals","What were the most OP heroes in their releases in Dota history? (Including DotA 1)","The International 2018 Fails and Funny Moments","Gaben balancing at its best: Grimstroke after update","Ixmike Enigma clutch play","3 rares from 3 treasures?","Not everyone should enter ranked","Valve - please do not remove the Chat Wheel after BP ends.","Not able to buy battlepass anymore?","Isn't ending the battlepass right after ti a bit of a kick in the teeth?","For those who didn't know the exact results, way close than I thought","Alchemist gem - Multi Hero Concoction","One of my favorite videos on the internet. Before N0tail came to dota. For you m8. You were always my favorite player and inspiration! Ps: Icefrog you if are there, rework techies into bombardier.","Is Meepo mega kill announcer the worst thing ever?","Congrats to OG!!! TI8 Chatwheel Champions!!! Special Flowers!!! &lt;3","Bug - camera for Grimstroke in effigy creation is offset","You see, that's where the trouble began. That smile. That damned smile.","How the report system is completely broken and needs to be fixed.","TI8 was so satisfying that people ain't even asking for 7.20!","The real reason Grimstroke picked up his paintbrush.","Viper play I just made!","Notail's New Gym Buddy","Organizing Global Trends By Change In Win Percent Crashes Dota","Valve I tried buying a shirt from your secret shop and ran into a bug","BUG Neutral creeps killed my innocent courier. :(","Why is Zues a good counter to Terror Blade?","Comeback of pos 4 roaming in 7.20?","TI8 was so good there is no prepatch shitposting.....lets correct this so that the holy IceFrog has some material for meme patch changes.","If ranked roles does not get added as a free feature, it should be added to dota+","Is it just me or does Grimstroke sound like Necrophos with an accent?","Hey people that manage the Dota2 youtube channel, upload the TI8 recap video please","next ti reveal the new heroes in the final day or earlier","Why am I in low prio?","So, our company has a daily quote of the day...","FOREV RAMPAGE! OSFrog nothing wrong here","What were the most exciting/ worth-watching games of TI8 main stage?","Dota+ Feature...","SEA server is shitty right now! Atleast 1 player cannot connect to the game/server.","Grimstroke skills and attacks Sounds are amazing!","Did the stars align for OG at TI8?","OG , immortalized!","TI1 - EHOME vs NaVi Game 1","Does anyone know what causes this bug with Dota Plus hero badges?","I know Fly is the Brutus of DOTA right now, but if you see the bigger Picture, Fly is probably the best Captain","Game Crashing Bug","Interesting statistics in dota+","The \"I can be OG.ana\" effect","all those people out there complaining about boosters","Dota crashes when you click \"Change\" under Global Trends","My take on this year's Battle Pass (casul)","The king's first stream since TI8","Some of the grimstroke responses are pure gold","We have had threads showing Chinese reaction to TI8, but can we get the comics as well?","What would it be like....?","Cataclysm Rampage - Live Streaming Now!","Spectre goes for bounty runes and finds a surprise","Why did Valve get rid of Poor Man's Shield","Who is a the better pos4, Jerax or Cr1t? (Overall, not just at TI)","A message to new players","Before demanding 7.20 anymore, remember-","The best team does not always win","This doesn't make sense. Did the guy who made this not go to elementary school?","My friend asked \"is anyone good on Beastmaster? Theres something I wanna try\" and shared this.","Can't find a game after last update.","When can nwe wxpect the fatrat music pack ?","New items at FOR FANS BY FANS online store","Does anybody know how Bad Luck Protection ACTUALLY works?","When will be correct predictions in Compendium?","This has to stop. Matchmaking and climbing is hard enough with the feeders, trolls and boosters as it is!","Dota 2 update","Post-TI Shuffle Hypeeee","Request time out Eu/Rus servers !","Valve: Allow us to block players COMPLETELY","The most memorable moment in Esport's history *not clickbait*","With Rubick winning the Arcana contest should they hire a new voice actor for new lines?","Its in the bag! or isnt it ? (plays Vsauce theme)","Machine Hype at the end of the Grand Finals","new Aghanim upgrade waiting room","Big banners being taken off at the Rogers Arena :’(","Archon IV all of sudden?!","Do your best to describe an ability in Dota, being completely vague while still helpful.","Da Best Trove Carafe Immortals","Question about Rubick lore - need explanation!","Here is my collection of Dota2 hero pictures that I collected over the years - Flickr Album","Perfectly balanced, as all things should be.","What was the game where Winstrike got 74 kills and 194 assists?","Petition: showmatch between these two TI winners to decide which team is the strongest","SEA server is broken! Valve please fix this","Am I super lucky or was this a thing at this years TI?","RAMZES666 And Topson.","If the teams on TI mute each other to focus on the game, how do they know when gg is called?","Got to archon 1 - percentile icon showing me how close the next rank is is gone?","I think it's the most I've ever gotten...","Till when is Throve Carafe available?","TIL SingSing predicted the DPC","Dual monitor mouse locking issues","On this day in 2015 (August 28), teams 5Jungz [Kuro's stack] and (monkey)Business [N0tail's stack] were created.","Ti 2018 immortal bug","Mars Skill theory","The M in Somnus`M stands for mason","Reposting: Petition to make changes for Grimstroke's model","This is fine","Puppey and Universe situations here in reddit","Don't Queue: New Patch Will Lock You From Connecting","Fem Pugna dedicated to OG Topson (credits Instant IP)","Would you consider this as a pro voker?..and can you guess the rank?","Beginner's Luck is the real shit😱😱😱","How do competitive games affect you?","Whats the best/hardest bot script on the workshop?","Analysis of VP.N[o]one account or how to get up your MMR if it stuck on 3k-4k-5k pts.","Having 2 different mmrs does nothing but ruin matchmaking.","Getting unstable connection when opening/playing DotA 2 (Tested on two internet service provider)","4 ex-pros and 1 TI winner","Bounty Hunter — Track rework idea","Outdated cour mechanic","I just rewatched the TI Finals and it made me physically ill. OG should be banned from future events and have their Aegis reclaimed.","[Guide] An in-depth look at Bane","Post TI Chinese Shuffle rumors from Tieba (Chinese \"reddit\") | Newbee dissolving, LGD staying together, New DK team","How to organize a Dota 2 local tournament?","Do multiple urn charges stack in their healing in Oracle's ult?","I was lucky enough to get a picture with 3/5 of the TI8 champs!","Is Turbo mode dead?","During TI8 I had the opportunity to have a picture taken with my favorite DotA2 pro player, GH... And some random guy.","Don't I get credit for this?","Rip my luck","The Story of Fly and N0tail: The Dota Brothers (Pre-TI8 video)","Dota Plus &amp; Dotabuff Plus","It worked.","Description of Bottle contains misleading information","archon gang stream","While we're all circlejerking TI8, can we remember one thing?","Comparison between Ti7 and TI8 viewership","Weapon from the Flowering Shade set has been broken since TI began.","Any way to disable post game chat?","Impossible but how awesome would it be if updates hit a week after TI?","When all you wanted, was this weapon for ogre and dear GabeN feels you)))","Emoticharm Stickers for Free","Video of ODPixel saying CEEEEEBBBBBB?","Permanent Rank Roles ?","Any controversial yet so brave 7.20 hopes? This is mine.","Valve I'm so tired of this. My hard earned MMR just wastes away like this. Please do something.","Pudge?","Why doesnt valve want our money anymore?","[back_in_time] Understanding why n0tail won TI","Party and solo mmr","Some questions about TI","Rubick Arcana","Doesn't mean much... finally over 10k ranking for a hero! Sorry, not Sorry","Mara (@dotamara2) - please tell me your favorite hero is Meepo!","The only chat wheel I need next year.","Reporting Mr.Dota hacking in the game with hist team","Someone should send this to Sunsfan or one of the other duckies.","Another reason to keep Ranked Roles in ranked matchmaking...","Dota 2 roles/positions - For newcomers!","Spectre has been over 60% winrate across pubs for the last week - nerf plz","How do you use Cataclysm?","Grimstroke skill build","Several attempts to connect","Im seeing a lot of Grimstroke in games lately...","OG eliminated my friend from open qualifiers 2-1","proof that dota players can't read","It hurts, man... it really hurts.","By far, the most advanced scam I have ever encountered","Gaben Please :(","I hope Valve keeps the Late Game for every TI to come...","Appreciated, Valve.","It will be nice, if Valve create upgraded version of \"Blistering Shade\" for WK for TI9 immortal treasure. They have already done the same, to some extent, thing with WD's immortal, some sort of upgraded immortal \"Bonkers the Mad\" came in a bandle with Masque.","Why this TI has been the best of all TIs","The International 2018 Stats and Trends","Why is the first time offense for not accepting a que 5 minutes?","Fy's biggest finals FeelsCloud9Man","Quickcast on items","Met 3/5 of OG while walking on my way to dinner tonight and they were super nice and let me snag a photo!","Prediction points mistake?","The review is great, but please don't play like this weaver.","Dota plus not working","The ultimate proof that this was the best TI ever","Archon Riki spamming :)","OG main event comeback statistics","Plz add DING!DING!DING!MOTHERFUCKER!!! As a response for next compendium!","From Legend V to Divine 1 Thanks Ranked Roles","Disconnected from Server: After several attempts to connect, the server did not respond.","[BUG] Seeing enemy illusions","Scrims/Casual teams for the lower-tier MMR players among us?","Grimstroke with Phantom Lancer + Aghs + KOTL","Did icefrog buff enchantress again?","7.20 waiting room...","Is there a way to abuse netherland treasure result without being really in netherland?","Any level &gt;1000 BP got nothing in the reroll of the Immortals and yet nothing from Immortal 3?","For those who have questions about BP being extended!","s4's player pool","Since TI9 will be hosted in China, I had an idea and I think you guys will like it!","UPDATE: servers fixed","Finally 3k","You know that this TI was the best","Valve, please never ever decide to remove caster voice chat wheel from the battle pass package in the future.","Valve, please offer a limited communication/chatwheel only mode for younger players.","Reminder that Laguna Blade and Finger of Death apply debuff to deal damage, which cannot stack with itself","I think JerAx is the social media manager of OG","How do I read these stats ( primarily with respect to ultra rares, shouldn't it say the no of chests since last ultra rare?)","What are you doing with yourself now that there's nothing to watch for a year?","Is 22% Dispersion balanced?","Make ranked roles permanent","Grimstroke's Ink Well should be skilled first as a position 5 support and possibly maxed first especially against heavily melee lineups.","Add Normal Mode Back from Original Dota?","Compiled Dota Changelogs?","Probably time to make a stickied post about Grimstroke bugs?","Adam out of coL, looking for team.","Always see people complaining about people ruining games. Maybe it's time to add something similar to CSGO's Overwatch? It could be called Toxicwatch","Crosspost from r/IamA about video game addiction.","Guess hero and mmr","NaVi's roster","Storm Spirit Kaya into Dagon","Dota+ friend match spectating bug","My Girlfriend guesses more names of Dota Heroes","Is battle pass active even after TI finals?","Eternal Envy would be an amazing coach","question about trove carafe items &amp; trove carafe it self","Sea server down?","A Crystal Maiden drawing I did while watching TI","why is brood sooooo strong???","Please update Overthrow and 10v10 to add Grimstroke","TI8 Online secret shop?","Save Indian Doto","Are OG dicks for spamming chat-wheel in TI?","Febby riding his new car","Dota 2 calibration 2018","Most satisfying games to win","A year earlier","Grimstroke not added properly to dota2.com/heroes/","I made a Rubick Arcana too","This is why N0tail plays so well around meteor hammer invoker","Valve let us select 2-3 roles and more than 3 servers to speed up the search.","The face you make when love is dead and friendship is broken","Why Cant I Buy Battlepass levels anymore?","Post TI \"Western\" Shuffle rumors from Tieba (Chinese \"reddit\") | Changes to Secret, VGJ.Storm, Optic, Fnatic, Mineski","Smoke of Deceit's item description is wrong","Apart from the finals, what were the best games in TI8?","Match orginizing bot for tournament","New game mode idea - picking your oppositions heroes","Remember when people were laughing at Ceb for saying THIS?","Post TI hype is real but we need to spread awareness for short term memory loss","We need Topson AMA","BUG: Chat Emoticons are bugged. Only your Favorite Team emote is available.","Dota 2 Reset my ranked &amp; profile level...?","2018 is indeed Rubick's year!","What was your favorite part of TI8, beyond the game play?","With the battlepass extended","Ranked Roles, it was only a short while without you, but never leave me again, I NEED you!","Analyzing The Internationals!","Please help with the dota-based research for my master's","Ranked Roles should be obrigatory to ranked MM","TI8 Vancouver harassed by US Customs/Border Agents","TI8 Depression","One more rant about treasure3 drop rates","Question for OG","2B's guide of an actual roamer. Grimstroke the sad painter","Now that TI is over it's time for Valve to give some love to Dota Plus","Gaben says number 3","HELP HELP! Can you still apply the 50 BP levels for your compendium after 17 days from now?","Advice to gain levels","top two pakistani teams playing in pro take down finals. Watch ghost khan playing the one who wrote down thesis in Dota 2 Ai Bots system","Got to meet the legend himself, Nahaz","How to get prediction Item where you predict at the beginning of the game?","My favorite jebait of TI8","Grimstroke ability specific relics don't update (yet)","What valve could do for the Rubick arcana.","Big Brother Fly","What I told my penis, now that TI's over and I'm having Dota 2 withdrawal because of it.","Camera zoomout cheat is still alive","when you lose a game as pango","[Q] Is the below user valid? or scam?","Support for the Pro Madden community, and competitive gaming in general","7.20 Waiting room.","Can we get Post-TI shuffle thread?","Suggestion to minimize Smurfing in ranked matches or Battle Cup","Tip: Walk away together when Grimstroke uses his ulti on you and another hero.","Picture of Sumail from TI","Is this Ranked Match Making correct?","Broken winter wyvern heal xd","\"After TI, we expect the first half of the new season to have longer periods between gameplay updates.\"","Grimstroke Relic's are bugged.","Shadow Realm and Ink Swell Questions","Possibly the worst news article about TI8","Does \"Axia of Metira\" also have a trade cooldown ?","Omg had 1 treasure left!! And this happens :)","I see nobody shared xNova's post after TI and so here it is.","Small indie company can't add info about predictions in BP","juggernaut crimson edge of the lost order","1. Randoming heroes sucks now. 2. All Hero was never fun 3. Cavern is awesome. So...","Do we have a Duck Courier yet?","Dota 2 boys","[KBBQDota] “My guilty pleasure is the fiend and the accompanying rumor threads and swirls. I just love reading and hearing this stuff, especially the ones that are hilariously inaccurate but fun anyway”","Server high load &gt; Manually leave game &gt; Count as leaver . Great game thanks for the penalty","Question about smurfs &amp; the ranked mobile authenticator","How can I check which predictions I got correctly?","grimstroke + shadow shaman","How do you find the motivation to keep playing this game?","StanKing leaves SG e-sports","I love how we cant report people who instantly walk down mid and abandon","FY god first weibo after match.","Claimed the lv 1000 Aegis sometime ago, but today noticed that the province was wrong. Can I change?","the absolute madman just went ahead and did it","Rubicks Ulti should work on Neutrals?","The Defining moment that wins you ti8","Dota 2 Replays restarting periodically","Laptop for Dota : ASUS TUF or Acer Predator... Pros and Cons?","It's self explanatory how a good deal should work","TI Winners by nation","Warlock mid, griefing or legit?","what is the tattoo on notail's arm","7.20 waiting room","Ana's performance","Battlepass extended for 2 weeks, thanks Valve!","Daily Reminder that In-Game Main Event Predictions were bugged and we should be compensated with 10 predictions.","Ana's former manager to sue Ana waiting room.","3.5K to 5K in 3 Weeks - Live Streaming Now!","Why haven't we had a stickied Grimstroke discussion yet?","Looking for this guy with the dota2 shirt, does anyone knows him?","Previous match performance + last match is broken?","Increase penalty for abandons and reduce it for the team","Bracket predictions and general predictions points are given","Past games","r/dotamasterrace is leaking","2 days ago I got the Golden Jugg at level 245. Today(263 lvl) I got the Golden Dark Seer. Holy shit. I'm so happy!","I'm the guy who gave OG the speech before the Grand Finals AMA","Pangolier bug with Grimstroke","where are the posts asking for 7.20?","So where are the OpenAI guys talking about their prediction thingy?","TheFatRat music pack","With the end of The International can I still unlock 2nd style of Lion or other immo?","OG Official shop site could use an update...","If you take away the OG games, Spectre had a 47% winrate and PL 45%","Your Mom Commended Me!","Everyone seems to enjoy ranked roles.... I'm not such a big fan","TFW Everyone Is Excited to grind the battlepass a bit more, but you're just happy to queue ranked roles again","PSA: To all new players trying to learn DotA2, and those who need a place to discuss DotA2 gameplay in depth, check out r/LearnDotA2 and r/TrueDotA2 respectively","Anyone can explain me why Lifestealer recieved a random nerf last patch? (-10 movment speed)","Could we please get a patch schedule this year as well?","Battle Pass Exact Expiration Date","Skulz's Competitive Hero Tier List August 2018 - TI8 edition","Post ti nerf dumpster","is it only me or should grim get a new icon?","Since TI has started I’ve lost over 500 me","Normal ranked and ranked roles","Ty Valve","Cool photos from the Chinese talent in the compendium :)","Do you think Necro ultra rare price will drop when we will get TI7 treasures avaible on market?","Anybody with active pvgna.com subscription?","Can someone explain to me how this matchmaking is fair?","Ti8 Battle pass extension waiting room.","Battle pass reward","Let's say that TI9's prizepool is capped at 22 million dollars, with excess crowdfunding money going towards funding lower tier dota. Does that make TI less hype for you?","Petition to Valve to extend the TI8 Battle Pass","Tried to sketch the dota2 map from memory.","Battle Pass Levels","Just needed couple of levels to get another tresure 3, thanks for extending the Battlepass Valve","TI8 was scripted","Counters for GrimStroke?","Hero Theory - MARS: The Broom of Doom that synergizes with multiple target AOE spells.","Throughout All Eight Years, the Most Dominant Team of the Year Has Never Won TI that Year","Perfect Game by Team Empire","regarding grimstroke ...","Met with SCCC in a train ;)","OG won TI8, but do you consider them top-tier? Choose one answer:","OG vs PSG.LGD game 1 - the most important map of the series","Need some help around diabetes and dota.","Do kinetic gems, like the bladekeeper one for bladefury, overwrite the effects of immortal items like his treasure 1 sword?","Reminder that another grudge was repaid in the grand finals.","Trade ti7 immortal for juggernaut’s edge of the lost order immortal","ALLWAYS PICK THE ROOONS !!! (MK image by Dopatwo)","Remember that Ramzes666 \"im 3 times major wiiner\"? SoBayed","r/DotA2 leaking onto r/formula1","Why our friends do not want to play Dota. (A hypothesis)","BattlePass Extended 2 Weeks","Ranked Roles Best Thing in the Current Year","Mutation","Results of the battle: AI versus Talents in the fantasy league. AI scored with 90.13% of the max points","Bit of an old meme but yeah...","New DotA 2 Movie?","New hero doesnt really anti-io it seems","fix SEA server","r/dota2 in a nutshell"]