["What happened in your country this week? — 2018-08-26","What do you know about... Julius Caesar?","EU survey: Over 80 percent want to get rid of time change","The Danish premierminister Lars Løkke Rasmussen and the French president Emanuel Macron biking through the streets of Copenhagen","British week. Lidl. Poland.","A memorial to the victims of communism opens in Estonia","Denmark wants to cooperate ‘as much as possible’ on European defence","Russia Secretly Ran News Websites In Eastern Europe","Dutch police arrest man over alleged plot to kill Geert Wilders","Share of European employees covered by Collective Bargaining","Muhammad cartoon contest in Netherlands sparks Pakistan protests","Poland pays tribute to resistance fighters killed by communists 72 years ago","Giuliano, paid by former FBI director to lobby for Romanian moguls.","Macron accepts Orban, Salvini challenge: ‘I will yield nothing to nationalists’","Nigel Farage portrait worth £25k fails to attract single bid at Royal Academy","How long for an English speaker to become proficient","Possible joint bid from Morocco, Spain and Portugal for the 2030 world cup","In 13 days the internet will be destroyed by Articles 11 &amp; 13 if the EU votes to pass them, this video explains everything in detail, share it far and wide, spread the awareness. #SaveYourInternet #DeleteArticle13 #DeleteArticle11","Germany removes golden statue of Erdogan after protests","English fishermen intentionally ramming a French boat fighting over scallops off the northern French coast as british boats fish ever closer to french shores.","Amateur footage of the last moments of the original Old Bridge in Mostar, built in 1567, before it collapsed under the pressure of shells from Bosnian Croat forces 427 years later on Nov. 9, 1993","R/China posted an official Govt tourist guide with some quaint rules for European countries","Since we're disscussing what's happening with fishing in France I think this should have been brought to everyones attention.","Germany, seeking independence from U.S., pushes cyber security research","Income gap between homeowners and renters by country [OC]","Anti-vaxx fears fuel measles outbreak in Europe — with 37 fatalities already","Logged off: meet the teens who refuse to use social media","Napkin in a Finnish fastfood restaurant","Ingrid Bergman 29 August 1915 – 29 August 1982","Polish government delegation meets with Assad government in Damascus","Iraqi Town Renamed Hungary’s Daughter in Return for Rebuilding Aid","NATO considering naming its HQ building in honor of McCain","German city takes down golden Erdogan statue after outcry","Denmark wants to cooperate as much as possible on European defense: PM","Turkey's Erdoğan and ultranationalist ally agree to bring back death penalty - Stockholm Center for Freedom","Putin softens pension reforms after outcry: The retirement age for women would be increased from 55 to 60 instead of to 63. But a five-year increase for men, to 65, would stay.","Frozen pizza sales go through the roof in Hungary","Portugal hopes to preserve memory of fascist era with fortress museum","The pound has risen after Michel Barnier said the UK could expect a partnership with Brussels \"such as there never has been with any other third country\".","PM Andrej Babiš says Czechs ready to prepare plan to halt illegal migration to EU","Ban killer robots to stop ‘truly dystopian scenarios’, say campaigners","Roman Migrant Crisis: 3rd to 5th century AD.","Several former Nazis running for office as Sweden Democrats: report","A Link Tax Won't Bring Back Journalists; It Will Do Even More Harm To Them","Italy's Salvini allies with Hungary on anti-migration manifesto","Orbán and Salvini team up to attack Macron","27 years ago, serbs singing in Vukovar, Croatia: \"President Milošević send us salads, there will be meat, we will slaughter croats\"","U.K. and EU Drop October Deadline for Brexit Deal","Ferrari 250 GTO: World’s Most Expensive Classic Car Sold in an Auction","Mostar - Bosnia","Europe land temperatures anomalies, April to July 2018, compared to averages in °C between 1981-2000 Source: ECMWF/Copernicus","Footage of kingfishers living at the pond near Danube river","Belgian steel executive found dead in Moscow street","Emmanuel Macron’s environment minister quits live on air, questioning president's green credentials","Hungary forces CEU to suspend education programs for registered refugees and asylum seekers","Turkey: Traders dump lira after Turkey's economic confidence hits a nine-year low","Walking down the streets in Bratislava when I spot this dude","Genocide of African tribes was Germany's Holocaust dress rehearsal, says scholar","First energy efficient island in Greece","Turkey to prioritize EU reforms, says foreign minister | Kathimerini","How the Dutch created a casual biking culture","Arrest warrant leak fuels suspicions of far-right links with German police","Britain’s new (Romanian) working class","Honest Government Ad | Article 13 (Internet Censorship Bill)","Great European metal bands part 107: SAMAEL - Baphomets Throne (Switzerland)","Today is the Victory Day in Turkey. In 30th August 1922, invasion of Anatolia by Greek army was totally halted by Kuva-i Milliye in Dumlupınar.","Outcry over retirement age plan brings rare Putin concession","What do young people do in Helsinki?","German state official: Fake news fueled Chemnitz riots","Statue of Recep Tayyip Erdogan removed after 'confusing' Wiesbaden residents","Carmakers’ gaming of emissions tests ‘costing drivers billions’","Where The EU's Prices Are Higher &amp; Lower Than Average","Free school supplies for Reykjavík elementary students","Rally in Milan against Orban visit to meet Salvini","Quarter of 14-year-old girls in UK 'self-harm'","How Spanish flu helped create Sweden's modern welfare state","Giuliani Criticizes an Anticorruption Crackdown in Romania","Data plans in europe","Secrecy on MEP expenses 'against will of plenary'","Even greyer day","In The Age Of The Internet, Serbia Aims To Keep Its Cyrillic Alive","Sweden needs 'humble government' after election: frontrunner","Germany creates DARPA-like cybersecurity agency - The German government has announced the creation of a federal agency tasked with creating cutting-edge defense technology. But some lawmakers are worried that it may develop state-of-the-art offensive capabilities.","Hidden Belgrade (34): Rabbi Alkalai, Zemun and Zionism","Germany looks to foreign workers to tackle labour shortage","Russian Intelligence Is Co-opting Angry Young Men","Turku, Finland [OC] [4587x3430]","Turkish Lira Drops as Central Bank Move Fails to Lift Confidence","Netflix has six films in this year's Venice Film Festival","New 'Glory to Ukraine' army chant invokes nationalist past","Germany reaches 100K home battery storage installations","Alphabets used in Europe Roman (blue), cyrillic (red), mixed (lila), greece (green)","'Goodwill ambassadors' held in Greece for illegally aiding migrants","\"No Schools with Ukrainian Language left in Crimea\"","The Pentagon is Building Up Its Troop Presence…in Norway","German Soldiers honoring French General Denis Mercier","How The EU May Be About To Kill The Public Domain: Copyright Filters Takedown Beethoven","Putin announces concessions in retirement age hike","European countries by net average monthly salary (adjusted for living costs in PPP)","Germany's far-right march en masse","Barnier 'failing to make himself available for Brexit talks' | Politics","Anti-vaxx fears fuel measles outbreak in Europe -- with 37 fatalities already","In Spain they sell eatable Bimbo’s. Interesting.","British taxpayers in Spain: September 30 deadline to declare offshore earnings","Best beaches in Denmark","Will Merkel bail out Erdogan? Germany may save Turkey's economy to protect Europe","Celtic rainforest in Wales to be restored with help from EU","Occupation board game found in Jersey attic pokes fun at Nazis","Brexit: Theresa May claims trade deal success in Africa – but critics say it's a 'rollover' of existing EU agreement - 'They’re reduced to celebrating an agreement to roll over a fraction of the existing trade deals that we already benefit from as EU members'","Yandex leads Europe‘s autonomous taxi push with public test launch in Russia","EUpeople: Behind the scenes with Margaritis Schinas - Chief Spokesperson of the European Commission","Syria ready to take one million returning refugees: Moscow","Industry, innovation and infrastructure in your country","Please help me to find a show?","Nazi protests in german city of Chemnitz turn violent | DW English","Chechnya Police Deny Detaining Dozens of Children After Terror Attacks","‘Overtourism’ Worries Europe. How Much Did Technology Help Get Us There?","One in Five Russian Duma Deputies is a Security Lobbyist, Says Transparency Group","Macron: Orbán and Salvini are right to ‘see me as their main opponent'","eMMa is to Norway like how Cleopatra Stratan is to Romania. (Song: \"Fått deg på hjernen\" / \"Get Yourself on the Brain\")","French and British fishermen clash at sea in battle for scallops","Can Europe live without the US? | AJ Inside Story","We've created the country which never existed in History\" - Sergei Shamba - former Prime-Minister of Abkhazia (breakaway region of Georgia) (2:05)","Brussels gripped by lobbying war over copyright law","IKEA to shut Norwegian in-town stores amid cost cuts","First time this happened to me since GDPR. Is it that hard to comply with the regulation?","How would people like one time zone for the whole of Europe?","Theresa May in Africa to sell post-Brexit Britain","Watch: Onlookers catch glimpse of waterspout in Zurich","Arrest warrant leak fuels suspicions of far-right links with German police | World news","Monthly migrаnt Sea and Land Arrivals in Europe from Jan 2015 to August 2018","Long-sought decay of Higgs boson observed","Travel between Ukraine and Georgia will be available with ID cards","Europe Sells 1 Million EV/Hybrids, Norway Leads the Pack","Nationalism Is Bringing Together Israel and Eastern Europe","Verdun, Europe, 25th August 2018.","More police boats for scallop row","Lifeline migrants leave for Ireland, as others wait for Italy to keep its word","Hungary university stops courses for refugees due to new tax","Lithuania to introduce computer science lessons for primary schoolchildren","Bavarian judges want politicians jailed for ignoring anti-pollution directives","Electric cars exceed 1m in Europe as sales soar by more than 40%","Protesters face off in tense German city","Italy and Hungary vow to work together on hardline approach to migrants","What next for Northern Ireland after a record 589 days adrift?","The New British Exceptionalism","Electric vehicles sales in Europe surpassed 1 million","Renzo Piano offers idea for Genoa bridge","No-deal Brexit: Plan to maintain medicine supplies 'could cost £2bn' | Politics","Short visit in Copenhagen","La Tomatina 2018: Tickets, everything you need to know about the tomato throwing festival","U.S. Distances Itself From Giuliani's Surprise Letter to Romania","Ireland increases employment by 3.2% year on year","Asia Argento Dropped by 'X Factor Italy'","Turkish interior minister orders Erdoğan portrait hung in official buildings","The Ramstein air show disaster happened 30 years ago - one of the deadliest accidents of its kind.","Theresa May says a no-deal Brexit 'wouldn't be the end of the world' | Politics","The first electric Vespa, the Elettrica, to enter production in September","UK getting ready to go it alone on Galileo","Academics say they have been forced to leave the country to pursue their research interests as British universities are accused of blocking studies over fears of backlash on social media.","Smog could cost Poland 30 billion EUR annually","Once welcoming, why Germany is wary of Chinese investment amid Trump’s trade war","Greece investigates aid workers for suspected migrant smuggling, espionage","Italy threatens to veto EU’s long-term budget over migration crisis (Euractiv 28th August 2018)","Brexit poses risk to care, say nurses","We need more Europeans over at r/SnackExchange!","Leading Journalists join call for EU copyright reform","Fights between Dynamo Kiev and Ajax fans lead to nine arrests","No deal Brexit won't be our fault says Fox","Theresa May indicates she would fight a Boris Johnson leadership bid | Politics","Serbia and Kosovo May Be Ready to End Their Feud","Turkey planning to establish sovereign base in Northern Cyprus","French and UK boats clash in 'scallop war'","France restricts travel by diplomats to Iran","Overview of headlines from different reliable news sources about right wing riots in Germany","EC Approves Car-T Cell Therapy","Italy considers nationalising motorways after deadly bridge collapse","Huge military exercise 'justified' - Russia","Pakistani Parliament adopts resolution against the recent Prophet Mohammed Caricature competition in Netherlands deeming it as blasphemous","French President Macron announces new push for European defense project, says continent's security shouldn't rely on U.S.","27 August 1961 :Two weeks after the construction of the Berlin Wall, the Charlie checkpoint is the scene of a showdown between Americans and Soviets. For several hours, Soviet and American tanks, some tens of meters apart, face each other at the crossing point between East Berlin and West Berlin.","Norway may pay energy-hungry firms to cut power consumption in winter","Is the European Union Worth It Or Should We End It?","Last ditch battle: Our fight for EU citizenship for Brits after Brexit","Austria to ban asylum-seekers from taking up apprenticeships","Amid Russian military buildup, Poland reacts","Charges over murder of Paris prostitute","Saronno (VA) - Italy","Merkel speaks out against more ambitious EU climate targets","Brexit offers chance to entice Poles home, says ambassador","August in Southern Germany","How to be human: the man who was raised by wolves","Germany slams US President Trump’s sanctions policy","LIVE DEBATE: Danish prime minister Lars Løkke and French president Emmanuel Macron debate the future of Europe START 16:40 CET","An electric revolution on Procida, the Italian island time forgot","Eurostat says construction sector production up 0.2% in Eurozone","Ireland to tweak unemployment data methodology after sharp July revision","Bosnia journalists rally again after TV reporter beaten","French environment minister quits live on radio with anti-Macron broadside","World's most northerly vineyard for sale in Norway","The fighting is real at Serbia's medieval festival","Italian Minister Meets Hungary Premier, Vows Historic Change","Beautiful fountain in Vilnius","Guiana spaceport undaunted by European newcomers","Businesses down €6m as shoppers stay out of Dublin city during papal visit","Central Europe: running out of steam","Female genital mutilation: Number of affected women rising in Germany","Migrant boat arrives on tourist-filled beach in Cádiz","Suspect in custody for assault of woman on Paris street that went viral","Four suspected people smugglers among migrants rescued by Italian coastguard","Environment Minister Nicolas Hulot quits French government","Great European metal bands part 106: Varang Nord - Ziemeļvīri (Latvia)","Russian court jails Kremlin critic Navalny ahead of planned protest","Pakistan Senate unanimously adopts resolution against blasphemous Dutch cartoon competition","The view on Lake Braies in the Prags Dolomites in South Tyrol, Italy (OC) Grafixart_photo","When should the media report on murders by refugees?","Man held for Paris CCTV attack on woman","Italy’s Salvini vows ‘historic change’ in Europe after talks with Hungary’s Orban","The fatal attraction of a no-deal Brexit","Bono takes EU dream on tour","French president calls for unity above nationalism (Euronews, Mark Armstrong 27th August 2018)","The foreign ministers of Greece and China on Monday signed a memorandum of collaboration in Beijing, in the framework of China’s “One Belt, One Road” initiative.","CNN: Macron says Europe can't rely on US for security","Under 130,000 people attend Papal Mass in Phoenix Park","German far-right street mob alarms police","A Brief History of the Belgium Territory","Paid loot boxes and loot chests disabled for players in Belgium","The storks are migrating back to Africa. Do you have a fun stork story from your country like this one from Croatia?","U2-Singer Bono: Europe is a thought that needs to become a feeling","The real lesson of a Swedish deportation protest","On this day, 27 years ago, the Republic of Moldova declared its independence from the Soviet Union","Germany considers providing financial lifeline to Turkey","The signing of the Kellogg-Briand Pact for world peace– archive 28 August 1928","Regulating Russian breasts: Federal officials put a regressive spin on their latest decision against sexist advertising","Emmanuel Macron rejects Theresa May's plea for help to rescue her Brexit plan","German far-right protesters clash with leftists after fatal stabbing","French environment minister quits during live radio interview","Theresa May dons her dancing shoes in SA","630 years ago the troops of the Kingdom of Bosnia defeated the invading Ottoman troops at the Battle of Bileća","Lithuania 101","Merkel condemns xenophobic riots after killing of German man | World news","The 'coup' against Pope Francis","France: Death knell for the landline telephone","Poland Gets Brash as Top EU Court Starts Weighing Justice Revamp","Commission To Crack Down On Data Misuse Ahead Of European Elections","Turkey warns Trump that sanctions will fuel terrorism","Max Temperatures in Europe 27 August","Macron announces Push for European defence project","Putin Has a Pension Problem - Russians have supported his behavior on the international stage, but a thorny domestic issue has put him on the defensive.","Catholic marriages in decline in Poland: report","Opinion: Pope Francis and the Catholic Church's moral bankruptcy","Air pollution causes ‘huge’ reduction in intelligence, study reveals. Impact of high levels of toxic air ‘is equivalent to having lost a year of education’","‘They wanted to kill us’: masked neo-fascists strike fear into Ukraine's Roma","Seatbelt Reminders on Every New Car Seat From 2019","Paris leads efforts to puncture Airbnb","The EU is too white – and Brexit is likely to make it worse","Italy threatens to veto EU budget without changes in immigration policy","Polish deputy PM: Warsaw will ‘ignore’ ECJ ruling on justice reform","Hooligans ‘attack migrants’ in Chemnitz after stabbing at city festival","Piazza del Popolo, Ascoli Piceno","Plastic straws? Cigarette butts are the worst ocean pollutants","Event risk radar","How GDPR Pushes DLTs Forward","Police in Kaliningrad charge an autistic man with hate speech for posting a sexist Internet meme","I knew it! (rue d'Aboukir, Paris)","What higher U.S. car tariffs could mean for Europe","Portugal: A good European in search of friends (Council of Foreign Relations, Almut Möller 24th August, 2018)","Sweden's far-right poised for record election gains","Iran president asks Europe for guarantees on banking channels and oil sales (Reuters 27th August 2018)","History of Ireland #3 - Rebellions","Greece has gone from 13th place in 2008 to 1st place today in Tax to GDP Ratio among Eurozone countries","Albania hosts 20 Eritrean refugees detained in Italy","How Kaiser Wilhelm II convinced Sultan Mehmed V to declare \"jihad\"","The French continue to be the most productive workers in Europe and the 3rd most productive in the G20,behind Japan, despite some of the longest holidays and lowest work hours in the world","Macron says Brexit cannot divide EU, criticises Trump's isolationism","500kg World War II bomb successfully defused after 18,500 evacuated in the German city of Ludwigshafen","Electric shock collars for pets to be banned","Germany should help to stabilize the euro area's economic growth","One in five vanilla ice-creams have no vanilla, cream or fresh milk","Today people in Moldova protested against corruption, lack of reforms and the poverty produced by the ruling \"pro-european\" party. Opposition leaders called for peaceful protests and active participation especially in the wake of the parliamentary elections in November","The first ever Aldi store, Essen, Germany, 1930","Angela Merkel warns against erosion of democracy","Germany must abandon its record surplus and rebalance","Want to disorganize an opposition protest? Put police protected loud speakers playing party music near the protest place! Ladies and gents, welcome to Moldova of 2018.","Trends in EU trade in goods and services 2000-2017","EU may fine political groups misusing personal data to skew elections","Europol TESAT 2018 Report: Overview of all failed, foiled and completed terrorist attacks in 2017","Are spheres of influence still in? The EU and external security (Council of Foreign Relations, Pawel Zerka 10th August 2018)","Pope says psychiatrists can help gay children and their parents","Reasons why a United Ireland is definitely on the way","Socialists of the World, Be Careful. Well-intentioned government interventions have a way of going wrong.","Hundreds of policemen violently remove protesters who stayed overnight ahead of Independence Day celebrations in Moldova","Navarrese Police Cars (Spain)","Day one in Germany, Rhine Valley:","Hungary: Opposition party seeks Microsoft graft case probe","H&amp;M sits on billions of unsold clothes as profits plummet - The retail behemoth has posted its lowest numbers in over a decade. The news comes amidst an increase in online shopping, as well as a series of human rights scandals.","Children ‘attempting suicide’ at Greek refugee camp","Italy nationalisation of Autostrade 'only solution' - Deputy PM","Suspected murderer of 11-year old Dutch boy caught in Spain","Germany ready to 'take more responsibility' in European defence policy, says Merkel","Volkswagen’s Effort to Stop Scandals Needs More Work, Report Says","Macron targets French welfare spending as deficit pressure rises","The King of Norway waiting in a metro station","New Campaign Aims to “Save Music” Ahead of EU Copyright Filter Vote","Revealed: immigration rules in UK more than double in length | UK news","Polish vice PM indulge on his stance about non-respecting EJC rullings. (Translation in comments)","Italy targets Hungary with EU budget threat on migrants","EU disagrees with Russia that Syrian reefugees can go back","Frisky dolphin sparks French swimming ban","Rocket launcher developed by Turkish defense contractor Roketsan sets world record","Why Czechs don't speak German","Battle of Bileca 1388 - rendition from book Bosnian Kingdom","Jo Cox: Brussels square to be named in her honour","Sweden: Truth, lies and manipulated narratives","EU and OSCE weigh in on Turkey's prosecution of Cypriot journalists","Bulgarian Students Shun Home Universities for Colleges Abroad","Marloes Sands, Wales","Another copypasta map showing the date and method of the last execution in european countries.","Jo Cox: Brussels square to be named in Labour MP's honour","A few tens of thousands of people protested today in Chisinau, R. Moldova, against the government","Honest European Union Ad | Internet Censorship Bill (Article 13)","Germany and Russia - The Long Dance","Two days ago there was a protest regarding internet neutrality in Slovenia.","Electric shock collars for dogs and cats set to be banned","Fentanyl and cocaine drug deaths rise","Interviews With Russian Mafia Bosses","Swedish healthcare industry booming in China","What country is this license plate from?","EU set to end Chinese solar panel import controls in September","Macron calls for involving Russia in European security","Strongmen Die, but Authoritarianism Is Forever: Leaders in Turkey, Hungary, and Poland have established new institutions, manipulated existing ones, and hollowed out others to close off the possibility of political challenges","The flow of data is yet another Brexit headache for the UK","Ossetian Pagan Songs","Russian reports about Chemical Attack being prepared","EU clears acquisition of LNG business of EDF Trading by JERA Trading","The weather is taking an unexpecting turn in middle Europe","Xenophobia on the Rise in Russia, Poll Says","Growing links between German right-wing extremists, police and state government in Saxony","Historical Warfare: Carthaginian Libyan Infantry.","What about a short cinematic edit from beautiful Greece made by an austrian editor?","Anyone know where this spire this is?","BBC News: Nicky Verstappen: Suspect held over Dutch boy's 1998 death","Orthodox nun with sheep, Lintula convent, Finland","Europe Benefits by Bankrolling an Anti-Migrant Effort","What claims did Archbishop Vigano make in his testimony about the Catholic Church?","Watch: Hotel in London goes green","Field of contenders for ECB top job widens after Weidmann setback","Euro map of Furries","Hotel Hermitage Monte-Carlo, Monaco","In Anarchic Corner of Copenhagen, Police and Dealers Play Cat and Mouse","Lake Grasmere, Cumbria, England","UK's Hunt to visit Myanmar to seek answers on Rohingya killings","Tarnished by bailout, Greek PM eyes reshuffle before election","Suspect in 1998 murder of Dutch child arrested in Spain","Peter and Paul Fortress. Saint Petersburg, Russia","Man hospitalised after stuffing 15 hard-boiled eggs up his bottom","Irish PM: time to move Catholic church from centre of society","A Glimpse Into Communist Romania","Venus Sculpture Unearthed In Granada","Incredible Shrinking Workforce Adds Strain to Polish Labor Pinch","947 Years Ago, On This Day, the Seljuks defeated the Eastern Romans in Manzikert, And Began the Ascendancy of Turks in Anatolia.","Germany: stabbing leads to far-right protest in Chemnitz","Colorized Photo Of The 1936 Nuremburg Rally","Pakistan’s Polish Patriot: The fascinating story of Air Commodore Władysław Turowicz, a Polish pilot who helped the establishment of the Pakistan Air Force and is known as the godfather of Pakistan’s space and missile programme.","No-deal Brexit thrusts UK into 'legal vacuum', warns Keir Starmer | Politics","/r/europe plays Europa Universalis IV - Season 5 Week 6 - Post Game Thread","Croatia Must Not Whitewash the Horrors of Jasenovac | An article published by Croatia’s best-read newspaper downplaying the atrocities at the Jasenovac concentration camp was an attempt to rehabilitate Croatia’s WWII fascist Ustasa regime and deny its complicity in the Holocaust","Police reveal Turkish man’s passport forgery after 48 years","Pope Francis declines to confirm or deny he knew of sexual misconduct allegations","European NATO members receive first lot of U.S.-made precision-guided munitions","Lithuania renames square by Russian embassy for murdered Boris Nemtsov","Sweden's far right has flourished because the elite lost touch with the people","US not against territory swap between Serbia and Kosovo | bne IntelliNews","I try hard to make an unusual photograph of this iconic places (Mont St-Michel, France) Grafixart_photo","Shearers secretly filmed punching, throwing and stamping on sheep could face criminal charges","Palatul Culturii Iasi, Moldova, Romania","Belgian, German, Dutch and French police working together during Formula 1 of Belgium","Fear and loathing on the Swedish campaign trail","Have people inspected at Irish border after Brexit, says Rees-Mogg | Politics","Boris Johnson: UK Brexit plan a ‘historic mistake’","Paris : Tuilleries gardens and Louvre museum","Ukraine: The war should not be the only priority","30 August is the day Turkey when Turkey won the great offensive and these are the announcements for the upcoming day","Highest road in Romania: Transalpina (2145 m)","Winter is coming - Kredarica, Slovenia this morning","Propaganda thats been going on for years","War history: Soviet Prisoners of War in Finland, 1939-1944","Surveillance cameraman - Italia [episode 1]","Farnese Hercules, Naples (216 AD).","Spain accused of pushing migrants north through Europe","Charlie Hebdo on the bridge collapse","Jacob Rees-Mogg says people should be 'inspected' on Irish border after Brexit as they were 'during the Troubles'","Russia Mocks British Military After Jets Scramble From Romania","The front page top post shows you a normal gendarmerie car, here's all gendarmerie fast interceptors cars since 1966","Angela Merkel’s Christian Democratic Union (CDU) party is floating the idea of a new form of compulsory national service in Germany for all young people and migrants. The program would see some young people join the military, the fire service, or help with disaster relief.","Bremen migration office scandal much smaller than first thought","Air Guitarists Compete For Fame And Glory At World Championships (in Finland)","Who likes this drone shot that I got in Spain. I’m new to reddit and trying it out.","According to IMF in 2018 Europe(excluding CIS countries) will have larger economy($21.0 trillion) than USA($20.4 trillion)","What Caused the Irish War of Independence?","Europe is in danger of falling behind in regenerative medicine","Italy migrant ship: Interior Minister Matteo Salvini to be investigated","'No way': Italy's leader takes Australian cue on refugees","1968 Soviet invasion of Czechoslovakia remembered in Red Square","Greece was never bailed out – it remains a debtor’s prison and the EU still holds the keys","Transalpina, Romania","Yet another tiny cobbled street, this one in Lund, Sweden","Polish-Lithuanian Hussar armor 16th century","Extreme water levels on the Danube uncovered this plastic milk bag from the '70s when it cost 5Fts (€0.015 on current rates). Barely any degradation despite being underwater for decades.","Fun fact: On top of everything else, Finnish president Niinistö is a passionate ice hockey and sports fan, having played casual hockey in Käpylä","The Neretva flowing through Mostar, Herzegovina","Get your eSport shit together Norway.","Golden Sunset at the Mont St-Michel @Grafixart_photo","Tempio del valadier, Genga, Italy","Urban planner Ildefons Cerdà's tomb (1815-1876) is his design for the city, Barcelona.","The Guardian: No-deal Brexit will break up UK, warns Van Rompuy","Russia calls Britain's Black Sea air force interceptions dangerous","Former top Vatican official calls on Pope to resign amid abuse crisis","German fishermen headed for choppy waters as Brexit looms","Today is my last day in Holland, enjoy!","Does anyone here think that the protests against article 13, the calls to MEPs and the petitions will work to stop the copyright directive at all?","Summer time in Montenegro","Nikola Tesla graffiti in Bucharest, Romania","American Conservative: Viktor Orbán Isn’t the Illiberal Revolutionary You Think He Is","EU hits back hard at Italy’s budget threat in migration row","No statue of Polish king in Vienna. The city hall claims the statue presenting John III Sobieski, who defeated the Ottoman army at the Battle of Vienna in 1683, would have an “anti-Turkish tone.”","Papal visit: Pope begs forgiveness for clerical sex abuse (BBC 26th August 2018)","Austria rejects 'fake' gay asylum claim, this time he's too 'girlish'","Srđan and Refik: two brave soldiers who sacrificed themselves to save innocents \"from the other side\" during the 90s war in Bosnia","Romania shaken by protests – Is the problem corruption, or capitalism?","The return of Conscription","Copyright directive must, in particular, respect Article 15(1) of Directive 2000/31, which prohibits general monitoring","Serbia, Kosovo presidents broach border changes for historic deal","Memorial to Nicholas Winton at Prague Central Station for rescuing 669 children from Czechoslovakia on the eve of the WW2 in an operation later known as the Czech Kindertransport","Berlin on beer brush☺️","Turkey police break up mothers' protest","Wooden residential area in Tampere, Finland.","Jewish Labour MPs to Get Bodyguards at Party Conference, Report Says","Sweden’s far right courts immigrant voters in bid to make historic gains | World news","Politics: when the losers come out on top","olá /r/europe! I made these maps of european cities inspired on Mondrian artwork using GoogleMaps API","Map of the Cycling World: to proportion","One of four Bison calves that were born into reintroduced herds of European Bison in the Romanian South Carpatian mountains. A milestone for the conservation of this threatened species.","HMS Queen Elizabeth at Portsmouth before heading across The Atlantic","Merkel backs efforts to find alternatives to Russian gas","Sweden: Truth, lies and manipulated narratives? - BBC Newsnight","‘I’m Not a Racist, But...’: Sweden Faces Historic Upset in Election","Are the citizens of European Union less free than let's say Americans?","[OC] On the topic of passports: reuniting the old country!","Soccer Pitch in Lofoten Islands, Norway","Great European metal bands part 105: WORMED - Tautochrone (Spain)","Question","Bike path going through a lake in Limburg, Belgium","Is it possible to get funds/loans as an international student for studying undergraduate in Europe?","Winter evening at Loška Koritnica, Slovenia","'Terre des Femmes' pushes headscarf ban for girls","'No grass': Europe's livestock sector stricken by drought","Ghent police seized 2 tons of cocaine with the logo of the \"United Russia\" party","Three Foreign Nationals Arrested for the Murder of Greek Youth in Athens","Disabled person gets hit by Bulgarian president father's Mercedes, receives penalty","\"I ate at the most beautiful McDonald's in the world, with crystal chandeliers, stained glass windows, and outrageously delicious pastries\"","Italy's far-right interior minister faces probe over stranded migrants","Contender at sheep beauty contest in Dagestan, Russia","French Cuirassier Armor, 17th Century","Norway sends dual citizenship bill to parliament","Street art Craiova, Oltenia, Romania","The main gate of the Corvins' Castle, Hunedoara, Romania","President Niinistö: Finland’s NATO membership \"a possibility\"","Statue of Heracles, 2nd Century AD, City of Perge, Antalya, Turkey","Old traditional house from Maramures, Romania","Riding a bike in Switzerland.","Песма Милиционара - Pesma Milicionara (Song of the Yugoslav Police)","Matteo Salvini formally investigated over migrant ship standoff.","French side Catalan dragons become the first non English side to win rugby league’s challenge cup","On this day, 74 years ago, Paris was liberated from Nazi occupation by the Allies!","Plyos, Central Russia","A Turkish headache for the West","The World Jewish Congress have launched a campaign calling for the #NordicResistanceMovement to be “eradicated”.","Croatian mountain rescue service announced to tourists in Croatia","Ethnolinguistic Map of Turkey 2006-2015","Glacier | Gwächtenhorn, Susten Pass Switzerland","Boris Johnson is a victim of the modern inquisition","Garmisch, Füssen, Reutte, and the Plansee","Russian opposition leader Navalny detained in Moscow - spokeswoman","Today marks 19 years since the start of the Second Chechen war in which Russia restored full control over Chechnya","Cocaine for United Russia","No-deal Brexit will break up UK, warns Van Rompuy | Politics","Over 772,000 people attend Army-2018 forum in 5 days","Polish city names","Mine Warning Sign on Jahorina, Bosnia and Herzegovina (Republika Srpska)","How a tax haven (Luxembourg) is leading the race to privatise space | News","African swine fever hits Romania's biggest pig farm","NEWSAfrican Swine Fever Reaches Europe After Devastating Chinese Pig Farms","/r/europe GeoGuessr Challenge Week #1","END OF DAY – CO2 hits EUR 20.70/t, highest since Oct 2008","Holocaust memorials in Estonia torched, vandalized with swastika","The Glacier. The Short 6K Dramatic Video Version","Europe According To ... [1904 × 3174]","The Latest: Italian church will take most migrants from ship","Cannes Travel Guide: Vacation in Cannes and Your Next Holiday Destination","Czech President Zeman remains silents on anniversary of 1968 soviet occupation","Berlin fires may have been caused by arson","This Children's Literature Map Shows the Best Kids' Books From Europe","Europe fingerprint map, 1989","The Dutch SSCV Thialf: World's largest crane vessel nestled in a Norwegian fjord.","Pope meets clerical sex-abuse survivors","Modern slavery in Germany: Preying on the vulnerable","Poland’s ruling party way ahead of closest rival in the recent poll","How come if you ask a American if they needed to move to Europe they always pick 1 of only 2 cities","360° View of Helsinki, Finland","Plastic bag charge to rise to 10p and be extended to every shop","Istiklal Avenue, Istanbul","German Patriotic Song - Was ist des Deutschen Vaterland","Merkel ally floats mandatory service year for refugees","Why American Conservatives Can't Ignore Successful European Social Democracies","Belgian Grand Prix halted after opening lap crash","Russian Opposition Leader Alexey Navalny Arrested in Moscow Today","Berlin City at the Spree river 😎","Nordic countries' 'happy' reputation masks sadness of young, says report","Europe Benefits by Bankrolling an Anti-Migrant Effort. Niger Pays a Price.","Does anyone here think that th EU parliament will listen to us regarding the copyright diretive this time?","Dunfermline abbey &amp; palace, Dunfermline, Scotland","Irish PM tells pope action must follow words on tackling abuse","Lithuanian policemen lecturing \"Celtic F.C\" fans from UK","The senate square, Helsinki, Finland","St George's Plateau, Liverpool","Remarks about Zionists draw official complaint against Jeremy Corbyn | Politics","Revenge of the Basques","Sweden: Truth, lies &amp; manipulated narratives? - BBC Newsnight","17th Century Turkish Sipahi, by Claes Rålamb","EU hits back hard at Italy’s budget threat in migration row - Country will pay a big price if it withholds payments, Commissioner Günther Oettinger says.","A Georgian company on the anniversary of the Russian invasion releases condoms with Putin.","Austrian foreign minister defends curtsy to Putin","Mount Etna Sicily: Europe's highest active volcano erupts","Populism &amp; Copyright, Part III: The ‘Meme Ban’","Finland's President Sauli Niinistö with his newborn child and the true ruler of Finland, Lennu","Tourist bus crashes in Bulgaria; 15 reported killed","America’s Trade War with China: An Opportunity for the EU?","No-deal Brexit 'worse than thought' for science","Vitoria-Gasteiz, Spain's Green Capital","EU Offers Iran $20 Million to Counter U.S. Sanctions, Despite Trump Threats","Italy's Mount Etna roars back into volcanic action","French Champagne makers see stars aligned for record harvest","2 or 3 Month Europe Trip","Fantasy styled maps of some European countries","'Clueless' tourists climbing the Alps in sneakers","U.S. official says EU aid for Iran sends 'wrong message'","Boat in Tavira, Portugal","Lyon, France (not an usual spot, but I like the pic)","Norra tornen, Stockholm","A Language Map of Europe","Have you ever seen heart of old finnish swimming pool?","Doctors order 16 migrants off stranded Italian boat as Salvini defies U.N.","Russian opposition leader Alexei Navalny detained in Moscow","Europe Lagging Behind in technology: It's Not The Safety Net","Maersk Sends First Container Ship Through Arctic Route","U.S. wants quick progress on EU trade issues, officials say","Germany’s Failed Climate Goals: A Wake-Up Call for Governments Everywhere","Why European women have few babies","I will help rebuild Genoa bridge after hometown tragedy, says Renzo Piano","Sweden’s far right has flourished because the elite lost touch with the people | Andrew Brown | World news","Political cartoons of the week","Defying US sanctions, EU unveils €18 million aid package for Iran","Vanguard - The fate of euro","Polish MEP accuses Brussels of double standards over forests [Bavaria - bark beetle infestation]","The roots of coalitions: Like-mindedness among EU member states","China says agrees with Britain to discuss 'top notch' free trade deal","Neo-Nazis Rally Alongside Counter-Demonstrators In Stockholm","(crosspost) 360° view of Helsinki, Finland","Good luck with the protests.","Glacier, mountains &amp; Passes in Switzerland Ultra HD 5K Drone FPV","On this day, 30 years ago, a big fire burned several buildings in Chiado neighbourhood (Lisbon, Portugal)","Italy to suspend EU funding unless others take in migrants","Finnish archipelago at the summer heatwave","Romanian Minister to Romanian President (ethnically German): \"as a German, speaking of using gas on people takes a lot of guts\" after his comments on excessive tear gas usage","How do I get the thing beside my name saying what country I'm from?","Great European metal bands part 104: Cruachan - I Am Warrior (Ireland)","Today is Independence Day of Ukraine, Ukraine's national day!","EU sees China plan emerging from fog of Trump’s trade war","European brown bear battle - Whipsnade, UK","Drought Exposes Ancient 'Hunger Stones' In Czech River","A battalion of female recruits saluting the commander during Independence Day parade in Kyiv, Ukraine.","LIVE: Pope Francis arrives at Croke Park to close the first day of his Irish visit","Atrocities against Armenians should not be forgotten says Chancellor Merkel - Choosing her words carefully in Armenia, Chancellor Angela Merkel avoided using the term \"genocide\" for the killing of up to 1.5 million Armenians in 1915. She did refer to the Bundestag's resolution two years ago.","Immigration minister blocks Britons who sought help on Twitter | UK news","Syrian foreign minister to visit Moscow next week - RIA news agency","Four dead, 17 injured as bus crashes off bridge in Finland","Neo-Nazi marchers refuse to leave Stockholm square","Nordic countries' 'happy' reputation masks sadness of young, says report | World news","Italy's Populists Turn to Trump and China","On the topic of passports: my three!","US open to Kosovo border changes, Trump adviser says","Bucharest: City of Sighs - It's often said that Bucharest is ugly, loud and dirty -- and it is. But it's more than that. It's a city you can fall hopelessly in love with","Jewish cemetery in Poland vandalized for second time in a month","Berlin City Palace - Current state of Reconstruction","Crows have been trained to pick up trash. Birds have been cleaning the amusement park in France for a week. Crows are encouraged to bring waste to a small box. Every time they throw garbage into it, bird feed falls out of the box","UN calls on EU states to offer asylum and end Italy’s migrant standoff","Populism &amp; Copyright, Part I: The 'Link Tax'","Foreign minister Stef Blok says sorry for multicultural society comments (August 17)","In the last 50 years, the fish population in the Mediterranean has decreased by 34% and marine mammals - by 41%. All because of climate change, water pollution and growing tourism.","Bashkiria, Russia","Today, 446 years ago, thousands of Calvinists were slaughtered across Paris and later France in what became known as St. Bartholomew's Day massacre.","Belgium Shop fined for discriminating against man","Two homeless people found living in caves in Nottingham","‘Not realistic’ for UK to start trading on WTO rules straight after Brexit, says WTO boss","My Passport came today!","Russia wheels out its answer to Tesla: Kalashnikov's CV-1 electric car","Spanish government passes decree to exhume Franco from mausoleum","Germany's new strategy to deal with Donald Trump","Video game swastikas stir unease in Germany","Greece’s “Bailout” Was a Disaster for Greece","Finnish president wiping his nose on Lennu","How far can you drive in one hour in different European capitals?","Move over Brexit, Tories' new battle is about free speech","Serbian Paramilitary Chief Arrested For Allegedly Joining Separatist War In Ukraine","Military Equipment Demonstrated on Ukraine's Idependance Day Parade","Italy mulls massive tax break to lure retirees to its sun-soaked southern regions","Free feminine Sanitary Products will be Provided Products for Scottish Students","Jeremy Hunt: UK better off outside EU, even without a deal","Germany's Navy Is a Total Embarrassment","Why Danish sounds funny to Scandinavians","Germany reports a 1H 2018 budget surplus of 48.1 Billion €","Maximum punishment a person can get in Europe","\"As a German, you need a lot of courage to talk about gassing [people]\" - Said by Romania's Minister of Labour about Klaus Iohannis, the Country's President","Spanish government approves exhumation of dictator Francisco Franco","US ‘against’ Turkey purchasing S-400 missiles from Russia","Today Zhanna Nemtsova and mayor of Vilnius unveiled the 'Boris Nemtsov Square' near the Russian embassy in Vilnius.","Lithuania: Netanyahu calls EU's financial aid to Iran a 'poison pill'","Attacks on police, fire fighters show increase in Germany","Study ties Facebook engagement to attacks on refugee. With hundreds of thousands of posts and comments broken down by area, the researchers were able to identify overall patterns of social media use, and then isolate anti-refugee sentiment within that.","Climate change is melting the French Alps, say mountaineers. Permafrost ‘cement’ is evaporating, making rocks unstable and prone to collapse with many trails now deemed too dangerous to use","Pick Your Own Brexit","Permanent European Union Citizenship - Signature Page Open","Drought In Central Europe Reveals Cautionary 'Hunger Stones' In Czech River","Nuns arrested over alleged abuse at closed orphanage","Too hot? 20 of Europe's best ice-cream parlours according to The Guardian readers","UK foreign secretary uses US visit to support Boris Johnson replacing Theresa May as prime minister","An overview of the Danske Bank money laundering scandal in Estonia","The forgotten story of Sweden's Chilean refugees","The U.S. Can’t Bring Russia ‘to Its Knees’","Canal with Houseboats in Amsterdam, Netherlands, (2)","Today, 29 years ago, Lithuanians, Latvians and Estonians formed a human chain, which contained more than 2 million people and spanned 675 kilometers across the 3 Baltic states. It was a peaceful protest, which occured on the 50th anniversary of the Molotov–Ribbentrop Pact.","Saw post about dual citizenship and wanted to show off my Italian passport that I recently got!","Poland’s Population Problem - Geopolitical Futures","LIVE: Parade to the Independence Day of Ukraine \"New Army March\"","Berlin-area firefighters beat back major forest fires","3 Villages evacuated / Buried WWII munitions explode as wildfire burns near Berlin","Architect of European Transformation worried about rising Antisemitism.","Denmark and Luxembourg had the highest price levels in 2017 (41% above the EU average), followed by Sweden (35% above), Ireland (28% above) and Finland (23% above), while the lowest price levels were in Bulgaria (56% below), Romania (52% below), Poland (47% below) and Hungary (42% below)","Joshua Rudder of NativLang explains: Why Danish sounds funny to Scandinavians","Spanish government sends 116 migrants who jumped fence back to Morocco","Raging forest fire bears down on German villages as 300 firefighters battle blaze","Belgians Chose “This Is Not a Street” As One of 28 New Brussels Street Names","Open Forum — 2018-08-24","French oil giant Total officially quits US sanctions-hit Iran","Diciotti: Rice ball protest in Italian migrant boat row","Ukraine’s Minister of Infrastructure has proposed cancellation of train service to and from Russia. Omelyan says “Too dangerous for Ukrainian passengers”","Shop fined for discriminating against man","August 23 is the European Day of Remembrance for Victims of Stalinism and Nazism","One Hour of Romuva Songs (Dainos,Chants/hails to gods) (\"Dainuu Shventee\")","Russian Feminist Reports Facing Extremism Probe For 'Inciting Hatred Toward Males'","Half the population of the Viking-town Sigtuna were migrants","Russia is sacrificing the ruble to be ready for new sanctions","Serbia arrests Chetnik chief for participation in Ukrainian war","Estonian counties by most common foreign nationality","Italian prosecutors to question Salvini on migration standoff","Monaco noble claims millions from France over royal 'trick'","'I Wouldn't Move Back': Deported Irish Man Creates A Life In His New Home","U.S. Imposes New Sanctions on Russia After Nerve Agent Poisoning","In these trying times, the great English poet John Donne provides some words to be guided by...","Bavarians see conservatives as more of a problem than refugees: poll","German government and police unite with far-right to clamp down on press freedom in Dresden","Trump offered Italy help to fund public debt next year: newspaper","Victims of Communism Memorial opened in Tallinn","Russia trolls 'spreading vaccine discord'","(Probably) on this day took palce the eruption of Mount Vesuvius in 79 AD","Poll: Over 55% of Denmark wants the Refugees asylum camps outside the EU","Greek archaeologists uncovered an intact chamber tomb dating from the late Minoan period","Number of Spanish speakers worldwide map","King Filip of Belgium kite-surfing in Armenia: \"Enjoy your last holidays!\"","EU Commission says will not bow to Italian threat on migration (Reuters 24th August 2018)","This is the coolest summer in Greece, in my life.","On this day, 79 years ago, the Ribbentrop-Molotov Pact was signed between nazi Germany and soviet USSR.In addition to the mutual non-aggression clauses, the pact divided Eastern Europe between the 2 powers","U.K. Says RAF Jets Interrupted Path of Russian Plane Over Black Sea","Germany calls for global payments system free of US","From 1923-1932 the Kingdom of Italy committed a genocide against the Cyrenaican indigenous peoples of Libya. It left over 80,000 Cyrenaicans dead.","Italy and EU clash over fate of stranded migrants","Nigel Farage Makes a Return to the Brexit Campaign | Good Morning Britain","Macron aims to put summer scandal behind him with new reform drive","The rising sea level forces the Belgian resort to build a 40-hectare island at a distance of 1.2 km from the shore, which is to act as a breakwater that protects the beach from damage","How do you view the U.S.A?","Lithuania decides not to appeal against ECHR ruling on CIA prison","Why Netanyahu sees Poland as Israel's most loyal EU ally despite its ongoing problems with antisemitism","Brexit: Philip Hammond's £80bn no-deal warning exposes Tory rift | UK news","Irish women ranked in top 10 for alcohol consumption, study finds","Dogs to be trained to detect bowel cancer in UK medical trial","Controversial Jewish analyst Alain Finkielkraut is worried for France's future","Spanish Cabinet approves decree to exhume Franco’s remains","Electric scooters: a hot new commuting trend in Lithuania","San Marino Crossbow Contest Ceremony","Białowieza forest - the last ancient forest in Europe","What does it mean to be human? Everyone of European descent has some Neanderthal DNA in their genetic makeup","Pro and Anti EU regions based on last parliamentary election and Brexit","German military targets youth under age 18 to boost recruitment","Measles cases hit record high in the European Region","Israeli film crew reveals anti-Semitic hate at German neo-Nazi festival","Poland Rushes Supreme Court Nominations to Preempt EU's Rulings","EU, NATO not Russia’s enemies, Merkel says","Ryanair boss Michael O'Leary speaking last year about the effects of a no deal Brexit for aviation and tourism in Europe","Migrants forcibly displaced within Morocco, distancing them from Europe","Charlie Hebdo enrages Italy with cartoon about Genoa bridge collapse","Is Brexit definitely going to happen?","Meet the 15-year-old Swedish girl on strike from school for the climate","Spain paves way to remove Franco remains from mausoleum","Europe should scale up military spending in order to act as a counterpoint to an unpredictable and unreliable United States, the German foreign minister said in an op-ed Wednesday","Maersk sends first container ship through Arctic route","Ryanair brings in new rules on cabin bags","What is behind the decentralization reform in Ukraine?","Angela Merkel stresses importance of press freedom in PEGIDA rally debate","The Complex Calculations Behind Angela Merkel's ECB Strategy","Germany halts Uighur Deportations to China","Ukraine crisis: Five soldiers killed in Ukraine clashes","Trump Confirms He Threatened to Withdraw from NATO","Largest foreign born population in Swedish municipalities","The weather in Europe today (23 August)","Merkel changes target in quest for German EU dominance","EU But every star is a country","Russian Twitter bots sought to sow discord around vaccinations: report","EU calls emergency migration meeting as Salvini threatens to quit","4 troops killed, 7 injured in fighting in eastern Ukraine","European Right wing vs American Right wing Parties","EU Citizen's Initiative for Permanent EU Citizenship reaches 50000 signatures within 2 days!","Sweden Democrats loses more support","Canal belt in Amsterdam Netherlands","Around Malmo City","Row widens after German police blocked TV crew at PEGIDA rally","AfD Germany wide 2017 results compared percentage of people receiving foreign welfare and percentage of people with an immigrant background.","A Leader of the Biggest Party in the Netherlands Slams ‘Anti-Vaxxers’, May Back Compulsory Vaccinations","Paris knife attack: \"someone with a psychiatric problem\"","Poland gives out record numbers of passports to Israelis","Climate change denial strongly linked to right-wing nationalism, finds a new study.","Former Kurdish MP from Turkey to appeal for asylum in Greece | Kathimerini","Russia breaks its social contract","Erdogan’s conspiracy claims strike chord in Turkey","Former Scottish First Minister involved two sexual assault claims. Also looking to sue Scottish Gov.","Irish prime minister to press Pope Francis on child abuse","New video of tortures in russian prisons","Microsoft faces U.S. bribery probe over sales in Hungary","EU States' Vacation Spending in 2016","U.S. lawmakers seek to impose more sanctions on 'menace' Russia","Evening chill in Bijela, Montenegro","Sweden’s government funds antisemitism","This is Turkey's 164 year old Ferris wheel tradition","70 Years Ago, America Restored Democracy to Germany. Now Germany Wants to Return the Favor","Soft hard brexit stance map","Roma in Ukraine targeted by Far Right","Lentil soup or cauliflower shakes? Finnish army's veggie meals upset minister","Austrian man tries to take his horse on the train","I found an old atlas with maps of Europe","EU agrees 18 million euro development aid for Iran","Prague gave 1,5 mil. Kč to a promotion of drinking beer. We want to fight smog this way.","What A No Deal Brexit Could Mean For Fintech","Change in total fertility rate in Europe (2006–2016) [OC]","Levels of E-Coli have doubled in recent weeks in the Swedish municipality of Lidköping (article in Swedish)","BBC News: Kalashnikov's CV-1 electric car touted as Russia's answer to Tesla","Legendary T-34 tank falls from platform during Kursk victory parade","Support for Democracy High Around the World | Pew Research Center","European Parliament splashes out £800,000 of taxpayers' money on 751 43-inch flatscreen TVs for MEPs","Europe to ban halogen lightbulbs","US-China trade war: What’s in it for Europe?","Russian trolls 'spreading discord' over vaccine safety online","I actually like the proposal...","German police in row over far right after officer blocked TV crew at Pegida rally","It is time to stop extensive copyright laws and upload filters again. Many events on August the 26th. Add your own or attend those on the list to make your voice heard!","Befriended a German dude on his journey across Finland, asking for strangers to doodle into his sketchbook. Here are some of the sketches.","Which professions do Danes trust the most in 2018? Midwives the most. Politicians the least (lower than car dealers). (Translations in the comments)","Northern Ireland firms dismayed at May's 'ask Dublin' Brexit advice","American &amp; British POW's beaten and kicked by French civilians whilst being marched by Germans","The Plight of the Roma: Europe's Unwanted People - SPIEGEL ONLINE - International","The Palace of the Dukes and Estates of Burgundy - Dijon, France 🇫🇷","Netherlands sticks with pension age rise despite longevity trend","Making plans for a new world order l Heiko Mass, German FM","On this day, 74 years ago, Romania Switches Sides in World War II. King Michael I removed the government of Ion Antonescu by arrest him and declared Romanian support to the Allies. Between 1948-1990 23 August was the National Day of communist Romania","Emmanuel Todd - \"Europe is gone\" (SPIEGEL, Full Interview with DeepL translation in comments)","EU and Eastern European migration to UK falls to record lows","Russia's four biggest telecoms say nyet to a new initiative to codify Net Neutrality","New analysis of rape sentences: 58 percent of convicted born abroad","Britons living in EU could lose access to UK bank services in no-deal Brexit","Hundreds of Russian Jehovah's Witnesses apply for asylum in Finland","The proposed European spaceplane Hermes, designed by the French Centre National d'Études Spatiales (CNES) in 1975, and later by the European Space Agency (ESA). The project was cancelled in 1992","Somewhere in Poland, 1939: German and Soviet troops implementing border agreed in the secret protocol of the Ribbentrop-Molotov pact","Amsterdam Jewish mother and children told they \"should all be shot\"","34 years ago in Romania - 1984 that is","Reindeer herders in Sweden ask for emergency funding so the animals don't starve to death","Netanyahu lauds European airlines for ending Iran flights, says more will follow","Air pollution leads to cardiovascular diseases. International team of experts from Mainz, London and Cleveland reports on mechanisms that cause vascular damage. \"The fine dust particles are chemically formed mainly in the atmosphere from emissions from traffic, industry, and agriculture\"","Credit Suisse freezes $5 billion of Russian money due to U.S. sanctions","Which are the most expensive countries in Europe?","Eviction of Dutch Jews from Nazi-ravaged synagogue brings back bitter memories","Russia marks 75th anniversary of its watershed victory at the Battle of Kursk","Best telco/sim for traveling to 4 countries","UK outlines plans for fallout of no-deal Brexit","BA and Air France to stop flights to Iran","Russian ruble weakened to its lowest since April 2016","Scripts of Europe","What Is the European Union? Its Purpose, History and How it Looks in 2018","The Baltic forest and moorland","Poland to offer special pensions to mothers of many children","British couple found dead on Thomas Cook holiday in Egypt","Aggressive Expansion: American Adding 9 New European Routes","Medieval walled town in Montenegro risks becoming the next Dubrovnik under pressure from cruise ship hordes","Svečani koncert \"60 godina Televizije\" [Last night's big open-air concert celebrating 60 years of Radio Television Belgrade]","19-year-old film student in Russia facing 5 years in prison for memes mocking religion","Brexit: Nationalism makes you weak, poor and morally insecure, EU warns","Russia is buying lots of gold to shield it from sanctions","Russian investigators will give Poland another look at the wreckage of Lech Kaczyński's plane","Finnair Announces New A350 LAX- Helsinki with Plenty Of Award Space","EU Healthcare Expenditure Relative To Population Size","China says wants to 'fully strengthen' trade ties with Britain","A Man Fell Into Anish Kapoor's Installation of a Bottomless Pit at a Portugal Museum","NI businesses advised to contact Irish Govt on Brexit","TIL the EU doesn't have any tariffs or quotas for \"everything but arms\" coming from the UN defined list of least developed countries","Norway's plan for a fleet of electric planes","Mass protest: Irish snap up tickets to see pope – with no intention to go","27-year-old refugee from Iraq \"too gay\" to get asylum in Austria","Paris: Smoking banned in some public parks","Hungary Intentionally Denying Food To Asylum-Seekers, Watchdog Groups Say","Germany has surpassed the United Kingdom as the top market for Greek tourism","Goldman Sachs commits to UK despite Brexit fears with £1.2bn deal","German Foreign Minister: When U.S. \"Crosses the Line\" Europe Must Act","Number Of Bird Species Threatened","Russian Journalists Murdered in Africa May Have Been Set Up","With attacks on independent media, the \"thaw\" in Belarus is over","Tories block Ukip donor Arron Banks from becoming a member","Volkswagen to invest $4 billion to build digital businesses, software","Britons in EU could lose access to UK bank accounts under no-deal Brexit","Brussels and Westminster brace for \"no-deal\" contingency plan publication","Most common foreign nationality in France (2015)","How Turkey’s lira crisis was written in Istanbul's skyline","Great European metal bands part 103: GRAVE DIGGER - Highland Farewell (Germany).....Don't ask ;)","Total pulls out of $4.8 billion Iranian oil project under US pr","Bosnian officials deny entry for Zakhar Prilepin","Despite being shunned in America, Huawei is flourishing in Europe","UK publishes 'no-deal' Brexit advice","Italy allows 29 unaccompanied minors held on the coastguard ship Diciotti to disembark","Europe From Memory By A Canadian... Je Suis Désolé","Somewhere in Czechoslovakia, 1938: German and Polish troops implementing border agreed in the protocol","Sweden: The good vs the bad - BBC Newsnight","Sale of puppies and kittens by pet shops set to be banned in England","When you have no idea for an election campaign in Poland.","Jeremy Corbyn refuses six times to say if UK will be better off after Brexit","UK warns of higher costs if Brexit talks fail","\"Hungary\" in various European languages","Social media users mock Dragnea's assassination claims","Chechen terror suspect arrested in Berlin","Paris hikes fines for apartment owners in holiday rentals feud","Spanish police smash Europe's 'biggest' illegal turtle farm","It’s not Turkey that’s sick, it’s Erdoğan’s ideology.","Turkey financial crisis: Should Europe prop up Erdogan? | DW English","Support for Sweden Democrats slips ahead of Sept 9 election","Populism &amp; Copyright, Part II: Foreign Proxies","Lazy Town star, Stefan Karl Stefansson, dead at 43 after two year battle with cancer","Ryanair agrees deal with Irish pilots, raising hopes of averting strikes across Europe","Moldova mulls new gas contract with Romania, not Russia","How long did the Irish language survive in each of the 32 Irish counties?","Poland Backtracks in $28 Billion Battle With EU's Worst Smog","Why Nordic “Socialism” Won’t Work In The U.S.","Goldman Sachs opens digital consumer bank in Britain","Rare STI which eats genitals diagnosed in UK for first time","Associations of judges and prosecutors, attorneys, civil society activists call on the Polish President not to swear in Supreme Court judges","Jeremy Corbyn refuses to endorse tougher sanctions on Russia","Commission gives green-light to several mergers","Germany urges EU payment system without U.S. to save Iran deal","Map of the Roma migrаtion into Europe","Merkel quashes foreign minister’s (anti) American Dream","Most common foreign nationality (excluding Ukraine) in Poland crospost with r/mapporn [OC]","Share of foreign nationals in German cities and districts","Suspected murderer (Jos Brech - 55) of boy (Nicky Verstappen - 11) on the run in France - Dutch police asks all European citizens to look out for him","Norway's $47bn Coastal Highway","Europe Is Warming Up to Putin","NATO and the Myth of the Liberal International Order","European Union set to allow Apple's acquisition of Shazam","Austrian caught speeding 42 days in a row","Greece demands Britain open negotiations over the return of the Parthenon Marbles","European Citizen's Initiative for Permanent EU Citizenship is now open for signatures, and has 1000 signatories already","Most common foreign citizenship in Austria","Bulgarian government approves roadmap to euro membership","Swedish authorities monitor Islamic group's campaign to stop Swedish Muslims voting","On this Day 24th August the God of Fire: Mount Vesuvius begins stirring, on feast day of Vulcan, Roman god of fire (goes on to destroy Pompeii The day after)","Water levels in Danube recede to record lows, hindering shipping in Hungary","AMA on r/IAmA on Monday 27 August: ask your questions to a parliamentary assistant in the European Parliament","How Turkey Dumbed Itself Down","Icelandic Whalers Kill Pregnant Fin Whale","Berlin: Russian detained on suspicion of preparing terrorist attack","Paris redesigned the urinal, but the real problem is the urinators","Sanctioned Putin ally Vladimir Yakunin granted German visa","Decay of remaining part of Genoa bridge not linked to collapse - prosecutor","UK government's preparations for a no deal scenario","A Record Year for Measles Cases in Europe","EU approves support for renewable energy in Denmark","Is anyone else having issues with some links on Reddit being ‘unavailable in your region’ since GDPR came in?","Fascist salutes: Does it matter anymore?","Germany detains Russian man suspected of planning Islamist attack","Dog attacks increasing in Finland, police and insurance firms confirm","Romania's ruling party leader talks about failed assassination attempt","Polish rail network undergoing biggest revamp in decades: PM","Emmanuel Macron’s decision to take in migrants isn’t supported by most citizens, poll says","Auschwitz survivor to sue German broadcaster over 'Polish death camp' slip","Serbia may reintroduce compulsory military service -president","Average Precipitation In Europe By Country","Hungary 'denying food to asylum seekers', say rights groups","Problem of ‘balconing’ makes a comeback, with six dead so far this summer","Reviewed: Stalin’s Curse - Battling for Communism in War and Cold War by Robert Gellately","Italy’s famous dome is cracking and cosmic rays could help save it: Filippo Brunelleschi left no detailed blueprints for how he built his famous structure","New names of the Tour &amp; Taxis streets in Bruxelles - including Ceci n'est pas une rue","While hunting Pokémon, I came across some photogenic streets. (Viborg, Denmark)","UK to publish 'no-deal' Brexit advice","German schools in crisis amid teacher exodus","Trump: We are going to put a 25% tariff on every car from the European Union","Power cut affects parts of Greek capital, subway system","First-of-its-kind satellite to measure global winds finally ready for liftoff","Hungary Wage Growth Accelerates Unexpectedly In June","EU Commission awards €9 million to Italy to support health care for refugees","Former pump station in Switzerland. Back in 1866 it was one of the two most important station for drinkable water in Geneva.","The cultural differences between Germany and Sweden","Trump revives threat of 25 percent tax on European cars – \"seemingly forgeting about his pledge not to impose new tariffs on the EU as long as the two sides are making progress in trade talks.\"","A friend of mines grand father took this picture when Czechoslovakia got occupied 50 years ago","Romanian ruling party leader says protest aimed to overthrow government","Romania has gathered 1.000.000 signatures from citizens to ban politicians with a criminal record from joining any public office jobs","Migrants left for a better life. Now they fight for a better Romania","Prague today and exactly 50 years ago","On this day in 1485 the Battle of Bosworth Field took place. Henry Tudor defeats Richard III at Bosworth. This victory establishes the Tudor dynasty in England and ends the War of the Roses.","Large supermarkets in Czech Republic struggle with serious shortage of staff","Vatican: Everything you need to know","Eastern European Public Transport Platform Receives New Investments","Could land swap between Serbia and Kosovo lead to conflict?","Dutch doctors use unorthodox approach to fight dementia","The Portuguese Civil War - The War of the Two Brothers","Bavarian SPD 'steals' CSU campaign slogan website","Matteo Salvini rides wave of popularity in wake of Genoa disaster","Heiko Maas: Making plans for a new world order","Illegal gun factory discovered on East Sussex industrial estate","Latvia, Estonia to demand damage recovery for Soviet occupation"]