["[Meta] Bi-weekly General Discussion Thread","13 year old me was a mistake","You probably just don't understand sophisticated humour","This person thinks they are too smart to read.","\"Get your self some education\"","This was sent to my girlfriend after a guy found out we were dating.","Thanks for the input..","Quoting himself quoting himself","What do babies even talk about?","The trifecta","A rare breed indeed.","Bonus points if you know a simple mathematical sequence!","Reading up on smash bros and found some delicious word salad","Easy to me... simple pattern","My friend can be a bit... verbose.","Mental giant discusses his problems with women.","Look out! We have a Metro Boomin' here!","This guy denied decay of Higgs boson because he did the math.","Youtube commenter would have surpassed college graduate's technical writing abilities by age 10","“Or maybe I’m just smart, idk”","When you want to show off to your cool aliens but your dumb species keeps embarrassing you.","Grindr's \"fountain of uncommon knowledge\"","My philosophy class","We need more geniuses in our life","If only I had more time!","The elder scrolls: plot twist","Don’t even try talking to this genius about horse racing, pleb","Ahhh yes very fulfilling on a metaphysical and spiritual level","\"I know more than scientists and physics textbooks because I have experience with some REAL jobs\"","I iS sMaRt eNoUGh tO bE a laWyER","Classmate on Instagram","Too many trolls, not enough humour","He's smart yet he misses the joke and blames his sister for it.","His intelligence us too much!","Back on her #academia bullshit","Uhhh aight fam","P2: \"My 7yr old is skipping yr 2 to get into a physics course sooner\"","He has a big mind","150 IQ","The Swiss truly are peasants","I only watch the intellectual YouTubers","Deep philosophical thoughts.","Intelligent girls are cursed!","Can we ever reach his level?","Normal people","My insomnia makes me a genius. Everyone tells me so.","Terrified at his intelligence","Two levels of smart","Chill out there, Bilbo Baggins.","It’s childish and sad, really.","An intellectual bragging twice !","Very smart gets bodied","this excerpt from an essay on how to define literature","The lowest form of wit","What makes you a expert on thermal dynamics, pressure and heat ratios, and vacuum seals below 500 microns?","Too many talents to count","The Yummiest High","Kid I know in a discord server talking about Minecraft","So triggered by Tool lyrics","13 year old me, too smart, parents just didn't understand","\"100 times more clever\"","It’s not my fault I’m just so much smarter, I’m just doing the assignment","\"I can get an A grade easily with my 140 IQ\"","You don't see many dumbasses with degrees","Who wanna bet that he looked up “fnaf music” and found where it’s from?","Eyerolling is the inability for me to contain my irritation while experiencing the stimulus of your iamverysmart-itude","Don't touch me i have a black belt in Economy","Im so depressed","Til that my genes ocellate.","Life is Complicated","My friend everyone","How do you not know how to react to a joke?","He's only 10","Apperently mad lads can also be highly intelligent","The Youtube dietitian had spoken!","Price of being verysmart","Illusion Immunities","“Have you tried reading a book about fútbol?”","Books are obsolete.","A big ol' chunk of condescension and sesquipedalian loquaciousness, and then he whiffs the metaphor at the end.","Random Internet people are soo below my level of intelligence","my favorite is crawfish","Would love to research. If only it were their responsibility...","Someone actually wrote this as a yt bio","He on the other hand...","“I am very smart”","About the USA","This racing and physics expert shows us inferior beings how it's done","That IS confusing...","The REAL DEAL doesn't want you to correct his grammar","Intrigued by the Paradoxical Condition","Super genius trying to blend in to twitch chat","Umm, akshually","\"Eh, essays are too easy, teacher\"","Max irony inbound","Solve all the issues in the world by not joining the flexible finger craze!","Just take the bins out...","Electronic music is for retards","Analogies are for idiots","So this girl at my school put this on her story and I immediately knew it had a home here","Intellectual's reaction to a Key and Peele skit.","\"oh my gosh I read above my age level\"","It's hard being this deep...","It takes a certain level of intelligence to play World of Warcraft, complete with \"whom\".","The humblest of humblebrags","I'm a geunis","“Thermo-fluid dynamics if you don’t understand you don’t deserve one.” ( A Lava lamp review)","It's so apparent!","you’ve only touched the tip so far","When I told my SO we are going to have a LDR","Elitist: A person who believes that they are superior to others because of their intellect.","Former coworker. I'm wondering what his grades are.","optical illusion genius","Legos are only for children and brain damaged adults.","YouTube commenters blow my mind","I aM tHe FiRsT in My ClaSs","Typical reply.","Sometimes I seriously have no idea what my SO wants to say..","Gotta get me one of those so I can play this game more 🤔","Post modern literature genius, now with better censorship","So I can write a dissertation","OP’s comment: spending Christmas in a movie theater alone. Sounds like something I’ll be doing when I’m older. Reply: that’s sad.","\"I did put him in his place.\" -respiratory therapy student","I can Program the Game Better than the Developers","Reddit responds to almost every comment with walls of text acting like Phoebe's creepy boyfriend Roger from FRIENDS that analyzed everyone.","Get gud nubs. Submerge yourself.","wow thanks","Sociopath with 157 IQ explains how he manipulates the simpletons","He knows what he wants do with his life, do you?","At least 6th place","School Story","A jobless addict in recovery, living at grandmas...","In a Video about showing flatearthers the curvature of the earth, he later claims that earth Can Change its shape...","In response to a funny post about the nature of assholes","\"Norms\" don't think about God?","On a post about Fortnite.","I am an exception","Existential crisis as an infant","Furry genious","Intellectual pelvic girdle","One of my girlfriend’s LinkedIn connections. Make this man a CEO!","Pardon me, Mr. Megamind","An Instagram comment on a magic trick account.","In a rush to use a term as a shutdown this happened.","The horror of living life with tangled keys","Say \"Quantum Physics\" again","Why is it always Facebook?!","He's trying to say that Bo Burnham's songs are mainly centered around humor. I think everyone gets the \"deeper message\"","The classic, [Certain Music] is better than [Certain Music].","The Cultural Illuminati are preventing his success","senior high-schooler is tired of coffee and age-discrimination (?)","You just don't get Big Bang Theory if you don't like it","Quantum mechanics every time...","We’re all nothing but a nuisance to this genius","thought this belonged here","Random person on a copycat agario game bragging about them being superior to others.","Redditor knew other universes existed before it was cool.","\"Others not as smart as me may prefer watching a mindless action flick that is clearly to mindless for people such as me\"","comment on a chill hip-hop video","Ack alack all these popular TV shows with their balderdash and bedlam","Very smart human being doesn't appreciate banter during a chess game.","Redditor asks simple question, OP is repulsed by his inferior mind","Facebook friend is clinging onto the fact that he was once an above average 13 year old. Always uses it to prove his intelligence.","Remember Fellow Nerds- Thinking D&amp;D 3.5 Isn't Perfect Means You're Dumb","Most people buying an s7 edge have high IQs.","Someone of my intellect simply couldn’t be friends with someone who’d make a minor grammatical error","On a preview for a movie","Poor guy, he is surrounded by idiots","An aspiring academic let his emotions flow","If it's fiction then murder is also fiction?","Local genius prefers cerebral Celtic music.","Amazon Review of a \"Nincompoop's\" Book","I wish I could dumb myself down","Didn't like the movie? Sorry you just haven't evolved yet","Spoiler: He didn’t get published.","Master of the Art of War","Thee just don't get it.","He is a smart boi.","Why the ¯\\_(ツ)_/¯?","Can't we just appreciate dogs?","Reaching out to my ex was a mistake","Liking something out of personal preference = contribution to society.","Intelligent Teenager appreciates Wittgenstein","Oh dear me... That's certainly something.","\"Trolling of pedants or definitive proof that you are a cretin\"","Lack of photons","At least cheese sandwiches aren't taboo","Had to unmatch due to feeling unworthy.","Minecraft player is smarter than Stephen Hawking","A very smart tinder user","Intellectual Big Bang Theory fan simplifies his verbosity for the hater bunch","It’s actually kind of adorable","Finally worked out why I don’t find Big Bang Theory funny","Will \"literally analyze anything just for the fact of knowledge\"","A handshake expert","Of course, I can pronounce it (on the internet)","Everybody is a theoretical physicst these days","On a meme about a book series for young children","\"Bright\" guy with 167 IQ about the \"coolness\" of random text on libraryofbabel.info Haha!","Too smart for this ad that ends in a twist","Apparently I need to read more antique books!","Adults demonstrate their intellectual superiority over stupid and WILLFULLY ignorant children.","Someone on twitter said they wished math came easy to them.","Just another Rick and Morty fan","Brains, people.","Getting DM'd by a celebrity after saying they should try recording better songs...","I know have understood this since like 5th grade","I found a live one","Why bother reading when you already know everything?","It's painful to be that intelligent","Fantasy Sports","Whoever wrote this pretentious text on the Mensa website","Intellectual AND an athlete?","I despair for the younger generation","I am very musical","Used to work with this guy, said this kind of shit everyday.","Her eldest kid is “a free thinker” according to her","A man above the entirety of classical literature.","Genius learns the words \"contingent\" and \"extrinsic.\" Proceeds to prove the existence of God.","Watch out for his mind punches","'Urban style'","I wonder if any research longitudinal studies have been done about you...","I’m an intellectual while everyone else is just a pig whose tail has been stubbed","This guy is the only one who \"gets\" Android","\"Most school barely are 4.5 hours a day\"","Knows too much about 3D to remember his (imaginary) kids' names","14 year old genius talking about string theory and space time continuum","But it shan’t be the norm","Complaining about a news headline using the word \"poos\"","\"As I am reminded of a time in my life when I experienced the delicate and unexplored tenderness of love for the first time\"","I guess I prefer the blissful ignorance that comes with being non-gifted. I’m too dumb to feel like someone is invalidating my...feelings? Ugh stupid normie brain","Im such a freak guuuuuys!","This guy knows World War II had more than one cause... And he's only 14!","Only those with a genius IQ can enjoy Fortnight o","I am twice as qualified as you and you're old","He’s miserable because of how smart he is.","And here we have the Edgy Intellectual","Jeremy is W0ke","Commented on a comment on an article about ants.","Get with my speed","Is the below average language why he can't get his sentence right even after editing?","Hope you guys don’t mind paragraph gore.","Boy who forgets he’s a millionaire strikes back","a verysmart male attempting to communicate with a real human female","I can image Sorrow TV doing a voice for this","Take that, mom!","\"I swear I'm surrounded by idiots...\"","He’s so smart that he pays google to tell random people he’s a virgin","I sneer at the masses who read inferior books!","Man posts graphic video of animal abuse and has sex with thesaurus.","Commenter built a computer when he was 9 so it makes him unable to share happiness for others","5 coding languages and a network engineer at just 9 years old","Up in math heaven","The irony","The plebs don’t understand you","What side of the bed do you have to wake up on to be this pissy?","This is a guy who I study with... He acts a lot smarter than he is.","\"I just sarcastically tried to see if there was actually any patterns\"","\"I was raised by a handful of geniuses\"","I’m smart... anyone know smart things I could say?","My character flaw is that I get frustated when I'm too intelligent for others to understand.","saintly introverts","Mix 2 table spoons of r/iamverysmart with a pinch of r/niceguys. Bake for 2:04. Bone apple tea.","Only Geniuses Know the Struggle","I think I know why he can’t find friends - and it’s not his hobbies. I am “grandpa age”, and I got chewed out for doing something he didn’t approve of in a hobby we share.","At the VERY least","This guy failed out of my University but convinced himself that he's the smartest/best looking guy around","A reply to a satirical news page…","Average American Adults","Wow, kids read books?","That’s not how stocks work...","“Forced to be drunk”","In response to the Kanye magic stick video","My class fellow straight up said that his IQ is above average and more than rest when asked about strengths and weaknesses.","On an askreddit about co-workers being fired on the spot","User too evolved for shiny rocks","Using a calculator to multiply a 3 digits number by 9...","“I passed some university-level science classes so I’m totally smarter than you. Oh, and I’m climate change denier. Don’t you feel stupid, you nuclear power hating democrat dingbats?!” Ugh, it hurt me to even paraphrase that shit.","This selective educated man is also a selective asshole","In a writer's chat about whether a fantasy settings \"needs magic\" this guy comes in...","sAnta is REaL","115 ain’t even high though","C H I L D G E N I U S","* snap * This one's going in my cringe compilation.","Is this a programmer navy seal copypasta?","“You are so smart for your age”","'Don't feel bad for being \"normal.\"'","THEY'RE JUST NINE YEARS OLD!","A response to someone who said \"you're*\"","LITERAL tech genius","Kid thinks he’s being really deep and intelligent by posting this","I'm not a perv I'm an intellectual.","Better Poet than Shakespeare... author's poem in comments","Today’s word salad from my favorite Facebooker.","Uh, I just need to fix a leak...","Nothing worse than people and their small talk","Giuliani goes full r/iamverysmart","I am smart, I am humble.","“I’m not a grammar nazi”","I have a lot of experience in humility","I bet her TPS scale well too","Don't judge a book by its cov-","This guy’s entire Facebook profile is just quotes that he made up.","“Maternal progenitors”","My teacher doesn't realise how smart I am","Welp. Sure you do bud","We get it, you know smart words!","NIiiiIcE gUyYyyYyyyyy","As a highly intelligent individual, whom along the way...","Yes I no English.","\"Gloat a little, it's ok\"","Because such a response has a better impression","Man uses a video teaching the basics of vectors to feel superior","An elite form of humour.","Just a story about the smartest guy in class","Oooh, I get a brownie point! Lucky me!","His knowlidge far exceeds others of the same age","Now that's a very intelligent message that an incredibly intelligent person said in a discord VC","This show is only for British people, as other people lack the IQ to understand the humor!","I discovered this guy a year or so ago after he commented on an NYT article about a whale killing a man.","He can quantize bosonic strings. Can you?","I just need you to overstand how smart I am","Resumé with no work experience: \"I know how most of the way stuff works in this planet.\"","Taking on the royal family with a thesaurus","Thesauri is the plural of thesaurus","“I did algebra at 5 for fun”","Must have the prerequisite IQ to communicate with them","For context, this was on a \"smosh\" satire video","I am 16 ... I have a very large mental capacity","Two child geniuses in the twitch chat","Instagram comment on a post about boys complaining about girls dressing like thots at school","This guy, on his own writing style..","It's always the 99th percentile.","grammar nonce and a reality check","Appearently people should only read books 24/7 and live life in utter seriousness without having any fun.","It's hard being the only smart person here","I used to work with this guy- he wasn’t very smart in person... But he thought he was great!","A true intellectual","No more puppy posts on Facebook!","Genius can sleep well","Why dress like a Lil Yachty when you could dress like Ferdinand Magellan?","Don't get me started on the constitution bros","280 isn’t enough for my big head","You cant comment one word comments","Close minded fools don't like elevator music","If you could add a 0 to any number in your life...","Some pretentious chick on tinder.","A friend asked her sister's opinion of an anime","What even is a suggestion?","On a video concerning substance dualism and metaphysics...","On a youtube video of how to crack a pirated version of the sims 3 (which does work)","You're not my peer so don't try to engage with me","In response to a physics professor talking about conservation of energy","A genius among fools in 1806","Someone jokingly said \"Cold is just less hot\"","Buckle up, eternal sadness ahead","Are we just a fly trying to make sense of something like Manhattan?","Modern film has fallen so far...","Slowly back away","The Hero we (Never) Needed or Deserved","im just a simpleton.","Don't insult me","Verysmart thinks video games are the downfall of humanity","At least he was nice about it?","Ah yes perfect math","This guy knows what the internet’s all about","Quick dip into Chaos Theory makes this man uncomfortable with living in the “box”.","I am very musically talented","My classmate was trying his best to be interesting and intelligent.......","Something something socioeconomic phenomenon, you cock riding slut.","Revolutionary self-quote","I know him. Those aren’t the top classes offered.","OP Was Asking For Advice On Typing With Long Nails","People who don't read Nietzsche won't understand Inception","Some geezer talking about women privilege","I, for one, as a roman historian, of course know this numeral.","This guy's intelligence is immeasurable.","sO mUCh wASted PoTENtial","Minecraft genius doesn't even play the game! Wow! (Reposted with names censored out)","The memes are over","As a science major...","Donated piano on a community run piece of land...","I win debates with my teachers","It's almost like round is a simpler version of oblate spheroid","Women latch on like leeches once they find out!","Guess what? It’s a risotto.","I have the charm and the wit","Millenials amirite","And to think he only has a high school diploma.","This guy left less than 20 minutes after joining and barely saying anything","Y does nobody understand my art history references????","Global warming can only be understood by political geniuses","2 Genius's one forum, these intelligence levels are off the charts!","There’s Basically Something In Every Paragraph With This Guy","After his nap, he could bring back Alex Jones!","\"You have a long way to go 😉\"","It's just a heavily edited selfie of himself.","Re-up: X-Post from r/funny. Hit the books.","Reply to a review of under the skin","Looking for BABES!!!1!","The Fibonacci Genius","Never thought i’d get to see one myself, I have been enlightened","The scariest part? THIS ISN’T EVEN MY FINAL FORM!","My friend got a little wordy on me after a \"bet\"","Internet Test Strikes Again","User posts some edifying projections about a heathen rife with malaise. Or something...","“Most common people could not begin to understand”","Tempted to unfollow this guy from HS every time I see his thesaurus vomit, but it’s just so bad I can’t walk away","I asked an IG artist if he wanted to try my photo editing app. Iamverysmart ensues","Basically it's syllabus week","I am a eugenicist, and I embrace my death if I deserve it","Good grammar = solution to all issues","Smarter then Alexa","Can you go around Twitter correcting people and still feel like an ignoramus 🤔","I'm just telling you, I'm too smart to vaccinate.","I am more than just a cute guy..... Notice me for my intellect!","A lot of people don’t like smart people","Clearly a member of the Finer Things Club","14 year old asks innocent question on a YouTube science video. Guy replies and is wrong. After he is called out he says this","This guy joined our server, talked about slender-man for a minute, then did this","Felt like Carl Sagan for a few months","And a millionaire too...","When my ears are smarter","Are you even acquainted with everyone in society?","He got me good. I had to google like 100 words :O","congratulations, your skill is redundant","Too much baffling information to grammar check.","He later goes on to say “science is theoretical theatrics based on blank blathering equations.”","She's disturbed alright...","I sure am dumbfounded. I definitively don't hear that on a regular basis.","We good?","On Twitch; sorry for the bad quality","‘Intricate psychological analysis and psychometric testing’","I guess you can find people like this everywhere.","11 year old has 150 iq.","Iconoclast, biohacker, and humanitarian","Wasn't expecting this in Twitch!","This nibba going to sauder school of business","Guys I need to say something.","Taking over the world, nbd","\"and many of you lower level primates can't accept him\"","She didn't dumb herself down enough to communicate with me","It’s twitter, not a dissertation.","Thank goodness she started school at such a young age","Context: A guy said that even christians could like Doom Eternal since a Doomguy (a human) is hunting demons","Hope I pass... Smh","Ah yes, because grammar solves all your life problems","On a thread about grammar pet peeves","\"Masterfully\" done Bill.","i reply CAUSE YOUR STUPIDITY TRIGGERS MY INTELLIGENCE","The video was about someone making really good Mac and cheese","His programmatical ideas are haunting","This is objective proof of my intelligence","This expert atheist is the real intellectual here","Ughhh I hate it when it all becomes a drag once I understand everything","Please santa bring me more IQ points","The Blue guy asked why the Green guy was on the group if he only shared 1 of our mathematics modules. Their conversation evolved into this","His response to me calling him out for being pretentious in the comments of another post","Me to gizmodo last February","yOU MEANT TO SAY","On this very subreddit in the comments","Guy reads and memorises dictionary aged 5, decides everyone who swears is of inferior intellect.","Do you understand me very clearly friend 😃?","Genius has to cope with burden of high IQ","Redditor(red) is the language police.","\"The physics which worked yesterday also works today because of a consistent and logical Creator\"","WHY NO PANTS?","A Quiet Place meme with Kevin from “The Office”","R-E-S-P-E-C-T, no way you're as smart as me","Verysmart person gets schooled--then claims they already knew what they were being schooled about","I don't try, I just am","This is basic...","Who quotes themselves? Old coworker that couldn't do their job because they were too busy thinking about it","wow thats incredible","Coping with high IQ","Counter Strike prodigy","They get younger every day","The importance of formatting sentences.","He will feed on you","Bit of a freak out there bud....","People only disagree with him because they're biased, stupid or delusional","Generic Correcting Grammar Guy","well thats a tad bit ironic isn’t it","On Micheal Caine clarifying the end scene of Inception","That girls name? Stephanie Hawking.","Someone was talking smack about Star Citizen","His genius is a curse, so he gets high all day","The intellectual capacity to truly appreciate.... a cartoon!","Had to blur out the details, so I'm posting again","Highly intelligent Master Degree student sees that the government is watching them","I found a big toblerone on Twitter:","Don’t let your humor overload your neurological nerve...","Late Night Genius","This very smart man can use words that will leave most people confused","Not on his level of intelligence.","Think about it. Plato, Descartes and Camus simultaneously.","can’t let people be curious about “simple” things","How does one get more brain? Asking for a friend.","Least efficient way to make a statement:","VerySmart punctuation on Twitter","170 IQ in action","The original verysmarter","He saved us from Hitler","Some highly intelligent children","Organists, the chiefest of musicians","\"the whole anti-Tesla CJ just absolutely reeks of populism and anti-intellectualism\"","A higher intellect blessed me today by replying to my comment.","“I don’t like this word so it’s wrong”","A Deity graces a coding Discord.","Nietzsche helps this Facebook user understand Inception, but not how to avoid being a snob.","Surrounded by stupid idiots","In response to an image of vandalized plants","Pretentious Teen","He's a true genius","Posts 6-8 times a day about *loving* science","he have IQ 129 and play fortnite","I thought the comments were wonderful","No penis jokes for this guy","Those who can't become quantum physicists become dieticians","my IQ is clearly to deficient to talk to such a god","On a Jake Paul video. Really?","Have you read the brain books?","Robot is too smart for our designer clothes and fake friends","Popular author knows exactly what they want in a woman!","I have been destroyed.","who hurt this man?","ENTJ Archetype engage!","Selling Bee Champ","YouTube commenter thinks they're smart for knowing what Mono and Stereo sound is","User talks down to community and speaks in riddles","Deep in the Nietzsche","Dang he really got me there","Guy assumes unless you know air traffic control code you’re an idiot","Half life 3 confirmed","wait joint consciousness?","Playing Beethoven at 18? Childs play, apparently.","guy so smart ends up at hospital","proficient in higher mathematics, Obviiusly","Their ability to infer is well beyond the capability possessed by others.","I was a child prodigy","Lol idek :|","Civil War 2–iamverysmart edition","Too much for a simple layman","I read some books and did some research so I’m pretty sure I found the cure for cancer","This guy in my group chat..... sigh","\"You know... the usual\"","these 2 geniuses","Smart guy takes a selfy of his smartness.","The woes of being just so smart.","The game rating is 4+ years","Of course it's not meant to be boastful","a lot going on here","People not looking for a relationship are ubiquitous, meaningless slag","Smart man posting his IQ certificate of 127. “It is about what you do with it”","We just wouldn’t get it","when someone takes a copypasta seriously","If you say lmao you're a complete moron","Set me up perfectly. Excuse our slang.","The LSAT really isn’t that hard. It’s basically the same as elementary school quizzes.","Can't believe you can get PhD's from Twitter these days!","Intelligent people NEVER argue with me","on the properties of a vape-cloud","\"Well, actually...\"","Man learns the secrets of the universe through reading","Recognizing allegories is for dumb liberals","This guy from my dorm was going off an a tangent about how women choose easy jobs such as being a nurse and don't deserve higher paying jobs","People who pay get gifts in return? How preposterous!","Girl posts screenshots on Facebook of her boss firing her. Smart guy explains boss's moral philosophy","Only those qualified to practice scientific research can read and discuss scientific news apparently","See it once, remember it always","That's not how you spell [word]!","BONUS! Also has Neurons as his wallpaper for +10 smart!","Exquisite grammar from this highly-educated English student","He was just looking for an excuse to show his \"intelligence\"","On a post about a talented 18 year old playing piano.","Only nerds will understand 🤓","I am a doctor medicine of medicine","Fools, fundamental concepts are below MY superior intelligence","Everything is so boringly simple","I mean she has a point but... she literally said I am very smart...","An expert in alliteration.","Verysmart person discussing of procedural generation","Oh no I am now inferior","he sure did show them","Gatekeeping on Grindr","Enlightened intelligent misanthropes laments the inevitable conclusion of humanity","This post is unintellegant","My eyes are now open","Wouldn’t want to get in a debate with this genius","Oh god, they've discovered graffiti!","Ahhhhhh, high school, what a time for me.","A sick mindset if you don't like kpop","This guy is so damn full of himself. Jfc.","Talking points of the ctrl-left","He is all and he is nothing...because math","I have an 19 PHDS","Basketball? Never heard of it.","Later you fly intellect","I see...","Movie critic","Sister can't post a thank you post for the community's help finding a wedding ring without finding one...","\"there is no aspect of a computer o don't understand\"","People these days not knowing how to read","\"Lol idiots you can't solve a crappy maze puzzle\"","A review on google about my school","Dont have an opinion ifbyou are not smart enough...","When you think that you are smarter than the protagonists in Saw","Who Knew Aliens Had Resumes?","A 'yes' would have sufficed","I don't get that feel very often...","What fool wouldn't know 1950's medical research?","I too, always out that small spelling errors kill me a little bit, u too?","I guess straw-manning is the only thing your puny brain is capable of.","I can practically smell this guy's fedora.","I’m so smart, that people say I’m smart, and I’m so humble, that I’m making a fb post to tell you that I’m really not all that smart. Also, I’m telling you in a roundabout way, that everyone else is dumb. Also, I am a grammar god.","Getting triggered at 200 IQ is normal","Too late.","*nearly* genius level IQ","This amazing article i found","He's being torn apart guys","I don't follow politics but here's a lesson on politics","Please explain your choice of \"emojis.\" It is a matter of public safety.","Pah! Simpleton. I truly envy your dearth of cognition.","Why even study for the SAT when you have a superior mind like me?","It's spelt aneurysm.","When arguing why he should have picked a healer over his onetrick dps when we needed it","The rare buy one get one free edition. *Chapeau*","He knows more than the IBM scientist","His brain is a quantum computer","On a discussion about BB guns","Feeling concerned at Ground Zero","Very smart fan destroys noob","You have to read them all or you basically haven't read any.","I’m the car guru","Ok w get it (Reupload since it got taken down)","\"The arrogance is high in this one\"","Ha ha techer dum I smart","Real professor disses lil pump on instagram","On a post about branded Vs non-branded medication","In the comments of a Facebook ad, in response to a joke about software being just ones and zeroes","if ur intelligent u can understand it","I don't know man, I didn't understand it so it's obviously too smart for me. Also yes, this was unprompted.","inception smart","Very smart person believes people are getting dumber. Luckily they don't need another source - they're a brilliant macro-analyst!","Listen here kiddo...","Knowing about the foundation of mechanics makes you a more useful person","I can't believe I was like this","I am too busy saving the world to have emotions while watching a movie.","Not as intelligent as man like me *laughs*","In a twitch stream","Mad at a subreddit’s name","About how elephants see humans","He has a steel trap","Very smart doesn't need science","Smart lad knows how to build a pc","This is one of a plethora of comments like this. For context: this was in response to a sarcastic “wow you’re such a genius” fro another person. Classic.","My buddy’s attempt at an insult, now with the full chat.","i will never apologize for your through intellectual inferiority","”I am using big boy words to make myself look smart and therefore make me more powerful than you in my mind”","Grey matter off the charts","why won’t anyone listen to me say things i heard on vsauce?","Yea, i agree","Mhmm ideas. I see","Super cool","I bet she puts her SAT scores in her applications.","I could memorize 404 terms \"all today... but I'm lazy today\"","Man seeks to enlighten.","President of the universe","In reply to a “you’re all important and deserve love” comment","Killed someone in Fortnite so he enlightened me","Imagine still unironically calling peoole \"noobs\"","'Your music is profane garbage!'","As someone with a major in Internet: Reddit, I am incredibly frustrated by this behaviour.","I found a 'hyperintellectual', guys.","“I have never wanted to run things (though now i do)”","Setting the classic “poor grammar” trap","He's only 13 years old","Ace pilot from flight simulators","Ha I'm smart ur not cus i said so and ur a hater","Nobody Understands...","Too bad she's purposefully homeless, her ability to craft a knife means she's smart enough to cure cancer.","Don't you hate it when you are too smart to experience childhood like your peers","Fully grown man shows up 5 year olds by playing the piano.","This guy is the God","A roommate was pissed off that a professor wouldn't write him a recommendation because he did poorly in his class. This was the email he sent in response","Only bilinguals can rhyme 2 non-rhyming words.","This guy smarts.","This shower thought did not capture the essence of life...","iamverysmart i know english","Must be hard to be the only one who ever thinks about these things /s","This is why they think they have such high IQ's (I got every answer wrong)","Very smart Redditor can't help but laugh at the absurdity of life.","Math is his porn","I guess he just doesn’t like the word.","He was TEN and realized this, how could you not?!","Better watch out or he’ll catch your brainwaves!","When you understand chemistry jokes even though it's not your field.","Tech wannabe, shutdown by the code’s author"]