["/r/NintendoSwitch's Daily Question Thread (08/29/2018)","Megathread: Nindies Showcase Summer 2018","Enter the Gungeon getting a physical release on Switch","FireWatch on Switch Playable at PAX WEST!","Made this Switch desktop wallpaper today!","Not every decent indie has a success story on Switch. Some comments from Cosmic Star Heroine developer.","Toejam and Earl: Back in the Groove to get physical switch release via Limited Run Games","Dragon Quest Builders 2 Japan release announced for 12/20/18!","Pokemon Lets Go Steelbook announced for Japan","Super Smash Bros. at Evo 2018 | Nintendo","Into the Breach is even better on the Switch!","Octopath Traveler composer was relieved his compositions were so warmly welcome by fans","Rocket League's Progression Update is available now (Scalable UI!)","A bunch of details about TowerFall on Nintendo Switch! 6-player mode, expanded stages, new variants, GameCube controller support and more...","What do you think the unannounced 10 Nintendo Online launch games will be?","Disappointment in telltale","Untitled Goose Game - Teaser Trailer - Nintendo Switch","Media Create Sales: 8/20/18 – 8/26/18 - Gematsu","Dragon Quest Builders 2 Opening Movie","Super Mario Odyssey adds Spewart Hat &amp; Spewart Suit","RAVPower 26800 USB-C PD power bank reviewed for the Switch","Why My Hero One's Justice aka My Hero Academia: One's Justice in Japan Switch version outsold the PS4 version.","Had an absolute blast playing Pode with my gf. Being a timed-exclusive indie game on the Switch, Pode is a very underrated game, a great couch co-op puzzle exploration about a rock that helps a fallen star to find its way home.","Battle Chef Brigade Deluxe Edition - Launch Trailer","Donut County creator Ben Esposito on a Switch port - \"anything is possible!\"","Switch 101: Daily News (29/08/18) - Rocket League and Minecraft updated, Log Jammers announced, and Western 1849 Reloaded released!","Disgaea 1 Complete - \"Earth's Mightiest Heroes?!\" Trailer","Undertale is coming to Switch on September 18th!","Dragon Quest Builders 2 — Co-developed by Koei Tecmo, Online Multiplayer, Pre-Order Bonuses and more...","Super Mario Odyssey Concept Art Unveiled For Broodals Member Spewart","50% off any Capcom Switch game when you purchase Monster Hunter Generations Ultimate at Gamestop","ARMS - High Tournament Play Montage - Vol. 1 | Showcase of some Great Plays from Top Players","Victor Vran: Overkill Edition - Launch Trailer","During the Nindies Direct, this Nindies Template screen showed up, woops..","Bastion &amp; Transistor on Nintendo Switch!","Good co-op games?","Next Slime-San update will include a level editor. “Most likely” available on Switch.","Splasher is a great eshop gem you're probably missing","DRAGON BALL FighterZ: Cooler Breakdown","Since the eShop doesn't have one, let's make our own Switch rating system! (Part 2)","Surprise Nintendo Switch Release Is One Of The Year's Best Games: Into The Breach","Rebrand Wii Sports/Play titles under the Mii series, problem solved.","Shovel Knight Showdown, multiplayer battle mode revealed","Battle Chef Brigade 'neither a hit nor a flop,' says dev","Pokemon LGPE are getting steelbooks!","Nintendo Switch Pro Controller Super Smash Bros. Ultimate edition Reveal","Into the Breach for Nintendo Switch is available now!!","I'd honestly love a remastered edition of wii sports+wii sports resort for the switch.","Mario + Rabbids: Kingdom Battle Donkey Kong Adventure DLC is a delight to play","Best hyper replayable games/exclusives on switch?","I made a new Homescreen concept for folders and backgrounds, what do you guys think?","Hyper Light Drifter: Special Edition is coming to NintendoSwitch #eShop on the 6th of September","I put together a survey regarding echo fighters for Super Smash Bros Ultimate","Shovel Knight: Treasure Trove amiibo And King Of Cards Release Date To Be Announced This Week","Fortnite: We have just released the v5.30.2 update for Nintendo Switch, which includes improvements for some hitching issues.","New NA Release Discussion Thread (08/29/2018)! Western 1849 Reloaded releases today!","Hyper Light Drifter - Announcement Trailer - Nintendo Switch","Unruly Heroes - Gameplay Demo on Nintendo Switch (Gamescom 2018)","TowerFall is coming to Nintendo Switch next month and features some familiar faces from Celeste, September 27th","Slime-san is getting a level editor and we'll bring it to the Switch as well!","Onimusha Warlords HD Remaster Gets Tons of 1080p Screenshots Showing Upgraded Resolution","The screen on the entire right of my switch is popping out. Should I be concerned?","After 75 hours and completing everything, I decided to try and put something on the paper. Here's my first drawing of Hollow Knight.","Left Joy Con wiggles slightly when connected in handheld mode while the right one is solid. Should I exchange it?","[Review] God Wars: The Complete Legend","Can you play Monster Hunter between Japanese and Western carts?","Finally. Playing Mega Man on the Switch the way it’s meant to be played: with an NES controller.","King of Cards \"nearing the end of development\", news on the release date coming later this week","Monster hunter generations 99% download failure","Mineko's Night Market - Switch Trailer","Onimusha: Warlords - Announcement Trailer","Bastion - Announcement Trailer - Nintendo Switch","Shovel Knight Showdown – multiplayer expansion footage","BQM – BlockQuest Maker out on Switch this fall","Dragon Quest Builders 2 launches December 20 in Japan","Happy Hunting - Monster Hunter Generations Ultimate is now playable on the US Eshop","Transistor - Announcement Trailer - Nintendo Switch","Monster Hunter Generations LTP","Xenoblade Chronicle 2 Soundtrack Quality 👍🏻","Rocket League, Progression Update Incoming on August 29 at 10 am PDT (1pm EDT, 7pm CEST)","Hover - Switch Trailer - launches September 19","Nintendo should consider the idea of game “tagging”","[MHGU] There's a lot of free downloadable content. Like, a lot.","Into the Breach will be live on the eshop at 1PM EST/10AM PST","MONSTER HUNTER GENERATIONS ULTIMATE: Move/weapon tutorials","According to Switch Modder @hexkyz, Switch Update 6.0.0 is coming soon.","X-ray of a Nintendo Switch I took, thought some of you might find it interesting.","Human: Fall Flat multiplayer update out today!","The next Joy-Con color may be white to match the theme of Smash Ultimate.","A #NintendoSwitch Pro Controller featuring the Super #SmashBrosUltimate logo will be released alongside a bundle featuring the new controller, a steel case, and the game when it arrives on 12/7!","NBA2k19 - Trailer from Amazon pre-order.","Wasteland 2 Director's Cut is coming September 13th","Switch 101: Daily News (28/08/18) - Nindie Showcase, Slime-san getting level-editor, and Human Fall Flat Multiplayer update!","Aragami Shadow Edition | Switch Trailer","The wait is over, ‘Hyper Light Drifter - Special Edition’ is Available for Pre-order on Nintendo Switch","InkyPen CEO talks about bringing the app to Switch, and why it's subscription-based","Rebellions Secret Game Announced For Switch","Onimusha: Warlords arrives on Nintendo Switch January 15, 2019!","Samurai Gunn 2 - Switch Trailer","Dragon Marked for Death is coming to Nintendo Switch on December 13th!","Levelhead, the new game from the creators of Crashlands, launches in Novermber 2018","Ultimate list of recent AAA games/ports/game engines that does (or should) support the Nintendo Switch","Dead Cells Signature Edition finally arrived in the mail today. It was worth the wait!","Light Fingers is coming to Nintendo Switch next month, September 20th","Here's What King K. Rool's Creator Thinks Of His Appearance In Smash Bros. Ultimate","Do you intend to subscribe to Nintendo Switch Online? (with straw poll)","Desert Child Announcement Trailer - Nintendo Switch","King of the Hat - Teaser Trailer - Nintendo Switch","Hover - Switch Trailer","Minecraft (Bedrock) - 1.6.0 Changelog","Anyone about to quit playing fortnite due to how bad the game's performance is on the Switch?","Nintendo Switch Is About To Have More Released Games Than the Nintendo 3DS","ONIMUSHA: Warlords for Switch announced. January 15th 2019","Wasteland 2: Director's Cut - Announcement Trailer - Nintendo Switch","Victor Vran: Overkill Edition - Launch Trailer - Nintendo Switch","Human Fall Flat multiplayer update is out now for Switch.","Nefarious is coming to Nintendo Switch, September 13th","The Messenger Teaser Trailer - Nintendo Switch","Tower defense action RPG Hell Warders coming to PS4, Xbox One, and Switch this fall","Super Smash Bros. Ultimate Edition Nintendo Switch Pro Controller","My Japanese physical edition of Okami HD just arrived. So beautiful.","Made a switch photo frame with pearler beads... gave it a plastic screen too... even has finger rings and smudges like the real thing! Lol","Difference in Switch since launch","Buying games in Japan : my experience","DRAGON BALL FighterZ: Cooler Gameplay Trailer","Monster Hunter Generations Ultimate Review - Nintendo Life (9/10)","I'm glad to finally share my first BOTW fanart after almost a year since I played the game","Shovel Knight Showdown features 16 playable characters, story mode and additional game modes — available as a free update to Treasure Trove or standalone game","Super Smash Ultimate Bros. Ultimate Special Edition at GameStop now!","Into the Breach - Launch Trailer - Nintendo Switch","Nintendo Switch on the Spot!","Just beat DK Tropical Freeze. Celeste was with me.","I can only connect 4 Pro Controllers to the Nintendo Switch, is there a way to connect 8 controllers?","The Messenger review thread (multiple review links)","SENRAN KAGURA EU eShop","The World Next Door - Teaser Trailer - Nintendo Switch","You should know what you’re in for with Monster Hunter on the Switch","Dragon Marked for Death - Announcement Trailer - Nintendo Switch","New NA Release Discussion Thread (08/28/2018)! Blade Strangers, de Blob 2, Monster Hunter Generations Ultimate, Victor Vran: Overkill Edition, and The Walking Dead: The Complete First Season release today!","Bullet Age - Teaser Trailer - Nintendo Switch","Auto-Dimming","Senran Kagura Reflexions's overt sexual content seems out of place for Switch (don't shoot the messenger, I'm only linking this)","Blade Strangers - Launch Trailer!","Treasure Stack is coming to Nintendo Switch this Winter!","Nintendo releasing Super Mario Odyssey: Starter Pack next month","Onimusha Warlords Switch Physical Copy confirmed… in Japan","DRAGON BALL Xenoverse 2 - Extra Pack 3 Launch Trailer","[Opinion] Why Nintendo Online isn’t a good idea.","/r/NintendoSwitch's Daily Question Thread (08/28/2018)","Nintendo Launching Switch Game Starter Packs","If you still haven't played it yet and you're looking for a game with good story, try Walking Dead Season 1","Octopath Traveler and the concept of \"grinding\"","Hollow knight lag after update?","Chasm, by Discord Games, is Coming to Switch","Saturday Morning RPG from Limited Run Games came in the mail today!","This should have been the boxart for Super Smash Bros Ultimate SE...","Pro Tip: If you're having trouble getting to grips with Monster Hunter Generations Ultimate, try out the Prowler mode","DOOM on Switch has ruined ports for me","I'm concerned for the Nintendo switch online. Mostly because of how little Nintendo has spoken about it.","Have had my Switch hanging out in dust","Yoku's Island Express is a pure delight!","Marble It Up! announced for Nintendo Switch, successor to Marble Blast Ultra","Hollow Knight made out of butter at CNE","Blossom Tales: The Sleeping King sales on Switch are 20 times higher than Steam","Prison Architect Experience","Streets of Rage 4 announced - Gematsu","I've made a 2D NES/Gameboy version of Mario Odyssey!","I need help picking a game!","PSA for people new to Monster Hunter or coming from MHW. Tips for avoiding frustration.","Looks like there is a ARMS pack in bundle in South East Asia","Metal slug deserves a lot more love.","Hypothesis: Nintendo is developing a PokeRPG Maker game","Monster Hunter Generations Ultimate - Launch Trailer - Nintendo Switch","Daemon X Machina- Producer Interview","One handed Nintendo Switch controller tested and evaluated","Luigi's Mansion AR game using Nintendo Labo: Toy-Con Garage","Bandai Namco Says “We’ll Think About The Possibility” Of SoulCalibur VI On Nintendo Switch","Baba Is You from the RedCube at gamescom 2018 (Nintendo Switch) - Looks like a great Indie for puzzle fans","Dust: An Elysian Tail officially launching for Nintendo Switch on Sept. 10!","The Creators of Ninja Gaiden Play 'The Messenger'","Super Smash Bros. Ultimate Is The Best-Selling Game of 2018 So Far on Amazon","Super Mario Odyssey: The definitive conceptual demonstration of the Switch","Marble It Up! rolls out this year on Switch!","Aragami: Shadow Edition announced for Switch, releasing this fall","Fortnite is unplayable: a crying plea from Nintendo Switch players","Human Fall Flat Multiplayer Update","Levelhead - Announcement Trailer - Nintendo Switch","Nintendo announces diverse lineup of Nindies coming to Nintendo Switch - Nintendo Official Site","Monster Hunter Gen: Are You Going to Transfer?","Would Nintendo ever implement digital backwards compatability?","Atlus still hard at work on SMTV, no compromises being made, news to be revealed at a later date.","Rain World official account teasing something for Switch?","Goofy city-sim 'Buildings Have Feelings Too!' announced for Nintendo Switch","Switch 101: Daily News (27/08/18) - SEGA AGES delayed, Ys VIII sequel in the works, and Dawnview announced!","Keep Talking and Nobody Explodes is a Blast!","Decided to share a fan-made Smash Bros Ultimate reveal I made for Isabelle. Hope you enjoy!","Toejam and Earl: Back in the Groove hitting Switch 'before the end of November'","The SEGA AGES Games Have Been Delayed to September On Nintendo Switch","Fallout Shelter: Tips And Tricks for the Overseer who’s reading this.","Hover Home Menu Icon","This Bluetooth Audio Transmitter by Gulikit for the Switch seems promising. Anyone got one yet?","Paladin software errors","How is Mario Tennis: Aces in it’s current state?","Chasm hinted at for Switch in developer tweet","Let's take a second to think about the state of Switch software releases and the people complaining about way too many indies","Any idea when the Nintendo shop will be open again?","Why are the home buttons black light responsive?","You got the Switch and what other console? Why?","Sparklite is now in development for Nintendo Switch","Bandai Namco Isn’t Ruling Out SoulCalibur VI On Nintendo Switch After Launch","Last Full Day For Amazon Prime 20% Off Pre-Orders, Ends On August 28","Black Screen Of Death Cant Fix","Happy birthday Mario Kart! If Formula E ran like MK","(DOOM Multiplayer) \"Unable to reach dedicated server endpoints\" Issue fix? Am i the only one here?","Bandai release Nintendo Switch Dragon Ball FighterZ trailer","Amazon gave me the 20% off for Diablo III preorder even though it didn’t come up initially.","TowerFall - Announcement Trailer - Nintendo Switch","Does the GameCube controller only work for games that support it?","What games would someone like me, who prefers handheld would you recommend?","Streets of Rage 4 - Platforms not announced yet but most likely coming to Switch","Super Smash Bros Ultimate Standalone Pro Controller is available for pre-order at Best Buy! ($74.99)","Human Fall Flat Server Issues","5 types of Nintendo Switch owner","Monster Hunter Generations Ultimate Demo: What's with the meowing?","Ridley amiibo up for preorder in Sweden !","Shin Megami Tensei V: updates on development, team interested in Nocturne remake","Eurogamer - \"Super Mario Party's use of two Switch screens is a technological marvel.\"","Current Nintendo Switch eShop deals","COOP Groups and Overcooked Lovers: Give \"No Heroes Here\" a chance. HIDDEN GEM ALERT!","Lost all audio while on hand-held Help!!!","Damnview: Built from Nothing Announcement Trailer","Super Smash Ultimate Pre Order","Donkey Kong in slow motion?","‘(N)Indies’ Reddit Sub-section?","NIS announces action RPG Lapis li Abyss for Switch, PS4.","Is there really enough \"great\" content on the Switch?","Right Joy-Con buzzing annoyance","Pokemon Trading Between Different Users of the Same Switch?","Take a look at Starlink Battle for Atlas' figurines (Pilot, Starship and Weapon Packs)","Zarvot - Teaser Trailer - Nintendo Switch","Connecting Issues","Switch Online Suggestion/Idea: Auto-upload of videos and screenshots","Losing faith in the Switch","I have to stop buying every cool game that come to Switch","Possible Guest Login feature launching as part of the online service.","Treasure Stack - Announcement Trailer - Nintendo Switch","The Walking Vegetables: Radical Edition announced for Nintendo Switch","/r/NintendoSwitch's Daily Question Thread (08/27/2018)","For those wondering, the Super Smash Bros. Ultimate Limited Edition probably doesn't include a regular case in addition to the steelbook (x-post: r/smashbros)","With remasters of old-school RPGs like Grandia 1&amp;2 and Langrisser coming to the Switch, which RPGs are you hoping get brought back from the dead?","If I've never played the Mega Man X games before would I notice the input lag?","Super Mario Party is really missing a trick by not allowing you to play boards online.","So what do you think the chances are with switch games working on the next Nintendo system?","'Netflix for Comics' App Coming to Nintendo Switch - IGN","Anyone buy a Pro Controller recently? Is the d-pad ok?","Getting MonHun Generations ultimate this week? FYI you can start with 2 million gold.","Mario Kart 8 Deluxe should add single player missions","Dust: An Elysian Tail coming September 10th Digitally (src EU/ESP eShop)","Does Switch have an Indie and Big Game problem? -DreamcastGuy","The Search for a Budget Gem; Week 6: Beach Buggy Racing","Have any of you ever actually taken your switch outside?","Starlink dev on Pitching Starlink-Star Fox crossover to Nintendo and Shigeru Miyamoto.","As a skeptic, I only bought hollow knight on sale. Now I love it. Here’s why in non-Metroidvania terms and some switch reasons so you can decide for yourself","Arena of Valor Switch graphical improvements detailed, different stats from the mobile version","Co-op Doom Switch with spouses and family is really awesome.","Drew up a pixel art Joy-con Grip with some of my free time. Enjoy! :)","Need a better D-Pad for Hollow Knight/Dead Cells or more controllers for multiplayer? There's cheap USB sticks that let you use any controller on Switch!","Switch pro controller battery life is underrated","Nihon Falcom Confirms the Next Ys Title is Currently in Development","Am I the only one that thinks Dead Cells sucks?","Excited for upcoming Isometric RPGs.","Is it risky to use a wired controller while undocked?","Kamen Rider Climax Scramble Zio teaser trailer","Japanese Dragon Ball FighterZ Switch trailer","You guys think we'll get Smash Bros Ultimate costume DLC?","PSA for those playing Prison Architect!","Can 8 Switchs pair up in Super Mario Party?","Warframe on Switch will solve my dying pet problem.","Nintendo Switch 32GB Console get Free 64 GB Memory Card $299.99 at Best Buy","Has anyone tested the GameCube controller for latency issues like those of the wired Pro Controller?","Dragons call mode on Paladin's is very buggy","Just finished this Mario Odyssey puzzle!","Little Dragons Café inconsistent framerate makes me want to puke every time I rotate the camera outdoor, I hope they fix it. A bit of a PSA, for the mean time, switching the Camera Speed to Fast in the settings helps a lot.","Okami text speed tip","Scored a copy of Blade Strangers early! Love the extras you get with Nicalis games.","Dual Micro SD Slots are a must for an upgraded Switch model","Starlink: Every Single Pack Listed With Item Inclusions And Pricing","2019: what do you think the game release spacing will be?","My Switch won’t show 1080p on docked mode","Hallow Knight's flaws","Bethesda and Nintendo had to figure out how free-to-play games would work on Switch when porting Fallout Shelter","/r/NintendoSwitch Sunday Show Off Thread (08/26/2018)","Yacht Club Games teases an \"all new game\" for Shovel Knight: Treasure Trove","My Switch Games ranked","As per Nintendo.com, the switch has 1065 listed titles for it, and the 3DS has has 1254.","/r/NintendoSwitch's Daily Question Thread (08/26/2018)","Best Pro Controller Dpad Fix","Starlink: GIFs For Every Weapon So Far","Guys... w-who are those people in the back?","Next Flyhigh Express set for September 1","Sky Gamblers: Storm Raiders trailer (Switch)","Switch 101: Daily News (25/08/18) - Shovel Knight and Golf Story devs working on new games, EPIC Games address issues with Fortnite, and Smash icon revealed!","What if Metroid Prime 4 is in Switch VR?","Pokédex features in Pokémon Let's Go, Pikachu! &amp; Let's Go, Eevee!","Can't believe how useful cross play is !","Nintendo fights back! All previous bans have been elevated to Content Distribution Network bans.","Diablo III devs: Switch is “the next evolution”, frame rate / resolution talk, scrapped touch controls","Its out in Germany! How is that even possible?","Sidebar games (Golf Story dev) confirms they are working on a new game, hopes it will surprise fans when they reveal it.","I don’t like metroidvanias and I have fallen in love with Hollow Knight.","Bethesda says it has talked about Rage 2 for Switch, but unsure if it would work on the system","\"The copy destination is full\"","Monster Hunter Generations Ultimate - Box Covers PAL","Disgaea 1 Complete - Persuade by Force (PS4, Nintendo Switch)","My drawing of Revali from the legend of zelda botw","Switch will no longer start","Bethesda says its games on Switch have been “hugely popular”","Why is nobody talking about the insane input lag in Hollow Knight?","We really need a software update","Fortnite - After the update, what setting have worked for you?","Does anyone else think that Super Mario Odyssey is more similar to games like Banjo-Tooie and Donkey Kong 64 instead of Super Mario 64 and Sunshine?","MERCENARY KINGS Limited Run Games cart says E10+ even though it rated T!","Thief Arthur from Million Arthur: Arcana Blood has been announced as the first DLC character for SNK Heroines","IKARUGA - update 25/08/18","If you are interested in Pokken Tournament DX or want to see high level gameplay, the official World Championships are going on right now for the game.","Any word on a patch for Tumbleseed?","I found this neat Nintendo version of the Marvel Studios logo on YouTube.","Bad North Discussion Thread","Lifeless Planet is coming to the Switch","Switch Minimalist Dark UI. What do you guys think?","60FPS Switch Games (Physical + Handheld)","B Button isn't working right","What if \"All Software\" became the default view for the HOME Menu?","Was bored so I​ decided to redesign the Switch's Home screen​, what do you guys think?","Smash Ultimate Icon Discretely Revealed","Anyone playing Little Dragons Cafe?","Deemo getting Nintendo Labo support, first third-party game to be compatible with Toy-Con","GameStop Ireland lists physical version of Surgeon Simulator CPR","New Taiko no Tatsujin DLC pack on September 13th!!","Eshop Price adjustments","Replaced my Switch housing with a new one from AliExpress","What's Going On With Wasteland 2?","Are there any good travel cases that don't have to be removed from the switch for handheld play?","I just finished Xenoblade Chronicles 2... (no spoilers)","The most preorder game at amazon.com in 2018 is Super Smash Bros Ultimate","Daily reminder Hollow Knight is really cool","Nintendo Switch super quiet when playing through TV.","Taiko No Tatsujin now available for pre-order on Amazon UK.","Epic discusses upcoming and current improvements for Fortnite on Switch","Hollow Knight is Amazing!","As a casual video game player, I wasn't expecting to buy seven games in my first year of this thing...","Need some Octopath Advice.","/r/NintendoSwitch's Daily Question Thread (08/25/2018)","Nintendo announced the Nintendo Labo: Vehicle Kit for Mario Kart 8 Deluxe!","After a year of working on this Demo spreadsheet, the list has grown dramatically. There are over 100 demos and free games to date on Switch!","Weekly Kickstarter Thread: Inlight Nor Syndrome For Eternity: BombFest [08/24/2018 on 8/26]","My custom cases!","[DigitalFoundry] Dark Souls + Diablo 3 on Switch: First Look at Handheld Gameplay","Arthur New character Join SNK Heroines: Tag Team Frenzy","Dust: An Elysian Tail, Yooka-Laylee physical pre-orders coming soon","Blade Strangers Home Menu Icon","(Super Smash Bros. Ultimate) New Battle Mode Concept: King of the Ring","Xenoblade Chronicles 2 - Elma reveal trailer","[PSA]Remember to Redeem Your Physical Software for Points","Awful performance on Bad North","Night Trap is Now Available on the eShop!","Nintendo Labo: Vehicle Kit + Mario Kart 8 Deluxe","Anyone getting worse FPS and Freezes on Fortnite since 5.30","Arena of Valor Pre Registration for Switch is now open","XC2 Torna The Golden Country story trailer","My thoughts on playing Little Dragons Cafe so far...","Not everything will require a Nintendo subscription service to play online: including Arena of Valor","Xenoblade Chronicles X’s Elma available today for Xenoblade Chronicles 2","Here's a look at Blade Stranger's alternate covers!","Wargroove! So they’re pretty sure it will be our this year...","Mutant Mudds Collection Physical Copies are open for preorders by Super Rare Games","Is Titan Quest playable at this point?","Night in the Woods Super Smash splash card","Chucklefish CEO: Wargroove is “coming along at a really good pace”","I made an app to quickly download and share Nintendo Switch screenshots/videos on your Twitter account","We're Perfectly Paranormal and we recently released Manual Samuel on Nintendo Switch. Ask us anything!","If you want to see some high level Pokken Tournament DX play, the top 16 of the Last Chance Qualifiers for tommorow's Pokemon World Championships are going on right now","PSA: If you or your friend cannot join party in Fortnite, change Switch user name to alphabet-only.","My job blocked my internet for gaming...","Nintendo Was Extremely Excited To Have Diablo On Switch","Mario Tennis Aces has added full matches with 6 Games and 1 Set.","New Info About The World Ends With You Final Remix Detailing New Scenario and Purple Noise","SEGA's PAX West 2018 lineup","Hollow Knight's free DLC, Godmaster, is now out!","Switch not outputting any image when connected via sound bar","[Deal] Hollow Knight is $9.90 on the Nintendo Store","Trying to get Surround working with the switch","Nelke &amp; the Legendary Alchemists details / screenshots – Lilie, Shallotte, Lydie, Felt, Edge, Hagel, and Pamela","Hollow Knight - Impressions after my first boss fight","SNK 40th Anniversary Collection - Psycho Soldier &amp; Athena Trailer","What are some games that have many different unique areas to explore?","Japan: more sales data for Week 33 2018, Obon, more (Media Create, Dengeki) - Perfectly Nintendo Switch","[Deal] Captain Toad: Treasure Tracker and Donkey Kong: Tropical freeze are $29.99 and $44.99 respectively on Amazon. (25% off)","Arms Helix Dance (Pixel fan art)","BRAWL, cool Bomberman clone, on sale for $0.99 (from $9.99)","Saints Row The Third on Nintendo Switch will include all DLCs!","I plan to do the famous Atomic Purple Joycon replacement case, but I'm a stickler for accuracy and want that \"frosted\" look. What success have people had with frosting cases?","First Switch special Edition for SSBU leaked! Link in comment.","Xenoblade Chronicles 2: Torna - The Golden Country from the RedCube @ Gamescom 2018","World to the West Switch update patch (changelog)","I need help removing 2FA from my account.","Space Ribbon Review","Forbes: Nintendo completely dominated July's sales","Regarding LEGO the incredibles","Nindies Direct 8/28 9am PT","Why doesn’t the switch play local video of the SD card?!","ATOT 2 broke my joycons?","Realpolitiks - Nintendo Switch Trailer","/r/NintendoSwitch's Daily Question Thread (08/24/2018)","Playism is hosting a Kero Blaster fan-art contest!","'Arena of Valor' is a completely different game on Switch","New NA Release Discussion (08/24/2018)! Earthworms, Little Dragons Café, Night Trap - 25th Anniversary Edition, and Space Ribbon release today!","Nelke and the Legendary Alchemists – first trailer","Switch Online membership not required for Arena of Valor","(Super Smash Bros. Ultimate) - According to a Famitsu Column translated by Source Gaming, Sakurai states that he “referred to the Smash Ballot when selecting characters this time”.","Morphie's Law Has Serious Potential That Many Are Missing","7 Billion Humans released for PC! Nintendo Switch version coming “very soon”","How long does account transfer take?","Ninjala heads up GungHo Online Entertainment’s TGS 2018 lineup","Fortnite has a fun concept, but seeing games like Morphies Law I get reminded that a fun &amp; beautiful design is just as important to me.","What are you playing this weekend? (8/24-8/26)","Micro sd card needs to be formatted almost every time i boot up switch","The massage game that nobody thought would make it to the West is available for pre-purchase today on eShop.","Super Mario Creator Shigeru Miyamoto Warns Gaming Industry: Don't Be Too Greedy","Grandia I and II announcement for Switch - FAQ and why you should care","/r/NintendoSwitch's Friend Request and Local Meetup Weekend! (08/24/2018)","Dragon Ball Xenoverse 2: Free Update and Extra Pack 3 DLC Launching August 28th","Indivisible Developer Demo - Gamescom 2018","Doom Slayer smash video: Fan-made","Is cheating an issue currently in Splatoon 2?","Apperantly this is the official art for the physical release of super smash bros, which I saw in Tesco","[Gear.Club Unlimited] No engine noise? Intermittent?","Public opinion of Nindies Directs.","Little Dragon's Cafe Limited edition contents","Dark Souls + Diablo 3 on Switch: First Look at Handheld Gameplay","DAEMON X MACHINA from the RedCube @ gamescom 2018 (Nintendo Switch)","Fortnite Motion Controls are much improved in today's 5.3 update","Paladin's performance now looks even better!","Monster hunter Generations ultimate Arrived today all wrapped up but it does not have the Nintendo Plastic seal around the box","We are XGen Studios, and we've launched The Low Road today on Nintendo Switch. Ask Us Anything!","DKC: Tropical Freeze and Kirby Star Allies $44.99 each, Sushi Striker $35.99 at Walmart.com","After recent patch, Switch player having issues queuing with friends.","What game has had the most replay value to you?","Blade Strangers on Nintendo Switch - Tons of versus mode footage","FIFA 19 for Switch preview from Gamescom","WIP: Web extension to add metacritic scores to eshop listings","Travis Strikes Again: No More Heroes will have a ingame Morphies Law t-shirt","Last day to get Bomb Chicken for 40% off","Senran Kagura Reflexions launches September 13","Paladins 1.4 Patch is live now on Switch! Patchnotes inside.","Xenoblade is at the height of its popularity. Square Enix has just had a new blockbuster Switch exclusive JRPG. JRPGs are so hot we're getting remakes obscure stuff like Langrisser. Now is the time for a full-blown, Monolith/Square co-developed Xenogears remake.","September was the final direct last year to reveal a 2017 release. What big games can we expect to be revealed before the year end?","CEDEC 2018: Zelda: Breath Of The Wild And Splatoon 2 Both Win Awards","My Hero One's Justice | First 40 Minutes | Nintendo Switch","Encountering a game-breaking glitch in North. Help?","First Nintendo Console in Years","Examining why Downloadable Switch games cost more than their PC counterparts","The newest Fortnite update is horrible.","Out of all the indie games coming to Switch, Bendy And The Ink Machine is one I'm personally very excited for. As a result, I made some art of a very confused cartoon.","SENRAN KAGURA Reflexions - Launch Date Announcement Trailer","Let’s talk about the real issues with Fortnite for Nintendo Switch","Dragon Marked For Death Will Be Playable At PAX West 2018","The Valkyria Chronicles 4 demo has been out for a while! What are your first impressions on the game so far?","RUMOR: Dark Souls II in development for Nintendo Switch.","There was an update for Ikaruga today. Does anyone know where to find the patch notes?","July 2018 NPD: Octopath Traveler is #1 Software; Nintendo Switch #1 Hardware","EA Sports FIFA 19 from the RedCube @ gamescom 2018 (Nintendo Switch)","[US Nintendo E-shop] Mario + Rabbids Kingdom Battle ($29.99/50% off)","A little Switch Doom fanart (OC)","NintendoSwitch LineUp for PAXWest","Five Nights at Freddy's creator says that the games are being ported to consoles","Heads up: Prision Architect is filled with tons of bugs on the Nintendo Switch version","Kero Blaster released today! (Discussion)","Super Dungeon Tactics Now On US Eshop","'Little Dragons Cafe' review for Nintendo Switch","Bionik reveals new protective, rechargeable cases for Nintendo Switch - LootPots","Capcom announces TGS 2018 lineup - Gematsu","WORK×WORK - trailer","Red Faction Guerrilla Re-Mars-tered - Nintendo Switch Icons found in game files.","Super Mario Party - River Survival Mode","Kirby Air Ride perfect for a Switch reboot?","(EU) Hollow Knight sale 34% off","Langrisser’s Japanese website now open, offers story details and countdown trailer","How does Enter the Gungeon compare to Binding of Isaac after the latest Gungeon update?","Why can't I buy physical Switch compilation titles with all games on cart?","RXN: Raijin physical version and limited edition announced","Super Smash Bros Ultimate: 9 themed Squad Strike match-ups I can’t wait to try","New Dragon Marked for Death footage","/r/NintendoSwitch's Daily Question Thread (08/23/2018)","What's the Big Deal With Undertale? -- A Mostly Spoiler-Free Overview","An easier way to share nintendo friend codes","Third person real time RPGs: which do you like?","Takashi Mochizuki: \"Switch OS UI Session: in cutting player's wait time as much as possible, Switch's home menu design resources have less than 200KB. Amazing.\"","Labyrinth of Refrain: Coven of Dusk possible Shinobushi censorship?","New NA Release Discussion (08/23/2018)! Out of The Box released yesterday, and Behind The Screen, Fernz Gate, Flood of Light, Hacky Zack, Kero Blaster, The Low Road, My Farm, Shio, and Sky Gamblers: Storm Raiders release today!","Pixel Action Heroes is on sale for $2.99 on eshop, but there is a free demo that seems to have all the features.","'Diablo III' Will Use Nintendo Switch App for Voice Chat","Did the Switch finally shake Nintendo's \"kiddy image\"?","Analyzing the Switch Tax vs Steam","Bad North - Fun but buggy game","Fortnite v5.30 Patch Notes (Details some Switch changes)","ARK: Survival Evolved pre-orders begin, release date 12/31/18. Still little to no details about the game itself","We are Ska Studios, the husband and wife team behind Salt and Sanctuary. Ask Us Anything!","CooV N110 Issues","[Everspace] Nintendo Switch Footage","Octopath Traveler soars thanks to down-to-earth characters","Cutscenes show the full Star Fox team in Starlink: Battle for Atlas (starting at 1:45)","Super Mario Party - New Board &amp; Mode Reveal from RedCube @ Gamescom 2018","Nintendo Switch Chargeable Stand compatible Battery Pack","The demo for Monster Hunter Generations Ultimate has been out for almost a week now. What's everyone's thoughts on it?","12 minutes of undocked Dark Souls Remastered gameplay from Gamescom","Half an hour of FIFA 19 footage on Switch","Did you know? The NES classic games will use the Nintendo switch online for voice chat","Dream Legacy Collections","Monopoly does not allow Online Multiplayer with more than one local player.","A Hat in Time will run at 720p 30fps (docked)","Official Diablo III Gameplay from Gamescom","All content from Diablo 3 will be on cart. No downloads required","4MB Interactive on Twitter: \"OMVORM HAS PASSED CERT! This means it will be coming to Nintendo Switch...… \"","Annapurna Interactive Twitter: Gone Home on Switch delayed until September 6","What games are you playing with a S/O?","AMAs this week with Ska Studios, XGen Studios, and Perfectly Paranormal","If you buy a Nintendo Switch at Best Buy you get Mario And Rabbids Kingdom Battle for free","Morphies Law: \"We have now submitted Patch 1.0.2 and hope to have it rolled soon\"","Retailers stopped selling/supplying Nintendo Products in Lebanon","Starlink: Battle for Atlas Developer Demo - Gamescom 2018","Captain Toad: Treasure Tracker - $29.99 at Walmart.com","Football Manager Touch 2019 Coming to Switch","The Current State of Game Rewards Programs for the Switch","What were the first switch games you got?","Dragon Quest Builders 2's release date (Japan) to be revealed in upcoming livestream","My weekend is already accounted for I guess. Monster Hunter Generations!","A Message To Our Portal Knights Console Crowd","A little King K Roll fan-art because hype is too high","Nintendo talks about Switch’s OS – home menu design resources have less than 200KB","FIFA 19 footage from Gamescom","Sikanda Launches Kickstarter, Is Inspired by A Link to the Past and Secret of Mana","Are my expectations too high?","eShop sales compared to PlayStation Store","Nintendo online question that's not listed ont he website","My Friend Pedro - Gamescom 2018 gameplay","Why are so many people predicting New Super Mario Bros. U for Switch?","\"On the single joy-con, however, rolling is handled by flicking the joy-con in a quick motion. It is surprisingly reactive and accurate and works well as a solution to the lack of a second stick on the joycon.\" Diablo 3 Switch version does support a single Joy-con. Blizzard never stops impressing.","Nintendo Posts Job Listings For Switch User Interface Engineers","Beware: Bad North has progress-losing bugs","Custom BOTW Switch and Dock! The Master Sword is completely made from scratch","SNK 40th ANNIVERSARY COLLECTION - Psycho Soldier &amp;amp; Athena (Nintendo Switch)","do you close your game before entering sleep mode","\"Broth of the Wild\" by Stef","Switch Subscription Achievement Idea","The person who stole my Switch is still playing games on my account even though I've gotten a new Switch.","[GAMESCOM] Saints Row: The Third has just been announced for Nintendo Switch","Gooseneck Tablet Holders for the Switch","PSA: If you channel your Nintendo Switch sound through your pc, you can control the volume with EarTrumpet","Atelier ~Alchemist of Arland 1-2-3~ DX only playabe in Japanese","/r/NintendoSwitch's Daily Question Thread (08/22/2018)","Scans roundup - Langrisser I &amp;amp; II remakes, The World Ends with You: Final Remix, more","Since People asked, here's an oldie I did of BOTW Link","PSA: Pre-Order Smash Ultimate before the Prime Pre-Order deal goes away, it'll be 46$ on Amazon","Arcade Archives Excitebike coming to Switch this fall","Nindies@Night 2018 Predictions","Is doom as blurry as Wolfenstein 2?","Langrisser I &amp; II Getting Remade For Switch","Super Cane Magic Zero - Nintendo Switch Version Release Decided","New NA Release Discussion (08/22/2018)! All-Star Fruit Racing released yesterday, and Out of The Box releases today!","Mario Belmont","Is there a way to increase the performance?","Anyone download Prison Architect yet?","Kotaku Says Dark Souls On Nintendo Switch Performs Very Well Despite Gamescom's Weird Build","Portal Knights receiving a bunch of new features on Switch soon","Pushmo anyone?","The Banner Saga Trilogy Physical Version: IS there really a Download required?","We have roughly a month of free Nintendo Switch Online left - Here is my opinion on the upcoming paid service, from what we know.","Telltale's The Walking Dead Seasons 1, 2 And 3 Are All Coming To Switch This Year","Gunlord X heading to Switch","THQ NORDIC bringing Let's Sing 2019 to Switch and Wii","[Fan Art?] Made an advertisement (Amoung other things on my design final this summer) it helped me pass the class 😎🤘🏻","Valfaris is coming to Nintendo Switch!","I absolutely love how King K. Rool’s sassiness is kept even in his victory pose!","Error with Lumines Remastered when ending game?","Super Mario Party File size and language support revealed","Okami HD is fantastic... but the first six hours are a slog.","InkyPen, a subscription-based app for reading comics, will launch on Nintendo Switch this November","Monster Hunter Generations Ultimate: All 6 Hunting Styles EXPLAINED","Miyamoto astonished by Minecraft’s success, considered making builder games in the past (Translation)","Telltale's The Walking Dead: Season 1 releases on Switch August 28th","\"We’ve had the most sales on the Switch\". An interview with the creators of Muddledash","[Super Mario Party] complete Gamescom demo","Battle Chef Brigade Deluxe Edition | Announcement Trailer | PS4, Switch, and Steam","Need some technical help","Diablo III dev on why Blizzard wanted to bring the game to Switch","Super Smash Bros. Ultimate – King K. Rool gameplay (Nintendo Switch)","The Other Side of A Traveling System","Am I the only one finding trick shots in Mario Tennis Aces inconsistent?","Do Nintendo change the serial number on Switch’s that are sent in for repair?","Europe: a limited bundle that includes Super Mario Party and a Joy-Con Pair will arrive in shops on 23/11","Diddy kong confirmed for Mario Tennis Aces","Girlfriend hid 58 handmade Koroks through my home while I was gone on a trip. 1 year later and after a move, I’ve still only found 54. She spent several days crafting them. I’m the reason she experienced Zelda for the first time and she has over 500 hours on her Switch. Thought it was worth sharing.","Huge bug in Bad North, deletes entire save file","Starlink: Trailer and gameplay Gamescom 2018","Polygod on Switch bugging out?","Informative video by Wulf Den concerning the third-party docks situation!","Looking for a party game? Try Treadnauts.","Created this desktop wallpaper to celebrate my favourite joycon combo","Nintendo Switch Themed Ladybug","GRIS - coming to Nintendo Switch/PC this December","[GAMESCON] New DAEMON X MACHINA Trailer","Starlink dev on how the game came to be, toys-to-life market, future support, Star Fox “a match made in heaven”","Super Mario Party's eShop preorders are open: double points for preorders (600 points = $/€6)","A Hat In Time announced for Switch!","My First Switch Developed Problems, and I Still Can't Figure Out What Caused Them (Looking for Input from People Knowledgable on Topic)","Phantasy Star Joins The Sega AGES Range In Japan Next Month, New Features Revealed","New Daemon X Machina Teaser Trailer from Gamescom 2018","Ary and the Secret of Seasons announced for Switch","Get ready for Arena of Valor on Nintendo Switch! Pre-register now for rewards!","Arena of Valor: details on online play, exclusive mode, mobile tie-in event","Labyrinth of Refrain: Coven of Dusk - Puppet Show Trailer (Switch, PS4, Steam)","Anybody have a completely dead switch yet?","A patch to fix Morphies Law's lag, bugs and other issues is in the works.","Slay the Spire Announcement Trailer","Unto the End Coming to Switch","I've played Starlink on Switch today! AMA","RICO - Gamescom Trailer","Sony-Owned Indie Studio \"Unties\" Announces PAX West Line-Up","Nintendo Labo: Vehicle Kit is \"more of a full-fledged video game\"","We are porting our game Passpartout: The Starving Artist to the Switch, would really appreciate some feedback on the icon :) (X-post from r/nintendo)","Arlo | What Makes a Game “PERFECT for Switch”","The Gardens Between - Gamescom 2018 gameplay","Arena of Valor launches in September on Nintendo Switch!","Awesome Gameplay of Bad North!","Brawlhalla is coming to Switch","Morphies Law Offline XP Limit","Morphies Law is incredible offline.","Hexologic, our puzzler for Switch is getting a huge, free content update next month (sneak peeks)","I thought my Joycon was drifting, turns out it wasn't..","What would you guys think of Earthbound Beginnings on the NES online service?","Aeon Must Die! - Trailer","The Obscure! The Classic! The RETRO! (+ More Character Predictions!) - S...","Everspace docked off-screen footage","Grandia and Grandia 2 HD coming to Switch.","A tribute to my favorite multiplayer game, Snipperclips (OC)","New NA game releases! Bad North and Prison Architect: Nintendo Switch Edition (also) came out yesterday, August 20th, and Out of The Box will release tomorrow, August 22nd","PREDICTION: As the PS4 version of Dragon Quest XI is launching on September 4th (in the West), I believe Square Enix will finally announce the Switch version at Tokyo Game Show which starts September 20","Battle Chef Brigade getting “Deluxe” upgrade, new characters, modes, and multiplayer added | Nintendo Wire","I've been really enjoying Octopath! Here's some H'aanit fanart","A sad but sensible decision: X-Morph Defense on Switch without coop","Bad North experience which really soured my previous amazing opinions of the game","Indie Highlights - 20.08.2018 (Nintendo Switch)","Super Smash Bros. Ultimate – Dark Samus and Chrom gameplay (2 on 2, Stage Morph)","Blacksad: Under the Skin - #1 Teaser","/r/NintendoSwitch's Daily Question Thread (08/21/2018)","The Messenger is like playing 2 games in one (interview + gameplay with producer at Gamescom)","Physical releases of NBA 2K19 on Nintendo Switch seem to not be delayed this year","The Switch's UI is so snappy because it uses only 200kb of internal storage. That begs the question, where's that other 5,9998 gigabytes needed for?","Japanese retailer says that in just 2 months, the Switch version of Minecraft has sold what the Wii U version did in 9 months","GungHo Online Entertainment America Brings Blockbuster Games for Switch to PAX West 2018","6 Minutes Of Diablo 3: Eternal Collection Gameplay On Switch","Morphies Law Available now on Switch!","Hollow Knight \"definitive\" Physical Edition releases in 2019","RPG Maker MV - My Dream RPG (Nintendo Switch, PS4, XBOX ONE) (EU - Spanish)","US 20% Amazon Prime Discount Done","「The MISSING: J.J. Macfield and the Island of Memories」Official Launch Trailer","Slay the Spire announced for Switch","Grandia and Grandia II, Two Excellent RPGs, Are Being Remastered for the Switch","Super Smash Bros. Ultimate Gamescom 2018 King K. Rool Gameplay","Super Dungeon Tactics is coming to Switch on Sept. 13th.","SEGA Ages – Phantasy Star launches for Switch in September","Mates of mine got invited to a Super Smash Bros Ultimate event and got to play it. It was a joy to watch.","Been getting pretty hyped for Super Mario Party lately.","Why are some Switch games more expensive than on other systems?","Ditching the Zelda Boss Formula [Breath of the Wild] | Boss Battle Breakdown","'Morphies Law' First Impressions Thread","With Amazon Prime ending their 20% Discount on games, what games will you be preordering before the end of the month?","Everspace will arrive in December and is going to have a physical release!","I wonder what would happen if I wanted to play the Japanese version of an NES game on the subscription service?","Morphie's Law is now live on Nintendo Switch eShop!","Ubisoft August Nintendo US eShop Sale, including Mario + Rabbids, Just Dance, Rayman and South Park","Broforce from Devolver Digital will arrive on September 6th!","Rumor: Signs point to surprise Nindies direct in about 2 hours","First screenshots for Ark Survival Evolved","Diablo 3 Switch Gameplay from Gamescom","BAD NORTH is available now on the Nintendo Switch! $14.99 | £13.49 | €14.99","Windjammers 2 announced for Switch, first game out in October 23","Prison Architect is $29.99 and includes All Day and a Night (new wardens and maps), and Psych Ward (Criminally Insane security class), and of course includes all of the post-launch building textures (walls and floors) that the PS4 and XB1 versions have :)","Sumikko Gurashi: Atsumare! Sumikko Town - Switch Debut Trailer","Shadowgun War Games teaser","128gb nintendo switch sdcard $110 off.","Will A Hat in Time Come to Switch? That's more likely than ever!","Really disappointed with joy-con quality","There's a playable prototype of the Nindie 'Baba Is You' on the dev's website!","Made a Mega Man Nintendo switch cartridge holder!","Death’s Gambit confirmed for Switch + Physical (Hollow Knight too).","Diablo 3 will run at 60fps “across the board” on Switch and in 720p undocked","Bloodstained: Ritual of the Night release has been delayed to 2019","Underworld Ascendant launches November 15 for PC, 2019 for PS4, Xbox One, and Switch","To all awake right now Morphies Law is making an announcement in 4 hours","Prison Architect: Nintendo Switch Edition Available Now on the eShop!","Should Nintendo try it's hand at \"mature casual games\" on Switch?","Amazon.ca no longer offering Prime 10% game discount on pre-orders","My ideas for Alts, Final Smashes, and Stages for my most wanted Fighters and Echo Fighters for Smash Ultimate","Meowrio Kart!","Soft Gear bringing Strix Engine support to Switch","Shadowgun War Games confirmed for Switch","Dark Souls Easter Egg in Dead Cells","The Gardens Between launches September 20","Beat Cop on the way to Switch","Morphies Law: First impressions!","Fan-funded aRPG \"Underworld Ascendant\" from 505 Games is arriving in 2019 on Switch!","Prison Architect Switch Trailer","A few months ago, Nintendo submitted a new left Joy-Con design with fixed Bluetooth Antenna to the FCC. Have any been seen in the wild yet?","New NA game releases! Morphies Law will (also) release today, August 20th, and All-Star Fruit Racing will release tomorrow, August 21st","Overcooked 2's icons get in the way","Software sales in France: full Nintendo Switch Top 5 on week #32 (Aug 6th-12th)","Valkyria Chronicles 4 - New Features","This is how you know the HP of an enemy on Octopath Traveler","Crash Bandicoot is No.1 again in UK","Publishers Are Refusing To Sign Velocity 2X Sequel, Dev Asks For Switch Players' Support","Passpartout: The Starving Artist planned for Switch","Microids' Switch lineup: Syberia 3, Moto Racer 4, The Bluecoats: North vs South","Lil Pump rocking his Switch at the VMA’s","/r/NintendoSwitch's Daily Question Thread (08/20/2018)","Grandia and Grandia II Coming to Switch in HD Remaster - IGN","Analyst: Nintendo Switch Will Sell 25 Million Units This Year","My Super Smash Bros Ultimate Shirt just arrived!","Mario + Rabbids free with Switch console purchase at Best Buy","Morphies Law has a Countdown on the official website","Morphies Law: Did you guys catch this at the end of the trailer?","After Super Smash Bros. Ultimate has blown the internet's collective expectations out of the water, Mario Kart fans should in my opinion be more ambitious with their wishes for the future of the MK franchise.","Playing on a busy schedule","Keep Talking and Nobody Explodes is the best local co-op I've experienced in years","Game-breaking bug in Dead Cells","Cabela’s: the hunt for Nintendo switch is on amazon for preorder","For people who are going to buy Morphie's Law: What is your favorite thing about the game, and what are you afraid you aren't going to like?","Circle Entertainment to publish Button Button on Switch","Brawlout killed the multiplayer fun","What is your switch pro-tip you think everyone should know?","My Hero: One’s Justice - New Characters Trailer","New game suggestions.","Yokai Watch 4 just got a new screenshot","What did you think of the DBfZ open beta?","Rainbow Six Siege ‘not possible’ on Nintendo Switch","[Hollow Knight] Fell in love with this game for its amazing lore. Had this custom made by a local craft store and finally it’s done! Can’t wait for the Gods &amp; Glory DLC.","When do you think Nintendo's C and D tier games are going to start showing up on Switch?","If you could only buy one the games coming in this ladder half of the year, which would it be?","Okami HD feels at home on Switch","What do you want out of a new 2D Mario game?","Do you think Nintendo will release a multiplayer demo for Ultimate prior to release like they did for the 3ds version?","Trinkle Studios President, maker of Battle Chef Brigade, teases an upcoming update for BCB","Our show is interviewing Chucklefish about WarGroove soon! Any questions?","Figured I'd share my entry for the Nintendo Labo Creator's Contest 2 (Best Toy-Con Musical Instrument)","Is the game you bought the system for your most played and favorite game?","Mario Odyssey, DOOM, and Skyrim - Which 2 do I get?","Just finished my second BOTW Painting! Enjoy!","Nintendo Will Need Some Heavy Hitters in Q1 2019","Morphies law online not working?","Has anyone every bought digital then replaced with physical?","The Search for a Budget Gem; Week 5: Woodle Tree Adventures Deluxe","Physical edition of Death Squared? Get on the shortlist","Switch home menu feels not Nintendo like","Do Monster Boy, Owl Boy, and Wonder Boy have anything to do with each other?","Thoughts on Dark Souls","[Fanart] JoJovania","SNK HEROINES ~Tag Team Frenzy - Coming 9/7! Trailer","Will an Ethernet/LAN Adapter solve my Switch connectivity issue?","As a Nintendo gamer, Amazon dropping their 20% savings hurts the most for me.","Nintendo Introduces Anti-Cheat to Splatoon 2 (since version 3.1.0 in June)","With Bamco opening this years Gamescom (along with others), I'm REALLY hoping they announce a port of Narutimate Storm 4 for the Switch.","The Doom Eternal Switch port should throw in some Easter Eggs to play with the \"Doom guy is Link\" theory.","Switch Audio on PC with same headphones and mic.","Kero Blaster, a must play!","New NA game release! Spectrum will release tomorrow, August 20th","How do I add a Kanji keyboard to my switch?","Space Ribbon arrives at Nintendo Switch on August 24","If I purchase a JPN game, will it be purchased in the EU version too?","How do you clean the sticks on the joycons?","/r/NintendoSwitch Sunday Show Off Thread (08/19/2018)","/r/NintendoSwitch's Daily Question Thread (08/19/2018)","Possible new game announcements coming at Gamescom","Sleep and blue light filters","The Messenger's director talks about his game and designing fluid gameplay [Gamasutra]","Pokemon Let's Go! Pikachu and Let's Go! Eevee Mega Kangaskhan and Mega Gyarados footage","Monster Hunter Demo menu controls","So does the D3 announcement basically kill Victor Vran?","What will it take to get a normal, non-fantasy, non-combat racing game?","Weekly Kickstarter Thread: Hamsterdam 103: Neon Sikanda Paws [08/16/2018 on 8/19]","online app listed as a key feature of the online service, despite not being updated once since november or last year","How can I change the primary console when I don't have access to the previous console?","In Your Opinion, Why is Octopath Traveller so Popular?","Has anyone had an issue with Splatoon 2 connecting with players far away from you?","For games like Doom, the Switch needs a gun controller that can mount the screen and joycons... kind of like this","Opinion: I think the Switch is halfway through becoming a PS Vita (in a good way)","Battery not talking charge","‘CASUAL ARMS’: ARMS Community Website (Themed Lobbies, Live Streams, Stage and Arm Randomizers, ARMS Quizes, and more!)","Free Mario + Rabbids with purchase of a Nintendo Switch Console at BestBuy.com","can't buy a Skyrim cartridge for Nintendo Switch","My switch suddenly write protected my sd card and now I can't play any of my downloaded games! Anyone know what to do?","Abstraction Games on how Ark: Survival Evolved is possible on Switch, not missing content, tech tidbits","Did a joy con battery test this week","[Fanart] Nintendo Switch Pro Controller Custom Skin Design","Thoughts on Little Dragons Cafe","Morphies law teasing us with \"whatever youre doing, make sure that you have plenty of energy for monday...🤔\"","Crash Bandicoot: N-Sane Trilogy Is A Must Own For All Nintendo Switch Owners.","If You Have the Joycon Moving/Drifting on it's own issue SEND IT IN TO NINTENDO","Morphies Law is atrocious","Captain Toad: Treasure Tracker $35 USD today","Dead Cells comes with a mini Art Book","[Discussion]A case for the revision rumor","(Super Smash Bros, Ultimate Concept) - Fighter No. 68: Yarn Yoshi","My Shantae Jammies Mode Fanart!","[Minor Rant] Switch doesn't allow the use of a mix of attached and detached joycons in local multiplayer, and I'm disappointed.","Finished some Dead Cells fanart. (Still waiting to get my hands on the physical version and play it T_T)","PSA for people, especially parents, who wish to buy A Hat in Time. There's an extreme jumpscare in the middle of game.","Switch won’t connect to WiFi","I bought \"Tennis World Tour\" and I feel like I got dupped/played thread","Splatoon 2 Fork vs. Spoon Splatfest starts 8/24 at 9 PM PT","Joy-Con Driver for Linux Kernel","Dixie Kong DOESN'T Have To Be an Echo.","MUSYNX advanced settings","What is up with the Dead Cell's lack of regional pricing?","Best ported games for Switch?","Spectrum, a colorful indie platformer in which I worked in, is coming to Nintendo Switch on August 20![Trailer]","Ever since I got a switch my playstation has been collecting dust. This happen to anyone else?","The next LABO Gun Kit: A gun, a bird and a camera?","SEGA Ages: Over 15 titles planned, including ones which have never been re-released","Questions about Blazblue Cross Tag battle on Switch and PC","Tinfoil Hat Time: Spyro Reignited Trilogy","MHGU Demo: Help with Solo Valstrax","The World Ends With You is $18 on mobile, $50 on Switch. Does the new content justify the price increase or is this another case of the \"Switch Tax\"?","A little Breath of the Wild fanart. (OC)","[Meijer / USA] 10% Off Total General Merchandise Purchase - Switch Console Included","Why all the hate for Pokémon let’s go Pikachu and Eevee?","Japanese packaging of Hori's GameCube-style Mario, Zelda, and Pikachu-themed controllers for Switch revealed","Gamescon announcements or a Direct?","So, what's your favorite weapon in Dead Cells?","For the past week, I've been challenging myself to draw one character from Smash Ultimate each day. With Week One out of the way, I thought I'd put them all in one image and see what you guys think :)","How to make Pokémon let's Go more challenging?","[US] Eshop Sales Discussion for the Week of 8/16/18","Stick Fight: The Game has been submitted for approval, playable at Gamescom","New Super Mario Bros U in Japanese software listings","Thought that I'd take a crack at what a New Super Mario Bros U Deluxe bundle would look like","Minecraft; world download from Realm on Switch; crosspost from MCPE","Can I use the same save for the physical version of a game if I bought the digital, even though it's from Japan?","Nintendo AUNZ has just released an interview by Hisashi Nogami about his thoughts on Octo Expansion and Yeah Nah's performance at E3 this year!","Nintendo of America on Twitter: Switch Online","Blossom Tales is 33% off on US eShop, now is $9.99","Flat Heroes (Switch) Review","/r/NintendoSwitch's Daily Question Thread (08/18/2018)","Victor Vran - Nintendo Switch 1 hour stream","News about FIFA 19 on Switch","I see your brilliant BoTW artwork, so I present my Simon Belmont art","This is going to be the *second* time Snake will be able to fight Rathalos.","Is Monster Hunter Generations Ultimate your first Monster Hunter?","Nintendo Switch Tour in Gijón, Spain","Shining Resonance Refrain - Review (after 100 hours)","Nintendo should revive the Nintendogs series for Switch.","Have those lag issues been patched in MMX Legacy Collection for Switch?","IGN play through of \"Breath of the Wild\" &amp; other games","Go Vacation in such a joy to play!","When an eShop title gets a physical release announced long after launch, do you double-dip?","The Switch, last remnant of multiplayer fun","Snake Pass is getting a limited physical release on Nintendo Switch","Diablo III Eternal Collection - Announcement Video - Nintendo Switch","Blizzard says Overwatch On Switch Is Feasible, But StarCraft 2 Isn't","Per Liam Robinson: New Super Mario Bros. U Coming to Nintendo Switch","A little Switch Stardew Valley fanart (OC)","I feel like playing with separate joycons is the most comfortable way i have ever gamed","Darks Souls Available Oct 19.","The Switch feels like such a cool, futuristic console, until I remember I still can't connect my wireless earbuds.","Dragon ball Xenoverse 2 - DLC question","Does anyone else wish atleast all the menus in games had touchscreen support ?","[Onion article] \"New Stardew Valley Expansion Allows Player To Shoot Self In Barn After Family Farm Bankrupted By Corporate Agribusiness\"","Doom Eternal is coming to Switch!","Panic Button will work on the switch port of Doom Eternal","Nintendo Switch Online will launch in the second half of September","The Smash Ultimate direct was a Masterclass. How can we let Nintendo know how amazing it was?","Alternatives after Zelda: Breath of the Wild","King K. Rool coming to Smash Ultimate","Decorated Labo Piano for Creative Contest","Smash Direct"]