["Tears and gasps after ex-officer gets a rare murder verdict for teen's death","Man gets beat up and arrested after making racist remarks and pushing 15yo on train track in Belgium","A man on a horse lassoed a guy that stole a bike from an old woman until police showed up","Teacher who raped boy, 11, jailed for 60 years with no chance of parole","Thug hacked to death with his own machete After failing to hold on to the weapon","Insurance scammer gets what’s coming","[Fight]15 year old boy retaliates after being thrown on train tracks by racist 35 year old man.","Man sentenced to death for murdering a gay couple in Florida","On the 63 year anniversary of Emmett Till’s murder a Texas police officer is convicted of murdering unarmed 15 year old Jordan Edwards.","5 robbers stopped from breaking into a Jewellery store by a 78-year-old grandma in Northampton.","Ex-Balch Springs police officer Roy Oliver guilty of murdering teenager Jordan Edwards","Ex-cop guilty of murder","Robber underestimates human","London thief caught red handed","Accessing scammers webcam &amp; make him call the cops","Neighbor Takes Down \"Firebug\" Who Torched Doormat","Asia Argento Axed From ‘X Factor Italy’","Man run over by own car while fleeing police","A porch thief gets 23 years sentence!","Baby abuser attacked in prison","Guy gets jumped, kicks his attackers' asses.","DA: Teen who stopped attack was taught to shoot by late dad","Woman sentenced to 15 years in prison for shooting a black college student.","What was THAT? Don't bully old men.","Dad who abused baby so badly he had legs amputated beaten by inmates in prison","Annoying girl gets exactly what she deserves","A guy robbing 3 people","Girl who falsely accused men of rape to save her relationship with boyfriend gets prison time","Kicking these dogs.","The Guy Who Tried to Bullfight a Wild Bison at a National Park Is Going to Jail","CHP officer tickets slow driver in fast lane","Waiting for the thieves","Dad Jumps Court Barriers To Punch Paedophile Who Abused His Daughters","thieves on motorcycle take out one of their own with a brick","Klansman gets 4 years in prison for firing toward black protester during Charlottesville rally","Man gets life for causing road collision deliberately","Still smug? Bank employee tipped off robbers who critically injure woman carrying 75k","The Time I Ruined the Life of an Online Troll","Vancouver bail bondsman sentenced to 15 years for breaking into wrong house holding occupants at gunpoint.","Bike thief gets more than he bargained for","and then his friend showed up.","Daniel Tate sentenced to life in prison without parole for murder of high school student","High speed chase ends when perp hits minivan and driver of minivan destroys him","UK cop attempts to bullshit his way into making a bullshit arrest, a legal expert sends him on his way...","Man dies by falling onto third rail moments after assaulting, robbing someone in Brooklyn","Man in court for trying to haunt his ex into getting back with him","Indiana Man Sentenced to 15 Years for Distributing Information on Explosives and Poisons for Use in a Terror Attack","Charlie LeDuff squats on a squatter. She gets arrested. Homeowner gets their home back.","Irate #angrymom catches pervert messing with her daughter chases him down","St. Louis puts video cameras at sites where illegal trash dumping rampant, fines and community service follows","Prenda's Fraud: Copyright Trolls going to JAIL","Package stealing thief got caught and her ankle got crushed by a car.","Doing donuts on the bay bridge, CA","Guy gets repeatedly Tazed After Punching Cop","Classy folks decide drinking/smoking/littering on someone else's porch is ok? Cop says no","Prenda lawyer pleads guilty to porn troll charge: plea deal (linked) suggests 12-15 years is likely","Uber Driver has had enough and enacts justice","White supremacists that crash black child's birthday with threats sentenced to jail","Defendant calls black judge the N-word. Judge gives swift punishment","Kevin Spacey’s new movie movie grossed $126 opening weekend","Lawyer who aided Martin Shrekli sentenced to 18 months in prison after asking for probation.","Fort Lauderdale airport shooter given 5 life sentences plus 120 years","A different type of justice served. Someone hacked the scam phone number that's been calling my wife and changed the message.","Muslim couple denied Swiss citizenship over no handshake","#GraetJustice for showing off in your Car .. while NOT in your car (La Chona kiki 'Challenge')","It's all fun and games until someone draws a gun on you.","Teen charged for pushing friend off 60-foot bridge","Not in courtroom 502","What a turn of events","They shot guns out of the car window while driving and then posted it on social media.. What in the world were they thinking? Absolute idiots.","He was told to stay down but chose not to listen...","Man sentenced for trying to blow up Confederate statue in Hermann Park","Student who falsely accuses 2 men of raping her is put behind bars","North Carolina kids fatally shoot man abusing their mother, police say","Jordanian immigrant receives death penalty for Houston \"honor killings\"","Cop pulls Over car that cuts off a motorcycle rider","outsmarted by trash cans","Australian man hits back at lazy dog owners","why you shouldn't break check a truck","Sydney drug addict jailed for trying to break into jail to deliver drugs","Girl smacks bartender's butt and gets immediate service","Woman sentenced to 25 years in prison for stealing $7 million from a nonprofit helping people with disabilities","Police confronts man three times in 3 days at his own pool - Manager Now On Leave","Judge adds 25 years to life term for man who stabbed ex-wife 47 times in front of daughter","Man on bus is shot after going for female cops gun","Two Kansas City Men Sentenced to Life for Kidnapping, Murder","Three paedophiles shot then hanged from crane in Yemen after raping and killing 10-year-old boy","Woman goes flying after being caught stealing fuel from a petrol station","Keep threatening me with a knife? Brick to the head.","Jordanian immigrant sentenced to death for Houston, Texas \"honor killings\"","Bouncer Absolutely Overwhelms gun wielding Punk","Entitled, racist teenager gets taken down and arrested for resisting arrest. 30 days in jail","Jeans Thief","It's been seven years since Casey Heynes suplexed his bully. It's still awesome.","Home invader takes shotgun blast to the balls (Arizona)","Man exposes a moped thief/ gang in Wolverhampton (UK): calls out the mother for bad parenting","Thief steals a bait bike.","Fearless Mercedes-Benz Driver Thwarts Scumbag Carjackers","Man attempting an acid attack gets served","2 women who murdered a young girl fall to the ground and begin to squeal after they receive life in prison"]