["30-Day Challenge #8: Cook more often! (August, 2018)","Weekday Help Thread for the week of August 27, 2018","Why You Might Consider A Trade Over College (One Real-World Perspective)","The Chart of Shame - Why Nobody Can Time the Market","Dave Ramsey dead wrong on education costs...","[UPDATE] Mental Health Is Deteriorating To A Point Where I Can't Hold a Job","Parents took $25,000 from their IRA to pay a $15,000 medical bill that they shouldn't have.","IRS will allow employers to match their employees' student loan repayments","Former job Supervisor charged me for item they assume I lost. Any options on my end?","I'm 22 years old and in a position where I am supporting my younger siblings in addition to my parents. I feel like I can't move forward.","36k in savings, but no investments/401k. What's my next move?","Should I use credit card for everyday purchases?","Large inheritance, estate property purchase, and budget data tables.","Renting Until Retirement?","I have undiagnosed ADD/ADHD but don't have the insurance to afford diagnosis/care","HVAC replacement needed for a first time home buyer","If all I want is to open a Roth IRA and put everything in Target date funds, who should I go with?","I need help with my mother's inevitable passing","24 y.o. College graduate in need of loan advice.","How Does My Budget Look - Advice","Opening a Roth IRA - considering various firms and looking for some advice. Do I go with Charles Schwab for their lack of minimum investments in mutual/index funds?","TSP vs Regular 401k Plan","I'm scared i wont make ends meet here soon. I need advice.","Invest and do IBR or repay student loans","Thinking about moving out and want to know what to do.","I sold some art! And, it hit my taxes hard. Is there a better way to do this?","Just moved to California. Please help with my budget, investments, and savings allocations. What should I do with my previous employer's 401(k) now that my new employer does not offer any benefits? Thank you in advance.","Keep saving or begin investing?","Ally bank withdrawal","27 Planning for the future","French immigrants to USA","Just quit, employer owes me vacation pay. How to receive payout...","Sale of gold coins","Part time jobs from home? Or any that don't require customer service?","Should I choose a cash prize or physical items?","Need access to inheritance being held.","Mortgage down payment or pay off car?","Finances and new Job offer, should I change jobs?","New income, what to do?!","401k 2 year vesting period","(US) Am I getting ripped off in Life Insurance?","Should I open up a second credit card to build credit?","About to begin new job, should I save or pay down student debt?","Can my employer contribute an additional amount to my 401k if I'm already contributing the $18.5k limit?","Just paid off my credit card","Help a Medical Resident looking to secure his future","Mortgage question: Negative points or Positive points?","While clearing inherited estate, found a file with all of families social security numbers.","Thinking about transitioning into a sales career, can I make a good living doing this?","Equipment/Vehicle Loan Advice","How should I spend $800?","Mortgage Loan","Should I buy a second investment property or use that money to pay down my current mortgage?","Help me understand the drawbacks of contributing to Roth accounts even at very high income levels","National Debt Relief advice","Will opening an Ally CD show up on my credit report?","[auto]What to know about financing a used car for the first time, and how to go about auto loans in general?","I have to move out ASAP.","Save for education or retirement?","Crippling debt and unable to refinance...","Starting University Is Yolt any good?","How can I negotiate this salary and should I?","Hi PF! :) I'm 30 earning $110,000/year. Posting to figure out a plan and how to best invest $50,000 cash.","Signed a Lease Renewal, just got email saying there was a mistake and the owner wanted to charge more. Can they do that?","I just turned 26 and can’t be covered under my parents’ health insurance anymore. What should I do?","Savings plan sense check","24 year old wanting to build credit and prepare for the Future","When to check in on promotion/raise request?","GF's mom allowed a utility bill in my GF's name to go to collections...does she have any options?","17 y/o investing tips","Need a concrete way to save money","Switching Jobs and need to figure out retirement account situation","Unsure if Renting or buying is a better option","If I’m a contractor and then I get hired full time, will I have two W2s?","Help. I bought a home with my parents and I need to sell it but they want to keep it. I need options.","Question on taxes when living and working in different states.","Moving home, rent free, for 15 months. What is the smartest way to pay off my CC debt?","Move out or commute","Moving(apartment),Bad credit,no rental history, and more.. unfortunately. Should i get a realtor? (Warning..Long)","Balance transfer check lost twice by USPS and UPS","I have ~10k in credit card debt and 29k in student loans. I graduate in December and will more than likely have a job making atleast 50k. Should I get more student loans to pay down credit cards?","Is Refinancing My Auto Loan Worth It?","Attempting to refinance car what happens if i get accepted/denied","Local community college deposited money into my account","What kind of plan should I put in place to pay off my 187k mortgage?","Question for anyone whos ever worked in a bank or financial institution.. did they check your 'credit score' before hiring you?","Consolidating all my debt a good option?","Debt collection agency is contacting me but don't show up on my credit report","Moving out for the first time - Need advice","How to proceed with adding a child onto insurance plan (US)","First Potential Contract IT Job Hourly Rate Advice Appreciated","Having trouble finding consistent info on SALT deduction and HELOC deduction","Best program for shared input/review of finances?","Can i use my creditcard to take out money, only to pay it back for a single day and then take it out again without getting charged extra?","Help!! 20yo no credit score, need a car","Submitting quarterly taxes on first assignment as an independent contractor","Old apartment building wants me to pay for their new carpet.","I have finally been approved by my work to set up a home office- with the caveat that i pay for phone/internet. Is this something I can claim on my taxes?","UBS-keep going or quit?","FAFSA Step-Parent issue","Should I close credit card I only used once?","Request credit limit increase on present card or apply for a new one?","Hackers likely have my tax return and SSN.... what should I do?","401k Plan Sponsor for small business looking for advice.","Index fund vs Target date Fund","Is this a scam or legitimate medical debt? How do I find out for sure?","Hospital Anesthesiology Bill sent to collections","Pay off tuition as i go or invest?","Buyer's remorse on vehicle","Charles Schwab 401k managed through Morningstar. Can I trust it?","How should I go about getting the cheapest vehicle I can that is in good enough shape to drive cross-country?","Getting good with money before starting a PhD","What's the best plan for engagement, house, wedding, kids etc?","Company is doing well, questions on how to evaluate a financial adviser and discretionary spending (US)","W-4 with 3 jobs","Negotiating a salary for working remotely?","401(k) vs Brokerage?","Live with family, 1 bedroom or 2 bedroom apartment?","How to report imputed income and claim domestic partner as a tax dependent?","Recently separated from my wife. I have a fair (150k) inheritance coming in next month. She knows and we have verbally agreed to a non contested divorce. Two kids that we’ve agreed for joint custody, and I’ve promised to pay her credit card debt. Have I prepared enough?","[debt] working 2 jobs and taking 2 classes a week, should I pay as I go and graduate debt free but late or go to school full time and graduate early with thousands of dollars in debt?","Premier Savings + HSA vs PPO Choice Plans and adding my (future) wife","How strict is your budget? How much do you aim to save per month?","Private company is giving me shares (units). They wont tell me how many shares exist or FMV. They've advised to put $0 on 83(b). This normal?","Question around short term vs long term capital gains for stock given by employer","New job situation","Salary grades?","Personal finance apps that take Venmo into account?","S.O received summons from collections agency","Did Verizon swindle me?","How to push my credit to the next level?","Too rich for grants, too poor to pay for college out of pocket.","Taxes on foreign investments?","What would happen if you took out a loan and put that money into a retirement account?","Is a 529 college savings plan useful for grad school?","Don’t Understand Drop In Credit Score","If I have 12 months worth of expenses in my savings account, should I increase my 401k contribution?","Just bought a used car that I probably shouldn't have purchased, what now?","Recovered from health issue, had no income at the time. Going back to work now, how to I pay this down quickly?","Question about first time leasing a car","Exercising (un)vested Options","Should I put my Savings in an Ally High Yield CD?","24 yr old taking out first student loan, need advice","Best way to force yourself into saving up for something you want?","Saving over 15% for retirement, what now?","What is the best way to pay off credit card debt?","(US) planning to get a van and travel the country for a year or two, I own my house and want to understand all the options","I was a stupid 19 year old who stopped paying car insurance a while back and I need help.","Denied Financial Aid after taking our loan starting classes","Should I max out my 401(k)?","Help with budgeting apps","As a college student looking to make trades/interested in Investing, which is better for me: RH or TD Ameritrade?","IRA withdrawal for education expenses already paid by credit card","Help with my family","Debt problems - should I tap into my retirement accounts?","Question On Consolidating Debt","How can I budget, start a side hustle, and survive with what I have?","You should be aware that in many states in the US, a guest stops being a guest, and becomes a tenant as soon as money changes hands","In a bind with healthcare...","200k in student loans and 67 in credit cards.. now what?","If you take the PSAT in high school, you could get a full scholarship","Where to find help making a budget &amp; paying off debt!","Should i be worried about my future","Balance Transfers Worth It?","If I have $300k on my Mortgage and I suddenly came into $300k, is it smarter to pay off big chunks of the Mortgage or something more like doubling my monthly payment to pay it off faster?","Property Letting - Tax Advice","Is TSP or an index portfolio a better option in my situation?","Increase savings/cut debt payments in short-term to decrease credit dependence in long-term?","Recent med school grad and want to get a credit card","Negotiating on paying debts?","Rent cheap / low QOL or Buy expensive in a very good market?","Need to get my first major credit card at 28 years old. Doing it for the travel perks etc. Where do I start looking and what card has the best perks?","Is it a good time to ask for a promotion?","Bumped up 401K %","Going to school (undergraduate and graduate) and surviving on loans (US)","Feeling like I am drowning.","Cant quite afford my car payments, and the clutch needs to be replaced. Is it a bad idea to buy a cheap car until I get my funds in order?","23 year old no credit wanting reliable car...","Capital One ATM Miscounted/ate my money, a month late Bank claims there were no overages, what can I do?","Vanguard employees don't have access to S&amp;P 500 funds in their 401k plan anymore","How can i stop spending so much?","Emergency Fund vs Car loan","I want to further my education by going to grad school (USA). What are some options to help pay for it apart from taking out loans?","No or low documentation HELOC?","Hurricane Harvey put me under. How do I stay on track?","Should I start accounting for​ my private expenses","(US/CAN) How Do I Get A Private Student Loan Without A Co-Signer?","I have 1K in savings right now, what's the best way to use it in my situation?","Question about 1099 form","Options for adding to TSP, AFTER military retirement","Is it possible to \"refinance\" a private student loan with 7% interest to a lower interest rate? How?","My Dad's Life Insurance payment went up about 70% last year.","ISO HELOC 50% DTI W-2 income verification","Where to open a new checking account? (and maybe savings)","How do you handle taxes as a freelancer when splitting your time between different countries?","Any software ideas to track all types off accts.","California Franchise Tax Board froze my S/O's bank account, please help","Buying a house with a large downpayment","Should I file Bankruptcy?","Is my rent going to be too high for my income? (NYC Metro)","What to do with ~200k inheritance","How mush of an impact does paying off a car have on credit?","Help me make sure I’m not missing any information for meeting with financial planner","I'm interested in a Self Directed IRA Custodian for Real Estate - Where do I start?","Found out that I (22)have a Mutual Fund with $26k in it. What should I do with it? Any suggestions?","I door dash as a side hustle but I'm getting nervous about taxes. Is it worth it?","Using PayPal to get credit card rewards","What Tax-Advantaged Savings Plans are Available Out There (Pre-Retirement)?","Ally Bank No Penalty CD Question","Major home improvement project required; Looking to get a 0% loan from Greensky or similar.","Is a brand new car still one of the worst investments you can make when you commute 100 miles a day?","Student Loan Refinancing Rate Shopping","Long road of credit restoration","Parents want to finance a car under my name","Selling car privately. How to deal with multiple buyers?","Spectrum cable cut my cord","Buy a used for with USAA?","I have a quick question about a early withdrawal from an IRA","Should i sell my car and take a loss?","Do I pay taxes on RSU's when they vest or when I sell them?","Maxing out tax-deferred accounts is scary","Clarification on Workers Comp","Should I raise my rates?","Tips/Advice on working with Negative Equity on car loan?","Lump Sum DROP vs. Pension percentage","Capital One Venture Purchase Eraser Question","403b or IRA - which to max first","My anti-depressant recently got switched by my doc and it is sitting at my pharmacy. I need to pay the $15 copay but have no money until next week. Any ideas on how to quickly get small amounts of money between paychecks?","Gift from mother who is on Medicare","Surety Bond Required for Special Liquor License in MI. Where to start?","How do you handle charitable donations? Do you make small donations while tackling larger financial goals? Or do you hold off until you're in a really strong financial position?","Urgent! SSN AND DOB","Landlord wants carpets professionally cleaned","Parents decided to buy a house immediately which resulted to my girlfriend being stuck in financial duty. Need financial advice","Credit card rewards","Investing income tax instead of withholding","How do you get good refinancing rate for mortgage?","Question on Travel Credit Cards","Personal expense report question","Pay off debt or save for real estate investing?","Should I freeze my 401k contribution to save for wedding and first-time home purchase?","Removing Debt Collection From Credit Report","Mega Backdoor Roth IRA With Existing Traditional IRA?","Buying our next house, sound financial move?","Do you think there's such thing as too big an emergency fund?","Investment Allocations in my 20's after a Raise.","Drowning in student loan debt, tried forgiveness plan but not sustainable","401k plan is through MassMutual. Their Target Date Asset Allocation (MM Sel T. Rowe Price Ret 2050) is recommend but is vastly out performed?","Beware of Comenity credit cards","ETF vs Index Fund, Long Term","Gifted Junk Car. Disposal Question","I bought a brand new car and my budget didn't collapse or send me into a downward spiral of financial chaos. Maybe a new car is okay for some people.","Please help me restart savings that got broken","Should I wait 4 years to qualify for VA home loan?","Looking to open a new checking account","Money tracking Android App","Victim of possible atm fraud at 19","What is the best way for us to invest our money?","401K Rate of Return Question","Using home equity from significant value increase to lower monthly payment.","Need help lowering my electric bill","Writing an iPad off as a college expense?","Balloon finance a car then immediately refinance?","22, recent grad &amp; moved to NYC.. $6,600 to spread for the future.","Taxes when I work abroad","What will my credit score return with no SSN/US history?","At what point does building your Credit Score result in diminishing returns?","Got an email bill. I dont have telus services. And bill has a different name. Should i be worried?","Just bought a house. Want to start an emergency account","What would be the best way to pay off loans while also getting a car?","Taking money into another country. Ways of transport/currency exchange.","What am I missing in this car purchase is this really such a great deal?","I want to start planning to help my parents. Where do I begin?","I am 19 and finally got a credit score/FICO, can I now apply for a loan/credit card?","Rent bill not showing up","College student looking to start buying stocks - robo advisor or actual financial advisor?","Paid toll tag, now they want proof","identity theft: Chase ultimate rewards stolen","Receiving Settlement (Car Accident)","Keeping money in reserve account?","Going to start paying on student loans soon. I read that after 30 years if your loans are not paid off, they are forgiven, but you pay tax on the amount forgiven. Can someone explain how that works?","Term life payout....","Kentucky vs Tennessee Taxes","How to handle collections","Where to start a Roth IRA","Chime - Early Payday","Roll over 401k to IRA or keep as is?","Have around $15k saved up thinking about quitting job and going to school fulltime","Will a hard credit pull affect my credit score if I have a credit freeze?","I made a cash deposit in a bank ATM machine. The machine froze up and the transaction was not completed. A claim was started at the bank and now they say the money will be debited from my account. What are my options to prove they are stealing my money essentially? Do I have any options?","So just wondering how do you other adults pay your bills with varying due dates?","What to do with money from 2nd job?","Credit score at 726-&gt;How can I continue to raise it?","Chase vs PNC","Getting a bonus from work","Have to Give Tax Info For FAFSA, but Parents don't file taxes because they live off SocSecDisability...?","Should I keep my truck?","Budget software for business travelers","Issues sticking to budget when I can just go make more money","Take a home equity to put down payment on building a new house? Is it safe to do so?","Credit card collections?","Etrade record retention period","New business, need advice on a credit card","Suffering now for a payoff later?","Debt grows and doesn't stop","My dad got fired twice in a month, I'm disabled and cannot do real work, we currently have no income.","Which loan to pay extra on?","Debt collectors calling for car I sold a year ago.","Canadian University goer, need advice","Filling in a position for an unknown period of time","19 y/o needs life changing financial advice.","How do I approach the insurance of a driver who hit me on my bike?","How should I save as an 18 year old uni student? (TFSA, RSP, RESP etc.)","First time moving out, am I on budget?","Near 100K in Student Loans. Thinking about Consolidating and Going back to School? Help Please!","Parents have debt with 15% APR - Putting more than employer match in 401k","About to invest in a small house as a rental. We would like to manage the property ourselves. Any advice on the best way to make this a successful investment?","Investing as an 18 year old - tips?","I signed a purchase agreement for a used car and I’m supposed to pick it up tomorrow. Can I refuse delivery and back out?","Getting an MBA right out of college","IRS sent me a notice of delinquency for a missed IRA withdrawal (US-NYS)","Paid for less than I worked.","Can my roommate and I really afford to move?","Vanguard vs Fidelity vs Schwab","What am I doing wrong? Drowning in hospital bill after wife had a C-Section.","ETF over target date fund for Roth IRA?","SSA authorization for Walmart CC","Wife is getting inheritance question about 529 and taxes","Very confused on credit card report?","Are Job Recruiters Worth It?","My parents bought me a house... What happens when we sell it?","Just got denied for a Car Loan because my Credit Score wasn't high enough. Now I am looking for a credit card to increase my score. What is the best Credit Card for my situation?","Planning for a year for traveling before college","BF is a full-time student with $4k in credit card debt. How should he approach this?","Mom buying life insurance, too good to be true?","18, no job, no college, mom broke, no clue what to do","Got into an accident, other party had no proof of insurance. We both have liability. Should I be covered by their insurance?","Best Way to Invest or Save 60K cash","I took out my Publix Stock","Anyone asked Discover for Goodwill Adjustment recently?","Should I apply for a credit card while seeking an apartment?","Currently 24 and trying to see if there is a benefit of getting life insurance vs Roth IRA and 401k","What should be my next move?","I wanted to start an IRA for my 51 year old mother. Should I do ROTH in this situation?","What to do about my godawful 2007 Jeep Compass and/or commute?","Would getting a new card for balance transfer and 0% APR for 12 months worth it?","Am I forgetting anything?","Help: need debt consolidation/restructuring advice","Late on payments. Want to get out of debt. Advice?","[Career advice] How to get out of retail with a bachelor’s degree?","Do you count your mortgage principal to your investment percentage?","Should we dip into emergency fund for new car purchase?","Not Sure If Accidental Overcontribution to Roth IRA","Just got a decent job need advice.","Is there a limit on FAFSA money? FAFSA for grad school?","New Job.. HDHP VS PPO","Where can I see my current student loans and/or begin to pay them off?","College Debt","Work isn't paying us for compulsory training","Wells Fargo stole $1,100 from me, Please Help","In need of financial guidance in new job","New Job: What to do with retirement from previous job","Trying to apply for food stamps, but parents income stops me.","Another paying down mortgage question...","15k debt and need advice. What do you suggest?","Student Loan Help?","Lemonade renters insurance?","25 years old looking for general advice on my current situation and what else i should do with my money.","Buying/Gifted Parent's Old Car","Question on car loan repayments,does it make financial sense to pay it off?","Is it possible for someone else to rent a house for me? Single mom, escaped abuse","Want to replace Old car. 1000 CC debt, 45k student loans. $30 in account, receive paycheck on Friday.","Is a 34% Mortgage Payment Out of Line?","I can’t get a loan for College and I don’t know what to do.","Broke single father fighting to keep son. Lost everything except roof over our heads.","Dollar Cost Averaging Strategy (CAN)","Should I ditch my health insurance for an employer plan?","Currently 17 and starting my first job. How to open a bank account for myself?","Buying a used car- What should I watch for or beware of?","Can I directly transfer stock ownership for property purchase? Tax implications?","I really want push notifications for every transaction, but my credit is too bad for a credit card. Ideas?","What Is The Best Electric Bicycle Under 500 USD For Urban Transportation &amp; Alternative Vehicle ?","Wife quit company, CoVantage terminated 401k, took fees and Fed. withholding. Must she roll it over?","Ongoing family crisis forcing me to cut back on every possible expense. How do I get out of or negotiate a \"legitimate debt\"?","AT&amp;T won't let me cancel my internet.","Car Rental Agency screwed me over","Would it be wise to move out now?","Taxes: marry 2018 or 2019?","Can an Employer contribute to a personal HSA?","Need help choosing investment options for my Fidelity","Medium-Term Investment Options","Is compounding interest possible on investing apps?","Graduating this December and looking for an attack plan to best prepare me to take on my loans going forward.","Best renters insurance for me and my SO in our first apartment","Seriously screwed up filing with turbotax. HELP!!!!!","How accessible is you emergency fund?","Getting Calls from Debt Collector Over Brother's Debt","$15K personal loan to consolidate debt?","23 Year Old Dutch/German living in US","Surprise! We're in collections and it's the first we're hearing there's a problem.","What do to about a credit card you don't use charging fee's?","What to do with my first $10,000","Book Recommendations","Can someone explain to me these arguments against Roths for most people?","Can we afford a $300k house on our budget?","So i bought a car with a salvage title now what","How do I go about asking for a raise at my current job?","Is there a significant difference between investment platforms (Vamguard, Fidelity, Schwab) for long term index investing?","Retirement Confusions","Types of bankcrupty in the US","Am I being scammed?","I have $10,000 worth of merchandise in my apartment, bills are past new, bank accounts are empty, I'm about to get evicted, and I can't sell my stash! What should I do?","Should I vote for my bank to reorganize into a mutual holding company?","Help With Old Swiss Debt.","Credit Score sank 120 points after mystery bill was sent to collections from 7+ years ago.","New Chase Online Investing Service: You Invest","Is switching from an ICE to EV a good idea, financially?","Finances for a Junior in College (US)","Unexpected $2500. What should I splurge on?","ELI5: How do taxes on dividends work if I'm selling them as options and rebuying right after?","Any Companies/Services that Help in Shopping for Car Insurance??","I work remotely. Spouse is deploying. Where should I move?","Student Loan Refinance Options","10K in Credit Card Debt, sort of feel like crap","An increase in responsibilities, but not an increase in wage","Living with no roommate with a 30k a year salary?","Does it ever make sense to consolidate and refi student loans?","Not able to decide to quit my job or stay","I Worked to raise my credit score to 720's, gave my mom access to credit card for an emergency, she spend $3000+. How badly will this hit me?","I flunked out of college and im already in the hole. Should I try to finish it out?","How Can I Hedge Against Being Paid in Stock?","Eliminate (most of) Emergency Fund to Pay Debt?","Call from Financial Crime Enforcement Network?","Need some good advice for getting out of my situation, but in a smart way. Loan options, etc.","Your financial investments should complement your human capital.","How to invest small amounts of money?","Tax prep service for alien non-resident in NYC","How can I find out when I'll incur interest on a credit card?","8 Hard Inquiries from Car Dealer in 1 Day","29yrs old - Only now investing in my 401k. Do these calculations seem right?","Anyone have any experience saving with NetSpend/Ace Elite or Brinks","Removing a serious delinquency on my credit report","Comparing new job offer to current position","Employer opted me into HSA even though i have other health insurance","In the market for a new CC","Credit Score Took a Massive Hit After Getting A Replacement Card","I did a super stupid thing and applied for a credit card before my home closed, what can I do now?","Best High-Interest Checking Account w/ No Minimum Purchases?","How to negotiate a public sector job?","I'm being paid internationally via Paypal, best way to get funds into my bank with minimal fees","Help; Bank; Which one?","Am I financially stable enough to buy a home?","Does anyone know of a way to pay mortgage and car loans with a credit card? Trying to accumulate FF miles more rapidly.","Voluntary Default on private loans?","New car after total loss?","Health Insurance Premiums as a Percentage of Income","(US) Mom addicted to QVC...Senior QVC Addiction?","Breaking unemployment streak and an out of state move.","Tax Consequences to Employee for EPP for Health Insurance Premiums?","how much savings should a 19 year old have?? (also saving tips)","HSA Requirements for Adult Dependents","Need a loan, no credit. What are my options?","Who do you talk to?","Considering Chase Slate; how should I split a 1k windfall between accounts to help my approval odds?","Bank account closed over $114","Tax Advantage Investment Options???","Beginner question about ETFs..","Currently make $14.50/hr at full time position, have opportunity to take $21/hr in a temporary (military/government related) full-time position. Do I take the temporary position?","I need help! How would i go about improving my credit score.","Pending collection under my name. Disputed, TransUnion approved and removed, then it came back. What can I do?","Can we afford a beach apartment?","23 Year old in dire need of financial/life advice and assistance","Best choice for will and living will","College Student with NO DEBT/LOANS. Should I invest my 10K or keep cash on hand.","Life Insurance Options","What's wrong with my credit? Why am I not getting approved for credit cards?","Any recommendations for down payment assistance that won't increase home loan interest rates? (Pima County, AZ)","How to invest your first 150$","How do I make my wedding cost as little as possible?","I need of advice ASAP! Overdrafted an account!","Question regarding being undercharged","Roboadvisor for 401(k) self-managed plans","401(K) with fees and no employer contribution - Best options","IRA options or HSA","My SO and I are planning to buy rental property together. We don’t want to get married for another few years, but are considering forming an LLC to do this formally and protect ourselves in the case of a breakup. What would be the difference in taxes and fees, and are there other financial pitfalls?","Need advice on 403b rollover, approximately 55k","Help me reduce our $2k/month food expenditures!","Thinking of making a career change from ESL teacher to pet sitter. Worth it or no?","How would you finance a 2nd masters if you had the cash balance? HELOC? Credit Card?","Would it be foolish to use excess student loans, as a means for covering rent?","Conflicted advice on how much to put down when financing my first car.","Should I use the money I earn to pay off a student loan I already have, or to avoid having to take out another in the future?","What's the reasonable life expectancy of my car?","Rejected for Credit Card for Balance Transfer","(26) Am I doing enough .. could I be doing more?","Student Loans or 401k - What Should I Prioritize?","Fixed vs Variable APR: Which will be beneficial for a loan amount of approx $17,000?","Quick budget question regarding categories:","Where to transfer my current investments through Principal?","25 year old friend has never done her taxes. She's going back to school and needs tax documents. Where to start?","Why is my credit score so low?","Banking at a credit union that's owned by your employer -- good idea or bad idea?","Need advice on car decisions","Non-Chase ATM Fee?","Wife's friend in Nursing School was just left by her husband that she and her children were dependent on.","Not planning on staying in my current home forever. Good idea to pay extra towards low interest mortgage?","Capital gains and state income tax","401k or other option?","Should I cash an upcoming $8k check here or in my home tax country?","(US) Okay ... buying a new car is never an \"investment\", but, after gas savings, federal, state, and local rebates ... it's kind of silly not to buy an electric car if I can afford it, right?","Are we ready to buy a house? (22 &amp; 24 Nashville, TN)","5 months into new job and boss is working to get me a raise from his superiors. Need advice!","Don't like sitting still, what should I do?","Just inherited 5 acres of land out in the country","Getting married and need advice","If you recently did a credit card balance transfer promotion, what was your experience?","American Student Loans in Canada","I don't think my student loan servicing company is properly applying principal payments","My credit card got sold from one bank to another. Will this conversion affect my credit?","What would you do with $50k to invest","What should I do with my 401ks?","I want to open an IRA, but I don't know what I am doing","Where to live (lower 48)","Needing advice for paying off debt","I scratched a rental car that my mechanic paid for.","Recently received 15k in gifts and don’t know what to do with it","[Scotland, UK] Benefits to help with private rent on a house","Car Insurance Companies Driving History (US)","Tracking Household expenses with second bank account","Missing wallet with several important documents inside of it, what do I do now?","Is an online savings account the best place for your emergency fund?","Prove me wrong! Leasing a Car is better than Purchasing","My credit history showing up as my dads credit history.","Avoiding a wash sale?","Rate my 401k investment plan please","School Debt Situation--Insight?","Advice on how to go about paying car debt.","How to handle stipend money?","High EPS and investing","$910K in debt, looking to leave it all behind in 4 years. Need Help/Advice.","Refining strategy for upcoming promotion. Tips? Advice?","A trash digger may have possession of personal financial documents and my old laptop. I've already changed my bank password. What else can I do to protect myself?","Where to save for college if my child wants to go to school in Europe?","ADP 401k contribution suggestions please","Have $50,000 HELOC from a divorce and $65,000 in Whole Life policy ... should I cash out and pay off the HELOC?","Are Supplemental Insurances worth it?","Tips for diy home remodeling project","Home equity loan/line of credit","Long Shot - Is there any way to get money back from dumb bank fees?","My finance is turning 27 exactly 1 month prior to our wedding. What are the best options for short term health insurance to fill the gap before she joins my employers plan?","Already established financially... what should I do going forward?","Company only pays for books...","Best retirement investment vehicle for future medical withdrawals","FAFSA filed improperly, don't know how I'll stay in college.","Doordash Scam","Quit my job, need to pull out my entire 401k that I had saved. Few questions first.","[Employment] Am 17, can I negotiate my wage for my FIRST part time job?","Just now getting into the basics of 401k. Is this a good match?","Non governmental 457 with special circumstances.","Tracking down bank accounts as next of kin","Is Credit Alert worth it?","Taking out a loan to pay debts","Signed up for dental insurance I didn't apply for.","Do I take lower pay or risk unemployment for higher pay?","How can I get rid of a $20,000 hospital bill?","Voluntary vs involuntary termination and other benefits","Selling a Motorcycle in an Unconventional Way","Opinion on Contractor jobs","Are Social Security and Medicare Taxes considered \"withheld\"? Re: IRS W4 Calculator","Opening a brokerage account.. realistically, what kind of returns am I looking at?","Taking over an existing small home business. What are some good resources preferably for the St Louis Missouri area.","I need to to get about S./5000 from a Peruvian bank account to a New Zealand account but don't want to pay an arm and a leg","Paying down student loan principal during grace period – change monthly payment?","Wells Fargo Sending Interest Rate Reduction Notices for Closed Accounts","[Planning] I am currently 17 years old living with my abusive parents and I'm not sure how to escape the situation and start my life","Buying a car before a house","Can I contribute the full $18,500 to a 401k when I was only employed by the company for part of the year and only had access to the 401k for part of the year?","Group of 5, traveled to Mexico but missed our return flight due to bus delays. We were late to check-in and the airline told us we had entirely lost the value of our tickets. It cost $360 a person just to fly back the next day. Is there any way to recoup these losses, or are we just out of luck?","What are some of the biggest drawbacks of USDA loans?","Husband quit job to go back to school; I am now sole earner. Should I change my W-2? I'm in CA","Going back to get my masters, need help with a plan to afford to do so","Car insurance company saying i owe £331","Open a Roth IRA or max 401k?","$3000 to pay off debt...WWYD?","Convincing parents to let me take students' loan (HU)","Which English certificate to kick-start my teaching and transcription career?","Getting ready to close on my first home in 2 months! Excited but nervous! Any additional advise?","Thinking about getting second job","401K vs Roth, if you were only able to contribute 5k per year to retirement, which is your best option?","I've become indebted and I can't get up!","A few months ago I requested a credit score report absentmindedly, knowing that I had no credit history and the report would turn up nothing. Now Chase is declining my application for a student checking account due to info on my Experian report. What do I do?","Cash Out Refinance, Smart?","Advice on building credit and a few questions?","Should I expect a raise in addition to a cost of living adjustment if I was offered a promotion?","Short Term COBRA to Avoid Gap in Coverage?","Retirement - IRA rollover with no employer option?","Hearing conflicting information about paying off debt, and could use some insight.","Tried withdrawing $80 and the ATM gave me $160. What should I do?","529 Plan vs. alternatives","Pay off wife's loans or keep money for down payment on house?","Loan Priority Payment Question","Trying to get my employer to match 401k contribution","Real estate compared to stocks: some info about Southern California","Is it possible to negotiate the buyout price of a leased vehicle?","Transitioning to a new job, am I covered by COBRA even if I'm not paying for it right away?","ABC Financial Scam?","Wells Fargo credit card compromised and wondering if it’s worth re-opening account","VTSAX / VTIAX vs. VFFVX?","Interviewed for a salary position... It's been 6 weeks.","Order of importance","If I pay a credit card bill, would the amount immediately be credited back into my account for use?","35y/o, working under-table &amp; no savings, license revoked due to $1k in unpaid tickets. Are there any 'hardship' ways of getting back on the road?","Recently left job and not sure what's next: general advice?","I make $13,400 a year.","Got my Credit card info stolen and they stole 1000$.","My mother is $15k-$20k in credit card debt. She won't allow me to give her money to help pay off this debt.","I received advice to only put into my 401K what my employer will match, and put the rest in stocks. Is this good advice? (unsure if correct sub)","Choosing the right Roth IRA","I've been verbally offered a job and am waiting for official paperwork. How do I/can I negotiate relocation assistance?","Moving out for the first time, good or bad choice?","Planning to help fiance pay off 70k in student loans. Advice requested","AMEX FICO vs what the bank pulled","Auto loan","Is investing in stock for a start up community bank a good idea?","Out of CC debt, but feeling discouraged about retirement.","Unused leased miles - help!","Set me straight! To buy or not to buy a house?","I’m looking to find my high-yield checking account options.","Former employer had a pension plan nobody knew about - what to do now?","Will be starting a new job that allows me to work from home and requires me to travel to work in other states. Looking for tips and suggestions (taxes, expense reports etc)","Fiancé just got a loan from Amex, need help planning!","Tax Allowance/W-4 Help","Am I doing ok? Budget advice","Former employer is giving me a one time opportunity to cash pension. Take or no?","Pre-tax Tuition vs. Child Care Tax Credit","Should I take a loan that requires me to close cards?","QUESTION - Moving company 401k after quitting","Looking at taking out a home equity line of credit to do work on my house","Advice:Should I take a more stable union job and give up being the boss at another union job","401k vs 2nd property","Student loan repayment advice","Crypto Rich -- HALP","Dentist bill","Dealership agreed to finance $6905 on a certified, pre-owned car, but...","30 years old, low expenses, What's the best way to use my money?","Credit card advice needed! Trying to raise my score (responsibly!). All help appreciated!","Very high amounts of salary that can be saved for the remainder of the year","Weekly \"which car should I buy?\" thread","Am I doing enough for retirement?","Scammers are getting smarter","Worth investing in my 401k at 18, even if I'm only saving 3%?","Does the Vanguard '500 Index fund' offer better gains than my '2050 Target Fund'? VFFVX vs. VFINX","Out almost $2,000 on a car I didn't want and gave back.","Visa gift cards","buying a house or renting, with student loans?","Sinking really fast and need some help how to get out this hole","Credit scores?","Pay off student loans as aggressive as possible or go less aggressive?","My grandma needs me to take out a $20,000 loan for her so she can move","Should I save for a car or try and tackle my student loans?","Roth IRA emergency fund draw and repay","Need emergency advice on home loan!! (Kansas)","26 Years Old, Mom just passed away and around $90,000 ish Life Insurance Payout now to me. I have steady job, few debts...Where is best to allocate these funds and current $$$? Thanks!","Starting A New Life With $5k","Help to Buy or Lifetime ISA for buying house (UK)?","Looking to move out soon, need budget critique please. Unsure what to do with leftover money.","Need advice about gold coins please!","Traditional and Roth 401k - Same account?","Critique My Budget","New job offers $20/hr, but I currently make $13/hr. What can I realistically expect to be paid based on my experience?","Booking a rental car oversees with a chase sapphire reserve - anyone have experience?","Changing up my retirement plan","Airline rewards programs","What can I do to prepare for retirement?","(Australia) Debt settled with financial institution, but debt collection proceeded anyway","What ducks to align for a future big move as a current 18 y/o","Tax rate on Grants and Scholarships used solely for living expenses?","About 11K debt I want to fix. What’s my best option for a personal loan?","I was just divorced and given full custody of my 4 children. My ex wife passed away yesterday. What do I do next?","Payday Loans / Quick loans?","CreditKarma shows a hard credit check status as open but it’s been closed for years now.","My home has fallen 25%+ in value but I now have the cash to pay it off - Should I?","[Update] Pet insurance may be saving me...","Someone good at math help me?","Cancelling credit cards due to churning. If I cancel 3 cards and sign up for 3 new ones, does that cancel out?","Just started working at 16. Have $4000 saved. What should I do?","Bank charged NSF fee but also withdrew funds. Did the check bounce??","I’m in search of an auto loan for a used car, but I keep getting turned down. My budget puts me in the pool of cars that are over 10 years old, and over 75,000 miles. I’m having trouble finding a bank/credit union that will work with me. Any advice for a first time borrower?","How do I count the number of allowances for a married couple?","Opportunity Cost and Private Loans","Trying to choose a health plan: lower deductible or start a HSA?","Terrible at money and life apparently, how can I fix this broken situation?","Dug myself out of a hole, What next?","Retirement Calculator/ Tracker (Am I on track?)","I fell for a possible student loan scam. Any advice?","Cost of dental work is $20,971 without insurance. How can I lower this?","Loan/School Help","Stay in high cost area or use windfall to transfer to a low cost area?","What should I pay off first so I can start building my savings","Considering joining the military to help pay down debt","My ex-partner manipulated me into a vehicle purchase. They paid half of what we put into it. It's in my name. There's no paper trail or legal documentation.","The nuances of car purchase negotiation","Seasonal Employee trying to find the best way to allocate my money","Are debt consolidation loans always a bad deal?","Should I take out private loans or spill out my savings to pay out of pocket college tuition?","[CA - Bay Area] Mid 20s, $72k windfall, don't want to put it towards student loans","Optometrist charged me for an optomap retinal scan. Was he right to do this?","I have a 99% payment history on my credit report. The 2 late payments (30 days) that are about 1 year old now. I have 198 payments out of 200 payments made on time...how much impact do those have?","Large surgery, out of network. What steps to take?","401k question","Sketchy Sale or No?","Got a medical bill for a doctor I didn't see.","Managing \"good\" debt / investment balance for an early retirement. Need advice.","Subway taking time to pay me","I want to set up a savings account for my young nephew in my name so his financially illiterate parents can't touch it. What are the best long-term savings account options? Details in text box.","Navigating using student loans toward credit debt","31 and Married - $40k Gross / $30k Net - Zero debt - No rent - Need advice on my next step","Tax question: Working out of state from residency.","COBRA event after 2 weeks notice to employer","Salary Negotiation Advice","What to offer on this home?","Mom is in a psychiatric care facility on a 302, what can I do?","457b vs 401k: What should I prioritize?","How much umbrella coverage?","Optum bank will start charging a monthly maintenance fee on my husband's HSA. What are my options?","Need in law advice","Will depositing large reimbursement hand written checks raise any issues?","Housing Purchase Model","YNAB review and Membership giveaway","Friends parents took out a utility under friends SSN and name. Now it's in collections. Options? [US]","How to handle a capped 401k","Looking for investment advice with $5-10k.","Best way to build up my credit for buying a house?","GI Bill vs 529 to save for college?","Refinance auto loan with 7 months left?","What kind of conversations do I need to have with my girlfriend before moving in together?","Retirement rule of thumb- moving target","Gym refuses to take payment unless it's straight out of a checking account?","Cash out of Bay Area home or hang in?","20 y/o Looking to Begin Investing","I just got offered a job after my current employees put me through a dogging and crane course, will they expect compensation? (Australia)","What happens if I contribute to a Roth IRA and then go over the income limits?","Company Messed Up Refund, Now I Have Overdraft Fees — Do They Owe Me Anything?","Best options for supplemental work/income and car buying advice.","Want a more expensive house than I can afford, but no matter what don't want to be \"house poor\" - is my strategy to save for a larger down payment reasonable, or are there smarter strategies?","Think I was fired without being informed.","Advice on Leaving Edward Jones &amp; Kid’s College Funds","First credit card","Anyone used RefiJet?","GF is 20 y/o JR in college on a full ride athletic scholarship. Hasn't ever filed any tax returns. What/how does she need to do?","is wealthfront good","Sell a car with upside down loan?","Hope this doesn’t get dinged, I was hoping for some insight into vehicle registration and selling a car.","How to split a house fairly","What is the best way to invest ~$2,000","Budgeting Categories Questions? Help plz :)","Is it worth it to try to pay down your student loans or pay the minimum for 30-ish years?","Personal income tax withholding (CA FTB), family business debacle that I got stuck with, no clue what to do at this point...","Student loan payment","Recent promotion, where to invest new income","Will a missed credit card payment ever disappear?","How to apply 50/20/30 rule","How the heck do I afford all of my medical bills?!","Auto loan - credit building opportunity or unnecessary?","How to figure out house purchase power when I will be renting out a house that I recently bought.","An odd question about myself and my financial troubles","Half year salary - anything I need to know tax-wise?","No credit, but in great financial shape; trying to find a rewards card that will approve me","When do I have to start thinking about tax season in order to not be subject to backup withholding?","Loan/Help","The PMI penalty: worth it to ditch paying rent or avoid it at all costs?","Using a $4000 credit transfer or keep grinding it out?","Feedback on my 2019 Financial Plan","Got reduced hours and my expenses almost exceed my income, what can I do?","Part Time Job Negotiations","Buying my first home","I've never invested. I have roughly 30 grand in a checking account. Is it safe (and a good idea) for me to put ~2/3 into Vanguard and keep the rest in checking account?","Should i transfer balance","Disappointed in job renewal contract that was offered. Do I stay? or go?","How to actually trade ETFs","Leaving Military; Want to Separate Debt Free","20yo, first job, what's next?","First Home - Paying for Repairs","Advice on buying a Duplex with my Mom?","In case of an accident if you are the responsible does the insurance company have the right to ask you for a payment commitment? Are you obligated to do so?","Will US apartment complexes accept printout of Canadian credit score?","Married Roth IRA Help","CD as collateral?","I need a new car but I have horrible credit.","It never hurts to ask for fees/penalties/etc to be waived!","Am I required to have a job after receiving a private student loan?","Chime took my direct deposit and won't help me","Salary wasn't \"flexible\" &amp; found out coworkers at same level make more -- now what?","Unemployed, made too much, and need health care. What are my options?","Contribute to IRA in one go, or spread out over the year?","10% Off on 10 Dresses I will return","Help with an old credit card account","Can I form an LLC/business to get “employer” health care outside open enrollment","Graduated college, new job, debt and savings. What to do?","Keeping the family home","Can a Coverdale be rolled over to another tax free account such as an IRA? Can you transfer from one bank to another?","Can I REALLY afford a $10k car?","Am I eligible for loan forgiveness for my school closing?","Seeking advice on getting rid of a charge off in anticipation of buying a house in a year or two.","Looking to get some feedback on our budget.","Delayed workers comp submission","Buying Property from Grandparents","Auto Loan advice","Can anyone here give advice to a first time home buyer? I'll include as many details as possible","I’m 20 and want to get my credit started what’s the best way of going about it","Student loan sold and new company reports it as collections","30 years old, no outstanding high interest debt, established a ROTH IRA and investment portfolio this year, small emergency fund established. What next? Any taxes I can save by investing in myself or establishing a LLC?","Which cards will help me maximize my cashback/rewards? Xpost in R/creditcards","Possible investment strategies to grow my near-future house down payment?","Withdrawal Roth IRA to pay high interest student loan?","Bogus collections question","Now able to save £1000 a month after covering all other expenses, what should I do?","Selecting Funds for 401K","Investing for retirement with money already made","An aunt passed away, a while ago my mother shared that since she has no children, I’m one of the beneficiaries. What do I expect if I am?","Checking account, chase, huntington? I am the worst PFer you could imagine in terms of credit and such. Ally for savings","Desperate for Debt Solutions to my Financial Problems *PLEASE PLEASE Help, I am Begging*","Working remotely in FL for a CA company while finishing grad school. Can I claim FL residency and thus 0 state tax?","Any feedback on my plan for the next month would be appreciated","Friend crashed my car, I don't have collision coverage, how do I pay for my car's repairs?","Question about how to allocate monthly contributions (IRA)","Samsung financing through TD Bank has me using a website (myonlineaccount.net) that looks and sounds incredibly shady. Does anybody have any experience with this?","Tips to recover from a 530 credit score as a 20 year old?","Credit Score too low to re-fi to comply with Divorce agreement.","Made a amazon prime store card for a $60 gift card. Did I do something wrong or is it ok?","Side Income Idea - Tax Prep","Breadwinner, just lost my job. No emergency fund. Am I screwed?","19 Year Old Canadian with around $4000 worth of savings in cash. Is looking for options and where to start.","Bought a new truck straight out of college but now I’m having second thoughts.","A property management company issued my roommate and me a 1300 dollar utility bill this month because they forgot to charge us for the last 6+ months.","Buying a car with terrible credit","Fraudulent Charges On Business Debit Card That’s Never Been Used","When to buy a home","Student With Savings","Is there any reason NOT to sign up for credit cards to get their welcome bonuses?","When is it okay to give advice to people?","Options to Transfer my commuted pension value?","Car in delinquency what are my options?","Needing advice to pay off debt as fast as possble","Wanting to save but don't know where to start","Are there any financial services that notify you when a credit card charge doesn't match the pending amount?","401k vesting ?? If I give notice, but my last day of work is after the hire anniversary (and therefore my vesting date), will I still become vested?","Is a Roth IRA the right call?","Just met my old jobs $2200 out of pocket health care deductible (Weekly Therapy), start new job in two weeks. Does this transfer?","Opportunity to purchase father's car; need a loan and I have no idea where to start.","My HSA turned out to be useless to me. What are my options?","Mum wants to take a loan out in my name to buy a house? Advice?","Have an almost $1200 bill from the ER. No way I can pay it all off at once","[Insurance] Thinking about quitting my job. When do I apply for health/dental?","I got a seasonal job this year in which I get laid off around November and collect unemployment and return in spring. I'm not sure if I will return. Would it make sense to contribute to a 401k for the rest of the season, or is the withdrawal fees make it a moot point?","Currency hedge","Parents retiring in 15 years, have no 401/retirement plan","Should I pay off my auto loan? (23 YO)","New Grad Needs Help","Where to start with making my families life better?","Help making student Loan Payment","Index Funds vs Waiting for Roth IRA?","Landed 65K per year job at 22, how to proceed?","Parents f*ed me over","Student loan watchdog quits-- any steps to take?","How do I ask for a raise at work?","I need some help figuring out what to do with a $3000 bonus I will be receiving in May of 2019. Save or put towards car payment? Details below","Engagement ring and credit card reward","Credit score just hit 750. Should I get new credit cards?","Gf received mail from collections for $800. what are the next steps?","New job. $16k/yr raise. What to do first?","Does this plan for an IRA make sense?","So I’m trying to get the best car loan I can...","Company I took a loan out with is declaring bankruptcy","Employer asking for salary expectation just before making an offer","Question about loans","Clearing up collection","Coming into enough money to pay off all our debt. Need some direction.","Grandmother bought $1000 in Google Play gift cards","Advice for 18 year old","Forms of Investment","Fixed or variable mortgage? (EU)","Need advice on paying CCs","Where to safely Invest $1,300 for 5 months?","Temp-to-hire position, just received my offer letter and looking for advice","Very short-term saving: open new CU account for interest?","Budgeting Sanity Check + Retirement Question","At what combined income level does marriage lead to higher taxes?","Realized I want to change my career field. Taking a risk and dropping everything. Not sure if I can financially handle it though.","22 Got My first job out of college with a salary of 52K How should I be saving/investing","Just moved to the US for college","What is a “revolving line of credit” and is it a bad decision for my credit score and financial health?","Giving someone else my bank account number","16 and don't know what to do with my money. What is the smart thing to do?","$20,000 in Debt and No Clue where to begin","Just lost my financial aid for school","How can I restore my credit?","401k question (US)","Will ending a subscription contract affect my credit score?","Renting apartment + car in USA without being citizen","UK: What should I do with £5000 while studying masters for 2 years ?","Looking into various options for refunding and terminating my ASRS account","Where to park money for the mid-term","22 year old with a new job and big raise. Where do I start","1 extra mortgage payment per year. Still worth it when selling?","Are grad school student loans something you can actually prepare for/do something about, or are they something that you just have to deal with after the fact?","Credit goodwill adjustment?!","How to find out what missed payment made my credit score drop.","Cosigner vs guarantor (for an apartment lease)","16k in debt","Inherited IRA transfer value from date of death or date of transfer?","Can’t calculate credit score","dumb question about my job","Should we buy this house?","US Dollar+Market Hedge","Getting scholarship retroactively, payoff student loans or invest?","Would it be a bad idea for me to open another credit card?","Qwil: A new way for some random company to take their cut","Canadian working in the US as a contractor under TN visa.","Mortgage Forbearance: Anyone Have Experience?","I messed up. I was two days late on my credit card payment. Called them up and they waived the fees. It never hurts to ask.","Is there a downside to closing my Bank Of America Savings/Checking account?","18 but want to get myself going on an investment/successful path. Need advice/Mentor/Help","Wondering if student loans would be worth it, thinking mid-term","How tough is it to start building credit as a new resident alien on a TN visa?","The more I look into it, the crazier I seem","Credit card companies that offer instant payment?","Saving for Home down payment with a 457b?","Should I use my mutual fund to pay off wife’s student loans?","401K Max or backdoor IRA?","Came into $7,000 and have no idea how best to invest for my future.","Just got offered a job that pays less but has benefits.","Hi, I'm a student that just got out of college and I need help with what I should do to get out of debt?","I've been enrolled in my companies 401k for a couple months now and just have questions on if my investments look good or need changing.","Need advice on investing 18K USD gifted to 4 year old kid","I literally just paid this joint debt off 100% and now other party may be landing a discount. I haven’t even got to tell them I paid it off yet.","Is personal loan right for me? Debt Consolidation question!","Survive off $20,000 for two years of school","Can I combine my CalPERS and 457b into a 401k?","How does insurance for a new born work?","Insurance agent wants to re-evaluate my policy","I'm Re-Evaluating my Emergency Fund -- And Could Use Your Help!","Starting my first real job w/ 87k salary, How do I allocate","Should I make (another) car insurance claim?","Whole life insurance","Keep Savings in Cash or Brokerage Account","Replacing car parts every few years. Worth the money?","GF's Mother (~57 y/o) Retirement / Investment Portfolio Construction","Broke wrist and footed with $1500 medical bill. Then I lost my job...","(CAN) Employment related question about secondment repayment - I went for a secondment to Australia but am leaving the firm before my repayment forgiveness timeframe. They are forcing a repayment plan on me that I never agreed to. What rights do I have?","Just got a raise now they want to give me a promotion should I ask for a raise with the promotion?","Is there a workaround to transfer my Visa prepaid gift card balance into Venmo?"]