["Exclusive AMA - John Staats, Blizzard's first 3D Level Designer, is funding the WoW Diary, a book on the development of World of Warcraft","Midweek Mending - Your Weekly Healing Thread","I'm over here working on 7th legion rep and this other guy be like,","I got married on Sunday, I had to make sure to finish my emmisarys beforehand...","When you choose your new hunter based on his pet.","Can we please have the option to ride side-saddle, like Whitemane does in hots?","Getting drunk and running around WoW makes me take artsy shots apparently...","At first I was offended this was gray vendor trash, but it's actually the most appropriate way to honor the best Loa.","me just tryin to get the dog food to the bowl","Business snek.","Daily quests -&gt; World Quests is the best content evolution in Warcraft","Characters we haven’t seen in the lore recent years that should be part of the BfA.","Feels like I see a lot of this lately...","13+ years ago I hit level 60 with seconds before server shutdown","My favorite thing about Vol'dun, would be nice to get it as a toy.","Boys, this is what the Horde wants to do to our beautiful Stormwind. Are we gonna let that happen?","Stop with the hyperbole","The real power Mag'har has brought to the Horde. It's never just an Allied Race, you know.","I've never been so delighted to collect a series of vendor trash items.","Blood Knight - Matthew McKeown","[FUNDETECTED] Skystep Potion was stealth-nerfed to require level 100.","Anyone noticing lag despite latency being fine?","Named my character after my GF as a joke, got kicked for being a \"girl\"","Why is Jani so much smaller than the others?","Blizzard PLEASE make this a heritage set for Night Elves!","I found a nice \"Dranei\" on the Vindicaar","My BFF's daughter is an artist already at 17. I asked her to make me a Cheerbear Sylvanas. I'm speechless.","This is by far the most stressful place in BFA","Make your WOW look good with Nvidia game filter","Undocumented change - Loh (tortollan little turtle) is faster now","This guy has been missing for 15 years.","Tip: Use Purge / Spellsteal / Dispel / Arcane Torrent. So many mobs have these effects in the new dungeons. This WeakAura's amazingly helpful.","After searching for 15 minutes within the main warship, I read the whole quest.","Why do i need to create my own cooking fire when these exists?","We tortollans grow up hearing the stories of Loh, a tortollan who had many adventures. This is the story of Loh witnessing the burning of Teldrassil","Zuldazar Guard teases Vulpera allied race?","I lost my WoW buddy over the weekend, but he'll always be with me for adventures in Azeroth. &lt;3","Data from World Azerite Detector - Looks like 15% proc rate","OMG I GOT A WEAPON!!! Let's see its a 340....meat cleaver...yes....oh boy","WoW settings explained (Graphics, Advanced, Network, and Sound)","*Pandaren Voice* Slow down!","Zandalar for evah! My Zandalari troll tattoo is finally made real, thought you guys might like it. :)","The Dark Iron recruitment scenario is busted.","Getting married on sept 23... Can you guess our wedding theme? Here’s a lil mock-up of a table (on the date, a florist is putting real greens out). Bonus pic of our gift table loot chest.","Lei-zhi's orbs drop in the water, instead of going outward and stunning you","Anyone else have a bug with them dodging weird?","Seens like the islands AI gave up on the expansion already","The belt on the nightborne heritage set sticks out really far. And it still clips with the heritage robes","What's a mob to a queen?","Battle Pets should be made into a mobile game","How do you know what to interrupt?","My Pointilism Loatheb [OC]","What happened to these Mag’har Orcs back in Outland? Where is Greatmother Geyah and Jorin Deadeye?","Nothing beats the view from Dazar'alor...","Fenvaria as Sylvanas at Gamescom '18","Azerite traits sending bolts of damage out to things im not in combat with 500 yards away..","I’ll be rich in no time. Goblins watch out.","Not sure if this is well known for blood elfs.","Why can't I get this as a hunter? Blizzard please.","Found these two legends...","No there's not (how do i get rid of this permanently)","anytime I get anything at all from a dungeon","FYI: The second rank of Weapon enchants (gale, coastal, siphoning, torrent) take MORE materials than the first rank.","Blizzard support was able to locate and recover my Vanilla account that I haven't been on since 06-07. Turns out it was hacked and banned. The Game master was able to reverse it and merge my characters to my current account. Customer support at its finest.","Anyone else want a ramp or a hole in the fence here?","How I've felt the last few days doing nothing but grinding","When you finally purchase an expensive mount but just don't know how to sit on it properly...","At least we can agree on one thing.","I painted my favorite part of BFA :)","It was everyone's first time. Everyone was from different guilds. This is why I love this game so much.","The old gods have infiltrated Boralus","This scared the crap out of me when I turned around the first time and saw it","For your consideration... The Jericho.","[Spoilers] So what exactly is up with Zul?","Feral is utterly broken. Abilities doing more than 20% more damage while in restoration.","Players are reporting they are receiving perm bans for abusing the WQ exploit.","MFW escorting Flynn on a 5th alt","Can anyone tell me what addon this is?","BFA Raid Supply Consumable Calculator","I was looking up a guide on the arcane mage rotation. I was not disappointed","Whatever happened to Chromie?","Me, waiting for Blizzard to announce Warcraft 4 whenever they feel like it..","I've seen you liked the Zandalar tattoo so I thought you might Garrosh too :) (Bonus doge)","Noggenfogger Elixir still counts as a dispellable magic effect. I don't want to purge the Noggenfogger buff before I can purge \"real\" buffs in PVP.","Is it just me, or are Kul Tirans WAY too tall?","Maiden of Vitality in Chamber of Heart","Rogues can lockpick the gates in Tol Dagor to skip past alot trash.","This questline REALLY makes me want a Mech class?","BFA feels like Azerite Armor wasnt given the same attention to detail that Legion Artifacts were.","TIL The Left one brings you up to the great seal and the right one to the Port of Zandalar","Thanks to Blizz for speeding up Loh.","Why is everything in this game so damn aggressive?","Players from other servers can come to my server and farm mats and mobs affecting prices, so why am I limited to only my servers AH.","There are mobs that scale with level in Kun-Lai Summit. Some of them have 700k health if you are 120","How come on Tauren males their tails tuck nicely to the side while mounted but on females they're all stiff and pointing towards the sky?","This is too annoying","What do you think is the best quality of life change in WoW’s history?","Blizzard GM: there is only one colour of Heritage Armor avalaible to Mag'har Orcs","Does anyone else feel like Blizzard was onto something with the Rhinos in Gundrak that charged and one shot your DPS who pulled aggro?","[Lore]Can we release Sargeras?","That's not a pig...","Mythic bots didn't even try","I killed the enemy and there was a cinematic after however I disconnected during the cinematic. Logging back on I still need to kill it however it spawns and fades away upon my arrival into the room and the cinematic doesn't play, nothing happens.","Need some help defrosting my permanently frozen Hunter pet!","Am i the only one getting chased to the ends of time ?","What are your 5 most \"essential\" addons?","Found some real banana hammocks","I did it, Mon.","Hunter Pet Issues","Fan Art commission: Alliance-Horde Ogre for Currently Online","13 years ago I met my bestfriends playing WoW, we are all playing BFA together again! (Story in comments)","Of all the classes, how many actually get distinctions based on Specs in Azeroth IRL?","I think Island Expeditions are quite fun and are a good weekly task that varies the normal progression in WoW.","The Mag'har allied race scenario brings us much needed closure to a very important WoD story.","Stop with War resources for Emissary","Attention Mistweavers, Way of the Crane is a broken lifesaver!","Did Loh get faster?","Alliance - Monk Race choice","\"Master Gadrin summoned hundreds of Talanjis.\"","A message to people who hit a group of mobs I'm fighting while doing a WQ and leaving, making me do all the work for them","Atleast some already tagged or looted nodes don't despawn on their own. Instead they only despawn when the \"despawn timer\" is over and another player tries to gather them again.","What are those guys aiming at anyway?","Gotta learn how to improvise.","Found Three Deathwings in Azhara today...","Notable BFA dungeon shortcuts you've found?","Halford likes to refer to himself in the 3rd person with a Dwarvish accent.","Stabled Ghoul, Can't Raise Undead now.","Since i was a little cannon I have been dedicated to protecting Stormwind.","Unused Warcraft classes","Azshara is level 123 now.","BFA soundtracks appreciation thread","What is the point of 350 gear from rep vendors at exalted when by the time you are exalted, the gear is obsolete?","Can we get a pig mount?","Stealth missions are bullshit","Toxicity within Mythics","Garona no longer \"angriest orc ever\".","Wildhammers &amp; Amani Allied Race? Let's ask, so maybe we may receive.","DX11 vs DX12 image quality differnces","Winter's Kiss as far as the eye can see.","[Help!] Prot Paladin - I dont know how to not suck.","Best immersive quest this expansion - Captain By Captain","Found a pretty crappy issue with the poop quest in Vol'Dun.","I think Azeroth is trying to talk to ye'","1H axes for Demon Hunters","How are fire mages doing in comparison to frost mages dps wise?","Post your Rarest WoW stuff","Am I missing something or does this whole section of Nazmir suck? GYs are super far away and so are Flight Masters, and all the WQs are so fast west, they might as well be in Vuldun","Lorewise, which class do you identify with most?","We ARE the baddies","Why are Expulsom BoP? Hydrocore and Sanguicell are already BoP","Seems like someone had enough Whiskey and Vodka","Hang on a second... What!?","Well this is interesting.","Discussion on the imbalance of Horde/Alliance in War Mode","Does anyone else find these world quests annoying and wish they could untrack them?","Total Newb.. got cursed at and kicked from a dungeon. what did i do wrong?","After hitting exalted with Honorbound/7th Legion you still get reputation missions from the command table.","Can’t mine adds in BFA","Lore-wise which Orc clan is the most fitting for a hunter?","EXCUSE ME?","Thoughts from a (maybe) returning player","Not sure if this is the right place to post, but curious to know what these are?","Azshara is coming...","How do you become a witch?","Void Elf Blink Racial Speed was Ninja Buffed?","Apparently some fist weapons sheathe on the back now? (And 2 sheathe on the hip)","Dont mess with Panda(?)","Since we're sharing old stuff: Heart pumping, sweaty palms. I will never forget my first kill of the black dragon broodmother.","Making The Switch","Dat moment you knew you fcked up","The difference between alliance and horde is annoying","Legion class mount that best fit the class lore and feel.","When is the best time to interrupt an ability?","Do i need a raid Guild for normal/hc raids?","VENT: How bad is your dungeon loot luck?","Help with 30fps potato settings!","I think I am doing something wrong while leveling","I've been playing w/ War Mode on since launch...","I’m still new to WoW but I’m loving it","List of partially implemented sets, please help expand!","Do the Alliance zones have stories that blend together too?","Mag’har Unlock","Blizzard, something needs to be done about Anchor Weed. We are heading into one of the most expensive raid tiers in wow history because of this extremely expensive and extremely necessary herb.","So my GF ordered me a Figureprint in December and I barely got it today...","Interrupt Debate (Please Help Me Out)","Blizzard, please \"nerf\" the Azerite Madness world quest","I've seen some stupid boost ad's but this one wins the crown.","Do mariners and pirates in Kul Tiras not go to pirate-heaven if their last words AREN'T a bad nautical pun?","Alliance players don't forget that you get this mount for reaching exalted with the 7th legion. So not all the rep mounts are horses!","It's been two weeks since launch. What does /r/wow think of BFA so far?","Arcane mage 1v1 tips","That time when Threat Reduction caused a forum outburst. (Sorry for poor res - it was a time before HD).","What’s your main and why?","As a caster, I've been loving the state of BfA Battlegrounds so far","Theory: Anduin is a pawn... of the Light.","2M auctions just fell off the AH... ouch","It's a PUG Party!","[King's Rest] Spectral Brute vs Restoration Shaman","Since a lot of people are complaining about being dazed, I present you:","Yes, Nathanos it is a pity","NPCs, don't insult people if you want them to heal you","So, run over 2 hostile npc that figth each other will keep you stuck in combat even if you run to the other side of the map.","Question about caster weapons?","Learning Curve?","Can we sell the stuff we make again?","Got myself some real world “Azerite”","Juicy Drama Story Time: Why did your previous guild fall apart?","Patch 8.0 Hotfixes for August 29 - Azerite Armor Trading, Dungeon Tuning","Blizz, draenei demon hunters when?","Anchor Weed Rarity","What is your uncommon race/class combo?","Is there a way to see the average ilvl of all 120s?","Best part of this reset","How unstable can it be?","Thunderous Blast x3 or just x1?","Lowered graphics, but now important things are hard to see - what setting should I up?","There's a WQ to prank the Raptari in Zuldazar by defacing their Gonk statues with mustaches and Pterrodax poop.","Is Premade Groups finder for PVE down?","What melee dps have the best self heals/sustain?","Havnt played in a while will i enjoy the new expansion?","Question: What to buy to start playing? (And in what order?)","How long should I play a class before I decide if I like it","Some toxic Alliance players, is it my realm or is it like that every server","Legion Scenarios repeatable?","How I feel playing through the campaign on my Alliance alt...","So me and my friends got back into WoW and boosted onto a new realm. Turns out it's 98% Czech and merged with a 99% Polish server.","What are the Best WOW Add-Ons?","Blizzard, can you make the reputation ilvl neck upgrade with Champions of Azeroth accountbound so the expansion is alt friendlier?","I made a post a few days ago about my Warglaive being reversed when sheathed. I haven't even noticed it was fixed until randomly staring at it today. Thanks Blizzard!","Minimalist Alliance Structures","Trinkets","I've never been a collector but I just have to get the 'Crashin Thrashin' Title... its a bit of work to say the least","Can somebody ELI5 WoW to a Runescape player?","What exactly do I lose if I chose a new main?","Leveling friend","I have a sincere question for those of you grinding rep.","New to WoW - What kind of Sub or DLC do I need?","Help, I'm missing a quest! (spoilers)","Best healer for mythic and mythic+ dungeons in the future","Playing fury but dont know if its suitable for mythic s..","I made a new friend in freehold","Arthas theory","7th Legion/Honorbound Rep Grind - One Faction or Both?","Warbringer: Ocean Man","Can Blizzard remove Dazed already?","Can you change the Tracked Quests Sidebar Font Size?","Apparently the Armory doesn't show your off-hand weapon as transmogged when you're using a Legion Artifact appearance","The adventures of a lvl 1 Worgen in Zandalar.","Anchor Weed | herb disappears","Disappointing bit of clipping on this dark iron hairstyle","Allied races for returning players","Possible answer to one of Il'Gynoth's lines","When do server transfers go on sale?","Garona finally hotfixed","Unpopular opinion: I like it when the opposite faction fights unfair in WPvP","UI Question / help","Did I miss some story in the Alliance levelling experience or does the only raid in the expansion have pretty much no build up at all?","Every time I die in a Battleground","Every time I get a drop in dungeons","[new player] how do the targeting rings work? (inner or outer circle)","Mythic Tomb of Sargeras @340+ ilvl","Just updated wow and logged in to see my lock holding his artifact staff with an off-hand at the same time.","Can i play demon hunter without legion?","Keeping people locked in the sarcophagus on Mchimba and the adds before","Can't kill any BFA faction leaders in the Horde VS Alliance expansion?","Is anyone else getting game stutters when opening any profession tab?","Temple of Sethraliss","TIL Scroll of Recall can still randomly you in Lordaeron","Other than trying to find the few rares/chests I left behind, whats the best way to get war resources?","Will running wow on a laptop decrease its life span?","thats like my pose behind the pc","are any of the altar buffs worth going back for when leveling?","Vulpera for The Horde and Sethrak for The Alliance?","what is the most complex spec?","Leveling as alliance, is there a quest line / zone I should prioritize to be ready to go at 120? Does it matter?","[Help] Hot to restore pre-legion nameplates?","Make Loh Go.","When you want to squeeze in that last mythic before reset","Hot fix on feral Druid","When you've had one too many energy drinks.","That Sylvanas Cutscene Tho","[Technical Help] WoW crashes my Internet","We have a problem","Alliance populated realms","Disc Priest are weird.","Easiest Class to Level for Dark Iron Dwarf Heritage Armor","I'm a new player with Battle Pet questions","There is now a mailbox by the horde scrapper","Dear Blizzard, please start a \"Print your character in 3D\"-Service","First time finding this place. Is this how long boi owners feel?","Can someone please tell me which addon on metzen's green earth this brown text comes from?","Cant release in BGs","Even Blizz realized the white crotch flap was a bad look...","Where do people download addons these days and whats the best DPS meter?","Really odd Waycrest Manor Damage buff bug.","Void Elf Rep Grind in BFA? Struggling to Get Reputation","Mythic raid leaders/officers, what apps/services do you all use for raid invites and guild applications?","Raids and pvp- newb questions","With mythic + coming next weekend, does anyone have ressources for skips and tricks for BFA dungeons ?","Green Orc transmog","Why did Blizz decide to go back to the WoD model for wolves in BfA? The model from Legion looks much better and deserves more variety.","Quick Questtion on new Races (Dark Iron Dwarf/Zandalari Troll)","So, let's say you're a Rogue with Tailoring and Skinning...","Fixed this quest's music for us","Quick Math","The demolishers you can buy in Island Expeditions allows you to split up your team in 3 and finish it in 3-5 minutes if you are efficient. They might be overtuned rn so make use of it while you can.","can you help me with these 2 items please? dagger + offhand vs 2h staff (frost mage)","Pet battle scaling is awesome for BfA, is this feature active on Legion Pet Battle WQ's as well?","Why is my mining glove enchant not as fast as mining trait?","Quest: Goldfield's War - Horribly Broken?","Looking for Rogue Sub macros - tips","Just did THE MOTHERLOAD!!! And I'm really starting to think something is wrong with my PC.","Ingame shot","Ban wave incoming for WQ exploit where people could complete them over duping rewards.","Temple of Sethraliss Bug","Somebody forgot to fix an item during the Dark Iron ally quest","[Help] profession tabs freeze?","First one to get it wins... Anyone? No takers?","PVE - Hunter spec in max level?","Dumb question about expansions","I Wish :(","Faerie dragon my wife painted few years ago","Max level gearing options","The Scrapper has to go. Professions are a mess and need improvement.","Where can I get the rest of the transmog pieces that was the reward for the first war campaign quest?","Apparently, you can force a font change with the new BNet chat by pasting Kanji into your message.","MoveAnything Fork","The person who designed The Motherlode...","Trial account boost garrison","BFA Warlock Specs.. which is best!?","Sylvanas and Forsaken by @LauraSavaArt","Kul Tiramisu","Azerite Power is a terrible way to gate power","If you play WoW a lot like me and want to make your time mildly productive, switch the game's language to one you want to learn and translate it as you play!","Clayton Backston and his squad of commandos are the best thing about Nazmir. Please bring them back over and over, like Tehd and Marius.","How is this possible?","Feeding frenzy world quest broken?","Has there been any news on the Zandalari Trolls and Kul Tiran Human Allied Races?","Little trick to check Order Hall without going to Dalaran","BFA's art is gorgeous","Island expedition votekick abuse?","By wanting harder world quests, i didn't mean we have to go full Mirror's Edge..","Simple Uldir Raid Guide?","Going to lvl Boost a Monk DPS/Offspec Tank. Fellow Monk Brothers, please offer advice and tips!","Why am I getting lockouts from doing random heroics?","Mal'Ganis vs Tichondrius","Best &amp; funniest name title combo you've seen","Will most of the dailies and rep farming of the last 2 weeks be made obsolete once the raid hits?","WQs should give items that match selected loot spec","A wild interrobang appears.","Feral druids can get 100k hits using Cataclysmic Gladiator's Dragonhide Gloves + Iron Jaws azerite trait","Just started my first tattoo. Can't wait for the coloring in another week.","BM Hunter stats","Ai-Li’s Sky Mirror is Beautiful","Should flying mounts be able to glide where there is no flying?","Question about artifact weapon transmog","No more bald hats","When you realize...","Thank you for changing Make Loh Go !","What is your favorite Pun Name you have seen.","What world quest addon do you use?","Island Expeditions - Ideas for Improvement","So what am I suppose to do during the first boss of Siege? (Sergeant Bainbridge)","When Boralus was announced, I hoped it would have World Quests in it to make use of a Suramar-level capital city. Seeing this World Quest makes me very happy on that end.","does the castaways side quest chain give rep?","[Slight frustration] Tidespray linen","Is stringing out class abilities and passives across dozens of levels even necessary anymore?","Ever wondered how mail gets delivered in Azeroth ? Well apparently Birds (Ravens) are responsible for it.","I guess news travels slow in Azuremyst...","Looks like the Bee Movie just got more serious...","Exarch Hellscream Model","Night elf Monk Art - TeeEule","Twinks","Anyone from EU playing on NA, what's your ping?","Old raids","My first successful attempt at making a Cinemagrph from one of World of Warcraft's new zones, Drustvar (x-post from /r/Cinemagraphs)","Who needs the Kul Tiras fleet when we can just get the Zandalari one? :D","About 7th Legion/Honorbound rep","when you're the grand admiral of the alliance navy but are relegated to the position of \"human portal\" for the expansion","Mathed out new AP scaling to hit each level by week. Taking into account decay and 42k per week farmed.","Void Elf Racial - No longer travels","Mount Achievements","War resources shortage","Stuck in netherstorm","Question about Nat Pagle at Garrison","The fastest way to level is with random battle grounds if you have both pvp heirloom trinkets.","Does using your flight whistle reset your kill count towards the assassin pvp buff?","*grabs spyglass to read Kul Tiran scroll*","Getting WoD LFR set in BfA, possible?","Food for thought for pvp doomsayers","Can you get banned for killing npcs in starting zones?","Raid achievement reset (Portal Jockey 25)","Boost a Mage or a Warrior???","I found some interesting filters while doing the [Deep Dive] quest and decided to take screenshots while using some toys. Lots of pictures, but I hope you enjoy. Share your pictures, and if you have different toys, use them.","Auctioneer add on not working?","Well ...","I miss when Hunter pets kept their unique look when tamed.","My kodo touched da voodoo","Azerite Traits are horribly designed","Am I done with the Druid class hall campaign?","Sham tank","Waycrest Legacy Set procs and Disc Priests","Newbie here - Question about dungeon scaling","Priest weakaura suggestions","My reaction to BfA so far...","Are island expeditions supposed to be this unrewarding?","Pet Battle question.","a economy breaking exploit i found (sorry if you were doing this kek)","Us-horde emissary","Why is this not the rep faction mount for The Order of Embers?","Question about WoW novel (Arthas)","Island Expeditions are the absolute worst form of repeatable content Blizzard has ever put out. Change my mind.","Seems balanced","These Tortollans need to be stopped","Blizzard patched together some Auction House solutions, but maybe it's time for an overhaul","What is your opinion on Island Expeditions?","Does anyone know what this balcony on the back of Dazar'alor is for?","Well Played Blizzard.","No hope. Just pain. Only pain!","Something interesting happening while taking the train.","The stuff you see on RP realms","Combat bug is back with all its glory again","Best class","Profession combinations?","Lvl 90 boosted warlock","changing UI?","Let me know how that goes for ya","Antorus first 2 bosses soloable?","Warlock players, wise advices needed","Pvp scaling? Mystery and mess","How do I start a warfront?","King Rastakhan bound his entire line for a glorified heroic leap...?! No! What he really needed was a mage's intellect buff so he'd make better decisions in life","Does anyone know this addon name? Thank.","DH Tanking","Do any of the Shop mounts allow herbalism without dismounting?","For those of you who log your fights, do you just have logging enabled all the time?","Well that's foreboding.","Warfront Gear ilvl?","BFA Where can i start Legion's Order Hall Campaign ?","Handmade Outland Map","What argument justifies rep not beeing account or at least realm/faction wide?","The auction house is flawed","Macro that sends a message to instance or party","Companion app question..","Soul Bound Item","Questions about 355 crafted gear.","I would pay money to have a disenchanting interface similar to scrapping.","Nightborne unlock question?","Thanks, I didn't want to loot him anyway.","Considering Anchor Weed is a bit of a nightmare right now have a chat with your guild leadership and sort Cauldrons!","There's an Earthen Alliance Flightmaster in BFA","Should I transfer to a RP Server?","Best and worst BFA dungeon for M+","Does CoA exalted give neck ilvl +15 ?","Whenever the Worgen revamp does happen, the only \"change\" I want is more Face options, and improved lower body (for Males, anyways)","When there isn't enough salmon on the AH, you get the boys involved","Is jumping servers to gather herbs safe?","Is anyone else getting the wrong drops in dungeons?","The best BfA easter egg. No picnic basket drop though. O_O","Frost dks currently","Wow","Is there a shadow priest rework coming soon?","Blizzard, could you please make one small adjustment in the WoW app please?","Addon to Display Reputation Bars for multiple factions?","Companion App Question","Mining Quest Bugged?","Favorite chill spots to fish in BFA?","New Wow player. Not a total noob but need help.","Requirements for Uldir?","Would love to see a expac themed around the decoded blightron messages","Clarification on Light vs Void, Good vs Evil","Confession of a diehard horde player","What to do after Wrathgate as a Horde?","[BFA] leveling in dungeon ?","Altfriendly expansion...","Are there any questlines in Zandalar the give Honorbound rep?","Possible Emissary Bug","upgraded my 780 3gb to a 1070 8gb. should i turn on DX12?","What do I get between levels 110 and 120?","Name Your Character App","Garona Bugged again? Telling me to get bent.","New player feeling a bit burnt out at level 65, boost maybe?","Ok it's been 2 weeks, why is there still almost unplayable levels of lag in many zones","/r/Wow has become a meme factory with almost no meaningful discussion","[Rogue] Is there any reason to set loot preference to Sub?","Is there a guide to get Fullscreen type behavior out of the new client ?","Prot warrior hidden weapon artifact skin","All The Things question","Returning player here, got the expansions until Cataclysm, so no Pandaria and on. What do I need to get?","Did heritage set weapons ever make it into the game? Will they ever?","Picture took during the burning of Teldrassil","A couple questions for returning! Every answer appreciated!","I just wanted to get some ore... and next thing you know.","So over 90 minutes later...","Whats the deal with phasing and warmode?","Is the new expansion an extra download?","Honorbound/SI:7 &amp; Champions of Azeroth rep should be account wide","It was possible to use Divine Steed while holding the flag all throughout Legion. Why isn't it anymore?","Idling on Brutosaur: Boralus vs Stormwind","Add-ons for leveling DH","8.0 Arcane Mage Guide","TIL that the south park episode is on blizzards timeline","Today i found my twin on battleground...","Weekly events?","I figured out how to get the [Epic!] Achievement!","World Quests","Tracking CD's addon question","The bay in the western most part of Zuldazar","Argussian Reach Rep grind in BFA?","Windwalker's Fists of Fury should be renamed and allowed to be used with a 2-hander.","The Postmaster title should come with a large reward","Mods","Catch up?","Calculating ilvl with using 2 one handed weapons vs. a two handed weapon?","Island Expeditions - How long to fill bar?","I keep seeing the term \"nolife\" thrown around. What is your definition of this term?","Does having less expansions allow you to run wow on worse computers or are the system requirement the same regardless of how many expensions you own?","PvP gear needs its own stat again","Noob question on server transfers/implications of (poss old) server designators","Is it faster to level through battlegrounds?","EU RPPVP Horde Roll Call","Notice to all rogues: YOU CAN OPEN THE CELLS!","Are there any good theorycrafting communities these days?","Destro Warlocks: Fel infused green spells yes or no?","Just got a fist weapon for my wq, as sub rogue will I be able to use it for all abilities (I assumed we were locked to daggers)?","Any1 else miss Gladiator warrior?","Help with elvui castbar","anyone have a somewhat updated class dps tier list?","21:9 2560x1080 Underrot Wallpapers","Time estimate to go back and complete pathfinder in previous expansions?","Minor issue: The Scrapper only scraps single items","Any WoW addons that show faction areas more clearly?","I recently got into WoW but the WoW token kind of confuses me.","Money money money","The difference between fishing.","WOW has a spot on my bookshelf. It kills my OCD that I don’t have collectors vanilla","I played WoW with a view this morning","Thanks to WoW i'm a religious one now.","Getting blackmailed in Groupfinder for gold after first few trashpacks. Got left with deserter debuff and a long dps queue time again.","Demon hunters in BFA","I got a pug for doing PUGs. So I can pug while I PUG.","Why did you decide to play Horde/Alliance?","Are there any Questing zones that reward collectibles..?","The worst feature of BfA so far: no Zandalar / Kul Tiras portals in Dalaran. Blizz pls.","Camera angle question","Raid openning","[Serious Potential Mag'har Spoilers] What happens to our garrison?","Dark Iron totems should sound like drills","Immersion ruined","Is Nightbane bugged (again)?","Question About Mage Tower forms (druid)","Why is there no information in-game that you can respec Azerite armor?","Alt rep potential fix?","When exploring Boralus, I didn't expect to see a troll being tortured.","We were so spoiled rolling alts in Legion","He's back at it again.","Questions about leveling in BFA; specifically if I'm supposed to be leaving one zone and going to another at some point...","Threat as warrior","how i get rid of this?","State of the game","Pristine Artifact bug","State of windwalker monk, specially at PVP?","Pro tip from a Noob, if you let your map go transparent by walking while its open, it makes undiscovered spots easier to see!","New Player, needing guidance!","Is it possible to play DH without Legion?","Am I just a bad healer? Or are mobile tanks just seriously a pain in the butt to heal?","So this was on the whiteboard when I got to work this morning","Professions need some love.","Frostmage stat priority?","Otis in Freehold","Can Kul Tirans (soonTM) become Monks?","Tanking Tuesday - Your Weekly Tanking Thread","How to get war resources?","Mythic lockouts not registering.","How World of Warcraft Was Made: The Definitive Inside Story of Nearly 20 Years of Development","My favorite place to get smashed.","The Underground Flight Path... Glitch?","Am I the only one who think the bell is a Beta prop?","My Pepe glitched out in the character preview but I don't really mind. Wish he would stay like that :]","PvP","Up up up I gooooo... awwhuumm","Since i've seen people 'struggling' with todays turtle maze.","It takes to long to dismount someone when attacking","QOL Suggestion - Blizzard, please let us mount up in legacy dungeons and raids!","Getting back into WoW and Gold","So yea my Ghoul learnt how to fly in BFA","Retri paladin with Holy Nova?","BFA gave me this long forgotten feeling of achieving something.","[BUG] Demon Hunter Glide; cancels without user input","Do Azerite Traits stack in any way? If they do, is there a list somewhere?","Thanks blizzard","My warlock finally got a legendary","wanted quests weekly??","When they say sylvanas can't be forgiven for genocide and they are burning 200 goblins alive in seconds...","Make this obtainable please","Been trying to farm '7'th Legion Reputation' to be able to continue my war campaign (Main story) but it's taking so long, I complete the daily's etc and only get 10%, been stuck for over two days any way to farm rep ? (I've done all the quest's too)","For all the PvP Fans out there: You can change talents here at the Training Dummys","So much negativity... Post your positive experiences!","A 36-hour mission costing 100 War Resources reduced to 18 hours with recruited troops... for Augment Runes?? Blizzard plz.","Is sylvanus body hot or cold ?","Can regular orcs get mag'har hairstyle options please?","My group whenever I get any piece of gear","When Titan's Grip isn't enough","Light Lords and Old God equivalents","I think my YouTube is trying to tell me something","Bwonsamdi's Boss Theory","I was scrolling through my phone and found this sylvanas drawing from a couple years ago, thought i would share it here!","azzinoth warglaives mog in bfa...","what rep do u need for zandalar trolls, i heard its not zandalari empire","this was a lot funnier in my head","I wanted to camp a dk while he was doing his tortollan world quest...","Timestamp???","Just got into Wow any tips?","Uldir tanking","Go, my champion &lt;3","Blizzard?","Unholy Dk duels 8.0","Picked up Archaeology recently, what am I suppossed to do with [Restored Artifact]s?","Can I read books by Christie Golden without knowing the lore beforehand?","Likelihood of getting accepting into mythic groups as an ilvl 320 dps???","The Best Bar in Boralas is at the bottom of the bay in the belly of a whale","Started levelling a horde alt last night after getting two alliance chars to max level...","Thanks blizzard 2x 600 azerite and 2x 700g in a row","Why are skinners getting boned on worldquests?","Change the EK and Kalimdor loading screens, seriously.","Three of the same cloak, plus another of the same cloak at stormsong. All I want is a goddamn weapon.","My favorite part of Waycrest Manor","If I use an item for an effect for limited time, is it game time or real life time?","Does collecting rep reward on the companion app actually work?","The Alliance boat is now a rest area","Can we balance number of healers on a team in BGs?","So is farming Azerite pointless?","World server is down.","Outpost upgrades and alts ?","Don't mind me, just looking at me floating map.","Anyone confirm faction changing with Honorbound/7th Legion exalted transfer over?a","What does a rank do for professions?","What getting killed by $60k looks like","Of all the damn times &gt;_&lt;","Can Blizz please make a mobile garrison app.","Priest Spec opinions","What's the best look/gold/drop% mount for someone who has no mount?","I just became the richest player in WoW.","Profession/Reputation chart for alts?","How's bfa?","netherbane back seated?","Not sure if anyone has noticed, but it's not worth doing bonus objectives(optional bosses) in dungeons anymore unless you have quests for them.","Thoughts on resto shaman?","I guess Severus get his revenge","Tortollan Seekers Emissary - only 2 WQ - bug?","No exp reward for completing island expeditions intended?","Just got back after a few years. What is the best UI and hotkey setup for a Hunter?","Legion vs BFA raiding","iLvl pvp scaling broken for off speccs","So I kind of didn't want to finish this particular quest.","WindWalker Monk","The Horde's targeting system needs to be updated or we're going to lose this war...","ELVUI New player","New Player Question About Endgame","I introduced my gf to WoW just before BFA, I think she is getting a little too enthusiastic.","As Horde, how do i quest in Kul Tiras?","Zandalari Troll unlock requirements","Actionbars issue,help.","I know they said the expansion would be morally grey but...","Right now if I were to do EVERY gold world quest on Zandalar, Kul Tiras, AND the Broken Isles, I would make 2452 gold and 87 silver.","MFW both my enemies and allies call me boy king","Story leak on 4chan - Real or fake?","Blizz should put the unlock requirements for future allied races on revered, or stop time-gating them.","It wasn't a phase mom, my imaginary friends are still around!","Hotfixes: August 27, 2018 - WoW","[Inside Spud]","Blizzard please?","Am I just playing Enhancement wrong?","How does Item Level work for dual wielding classes??","The AH is incorrectly showing sockets on some BoE items.","Does anyone know how gearing for pvp will work with the new season?","3 days ban for WQ abusers","Why is WoW the best Game ever created?","I see your way of getting to \"The Ship\" in Boralus, and raise you mine!","How's the Ret Paladin with 8.0.1 (BG PvP and PvE-Leveling/Raids)?","2 weeks of going hard on world quests, and I can't even get the right hairstyle :(","Island Expeditions recap","Everything is too close","Not enough WQs up to do emissary [EU]","Kul-Tiran human race reputation unlock","I would love to have my Engineering goggles relevant please!","Why can’t a holy paladin wear cloth and wield a staff?","This face my goblin hunter made after using Orb of the Sin'Dorei","Activating a BFA Collectors Edition on an account that already has BFA gives Blizz Wallet and NO character boost.","Cauldron, taxes, alchemist... how are you managing it ?","I guess Darnassus is fine?","Is there any sort of attunement or prerequisite for the Uldir raid?","Ya gotta be able to come up with some better way to gain reputation than repeating the same World Quests over and over..","You're pushing it, Blizzard.","Another reset, another day of no weapon world quests. When was the last time you saw a weapon? 3 full M-0 clears, and crafting capping at 310 ilvl, my only other option seems to be chancing at BoE farming at this point to replace 315s.","Severe faction imbalance in warmode is a problem on RP servers who share phasing.","Random disconects.","New to WOW. Unsure which class is best for my race?","Azerite now but not then... [Lore Discussion]","Don't tell me I can't complain about BFA, my opinion is mine agree or disagree but don't tell me I can't","Best way to use the siege engine in Island Expedition?","Damn it, monster","Is the sound of rifles loading on NPC's in BFA insanely loud compared to the rest of the game for anyone else?","This guy...","This should be Blood Elf heritage armor","BFA Mobs are following you ridiculous levels...","How many of Sylvanas' Val'kyr are left ?","Blizzard Taking Action Against World Quest Exploits","An idea for Blizzard to easily know what their community wants","Is that what world PvP intended to look like?","There is a lack of interactivity with your character especially since BfA","Just found this out.","[SPOILER] If only we didn't get the shitty timeline. Thanks Gul'Dan.","What time do World Quests reset?","The Loa buffs should be permanent until you choose a new one.","Where did Lilian get her back fixed? (The guards at Dazar'alor too)","NPC voices not working","People who have more than 9 toons within one faction, how do you pick which race?","The quest with the little girl made me stop playing last night. And it's freaking me out now at 10 in the morning.","Account XP Idea","Make safe areas (war mode off) around dungeon entries like Tol Dagor","Seems legit","can anyone expain this please? found in vol'dun","Rep Exploiters should have their characters reverted to 110 and forced to redo all of bfa so we can laugh at them.","Disc priest and resto druid differences pve/pvp","You know what's bullshit? A 355 TF not being an upgrade over a 340 with socket. How are sockets worth more than 15 ilvls!?","BfA Fishing","Goblins need a visual update","Weapon trading in dungeon question","Alliance: Are your new Allied Races involved in your intro scenarios/ capital city somehow?","Come on devs. If you're gonna go through the trouble of putting an anvil in the world, at least flag it as one.","War Mode makes the world feel alive!","7th Legion/Honor Bound Rep Grind.","War Mode in unbalanced pop realms","The so called WQ exploit now claimed to be fake","Tanking in BfA","Blizzard hears yeh. Blizzard don't care.","[BUG?]Teebu's Scorching Straight Sword Procc-rate too low!","AH - deposite fees? did blizzard changed something?","I've never been so traumatised by a child","Need advice, help on computer specs (New Player)","I don't know if this counts for Everyone, but for those needing a weapon like me, there is a 330+ weapon reward for doing the Order of Embers emissary WQ for the next 2 days. FYI","Why people insist to write Sylvanus?","I get \"Incompatible\" in the Population Realm while connecting. Are the servers still down from the maintenance?","Hey, Blizzard? What the fuck did you do to me.","New player here! I have a question about dungeon loot..","Flag of Ownership in Feral Forms","This damn game!","AH addons broken after maintenance","Safest ranged bet","Opinion: The removal of Paragon Reputation and Legendaries was a huge mistake.","Seems there was a lot of quest removed from voldun, possibly more story into Mythrax? Or a continuation of Vulpera/Sethrax races background? Did seem the shortest of all the zones.","Many 'big body' mob types seem to have normal HP values after the reset (150k-&gt;50k)","If there is one overworld mob ability that should be able to be interrupted...","Pawn Script for balance druid","[GUIDE] HOW TO NOT GET DAZED EVER AGAIN | MS PAINT + GIFS + EXPLANATION","Spec when leveling hunter?","Need help, world quests no showing on map","On the topic of Daze dismounting and the community as a whole.","Sylvanas Goes too Far","Aduin wrynn","World PVP creates long-lasting salt","As a windwalker monk, can I just wrap one of these cloaks around my fist as a weapon?","Do enhance shamans seemed buffed to you guys?","Tol Dagor - Alliance Graveyard","High End Raiding / End Game Content Podcast","Blizzard \"taking action\" against WQ exploiters.","Advice for lvl 110 hunter-gatherer/miner","New player here! I have a question about equipping items..","The king fell, or did he?","Desperate times call for desperate measures","LPT if you are tired of the water strider","The Glazer - 1H Mace questions","Trade agreeing on something for once","I know it's not even been a month, but since I rerolled my class for BfA, I wish they would bring the mage tower challenge back!","What if... what if the boss is...","How is DK DPS right now?","I love this Community!!!","New race option confusion","Does Blizzard have anything planned for PAX on Friday?","When will we be able to obtain Zuldazar Hearthstone","Who does Bwonsamdi serve?","Open Pvp and random Horde Raids (Question)","A crude solution to the single items flooding the AH.","some thing seems a bit off","Fun and Interactive Gameplay","How is the first raid lockout going to work?","What about some more love for Warlocks","Mod Recommendations","Does “Deadshot” Azerite trait for combat rogues stack?","Wrath of the Lich King main title track performed by the Game Music Ensemble at UCLA","DH glide canceling itself. Possible phasing/sharding bug?","Does anyone remember \"welfare epics\"","New to the game wondering where i should go/what i should do","My BfA experience so far","This app is stupid, just wasted a whole bunch of War Resources","Didn't get 110 boost after getting gifted BFA","New character question","Pet Battle World Quests - Scaled?","At this point the WQ with the turtles making it to the water is such a meme that it is fun","New player in a Dilemma - level 110 boost...","Realm choice","When you really want to play that Dark Iron dwarfs and have no wq left..","WANTED: cosmetics!","Max hit dummy","A raiding community for those who, like me, work on weird shifts","Pins for the Map would be nice.","Is the grind worth it?","Theres no point to \"ramp up\" DPS","Am I doing something wrong? (always getting declined for Mythic)","This is why you keep auto updates on for google maps","Can't see any world quest after realm transfer","Alliance, y u no PvP?","Where to get Wanted! Quests?","John J. Keeshan and my hunter getting really comfortable on their gryphon ride","How much are professions subject to change between now and the next expansion?","Weird question about the Sharptalon Hatchling","All three Alliance allied races are nerfed","I feel rep requirements for allied races is a fail for bfa.","Mark of the Wild","Stuck in island expedition after completing, BUG !!!!!!!!!","@Blizzard please make a hermit crab boss","What's your most memorable instance of \"guild drama\"?","Finally got a weapon from a WQ...","This will always be how Teldrassil looks to me.","What’s with the low health?","Looking for help. Graphics card / driver update. #n00b here","People would complain less about not having flying if daze wasn't a thing.","Why are there so many people still in Legion?","Remember when we were all excited for Legion?","Anyone willing to help me identify a UI frame and the addon its from? Getting annoyed by a frame that pops up every time I get in a group","Am I the only one that hates flying nowadays?","Which tank should I roll next?","An expansion late, but here be an Emmigosa doodle!","Opinion: Writing \"LF x with brain\" probably deters more decent players instead of \"brainless\" ones","[Performance]For those who care I've been feeling something off since I turned DX12 on with my Nvidia card (GTX 1080) and I thought I'd share what's happening. The mouse movement in game, like moving your cursor across the screen, is tied to framerate once you turn DX12 on which can make it feel off","Why didn't engineers get the ability to make a quillbomb?","Most general rant","How to get the different artifact appearances when xmogging?","What causes my bubble to be that pixelated?","just leaving it there for those who didn't know (like me)","The doors in old ironforge are glorious and beautiful pieces of art","Looking to start up again. Advice on healing class?","How do I increase my ilvl from mythic dungeons if I keep getting declined tons of times as 326 ilvl DPS?","The warmode problem","Mists of Pandaria recipe discovery","My current WQ’s give me 5 cloaks on top of the emissary reward which also gives a cloak.","Question about allied races","Man these LFG requests are getting weird.","when does mythic plus come out???","Transmog Question","RIP Drust-Runed Icicle","Is boss loot determined by loot spec at boss death or corpse click?","Zandalari Troll release","Kul Tirans can be so rude...","You can walk into stratholme from the back end atm","\"The deposit for certain tradeskill goods has increased by 20% of the asking price of a single unit.\"","So, I just turned on the sound in this game for the first time in YEARS..","Me: Does Drustvar look like a cow? Worldmap: Perhaps","[Hi rDruids] can you tell me how cultivation talent works?","Heroic Dungeons?","Are refreshments summoned by a mage still useful?","Dark iron dwarves nerfed?","Dark iron dwarf, Mage or rogue?","I'm having doubts about BFA","How does the azerite gathered for the island expedition weekly work?","Why does it feel like this game is always taking away features?","Is enhancement a spec that blizzard didn’t finish?","Doing Pandaria on an alt, and I'm noticing again how fantastic the jinyu architecture aesthetic is.","Anyone know how long they took to get the throne of thunder set for monks?","Trial of the Crusader - What Happened?","Been holding out on BFA .... till now. (Casual)","Is there a reason Demon Hunters can use fist weapons but can't mog them?","What's the best iLvL to reach before completing Siege of Boralus?","Where do I find my weekly Conquests points?","Faction Change","Trouble finding Bfa starting quests on a fresh faction changed allied race","I think Blizz needs to up the spawn rate on these just a little, been like this for about a week now.","Honorbound Rep","My first experience being marked as an Assassin","If you think having a drunken gnome in a beer hat /train for a flight path isn't worth spending war resources on you're wrong.","Herb despawning issue","Does anyone know how i move this some where else on the screen","Leveling Add-ons","One of the best things in bfa so far","Legion LFR","Addon to move all items from bank to bag or vice versa? (or all crafting regeants from bank to bag)","Darkest dungeon quote?","Come on now... really?","Thought to help anchor weed/midnight salmon/war resources problems","Do you miss anything other than rep if you just do instances 110-120 on an alt?","Lag only in new zones ?","Saw Dwaurfang today.","Forced Name Change","There is an image of C'Thun at the last boss of the Shrine of the Storm","A simple request when doing island expeditions: Please help us kill mobs before looting nodes.","Anduin Llane Wrynn","Freehold Disguise?","No Class Hall?","To all the new dark iron players","Remove the cost of reforging Azerite gear, and let us reforge traits on the go. This is ludicrous!","About Mythic groups and Ilvl","Can you quess the location of Blingtron 6000?","Questing in Stormsong Valley be like","What are Warfront's and when are they being released?","What is the logic behind making skeletal raptors \"beasts\" instead of \"undead\"?","Invisible Guild Chat Text Bug","where exactly do you guys turn in world quests?","Knowledge Calculation Q: Difference in AP Gain from delaying turn-ins with AP rewards until after Knowledge goes into effect?","???????","Rogue PvP Spec Question","When you've done the WOD starting area too many times...","How do I buy a friend?","Rejoining WoW and what to expect","Would you be in favor of Blizzard abolishing player factions?","This is what the throne room looks like, when you're dead.","How to maximize AP with the new AK","Loot spec issue","Guys you need to spread out more!","My first thought when taking down Raal, in Waycrest Manor","PetTracker Addon?","The \"Alliance\" does nothing","&lt;Name&gt;, Lord of War Title at 120","Is this a joke now? 2 days in a row 700 gold WQ, wth","Emissary rewards - gold, gold, gold","Is there any way to check which islands I have played on?","Are the servers only down for me?","I am fully convinced the only reason this gap exists is because Blizz realized they made the Horde city so spread out that they had to give Alliance something to complain about","Mobile Range DPS to Duo w/ Hunter","How am I supposed to finish rouge class mount quest if the Under city is full of gas?","Leveling Allied Races","Is there a way to transmog druid skins without having to transmog the weapon?","WoW and linux","New player wondering how to change Guardian Druid skin","BFA Engineering, a ranty review.","Problem with Uuna's Doll \"Nuu\"","Help with DC issues","Standalone 7th Legion Quests?","Anyone else on Defias Brotherhood been seeing this guy just sitting there for the last week?","Blizz, if you didn't want me to be excited about Azerite gear...","Anyone else torn about what to make your 2nd alt?","just lost all urge to play again; another week with being stuck with a shit tier weapon. everyone gets to outdps me now because melee dps, unlike casters, are entirely dependent on their weapon to do damage","How do i get World Quest Gear over 335+ ?","Pawn add-on stat weights","Tiragarde Sound","Warlock damage spec","Demon Hunters can get to some pretty interesting areas.","Faction Change from alliance to horde. Will I have to do the zone quests and war campaign even tho I have completed both on my alliance character","yes this is a little pointless but, why not do it for the memes?","World quest question","Why is it that RDPS are almost always more in demand for raiding than MDPS?","When the Horde see that US Alliance got gear from their emissary quest today.","Suramar quest Giving It All We've Got","I feel like Blizzard thought they where being cheeky and double downing on the hated Turtle quests by trying to make it harder. Only to forget name plates exist.","Class hall?","Alts, Gear, General questions","Trying to get this out everywhere (suggestion)","Herald of the Titans achievement removed?","Leveling 1-110 for heritage armor","Is there something on my face?","Currently fishing with Uuna to take a break from rep grinding, she's loving it","LPT: Use a trial account to unlock the Legion allied races for the opposite faction","Whoever decided that putting a cool down on Flame shock was a good idea clearly has never played Elemental shaman.","best solo non-profession gold farming for rogue?","The Horde truly has lost its honor...","The \"WQ exploit\" was a hoax"]