["Use your PC to help scientists beat cancer and other terrible diseases (and get a custom PCMR flair while at it)!","How has PC changed your life?","High level bamboozle","At the Steam Checkout.","RIP Tom's Hardware","Next gen Cookie Lake","I Think It's Worth The Money.","My new laptop has 2 F9 keys, what to do? Gigabyte Aero 15x","No Formula 1, Those aren't the same things.","I have ghostly goings on in my case",".","RTX looks cool and all...","First build wish me luck!","AMD’s First Gen Ryzen Threadripper CPUs Get Insane Price Cuts – 12 Core 1920X For Just $400 US, 8 Core 1900X For $300 US","So i woke up to this...","After 9 years of service finally gave its last, but not before blowing the fuse in the extension cord. F.","Just got this gtx 1080 for $300!","Nvidia is so insecure about their RTX cards that they're trying to get between their hardware partner's and their reviewers","Times have been really hard since I split from my wife about a year ago. My sons (15) headset broke about 6 months ago and I've struggled to replace it... I am so so proud of him","I just accidentally deleted all the things I had on steam that were on my ssd, heck","Going to PAX West? Come check out the Bi-Annual PC Gaming Extravaganza! Panelists from PCMR, CORSAIR, GAMERSNEXUS and PC WORLD will be there! Friday, August 31st, 7:30 PM, Sandworm Theatre.","The struggle is real.","To anyone saying that can't decide whether to buy the new RTX series or GTX 10 Series. Just wait for the f*ckin benchmarks or if you see a really good deal then buy the GTX 10 Series. Thank you for your attention.","Went with quieter fans. Had to take almost the whole build apart to replace them.","First try at a custom loop!","My little nook, moved into a new house and this is the desk I get. Not much but it gets the job done!","Finally rejoined the Master Race after 3 long years. PC died and couldn't afford a new one until NOW.","My cat started to use my laptop!","That sad empty feeling when your GPU is out for RMA","Which of the 27 top, most stable, non-whitelisted games running on Steam Play beta interest you the most?","Managed to fit 1080ti ftw3 hybrid with le grand macho cooler...","What everyone's reaction to the new RTX cards should be","RTX elbows","One of my old babies","How it feels to troubleshoot printers","My key cap puller with a irn-bru bottle cap thingy looks like the London Underground","Sir, what are your qualifications?","Decided to treat myself to an upgrade today 4K HDR G-Sync 120hz (OC to 144hz) monitor","I fear for our future unless our government can stop this crap","Who knew joining the masterrace would feel this good?","Am I using this format right?","Just picked this up on Craigslist for $650, thank you RTX for lowing gpu prices!","I am some sort of storage overlord. See comments for list of drives.","Why is she gaming on a laptop in her college Lecture? Moreover, why is Intel promoting this?","Never seen someone pointing a heatgun at a cpu cooled with windshield washer flued using an aquarium cooler? No problem, I got you guys.","Upgrading a family member’s broken 256GB intel 600p","Got some cooling improvement for my Palit 1080. So worth it","Remember that first time you went from 30fps to 60? Or 60 to 144? And how it’s painful to play at 30fps now? Well now do the same thing with videos on your PC! (This isn’t new by any means but it’s new to me, and I’m sure many others)","Is the PSU cable nylon or paracord? I wanna buy a custom GPU power and Sata power for my system.","My first Build - Specs Below","After playing on my new pc and going to call bale to play with friends. I literally have motion sickness from the 30 FPS...","Linux: finally running DkS3 - feels glorious and awesome with all these details and FPS!","The true sign of a madman.","Thought I had seen it all!","Looks like PUBG got an upgrade","NVIDIA Controls AIB Launch &amp; Driver Distribution","When you have no internet and start up your pc","Nvidia stops sponorship and demands hardware back after streamer promotes not preordering new RTX GPU's","Sirens","So I started streaming and got this message 2 times, is this bad?","AK Shotty rampage on CS:GO VR","My friend bought me a game. Thanks i guess?","My preorder is in for research purposes","The 2nd best feeling when building a PC. The first is when it boots up ok.","Girlfriend built her first rig today!","Before and after moving my pc to a new case with some added cable extensions.","We gave our teacher a dual monitor setup in her classroom.","Reality isn't shiny enough for RTX, we have to go full Makoto Shinkai.","Still remember these?","What I visualise when my friends say \"AMD or Intel?\"","Rate my setup","this feline understands","I want to get into pc gaming but i know nothing about pc’s","M65 Thoughts?","We all know its true","Anyone know where I can find a temperature chart for some specific HSF on Ryzen CPUs?","When playing Overwatch audio in my left earphone goes a lot quieter sometimes. Does any one know what this is?","Air cooler,stock cooler or liquid cooler","Apparently I still have net neutrality","Nvidia RTX 2080 outperforms the GTX 1080 Ti in this leaked 3DMark benchmark","I want to upgrade my Monitor","Boot loop on previously good pc","Help fixing my fathers optiplex?","Trying to hop in the master race train","A thanks to the PC masterrace","HardOCP: NVIDIA Controls AIB Launch and Driver Distribution","is a 1080 worth for 1080p 144Hz gaming?","The system requirements for the Undertale Soundtrack on steam","This can't be real, right? I found this while trying to fix my fps issues with my new GTX 1080.","I Know You're In Here Somewhere","How to change resolution in NVIDIA Control Panel","Got an Asus FX35VD gaming laptop and was wondering if it was safe to upgrade to 16gigs of ram. It came with 8.","CPU Temperature Support","weird problem with my pc","My dad is starting to get a little obsessed with his RGB","Daily Simple Questions Thread - Aug 29, 2018","I have a freesync monitor should i sell gtx 1080 and get vega 64?","Moved into a new house! Finally have a space to call my own. Obligatory “Not much but it’s mine” post.","How Do I connect my PS4 to my monitor, and how do I change the HDMI?","It just works okay...","Using Klipsch Gallery G-12 as desktop speakers with Sony DH190 stereo amplifier.","My brother and I deep cleaned his keyboard look at my profile for the before picture.","Please help!","Downloading without an AdBlock","Need help choosing a power supply","Glad I changed to PC","Coffeelake build complete mix old parts and new","In need of a new keyboard.","(For all you new Linux users.) Doom art + KDE's dark theme looks amazing!","In Progress build","How big of a USB do I need to install windows ten?","Mechanical keyboards for all!","Building a second PC to take to college.","Time to unleash the beast","Saw this sad image on #Nvidia on Instagram","Gaming webshop","[build tips] what is the best option when it comes to getting a 1060?","Well this is a fat L","Question: Chairs for gaming/streaming usage.","Can't get wireless card on new pc to work","How exactly does water damage work?","Ascending into the master race through The Annihilator build.","Thoughts on this pc","how does my build look? it’s $843. anything i should look to change?","Any who bought the X470 Aprus","Can I get some recommendations for a build?","Is it possible to simulate virtual key inputs as \"real\" hardware inputs?","So my power buton broke and now i always feel like a car thief when starting my pc","1070ti now or wait","Is there any difference between G-sync and Freesync besides that G-sync is Nvidia and Freesync is amd?","How do I clean my keyboard correctly?","Are these speeds normal for a WD Blue 1TB?","What is the best antivirus bootable from a USB","Cleaning my PC for the first time","High end VS. Mid range","Low GPU usage","Thoughts. Cheap External GPU Case options","I recently built a PC, but the display doesn’t work. It works on other monitors, just not this one. Please help!","Rx580 + Ryzen 5 2600","Overclock all the things!","Finished setup. Anything else that I should add?","After putting off so many games, being a console main for 6 years, and spending 19 hours, I finally joined thr masterrace. Gang gang","Computer not fast enough! Get yourself a turbo button!","Are their any Monitors that aren't featured on Amazon or easily searched I should consider?","I’m not sure if this is the right subreddit but...","Need a network expert to explain me GPON vs P2P fiber","look, perfectly good \"raytracing\"","To whom ever joined the pc master race today.","As a response to my previous post, I took off the shroud and fan on the card and saw this.","Bit of a noob on quadro and I got a question","Windows Firewall code exposed","Living the Lefty Life","MSI Optic G27C2 mount for monitor arm","Can someone help with this is issue? It's just a black screen and Ctrl+alt+del won't work","Do I really even need a 1070?","ryzen 7 only has 4 cores and 8 threads?","A story.","Good Free Windows 7 Dark Theme","New GPU and tidied up the cable management a bit","Mouse + Keyboard randomly not working?","Quick build video for those that enjoy. Cable management is trash but I redid it after the video so I could get tighter runs around the board. Ryzen 7 2700x build. If this is against the rules, please remove!","RGB Case Help","What are you playing?","Should i overclock my gpu?","How far can I push this ram kit in terms of Hz and voltage?","Would the Surface Go be good enough for me?","Pc CPU problem","Ryzen 5 2600 Memory Timings Benchmarks? 3200","Pc randomly wont turn on?","Yesterday i posted a post about my top fan spinning slower than others. Here is a video about what im talking about any idea?","This guy is a frickin GOD. I noticed a lot of people complaining about windows 10 updates/privacy so... Here ya go","Battlefield 5 First Impressions On Rotterdam (NEW PC Gameplay) Positive","Budget PC gaming builds under $700","Any place to test keyboard switches near Chicago?","I was originally building a desk pc from scratch but it fell thru after a couple of months so I decided to pick a Thermaltake's P5 case instead. I called it the \"Demogorgan\". (1st post ever)","Buying Used GPUS","Upgrading GPU for AW3418DW","\"It looks the same and it's not overpriced like the other one, you should be thankful for it!\"","Does bios OC not work anymore","Tips on moving from Canada to Europe? (Ireland)","Looking to buy this prebuilt machine. It's in my price range. Advice?","Stay strong, captain!","1050 TI 4GB -&gt; RX 580 8GB a worthy upgrade @ $250ish price point?","Saw a post about how awesome that a 14 year old game an still get 70k viewers on Twitch. This is a screenshot I took before BfA's launch. It is truly awesome that a nearly 14 year old game is still capable of topping the viewer charts, despite those slight controversies about BfA!","Can I install Windows 10 from external USB drive?","How do you rate this pc/monitor combo? Is it worthy of the Master Race?","finally completed well almost! 2nd build in 8 years.","What ram do i need for this motherboard","Is this a red flag?","Friends PC keeps restarting....","Sold my evga 1080 for 450 and got a TI for 610 what a OC beast","Thanks to valve, and all the other groups working hard the last few years, now as a gamer I can officially say goodbye to windows! Only a small small dual boot for rocksmith.","Every. Single. Time","Pc crashing everytime i start a game","So I just wanna hear everyone’s opinion.. do you think it’s more important to water-cool your CPU or GPU if you had to pick only one.","Can't Launch BFH","New mouse arrived compleatly dead what do i do?","PC keeps freezing up and crashing","PSA: Insure your PCs!","Cable less internet","I installed an SSD in my laptop's ODD port with a caddy. Will my laptop read the SSD at it's full potential, or am I doing it wrong?","Transitioning to PC MasterRace from Consoles","Can a 1.5v stick of ram fit in a 1.2v slot","Portable Backup HDD advice","Whats the difference between these two cases","I need a decent headset","Anyone else who has played this game?","AC:Odyssey Map Bigger than Black Flag!","Gaming Chair?","Screen Tearing on 75HZ No Matter What FPS Cap","Finally I have ascended after 7 long years of console","Command &amp; Conquer Mobile is as bad as everyone expected and has Lootbox Pay 2 Win progression.","Gaming laptop recommendations","Resrarted my pc and got an error message","Bloody Optical Switches","Why buy one, when you can make one!?","Acer's upcoming laptop with a reversible 4K UHD touchscreen and G-Sync","Bottlenecking?","Achievement Unlocked","Are these part capable working together or should I change something","Companion end table/stand for mid size desktop?","RX 480 crossfire?","Oh, it’s beautiful","I Require Assistance","trying to find a good €500 PC.","Can someone please explain to me technically how China has managed to block VPN's?","HELP - Next-Gen Build planned for October","The first ever PC I got to use, a Dynalogic Hyperion, considered one of the first ever \"portable\" computers, released in 1983 and made in Canada, its CRT display had 12 shades of amber, it had two 5 1⁄4\" floppy drives, and ran H-DOS with a unique F-key menu system","Is there a solution to this issue on my friends computer?","The Universim Gets It!","Friend wants a prebuilt PC around 300-600$, any recommendations? (he's not in a position on where he can build it unfortunately)","Windows updates in a nutshell.","Made this myself after being inspired by someone on the r/Breath_of_the_Wild subreddit","Ryzen 2400g + more Ram","16\" 60hz monitor vs 22\" 144hz monitor","Does anybody else not like the looks of the EVGA 2080?","Input lag when i startup the game which goes away after an hour!?","is this a good build for the money spent? first build, will everything fit in ok?","AT&amp;T-backed robocalls tell seniors net neutrality raises phone bills by $30. Robocalls spread misinformation to seniors as California votes on net neutrality.","Will a 1070 or higher graphics card fit in a HP Pavilion 690 0067c? I'm already getting a better PSU, so I'm just asking if it would physically fit.","Is there even a point in running Cinebench knowing it will be disappointing?","Can anyone tell me what this card actually is? (Advertised as a GTX650ti 2gb ddr3)","Work around when WiFi blocks mobile devices?","Need help to build a pc for fortnite and other games like overwatch cago etc.","Cyberpunk 2077 Gameplay reveal in glorious 4K","Rate my build","I only upgrade my GPU once every 5-6 years, in the mid-range market (~£200). Do I buy a 1060 6gb even though it's two years old, or wait it out a year more?","PC back panel audio issue","Razer vs Dell","Sometimes, you just can't win","You vs. the guy she told you not to worry about","RTX 2080Ti Battlefield V RTX On IGN video","Bought a faulty PSU, need replacement suggestions.","Mobo died?","Check out my setup. Believe it or not it’s a vast improvement to my last one.","Need help choosing mouse","My cpu cooler standoff’s are fully on, and it’s very loose after uninstalling stock fan and backplate falling off.","Ram slot to m.2","GTX 1080 or RTX 2070?","USB hub with low latency for gaming?","Is triple monitor setup worth it?","\"Students, please clean the computers from the lab\"","I need a pc for video editing, nothing fancy and as cheap as possible. What should I look for?","Corsair messed up my order. Got 2 fans that i shouldnt have.","FPS issues","After 8 years of owning a shitty laptop and playing on ps3, back in April 2017, I decided to join pcmasterrace. It’s all I have for now, but since I found a job, I have some plans for upgrade.","woah, thanks konami! Great sale there!","Best Coffee Lake Motherboard","Updated Battle Station with custom desk","Cant remember pc case name","Cpu and Ram Bios Settings","PCMR LPT: When assembling your system, run additional power and SATA cables for when you need to add additional drives.","does 4x4 gb of ram have any problems?","GPU for Gaming and Encoding?!","Office Chair / Gaming Chair - What's the best?","Why am I seeing a lot of people move to Linux lately?","Post-silicon?","Finally upgraded my Logitech speakers to these Audioengine A2+ speakers. And now my setup is complete. Finally upgraded that crappy mouse mate as well to something more appropriate. Let me know what you all think","Can you use this to over lock","Any love for vintage hardware?","In FPP, what's your Horizonal Field View preference?","Does anyone know a good keyboard &amp; mouse bundle on amazon, Or any cheap decent gaming keyboard and mouses?","Push and pull fans of different brands and rpm","Finally upgrading","When does a HDD start showing signs of failure after being damaged?","Hey! I wanted to show you a short trailer for our upcoming game called Re-Legion. It's a Cyberpunk RTS where you become a Prophet of your own cult. Tell me what you think","How are Nvidia drivers lately?","Regional Sharing Games","Shut down the system on Saturday and it never started again. RIP he died young.","Fellow PC players. What do you think is the symbol for PC gaming.","Need help building a vr ready pc!","Should I buy The tazer blackwidow V2?","Anyone else have that one stupid friend who thinks he knows everything there is to know about PCs!","Is it worth replacing my i5 6600k with the i7 8700k. I have a gtx 1070 along with my i5 will changing cpu show any improvement in performance?","The itty bitty interference photicity","Laptop with no TB3 - Can i still attach external GPU's for rendering?","Intel - Anti-Competitive, Anti-Consumer, Anti-Technology.","Damage capacitors.","Laptop keeps failing to update","Scored an ASUS ROG-G551JW FOR $150!","Could someone please tell me the size of the Dell Optiplex 3200 SFF's motherboard?","Wi-Fi Adapter Issue","To celebrate getting 1000 subscribers, I'm doing a Steam Key giveaway! Guess my favourite colour to get 2 keys for games I've worked on!","My spacebar broke! Does any1 know how to get one?","I did the best I could. Second desktop built","Blizzard disables paid loot boxes for Overwatch and Heroes of the Storm in Belgium","XBOX ONE controller with DS4 wireless adapter.","Opinion on the ACER kg271b?(Gaming Monitor)","How likely is it for windows update to break my pc","Looking for a new keyboard to buy","I bought an HP 8300 small form. What are the a couple of choices for small form video cards I can buy?","Can I use Gtx 1070 with my i5 6400t processor and gigabyte b150m d2v motherboard?","I need help configuring my new rig.","Thoroughbred cat","Saw this walking back from a meeting at MUSC in Charleston, SC. Thought y'all might enjoy it.","Is the Surface Book 2 the only 2 in 1 with a GTX1050 or better?","Acer laptop BSOD loop","Beginner's Guide: How To Install Ubuntu Linux 18.04","Yeah, I watercool","Optimising Windows 10 after 1 year of use","Decent $25 gamnig keyboard/mouse on amazon?","Best laptop for 1100 dollar","I've started having problems with my drivers. Which driver installer do you recommend?","Does anyone have the best build for a budget of 1200 dollars","5x120mm fans connections in Asus H81M-C Micro-ATX Motherboard?","Amazon won't let me buy more RGB","My setup","What do you think of this ~$600 PC build for a friend?","Ey MSI do you think you’ve overdone it with the thermal paste a little?","Predator Thronos – Warp Your Reality (Acer gaming chair)","Fan speed control","Half Life 3 Project Borealis tech demo announced and coming soon | DSOGaming","HW News - Tom's Censorship, NVIDIA Dumps 10-Series on Partners","This is out of control, now my company is sending me RGB emails!","Sacrifices for better Laptop NVME SSD Temperatures","inverted ATX cases?","Pc keeps turning off and on","One of few great things about Windows that still hook me to the OS is....","Ryzen PC start up issue","Fuck you for this, Activision. Not like I just want to play old Zombies with my friends or anything.","My 2007 Rig from back in the day. I miss her sometimes. Thousands of hours of FFXI on this. i7-920 on an X58 Platinum SLI 12GB of DDR3 1600Mhz OCZ memory and an EVGA GTX 275 896MB SCC. That Thermal Take Element G case babay!!","Made some changes to the battlestation yesterday. No 100% complete but I'm excited with how it's shaping up!","Fortnite low gpu usage causing lower fps","And now the fun begins","Issue with Nvidia Surround","Free RainbowSixSiege Test severs code","Okay so i need help","Opened up my keyboard after spilling some water on it. Snapped a different view of it while it was open!","Need a Peer review for my pc build.","Best gaming/streaming cpu?","What kind of motherboard should I get for this build? Any other reccomendations would be appreciated, first time on here","Back to college!","second build","First time buildinga pc, anyone know if this will kill my GPU?","Just build my first pc and wanted to know if the ram is okay with the fan against it?","Is it worth it to get 12gb of ram?","Anyone need help picking out parts?","Guide: How to make steam download using 2 internet connections at once","For anyone looking to hardmod their PC but not sure what tools they need, Dietec has a great video on how to start","Will this case be good enough for cooling(Fractal Design Core 1100)","\"Why are these fans so loud?\"","Just a hello and my small setup!","Upgrade questions from 1050ti and i5 7400","They really knew there audience.","need advice please","Gaming on a Budget - Rate my Setup.","PC power issue","Headphone suggestions","Transfe files (OS+everything else) from HDD to SSD - what’s the best software? Non-Samsung","posted on r/battlestations, just wanted to share the fact that I have ascended!","Question about new rig","Do you ever run out of good games to play?","Building a new pc out of my old components for my mom. Anyone know where/how I could get a cheap mobo and processor? Also need advice","Quick question from a pc noob","Everybody complains about Windows 10 auto update, but let's not forget Windows 7.","My PC puts Las Vegas to shame","Buying a PC","SSD help","Rate my trash","First build, couldn't be happier!","Nvidia ANSEL not fully working","Earphones Vs Headphones","Will this pc be able to Crush Esports games at 1080p @144hZ","Games plz","Disk always at 100%","We’re gonna need a bigger screen","I'm new to the PC Master race. So I'm lost into what is it that my Samsung 960 Evo m.2 does for me, I downloaded games but they all went to my ssd and my m.2 is empty. It just have computer fundamental programs. Can someome explain to me how is this thing supposed to work","How do I get rid of this issue?","Speaker recommendations?","More proof of KSP on a non dev mode chromebook.","Need Halp!1!!","What are some other games like this? (aim based time trial games)","GTX 1080 with a 2400G?","(CSGO) hudweaponselected.swf Corrupted","Big boss really let himself go","[QUESTION] Is this an efficient way to measure mouse input lag?","Can I run Sea of Thieves and Fortnite?","Is my graphics card DOA?","Its not much, but it's mine.","Is my PC using more power than the PSU can provide?","Best HDMI to PC?","Upgrade help","If I hypotheticallu had a high-end PC with. 2080 ti and Intel i9 and very good parts, would I NEED water cooling?","Daily Simple Questions Thread - Aug 28, 2018","Recently Saw A Pretender To The Title Of \"True Fallout Case\"","How can I help my younger sister get started on pc gaming?","Help with Nvidia Custom Resolution Support","Best Desk Chair for a Tall Boi?","Any good cases with no glass panel on the side?","Won Intel's Sweepstakes. Took awhile but it finally came! (Upgrading from an FX 6300)","Wireless dual shock for pc gaming not working.","Could zfs kill boot ssd? (Read entire post)","Got a 4K/VR ready case, can't wait for the fps boost","Magnetic RGB Strips Inside of Case","How do PC player manage their sensitivities on a wide variety of games?","Acer B247Ybmiprx experience?","Replacing gpu with a new one, is it a necessity to uninstall old drivers?","PNY CS900 vs Kingston a400 reliability?","Galaxy Note 9 Desktop eXperience. Not exactly a PC, but still impressive!","Looking for \"low\" graphic card","Ryzen CPU better than i7 8700k","What’s a good addblock?","Is it normal that my overclocked 8600k is 60c when i play games","EA support is great","can I game with a Barco DC MXRT-5600","This has to be the worst cable management I’ve ever seen.","My setup got completed yesterday (for now, of course) rate my battlestation!","Humble Bundle Giveaway!","Windows stop code and (potentially) frozen on BSOD","Home built LAN center in progress for service members here in Japan to better spend their time rather than drinking.","Joined the master race today. Thoughts on first build?","In the process of building my first computer. Do I have to plug that blue thing in for the fan. I have it connected to the power supply already.","Does this count as PC gaming?","Ryzen 1200 enough for 290x?","Windows 10 cheapest option?","Prices for last generation GPUs","CPU + Motherboard Bundle $414.35 Including Taxes Good Deal?","Windows 98 SE Gaming Rig: Dell Dimension 4100. Will an ATi 9800 Pro work?","spec requirement for web design and android app development","Need help choosing mobo/ cpu combo","What happens if I reinstall Windows on my SSD with stuff in it?","200$ for i7 8700 no k good deal or wait for the 9700 ?","Ergonomic desk chair?","Don’t know how to connect my pc to tv","Do you guys think RTX 2070 will outperform 1080?","Cheap and powerful gaming rig or bust?","Help bulding a new rig","Just spilt vodka and coke into my Razer Blackwidow keyboard. Is it done for?","I have cable spaghetti pls halp","ssd question","Made my SSD a boot drive, nothing on my old hdd works","Will these Cables work with my PSU?","Remove heat sinks","PC just randomly restarts","Can anyone show me a motherboard that looks like this but only has 2 ram slots on each side","Forgot to put a desk in the budget...","Evga 450BT vs GTX 1080","PAX WEST Panels on PC Hardware: PCBuildFight - EXTRAVAGANZA - Build your own RIG","Is it possible to go from a 9 pin port on a tv/monitor to a 25 pin port on the PC? If so, are there any drawbacks?","Is this what it's like without adBlock?","Rate my battle station","Which streaming tool has the lowest FPS impact and network stutter (Mixer, GeForce Exp, OBS, etc.)?","Opening a .bat file","I plan on putting this together for my first build. Any input before I pull the trigger?","Spotted in the wild, someone has their priorities straight","Orwell Steam Key","Looking for help finding a new monitor, please:","How to downsize pc","Is the 8th Gen Core i5 8400 good?","Any good cpu for my motherboard??","Should I upgrade to a 1080?","Should i buy Rust?","What are some good ways to decrease your PCs temperatures?","Decided to make my PC cyberpunk 2077 themed after seeing the gameplay reveal","Can't reinstall windows 10. Been trying to through the media creation tool however I keep getting an error. Can anyone help please.","Steam For Linux Adds 1000 Games In Under A Week","I would like to build a decent gaming pc. What would my budget look like?","Trouble shooting dissasembly; thermal paste was touching the mobo, was that my problem? is the pre-applied thermal paste from Ryzen 7 2700x conductive???","Looking for software that will turn off my PC even when some running software makes it unableto shut down PC (the common thing that requires another click to confirm shutting PC down)","PSU cable only has 6+2 cable, GPU has two 8 pin connections. What do I do??","Steam idea","Which cable is better for my main gaming monitor?","Swapping mobo in a HP Omen 870-224","Low performance","Thinking of changing to team red","This was my PC for 3 years. In her last year she got a case","I ran a Minecraft server on a Thinkpad with a 233MHz Pentium (Game is running on modern computer)","Anyone using the Steam Link? Some games lag on wired network.","After watching Linus talk about \"Blowiematron\" fans that retail for $55+ And someone posting about these mega fans for a lot of money. Popped over to a local shop and picked these fans up for between $1 and $7 each. can they be used in a PC? And how much do you think they retail for?","Backseat gaming cat. She never really helps","Does every ssd fit every motherboard?","Looking at gaming laptops, any recommendations?","Is there Modern Modded Drivers?","Question: Ryzen 7 2nd gen with old B350 mobo","Is this cable safe to use or should I look for another option? for new GPU, but only having 6+2 pin on PSU.","MSI apache pro RAM upgrade","Nvidia RTX Deep Dive","Are there any major differences between brands of 144Hz?","Best AIO for Threadripper 1950x/2950x","Why do my fans not seem to blow air in or out?","The Persistence of Memory","Does the 970 still hold up?","1070Ti barely getting 60 FPS in Skyrim: Special edition, and similar low power games.","New motherboard help","Best place to buy a gaming pc?","Trying to build a pc","Battlefield 1 and Rainmeter","Is my psu good? In win 750w premium","Ah The Memories","Excited About My First PC Build","Anyone know a fix for this on windows10","What can I use to clean all this up? (Including the peeling plastic layer infront)","[HELP] Can i use EVGA 6+ 8 Pin cable and a regular 6+2 cable with a GPU that needs 2 8 pin?","Linus recommended me this. The Fifine K669. Just got it today!","Tell me, how's it pronounced?","Best PC Cooling","Best budget gaming keyboard","[Help] My screen stutters and my PC is slow when I use only one display.","Bypassing extended warranty purchase time?","Need help with windows 7!!!","Audio sounds horrible on headset until i reboot.","Midtower recommendations","Help","Rate battlestation","So I tried running Assassin's Creed Origins On Integrated Graphics Interesting Results (Not Really)","soldering skills","Would a 400w PSU be good enough fora gtx 960 4GB","Can I copy the DVD to USB drive?","ASUS GTX 1060 6GB Turbo","HELP! My computer crashed whilst playing WOW and I have a raid tonight!","Small question","The Witcher 3 Can't Run at Ultra Settings on GTX 1060 SSC 3GB","Worth upgrading from an i5 4670k?","Sades L9 Issue Please Help","Dwm.exe starts running mid game which causes fps drops?!!","Will this work? 8+6 GPU - or do I need a new PSU?","I'm moving from Ontario, Canada to Ireland! How should I move my computer to Ireland?","I just got a new PC and I dont know how to use my hard drive.","Gpu suggestions 100 bucks","Half Life 3 confirmed for 2077?","Couple of questions from a newbie","Leggo Board at our school","Buying/building a cheap PC...and upgrading it later ?","Monitor","Rejoined the master race","24Gb DDR3 vs 16Gb DDR4","Why does it look like 1 fan spins faster than the other while system says they are the say RPM? Is it because rgb?","Is there a performance difference in pci slots.","Can't solve shitty internet","Light setup for desktop","Does a proper AIO GPU water cooler exist?","I know this is basically a long shot, but I have a Brady PR300 plus label printer, and I can not for the life of me get this thing to print efficiently.","4k monitor randomly stopped letting me display in 4k....","So my brothers pc has poor connection to the internet every time he tries to play a game. I’ve tried different WiFi adapters and none of them worked","After more than a decade, I have finally beaten Windows 7!","Complete World Map of Assassin's Creed Odyssey !","Is my motherboard dead","can use old cooler from i5 3570 with a i7 8700 ?","Quite the upgrade!!","Best Full ATX PC case","What Adblock do you use?","So, my pc was getting kinda hot and slowing down...","Just got computer out of storage in Ohio (it was there from May to now), and now it won’t turn on.","When the “budget” build gets sabotaged by /r/buildapcsales","Compatibility Question","Can you program a keyboard to display health ETC?","IBM keyboard","(OC) This 4-second clip with ray tracing took me 16 hours to render with a GTX 980. I can't wait for those new NVIDIA cards...","Just had the weirdest mouse issue","Hi im kinda new to pc gaming and have been running on the same laptop for about 3 years and i would like to build my own pc","How are my PC Parts?","Jay Testing Spectre and Meltdown Slow Downs with Skunkworks","Very loud PSU with 1080ti, upgrade needed?","Picked up this sweet 2006 Dell XPS laptop. Currently playing GTA: SA with no problems at all.","Dear nVidia, how about you don't update drivers while I'm literally in the middle of the game ...","First timer: Successfully delidded my 8700K","Monitor suggestions for FPS / Photo editing. (x-posted)","Non-tech guy here, what's so special about \"real time ray tracing\" on the new nvidia card? Hasn't 3D games been using that all this time already?","Experience with Logitech customer support?","Found at girlfriends parents. Rate my.... what even is this?","Permanent GPU throttling but clocks stay at max","Low Performance","Cables. Cables everywhere...","I'm about to upgrade my graphics card from a 1060 to a 1080ti. How should I handle the drivers?","Low FPS with GTX 1070 - driving me crazy","Hello, Need help with connecting pc with laptop with hdmi","Help selecting a cooling system","Ready to build! (Complete amateur)","How Microsoft is cutting through the noise to create a more useful, beautiful 'sound world'","PCMR flex","Found this relic at my dad's place. Got it working after messing with the BIOS.","Help a new student out? What is the best, most affordable laptop just for schoolwork and browsing on the go?","Everybody after CD Project Red's gameplay demo today","First PC Build - Gaming/Music Production","Headset, and a keyboard","Pc?","Google opinion rewards doesnt know me too well","Not that this is a bad PC but anything on Ultra with 100fps? Uh no.","RAM speed on b450 motherboard","Can someone help?","I’m having trouble with my computer.","Which PSU do I need?","Question About Integrated Graphics","Born-Again Gamer","Need help:Replace Stock 60 HZ TN panel in my ASUS FX60VM(Asus ROG Strix GL502VML Series Notebook) with 120HZ panel","I love my desktop to death, but miss the 'loungability' factor of a laptop.","things to know - if you want to switch to linux (imho) at the age of proton","New PC build","Is a 31.5” (4k) overkill?","AMD or Intel?","When gaming, the fps suddenly drops by 20 fps?!","Steelseries Rival 600 VS Rival 310","I'm happy for the new generation that dont need to experience this pain in the ass.","Desk too high. Any tips?","Finally done...","An 11 year old game still capable of this","Dedicated room for League of legends LAN party, at my high school.","Good cpu and motherboard","Build Help","I present to you... Wildfire (My new £750 gaming rig)","Looking for a valueable 500GB SSD","Cheap RGB???","Guess who got an Alienware 15 for €100","PC sleep mode not working","Witch evga to get","Best tools or methods to cut acrylic front panel","Finally upgraded my mouse!","Is Linux Gaming Finally Practical? - Proton and Steam Play","Need help choosing CPU.","Video editing/gaming PC. Not gaming in 4K, just editing. Gaming in 1080p 60FPS. Budget is $1300","Noob Question for the Master Race","Do you use macros on your keyboard?","Send help... I have no idea what im doing.","Buyer's dilemma - 8300H vs 8750H?","One more required and I think I’m there. The graphics card... Not Tamatoa...","Gpus prices in 2019","This the build I might be getting In November, Is the Motherboard good for it?","After losing my computer earlier this year to a mishap with my 2yo and some Appple Juice, I've finally rebuilt. I present The Phoenix Project!","Using a USB drive as a windows media install drive...","Is the HP Z400 a good option as a bare minimum text rig?","Atari announced they are gonna update one of their triple A titles.","Faster speeds, but much higher prices. Looks like Nvidia chose a bit of both","Why wont my pc work?","Getting A 2nd Monitor!","Need to Upgrade My Sound Experience","cant get heatsink pins back into place on mobo","Cable management tips","New fans and case","1080 TI Ebay sales or wait for benchmarks for 1440P?","Missing setings on win 10","BF4 low FPS capped?","It's a celeron keychain everybody","I keep a small amount of memories in my drawer at work.","I just reset my pc and tried playing several games like Overwatch and LoL but all my games are capped at 60FPS! Guys, I turned V-Sync off... Specs: i7-7700, 16 gigs ram, 1060 3gb","Will the 1080 Ti be future proof for VR with a Vive regular.","Got this for $550 ... Good deal ?","This guy explains the truth behind overpriced motherboards and the technicalities behind them - I think more people should be made aware so that in a hope that we get a better value for money/efficient components.","Your gaming setup is whack","What is a good CPU/GPU to be able to run current titles at 1080p, 60FPS?","I cant play fortnite because of this who knows what is this and how can i fix it?","My Current PC build","Noisy CPU/Radiator fans, even when not gaming.","Someone put a single frame from Doom in 'Who is America - S01E07'","My light blue battle station.","Would a 5ms response time monitor affect my gaming?","PC midrange Build","upgrade when/what","Why are my radiator fan producing so much heat but every other fan pushes out cold??","Helped a friend setup his new battlestation. One of the most satisfying things I have ever built.","Help Me Build My Setup: Mouse, Keyboard, Headphones = All Wireless","Ryzen 5 2600x stock cooler","Two Flash Drive Problems (Recovering Data)","Is this the upgrade? I think it's an upgrade.","My build in it's final form... for now","Ryzen for EVE Online","Found in CEX is this a good deal","How long do you reckon till gtx 10 series cards drop in price?","The rig","Xbox controller volume and mouse functions on Windows 10","Pc got virus-infested after downloading a wrong torrent. What do I do after scanning it and deleting all the stuff antivirus finds?","Is the GT 1030 that bad? Lol","I have some problems with NFS Payback","Is SMBv1 really that risky?","Really happy with my new setup!","I downloaded something and opening the file did a whole bunch of shit to my computer... Help","Virtual 7.1","What's your experience with sound bars?","for those game devs out there i got cool idea","Fps suddenly drops by 20 when playing fortnite?!","THE GREAT GEOMETRIC MULTIVERSE TOUR, my first game released today on Steam! Giving away free keys to anyone who likes mindless fun, roguelites, arcade/bullet hell shooters, or anything in between!","Not even allowed to queue anymore without a distraction","Advice about Pc componets","Progams for Games on PC","PC Issues","Waiting for my precious.","Finally the mines have stopped!","Why developers don't remove Denuvo even after their games are cracked","Alt tabbing out of any game makes mouse speed faster?!","I have found a problem with GPU upgrading.","Can i put 2133 mhz ram into a 3466mhz mobo? And does a 2xx &amp; 3xxx work with a 6th gen i7?","Help me choose a monitor","So...my monitor keeps flashing the 2k games logo...","Intel or Ryzen","My hands and arms have been hurting while typing latley.","God bless the PCMR","When Windows 95 Plus came out, I stumbled upon a video file of a clip from Happy Days, it was the first time I had ever seen a computer play full motion video, and I dreamed of a future where we could have thousands of episodes, of thousands of TV shows to pick from right at our desktop","Get a Ryzen 7 2700x or wait till 2019 for Zen 2?","Pink and White Build","My setup at work is pretty nice... (albeit messy)","The hardest stutter to troubleshoot","My new battlestation!","Props to AC Origins for being multi-threaded!","I5 8600k perfectly fine for streaming?","Good old times","Can I use the audio on an Nvidia card without Nvidia drivers?","Is the Insignia 24inch 144hz monitor any good?","Overclocking Help","Games where it is fun and fluid to just move around the world?","Buying a new monitor","Need some help upgrading my build.","Main Monitor Black, Second Spazzing out with Colors.","PC taking longer to boot.","Thought I'd add it back to the setup (PowerLine Ethernet)","New Build","I love dslr cameras for these kind of pics","My next instant pre order will be","Is it still good?","[NSFMR] Rest in peace, sweet Prince.","Sorry for poor quality (and sorry for buying pre-built)","Cyberpunk 2077 48 minutes gameplay!","This is fine","My simple setup (WIP)","Witcher 3 having odd framerate dips","New gaming laptop","rx580 or 1060ti","Getting married next week. She's a goldsmith and surprised me with 'CPU' cufflinks on my birthday to use on wedding day.","When your PC becomes the ultimate console","Power supply has two 8 pin connectors for a GPU. My gpu only has one 8 pin connection. What do I do?","Wireless Headset Recommendations?","Cleaning out the closet and dug up this classic, solid copper!","Sons first build","Why Does 60 FPS Look So Bad Now?","Undewhelmed with 1080ti","Budget build? (Not for me)","My mildly janky/budget setup. It gets the job done though.","Taskbar thumbnails are way out of place, how do I fix this?","Using Three Different Monitors with heavily different specs assistance","1060 or 1070ti?","Premium VPN?","My gaming partner","Is the Switch Pro Controller good for PC?","Beginning my climb into the clouds","Free game keys for new pc builders!","Dumb question but should I get an rtx 2070 or the gtx 1080/(ti)","What do you think of my battlestation?","Water cooling and RGB RAM in 2005!","Can I Run Chivalry?","Is this a good monitor? My friend recommended it to me. Looking for something 1440","First pc lookin good","Help with GPU Instillation","First time posting in here, but very proud of my first solo build. Have I made any mistakes?","1080p but 100% Scaling (instead of 125% default)","The power just cut in my flat, could that damage my PC?","Good review site/YT channel for PC components/peripherals reviews","I finally completed my battlestation!","Display and Build Help","Added an AIO. RGB Zen Euphoria achieved.","my first meme ever.","My new pc, a laaaaarge investment. Ryzen 2nd gen 1070ti and a really glary sidepanel","Gentlemen I need help my laptop screen is all messed up but when I plug in a hdmi to it it works perfect ...help please","Media will 100% blame that shooting happened at game event on gamers.","Using desktop monitors, mouse, and keyboard for laptop?","What do you think will be better the rtx 2080 or the gtx 1080ti","I bless the rains down in AAAFFFRIICCAAA","Getting the PC Room set up Slowly","Cooling question","Upgraded to a GTX 1070 today for an absolute steal of a deal","Trying to buil my first gaming pc budget is 1000-1200 mostly wasting money on Black Friday and Christmas need help on what to build","Is there a headset that works on the Xbox app and allows me to talk in other steam games.","will this desk work? 3 24in' monitors on a vesa mount and a 10 inch desktop","Cablemods psu cable extensions","Is this website legit? I just want to know.","Pc turns off immediately after turning it on.","Daily Simple Questions Thread - Aug 27, 2018","Ati radeon 6870 overheating.","Higher-end Gaming monitor","My first WC build!","Its me, again, i had post about adating asus conector to usb as said here, https://www.reddit.com/r/pcmasterrace/comments/9adj4n/hello_i_know_this_is_not_best_place_for_it_but_i/?utm_source=reddit-android , today i taken it apart and found this (photo), so atleast on hardware side is it possible?","Internet Issues","What to do with 12 IMB model M keyboards?","Repurposing an old Pentium D as a keychain!","Switching from Ryzen to Intel Question","Bad audio after new gpu","cant find what my graphics card is? 7700 RADEON series","1950x two threads unstable","Brothers, computer shops in Udine, Italy?","[Serious] SLI GTX 1080 TI and soon 2080 TI, what do you do for living and how long you actually play?","What’s a good temp a you should be at when overclocked?","Found this absolute beast lurking around our office!","My Frank Lloyd Wright Inspired Case Mod","how to clean blower fan on 1080 ti, its been running a few C hotter from 76 to 81 over the year n half","Monitor suggestions","SSD Help needed","[OC] I put in way too much effort for this meme.","Can I get some help zip tying fans to a gpu for a 0/10 DIY person? And a 2/10 on gpu knowledge?","Booting up my first custom build but keyboard isn't working ( sorry if wrong subreddit )","TridentZ RGB 3600 CL 18 vs 3200 CL 16","[Giveaway] - Old huumble bundle I forgot about","New GTX 1070 in system and monitor won’t detect signal","Hey PCMR, I'm back again from a few hours ago, this time with my PC built (yeet) any advice on cable management?","Is this PC worth it?","Does having windows open/utilizing the GPU on a low refresh monitor drag down the rate of a high refresh monitor as well?","I love my new pc. Sorry about all the messy cables.","Ever wondered what ray tracing really looks like? Yup, it's an IKEA catalogue. Nope, most of the pictures aren't photos. Try to guess which ones.","Internet connection","First Gaming PC","Please help! I have a few questions about laptop specs!","know a good Low wattage high efficiency PSU?","I took a meditative painting class. SO asked if it was supposed to be an abstract Windows XP background.","Local pc parts store gave me a 1050ti after my 970 died and still had warranty","Ingenious or just plain out dumb","60Hz or 144Hz on monitors?","Long life to PC Master Race","Steam recognizing an external download?","Moving Steam games to SSD and retaining settings","Need help with plan B.","Easy way to move windows","First time build, having concerns with parts list","Samsung C791 monitor has no sound","I'm not sure if this is the right sub for this, but I need help with mic volume.","Will this connector work as an 8 pin power cable for my rx 580?","*beep*","Any builds for $600 or INR 40,000","Console To PC Switch","CPU doesn’t fit “snug?”","Guys, I don't know what to do.","When it is winter.","Can someone tell me what is this?","sneaky boy","Is OS to hardware compatibility a common/actual issue?","Hardware bottle necking.","EAC causing issues with 2 games","Wii emulator for gaming laptop.","Watercooled GPU repairs/Testing?","120mm vs 140mm case fans, what do i buy?","Windows 10 freezing &amp; usb port issues","Advice on rebuild/update","Looking to hold gaming tournament. Any thoughts?","My old setup","Laptop Crashes during Gameplay randomly.","Delidding fail","(Question) Need help with changing the rgb on my mouse.","Any advice on this build?","Halp","A quick question about ventilation.","Need advice","Unpopular opinion but windows 10 is good.","I bought Star Wars Battlefront 2 on sale and this has been my experience so far (PC)","Having issues finding the brightness setting for my monitor.","Life is short.","[LFH]looking to get cheap gaming headset","I got bored and got my 8600k up to 100th percentile on UserBenchmark.","Not detecting speakers","My Core 2 Duo E8400 - F","HELP! Cpu light come on and i dont know why","Need a gaming laptop suggestion","Tenkeyless or full sized?","FPS help","Does anyone know anything about Orbitcore? I'm having trouble with my psu","How many motherboard PCI-E pins does a GPU actually need?","Graphics Card Fit Question","1080ti or 20xx?","Low-Cost PC Building","You kinda cant tell but the screen us flashing green bas all over in only happens in some games any ideas on how to fix it (at a friend's house)","Didn't increase voltage but overclocked 200mhz - GTX 1060 6gb","CPU Cooler Clearance Question","I'm about to make a second PC for a friend of mine, using the same parts from the first PC I made for myself, however, a certain case is being discontinued...","My “bang-for-the-buck” themed setup.","1080 to a 1080Ti and added some LL fans","Do I get FFXV?","Run 32-bit CD program on 64-bit pc?","Hardware Preordering on Neweggs Canada","Hearing myself while using Mic","DualShock 4 via Bluetooth behaving weirdly with Assassin's Creed Origins","Built my First PC ever yesterday! I am finally part of the masterrace","Should I get an Acer Aspire 5?","RAM upgrade BSOD","New CPU upgrade ideas","My hard drive won't work","Cases with front panel HDMI port?","How do I turn off the keyboard my laptop but still have the one connected work","3-pin to 3x 3-pin","What happened to the FB page? Pretty sure this is not Master Race related...","New GPU","dark rock pro 4 vs AIO","Are AMD cards still ok to buy today?","My desk is small but I like my wireless setup","WiFi problem","New Pc Gamer","Just installed Kubuntu on my PC. Love the design! Thanks Steam Play for breaking the Ice!","Im going to be ascending very soon; I need some tips because Im nervous as fuck.","Curious about ryzen upgrades","Desk Recommendations","i7 8700k @ 5.36 GHz, stable -Watercooled , non delidded","Recommendations for PSU cable sets?","i found a new 1080 for $430, too good to be true?","Advice on a Monitor","Going to the mountain this weekend, just got the basic to start a fire","Yellow Keys","Might not be the best. But \"as long as it holds\"","Can you recommend me good gaming headsets?","New Case!! Thermaltake's P3","Cost estimate","RAM Prices","New graphics card","just got my new headphones, can’t wait to open them","CPU fan was failing to respond to speed control. Failed to boot after a week, no fan spin. PSU BIST passed. Looked inside and found this cracked die. 2016 Dell Inspiron 3650, all stock. Would be immensely great full for any and all help.","Need help picking a monitor","Will NZXT be having a Black Friday sale? I want to possibly get the Kraken x52.","Corsair 570x and LL120 Motherboard Compatibility","Dual monitor beginner setup questions","hi r/pcmasterrace","After months of waiting and an upgrade I got access to Geforce now","First build thoughts?","My Laptop wont run any game , are my specs high enough?","Controller on PC help","Help for Gaming Laptop","Its not much but.... Yes","I need to upgrade on this gracious day, to make my streams less shit.","What kind of cpu should I upgrade too?","Best MX Black Keyboard","Looking to build in the very near future - should I wait 'til the new NVidia cards are released to get the best price?","My PC shuts down randomly","BattleStation Upgrade !","I am very close to finishing my pc build for the first time but I have a court or of questions.","Pc network help....","Keyboard or controller?","Anyone Got A Good Budget Build For £400-£500?","\"Did you upgrade your monitor?\" Me: \"oh yeah\"","RAM differences?","Master race fellow, tips for reference stores in Germany?","How do you get the specs beside your reddit username?","I’m currently a console pleb and am looking to convert to the master race","Trying to switch over to Mac full time, what's my best option to maintain my gamer status?","Is there a \"silicon lottery\" for motherboards in overclocking as well?","Tom's Hardware contradicting itself within 24 Hours","I5 7600k wondering best GPU i can get"]