["Recommendation Tuesdays - Week of August 28, 2018","The Summer 2018 Mid-Season Survey Results!","Answerman - Could Patreon Be \"Better For The Industry\" Than Crunchyroll?","I drew Diamond from Houseki no Kuni [OC]","Clifford Chaplin, Bakugou's English voice actor, tweeted out a thread of rejected takes from some of his time directing the My Hero Academia dub. I took it upon myself to edit them together.","[Clip][Spoilers] Twitch Chat reacting to one of the saddest scenes in the series [Pokémon Marathon]","Hero Killer Stain (Boku no Hero Academia)","Mob Psycho Season 2 New Visual of August","Golden Kamuy Season 2 Anime Premieres on October 8","You're Never Getting Haruhi Season 3","I drew Red Blood Cell from Cells at Work [fanart] [OC]","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Overall Discussion","Victorique from Gosick [Fanart][OC].","The Salty Sea IV - Best Anime Couples/Ships Round 5 Group D!","Paid to Watch 900 Hours, Update 12","[fanart][OC] Aura and Mare from Overlord","[Rewatch][Spoilers] Monogatari Series - Owarimonogatari Episode 5","Free! -Dive to the Future- - Episode 8 discussion","Sword Art Online: Episode 21 Discussion","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E15 \"Marathon Tournament!\"","Play With Your Anime! (The Art of Viewer Participation)","Hinamatsuri Volume 4 BD/DVD Cover Art","What is the favorite first episode of all the anime you watched in your life ?","A Certain Scientific Railgun: Episode 14 Discussion","\"I've got someone to introduce to you! She's a really big fan!\"","What was the last anime you absolutely loved to watch?","Consensus opinion on an Anime that shocked you?","3x3 Thursdays [August 30th, 2018]","[OC] The last Supper, digital art","[OC] Deku learning Full Cowling (MHA)","I sketched Nisekoi Raku's harem in Jojo pose, for my Part 5 hype","What's your favorite year anime-wise?","Which AMBITIOUS Anime Characters Had Their Ambitions Portrayed Most Interestingly?","Frontwing's Grisaia: Phantom Trigger Anime Kickstarter Adds Stretch Goal for English Dub","Overlord III - Episode 8 discussion","[365 Daily Movie Challenge] - [#50/365]: Mobile Suit Gundam: The Origin Part II: Artesia's Sorrow","ReLIFE OP 'Button' cover [Piano/Violin]","[Rewatch] Mushishi Zoku Shou Episode 2- “The Warbling Sea Shell”","[Spoilers] Review/discussion about: Net-juu no Susume","How many Inazuma eleven fans here?","[video] Initial D fan from Germany travels to Japan just to rent an 86 and drive on roads that inspired the manga","Hello, my friend drew a portrait of Nagis from Assassinarion Classroom and I wanted to show it! What you can say abot this fanart?","\"Tank!\" (Cowboy Bebop OP) Cover LIVE @ Liberty City Anime Con 2018 // J-MUSIC Ensemble","I'm making a graph database for anime I've watched","what is the last anime you watched in the last 6 months that you gave a score of 8.5 or higher?","[Clip] Twitch chat dying from Brock's top tier puns [Pokémon Marathon]","Pikaruto","Sumire Uesaka joins the cast for the “Kishuku Gakkou no Juliet” TV anime as Anne Sieber.","Beatless Final Stage will premiere on September 1st","Serial Experiments Lain on an Eight Inch Black &amp; White Tube TV from the 80's","Overlord Art/Wallpapers [Fanart]","Recommendations?","Do you think reading the source material makes watching the anime alot better?","Fans Lament The Thousand Noble Musketeers Anime's Production Issues","Ochaco Uraraka animated from My Hero Academia","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 47 and 48 Discussion","Name the anime with your favorite overall soundtrack, others reply/link their favorite specific track from that soundtrack","Best OP and ED of the year so far?","What was the first moe SoL anime?","Anohana was the first anime to make me cry","Anime similar to Akame Ga Kill?","Thursday Anime Discussion Thread - Week of August 30, 2018 - Tari Tari","Any anime where Mc is God or stupidly overpowered?","Ms. vampire who lives in my neighborhood. TV Anime Premieres on October 5","A fast-paced martial arts anime","The Salty Sea IV - Best Anime Couples/Ships Round 5 Group C!","Himouto Umaru Chan Kirie-chan","Best place to buy anime?","Tada-kun wa Koi wo Shinai Volume 4 BD/DVD Cover art","Rosario + Vampire season 3","need anime recommendations asap!","Kadokawa Sneaker Bunko 30th anniversary festival illustration","Why do I regularly watch cheap “cookie cutter” light novel adaptations (especially the “modern guy go to another world/MMORPG” genre)","Forest of Piano, Last Hope Anime to Premiere on Netflix in September","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E14 \"Summer Training!\"","[Fanart][OC] Chino wants a piggyback ride","Whats a good anime to watch like pop team epic or Aggretsuko?","[Fanart] Deku from Boku no Hero Academia","Slice Of Life","What would your own shonen anime transformation be?","What are your top 5 favorite anime tv show of all ? (Mines are)","[Spoilers] CCP Episode 28: Vampire Movies","[Rewatch][Spoilers] Monogatari Series - Owarimonogatari Episode 4","Scotland Loves Animation 2018 (Partial Lineup)","Samurai anime","Shows you dropped, only to later re-watch and really like?","What are your thoughts on B: The Beginning?","Myanimelist Update: Update - Additional Features Restored","Sword Art Online: Episode 20 Discussion","Lupin III: Part 5 - Episode 21 discussion","Need to find this anime","Darling in the Frankxx Volume 6 BD/DVD Cover Art","Why does each episode of Evangelion have a different 'Fly Me To The Moon'","Of The Seven Traits/Characteristics Listed, Provide Your ULTIMATE, All-Time Example From Manga/Anime!","[SPOILERS] Thoughts and questions about Golden Time","Angolmois: Genkou Kassenki - Episode 8 discussion","What is your favorite manga scene that ended up being adapted despite fans thinking it would be cut from the anime?","A Certain Scientific Railgun: Episode 13 Discussion","Bleach","\"Texhnolyze\" Rewatch Schedule","Why does Golgo 13 need so much money?","Chuukan Kanriroku Tonegawa - Episode 9 discussion","Anime Suggestions","What’s your favorite genre and why?","Isla from Plastic Memories [Fanart][OC].","Looking for someone funny anime made this year.","Can someone explain the Tokyo Ghoul anime?","Black Clover - Episode 47 discussion","This Week in Anime - Revue Starlight is a Dazzling Surprise","Y’all ever had that one anime opening that you just couldn’t skip?","Why is there no offical Gintama dub?","Plot of Overlord isnt going anywhere for 3 seasons","'The Seven Deadly Sins the Movie: Prisoners of the Sky' Review - All in all, this is a serviceably popcorn film that delivers about as much as you'd reasonably expect from a shonen filler movie","WOULD LIKE TO BE AN ANIME FAN","How They Marketed B: The Beginning [Digibro]","Did you know that the first opening credits of Mahoujin Guru Guru changes in every episode?","To celebrate MAL's list comparisons being back, post your MAL and other people judge your taste","[Rewatch] Mushishi Zoku Shou Episode 1- “Banquet at the Forest’s Edge”","The opening theme for Fairy Tail final season TV anime,titled \"Power of the Dream will be performed by LoL and the ending theme,titled \"Endless Harmony\" will be performed by Beverly.","About \"if her flag breaks\"ending","Stupid question, are there any shows out there with catgirls that are more catlike in personality(i.e chill, bordering on lethargic)","Does anyone know a website for watching german-dubbed anime?","Need anime recommendations","Kurisu being a Tsundere is best Kurisu!","Who's your favorite magical girl?","Asagao to Kase-san is Pretty, Pretty","Captain Tsubasa (2018) - Episode 22 discussion","I just finished watching Maria Sama ga Miteru.","[fanart]I was told that y'all might enjoy this-Konosuba","How Masaaki Yuasa's The Night is Short, Walk on Girl COULD be nominated for the Academy Award for Best Animation and be the first non-Ghibli studio to win it, given the factors behind the distribution of the movie.","[365 Daily Movie Challenge] - [#49/365]: Twilight of the Dark Master","Suggest me PSYCHOLOGICAL Thriller Anime with MIND GAMES like Death Note and Kaiji","What is a series that has been cancelled or finished, that you really want to either have a sequel or be remade?","[Attack on Titan PSA] Do not, under any circumstances, Google anyone in the series. You will get spoiled.","Does anybody else actively dislike death note’s second half?","Toonami Schedule for September 1, 2018 (My Hero Academia Season 1 Marathon)","The Genius of Full Metal Panic’s BEST Episode","Sentai Filmworks Licenses Dive!! Anime","Pixel Graphics Fanart, Tohru","What anime have seen recently and really enjoyed?","Favourite scene in anime?","Japan's Weekly Blu-ray and DVD Rankings for Aug 20 - 26","TV anime Conception new key visual (Fall 2018)","JoJo Bizarre Adventure","Konosuba season 2 ep 6","Why Master of ragnarok and blesser of enjehar is a bad anime.","Q-On! - Episode 1 - \"The Miracle\"","Linked Horizon \"Advance to Paradise\" Singles Album + Attack on Titan Full Illustration","What is the optimal time a fight takes in an anime?","what is the point of rating for you? why do you rate stuff? why does other people do it?","Shinya! Tensai Bakabon - Episode 8 discussion","(Wt) Fullmetal alchemist 2003","Looking for a character with a laid-back attitude","My Lum Invader tattoo (Urusei Yatsura)","Producer: Script for Anime of Satoshi Kon's Opus Manga Being Written","Yu-Gi-Oh! Arc V´s first 49 episodes have been added to Netflix in some countries","[clip] Outdoor club activities when you don't have money (Yuru Camp△)","Steins Gate is overrated","Otaku Culture Oasis (This Ain't That)","Favorite anime movie of all time?","Anything good to watch","Rin Shima (yuru camp) art","Just watched my Miyazaki film, what should I watch next?","Thoughts on Hataraku Saibou?","Trigun Rewatch announcement!","Do 4K HDR anime (eg Your Name) and anime in general use the D65 standard?","Bad Anime is Good","Ichigo Pop Art","[OC][FANART] Never forget your first waifu - Venus Love Me Chain","[Fanart] Goku Mastered Ultra Instinct Color pencil drawing","I want to try one of the monogatari series","what is your most unpopular opinion about anime?","A few instances deas on the recent episode of ISLAND","[OC][fanart]#1 best waifu(old art)","Let’s bring AMV back!","Should I drop Jojo?","Harukana Receive short AMV","Pokemon is actually pretty decent, if a little accidentally horrifying.","Nendoroid Simon (Gurren Lagann) and Nendoroid Ichigo (Darling in the Franxx) now available for preorder","Can Somebody Help Me With My Plan-To-Watch List?","Gundam Build Divers - Episode 21 discussion","[Clip] Early prototype of the KyoAni water physics engine [Chuunibyou demo Koi ga Shitai! Lite]","Top Summer 2018 Anime Week #6 on Anime Trending","I drew SS4 Goku!","Cinderella Girls Gekijou Season 3 - Episode 31 discussion","Ririna from Koi to Uso (Aka best girl)","Steins;Gate Zero 2nd Ending Art","The Salty Sea IV - Best Anime Couples/Ships Round 5 Group B!","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 46 Discussion","Does anyone remember the perfect insider?","[365 Daily Movie Challenge] - [#48/365]: Miss Hokusai","How good is Steins;Gate 0, really?","Senjuushi - Episode 9 discussion","My Experience at the Otakuthon 2018","[Spoilers] Three years later Oregairu makes so much more sense and helped me realize something","[OC][FANART] I heard Todoroki’s name in Boku no Hero Academia and I simply had to do this","Potentially obscure anime short","[Spoiler] Twitch Presents Pokemon: Day 1, Episodes 1-12 [Discussion]","Anime suggestions?","Animes about conspiracy theories and/or psychology?","Trigun Rewatch interest thread(cause the last one stopped for some reason)","School anime where the mc is unbeatable.","Hype anime?","I need a romance anime to watch. Help me someone","Momoko Sakura, author of Chibi Maruko-chan, dies at 53 to breast cancer.","WorldEnd: Just finished it,now to go onto the light novel. [Discussion]","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E13 \"Late Summer Postcard!\"","Yama no Susume Season 3 - Episode 9 discussion","What is this video from for Miku Hatsune","[Clip][Detroit Metal City] How to eat a weiner the french way and how to express your love in french","Anima Yell uploads two CMs","Any good senior quotes from an anime?","Has someone seen this gem?","A Certain Scientific Railgun: Episode 12 Discussion","Interview: Flavors of Youth Producer Noritaka Kawaguchi and Director Yoshitaka Takeuchi","If you could pick one anime to watch and it had infinite episodes that never got repetitive...","Anime similar to Violet Evergarden","How In Gods Name Does Amazon Have Such A Terrible Anime Streaming Service?","Sword Art Online: Episode 19 Discussion","Toradora took a minute but now it’s really pulling my heartstrings.","Rambling about Hanekawa Tsubasa's character arc","[Rewatch][Spoilers] Monogatari Series - Owarimonogartari Episode 3","A thought about Hyouka and Chihayafuru from a English speaker.","[Fanart][OC] Shooooooto!","[Rewatch] Mushishi Season 1 Discussion","Darling in the FranXX Ep. 17 Discussion - Trigger Bois Podcast","which of these anime is your favorite and most importantly WHY","[OC] Hunter X Hunter (Monochrome Ink done in Clip Studio)","Are there any \"realistic\" military anime out there?","What are the dynamics (length, habit, etc) of your anime watching and why?","Kyoto Teramachi Sanjou no Holmes - Episode 8 discussion","[365 Daily Movie Challenge] - [#47/365]: Psychic School Wars","Konosuba radio event announced for November! This is likely to cover new information about the upcoming movie!","Better in English or Japanese?","Chibi Maruko-chan Anime Reruns 1st Episode's Remake After Creator Momoko Sakura's Passing","Anime suggestions pls i am new to this XD","Anime MCs that have have had sex with their love interest/the main girl?","[OC][Fanart] I drew the two demons from Shokugeki no Souma, i hope you like it!","Give me your best Anime Quote.","Any good anime in the style of a sitcom?","The TV broadcast for this Fall's “Anima Yell!” anime series begins October 7th (Doga Kobo)","Fighting Demons/The Occult (similar to Yu Yu Hakusho)","One Room Season 2 - Episode 8 discussion","Eromanga Sensei","Happy Anime Movie? Dubbed.","Little Busters: Possible Timeline of Events (Anime Only) [Spoilers]","Jashin-chan Dropkick - Episode 8 discussion","I've been looking for this anime for years maybe you can help!","Kemono Friends - The Rise and Fall of Anime's Biggest Underdog","[Spoilers] Revue Starlight: Bana-Naughty (Nearly On Red)","Shingeki no Kyojin Season 3 - Episode 43 discussion","Who has the most tightly clothed butt in an anime?","How Little Witch Academia Got Its Magic","Your mid-ish Summer 2018 thoughts!","What was your first anime to see?","Monogatari heroines about their auditions","Celty Sturluson - Durarara!! FanArt!","Just a reminder, the Pokemon Twitch Stream starts at 10 A.M PT/1 P.M EST today!","Which MAL scores do you most disagree with?","Ani ni Tsukeru Kusuri wa Nai! 2 - Episode 8 discussion","Cup of Raindrops | Shoujo Shuumatsu Ryoukou x Cup Song","\"Haikara-san ga Tooru Movie 2: Hana no Tokyo Dai Roman\" anime 30-sec preview","Do you have an anime that you personally give a 10/10 score to, that most watchers generally disagree with and give a significantly Lower score?","[SPOILER] K","Good isekai/fantasy anime?","May I ask for an anime title recommendation for me to watch?","Re:Zero in 29 Seconds(for people who only know it by name)","Cells at work OP with Platelet Cosplay dancing","Why is anime openings so awesome?","Kakuriyo no Yadomeshi - Episode 22 discussion","My review for Kyoukai no kanata","Favorite Relationships in anime","What is the song played when Aladin enters the Amon dungeon to capture it?","[OC][Fanart] Just another Platelet picture","Where can I see which anime are dubbed and which are the best subbed ones?","Name some complex/well developed anime characters","Froppy Fanart","Touka at the end of Chuunibyou: Take on Me!","Hataraku Saibou Ep. 8 - Doctor's notes","Seishun Buta Yarou wa Bunny Girl Senpai no Yume wo Minai new character designs revealed","\"Hitoribocchi no Marumaru Seikatsu\" new visual, staff and additional cast revealed. Broadcast begins Spring 2019.","Just watched higurashi no naku koro ni rei and it really hit me in the feels","One piece","Looking for good Detective/Thief/Murder series.","What are your criticisms of School Days?","Anime of Summer Season 2018 That Deserves Doujins","anime where popular girl falls in love with unpopular guy?","WHO IS YOU FAVORITE BLACK ANIME CHARACTER?","rank every shounen jump adaptation you've seen","AIC Plans to Crowdfund El-Hazard Revival","[365 Daily Movie Challenge] - [#46/365]: Saint Young Men","Phantom in the Twilight - Episode 8 discussion","Here's a video about Mahoujin Guru Guru from last year.","what anime you watched you liked but you still did not understand it very well and you need to rewatch it?","About Anime Piracy","[Canada] My Hero Academia Two Heroes showing up on Cineplex, might include more so keep checking","[OC] [FANART] Ainz Ooal Gown, made with normal ball point pen and red sketch pen.","What anime started the \"Power Sealed within my right hand\" trope?","What are your anime nostalgia memories? The moments that transformed you into an anime fan. Any shows that helped you get there?","What's an anime that you gave a 10/10, and no amount of reasoning will ever make me change your mind about it?","Hanebado! - Episode 9 discussion","Pokemon twitch stream","[OC][Fanart] Samurai Champloo Virtual Reality Tribute","Finally Watched Love is Hard for Otaku","Asobi Asobase - Episode 8 discussion","Attack on Titan Season 3 Volume 1 BD/DVD Artwork","Seishun Buta Yarou wa Bunny Girl Senpai no Yume wo Minai Preview #2 (Fall 2018)","Baki - Episode 10 discussion","Best Short Haired Girl 4: Quarter Finals","Your favorite anime?","Pony Canyon Streams English-subtitled Promo Video for The Girl in Twilight Anime","Mecha Anime Recommendations","Need romantic anime suggestions","Gintama.: Shirogane no Tamashii-hen - Episode 20 discussion","[FanArt] My drawing of Zoro from One Piece","Perfect Blue...","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 45 Discussion","The Salty Sea IV - Best Anime Couples/Ships Round 5 Group A!","Bokuben's anime website is live","Deku Sketch","Planet With - Episode 8 discussion","Maika Sakuranomiya from Blend-S [Fanart][OC].","Recent Anime with Amazing Dub","Asobi Asobase seems to have an alternate ED, and it's amazing.","Why Naruto Is Stronger Than People Think - SethTheProgrammer - Debunked","Merch Mondays Megathread - Week of August 27th, 2018","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E12 \"Summerfest!\"","Hideyoshi from Baka to Test","Top 3 Anime","In Unison (Just Because!)","My university puts the new freshman into interest groups for orientation. I was in charge of the anime group!","Character Designer Ume Aoki Presents Madoka Anniversary Art","Let's talk about \"A Place Further than the Universe\"","The Half-Life x Darling In The Franxx Crossover nobody ever asked for","Anime series recommendations, please!","Thoughts on Lerche?","Where do you watch anime","Which anime has best/worst kiss scenes?","Yagate Kimi ni Naru character designs and theme song (Fall 2018)","Jingai-san no Yome Anime Casts Satomi Arai","[English Cover] Every Heart - Inuyasha 4th Ending Theme (Originally sung by BoA)","[Rewatch][Spoilers] Monogatari Series - Owarimonogatari Episode 2","Yutaka Nakamura - Master Animator Analysis - Part 2","A Certain Scientific Railgun: Episode 11 Discussion","Does anyone knows in which K-on! episode Mio explains why she likes playing Bass?","Gravity Training in Dragon Ball Z","Recommendations","[Rewatch] Youjo Senki Rewatch Re-Announcement + Interest Thread","What is your favorite adventure anime?","Anime you defend to the death, even though you know it’s shit?","An interview with Taichi Ishidate, Director of Violet Evergarden","Soundtracks","Black, White, and Gray: What Makes an Antihero Work","Anime to hentai","Can anyone help me with an anime i watched as a kid but don't remember the name of anymore?","Island - Episode 9 discussion","Since the only other post I cold find had the unsubbed normal trailer linked in the title; Here's both Overlord's subbed S3E8 trailers, in preparation for its release tomorrow.","Recommend me an anime!","[Clip] Kitties! So many kitties! [Anne Happy♪]","Sword Art Online: Episode 18 Discussion","Yoshiko-chan ~ Yohane [Love Live Sunshine]","Crunchyroll DOES support the anime industry","Pony Canyon Streams English-subtitled Promo Video for Tsurune Anime","What anime did you like more than you thought you would, and didn't like as much as you thought you would?","So... Banana Fish...","Fairy Tail or Gintama?","Attack on Titan Season 3 episode 43 ED art illustration","Subs vs dubs quality","How do you decide which anime to watch?","Favourite and least favourite studio?","What can we expect with the recently announced Bokuben/We Can’t Study anime? An in-depth prospective analysis.","Just finished The World God Only Knows","Hugtto! Precure - Episode 29 discussion","Jigoku Shoujo - Any alternatives?","What Have You Watched This Past Week That is NOT a Currently Airing Show? [August 26th, 2018]","Toradora let’s talk about it!","Quick Vegeta piece i did. First real attempt at anime character for me.","[Spoilers] - Erased (2016) ending","Best anime 2018?","Action shows with good choreography/smooth fights","Layton's Mystery Detective Agency - Katry's Mystery Solving Files - Episode 21 discussion","r/anime Seasonal Discussion Ranking | Episode 4-6 [Summer 2018]","Anine/Manga Similar to ReLife?","Drew Aqua since I miss seeing her being useless (Konosuba!)","Why your anime is good.","Tsukumogami Kashimasu - Episode 6 discussion","Monogatari Girls Play Music - Animation by Yvanya","Aoi Miyamori from Shirobako [Fanart][OC].","[Fanart][OC] A convoluted attempt on a 3D Constanze","Animes like Psycho Pass","Darling in the FRANXX- VITA (Piano tutorial) easy","Kirishima Fanart done by me!! 8x12 water color paper, done with copic markers!","Drew Sylvie from How no to summon a demonlord","Anime where no ones good","[Rewatch] Mushishi Episode 26- “The Sounds of Footsteps on the Grass”","Kageyama and Mustang","More Nendoroid: Kujo Jotaro from JoJo's Bizarre Adventure Stardust Crusaders","Does Black Clover get any good?","[OC] [Fanart] JusT started watching Hunter X Hunter and Leorio is no doubt my favorate,,, so far","One Piece question","Best Anime Film Director - Final Round","[OC] I drew Phos a while ago, thought I would share it with you guys!","Answerman - Why Do Sports Anime Bomb In North America?","Official Media\"ISLAND\" anime Winter route visuals","Specific Anime Scene that caught the feelings for many years (from Yu-Gi-Oh!)","Sell me anime with the listed feature.","Aikatsu Friends! - Episode 20 discussion","(Spoilerless) If you love the attack on Titan anime..you must stay out of everything related to anime or AoT","Source for the characters in this corrupted image?","Hinomaru Zumō Anime Casts Kaito Ishikawa, Daisuke Namikawa, More","[SPOILER] I just saw “Your name” and I LOVED IT. Any recommendations?","Deku in a box","Made Another Toonami Promo. My hope is that it provides inspiration.","The Tatami Galaxy on Life","Dreams of a Better Anime Industry","Hataraku Saibou - Episode 8 discussion","Kaneki's Part-time","Whats your Favorite anime fight of 2018 so far","Translation question - \"Take\"","[OC] [Sangatsu no Lion] my take on our boy Rei","[365 Daily Movie Challenge] - [#45/365]: Genius Party","The Evolution Of Kyoto Animation: A Unique Anime Studio And Its Consistent Vision","Super☆Affection [すーぱー☆あふぇくしょん] (Carnival Phantasm OP) Comparison","Hunter X Hunter is so good and so bad at the same time","Makoto Shinkai seemingly loves to name his male protagonists \"Tak\"","What anime utilize music the best?","Konosuba Season 1 ep 9","Cosplaying with a beard?","[Project] /r/anime sings \"Before my body is dry\" (Kill la Kill OST)","[Fanart] [OC] I drew Kaminari from boku no hero academia","Top Summer 2018 Anime Week #5 on Anime Trending","Question - What's the name of this anime?","Parenting goals [Clip][Sengoku Basara]","[OC][Fanart] I did a watercolor painting of Rei Ayanami","Boku no Hero Academia Season 3 - Episode 58 discussion","Looking for sports/romance anime's that are like Cross Game and Chihayafuru.","Glue AMV / Tamako Love Story, Violet Evergarden &amp; Chuunibyou","I need Help looking for an older title!","Anime recommendations","[Fanart][OC] I drew Young Red Blood Cell from Cells at Work!","The Salty Sea IV - Best Anime Couples/Ships Round 4 Group D!","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 44 Discussion","What are the most beautiful anime NOT by Hayao Miyazaki / Studio Ghibli / Makoto Shinkai?","What anime do you think will receive a second or third season eventually?","[OC] Sailor Jupiter from Sailor Moon.","What are some funny animes that are complete and have English dubs?","Least favourite anime?","[OC] [Fanart] FULLMETAL ALCHEMIST SPEEDPAINT","YuGiOh the Abridged Series - Episode 81","[Cosplay] my attempt at Lintharo (Steins;Gate 0)","Any recommendations on animes that are similar to Nisekoi?","High Score Girl - Episode 7 discussion","Shoujo☆Kageki Revue Starlight - Episode 7 discussion","Persona 5 the Animation - Episode 21 discussion","What anime did you hate the fact that you were spoiled before watching it?","Made in Abyss finish and rough illustration with Reg and Riko from the Art of Kazuchika Kise","(Tokyo Ghoul) Ken kaneki fan art by me","Crunchyroll Does Not Support The Anime Industry (Response)","[Fanart] Fused glass piece of Mikasa","Any animes like prison school?","Opening that doesn’t match with the anime’s tone","[OC][Fanart] Rachel from Angels of Death","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E11 \"Hot!\"","Yuragi-sou no Yuuna-san - Episode 7 discussion","[OC][FANART] I drew Momo Yaoyorozu from Boku no Hero Academia on my twitch stream!","Gegege no Kitarou (2018) - Episode 22 discussion","What is your opinion on IMDb's Top 250 TV webpage and the Anime that are included in it?","New One piece film announced for summer 2019","[Discussion] What was the most difficult anime for you to draw an opinion on and rate? Why?","What should we have gotten with the final Yu Yu Hakusho arc,\"The three kings arc\"?","FLCL Progressive Anime's English Dub Streams Internationally on Adult Swim Website","ANIME RECOMMENDATION TIME | Rokka: Braves of the Six Flowers","A Place Further than the Universe","Dimension W and Acca 13 dubbed or subbed","[Rewatch][Spoilers] Monogatari Series - Owarimonogatari Episode 1","[OC][fanart] I drew Rei from NGE!","One Piece Skypea Special - What was with the credits?","Suggestions for me and my friend to watch together","What one episode should I watch for my 5000th episode?","New to anime","Best Short Haired Girl 4: Voting - Round 3, Group D","[Fanart][OC] I drew Illyasviel von Einzbern dressed in Platelet clothes","A Certain Scientific Railgun: Episode 10 Discussion","Sunohara-sou no Kanrinin-san - Episode 8 discussion","I need help.","Made a quick sketch of My Hero Acadamia's best girl (fight me) Tsuyu Asui.","Sword Art Online: Episode 17 Discussion","Anime with similar tone to \"Grand Blue\"?","Paid to Watch 900 Hours, Update 11","Good action (shounen) anime?","What are the most important anime shows to watch and why?","For creating an anime, do you have to start with a rough sketches?","Is Boruto still worth watching?","Violet's age doesn't make sense (Violet Evergarden)","Lovable idiots anime?","Who's your Waifu/Husbando?","Was Cowboy Bebop deep?","How many Gohan fans are out there?","What is the most popular anime?","Worst character in an anime you otherwise enjoy?","Is Girls und Panzer a mecha anime?","Has anyone watched all of the One Piece: Episode of *story arc* movie specials? Did it feel like a comeplete and connected story watching each of them or was it missing too much?","Why Crunchyroll Is Ineffective Anime Support","I made a short Wotakoi AMV","Can you guys imagine the hype if Attack on Titan were an anime original show?","[Fanart][OC] I tried drawing a Platelet, but I also like JoJo","What is the difference between \"deconstruction\" and \"subversion?\"","My Hero Academia - Midoriya's Strategy (Abridged Short)","Just finished Hunter x Hunter...","Request from a friend","Why there is hardly anything regarding Aguu","Help me choose from my list of animes","Need help from someone with an encyclopedic knowledge of anime","Different animes in different streaming services?","My problem with Anime","What do you think of people who worry about age in Anime?","[Rewatch] Mushishi Episode 25- “Eye of Fortune, Eye of Misfortune/Pleasant Sights, Woeful Sights”","Hyakuren no Haou to Seiyaku no Valkyria - Episode 8 discussion","(Minor Spoiler Warning) First impressions: Episode 1 : Cowboy Bebop,Houseki no Kuni and A Place Further Than The Universe","Fukushima Gainax Reorganizes as Studio Gaina in Acquisition by Kinoshita Group","Monogatari series order","[Discussion] [Spoilers???] Art or Quantity","Can I get some classic recommendations?","What are Hunter x Hunter's flaws?","CR Originals and the HTML5 Player (Crunchyroll's Response to Recent Feedback)","Subbed Exclusive anime","Just a question about Clannad After Story for y'all","I made a My Hero Academia video about the correlation of the fights in the first two episodes and the Hero Society!","[Fanart] [OC] Rindou Kobanya~shi","My favorite anime","Can I get some anime recommendations?","Anime that explores suicide?","For the upcoming anime next season, Goblin Slayer, I've been drawing High Elf Archer from the series","I can’t move on :( *spoilers ahead!","Ongaku Shoujo - Episode 8 discussion","Watched 30ish animes and i don't know where to go from here, any recommendations based on my style?","Weekly Seasonal Rankings: Summer 2018 – Week 7","Aguu: Tensai Ningyou - Episode 7 discussion","Recommendations for Anime on Netflix preferably","New One Piece Film Announced","My itachi theme cover","My Hero Academia Season 3 Volume 4 BD/DVD Cover","Why it is so difficult to know what was the budget of an anime film or tv series?","maniacally hardworking character from unpopular/unsung anime?","What's your rating philosophy?","Yu gi oh vrains","Official petition to get my friend to watch an anime. (50 needed)","How hardcore of an anime fan are you?","Making Anime Playlist Spotify (EU) PM me suggestions! Prefer original artists if possible","[REC] Trippy anime like Lain?","Is the monogatari series worth watching?","How do people watch Dragonball z","I drew pin buttons for MHAxPokemon xD","Don't get your hopes up for CR's HTML5 Player (from someone who's using it)","[OC][FANART][Naruto] The Eyes","Grand Blue - Episode 7 discussion","Zack and Rachel from Angels of Death","[Fanart] [Naruto] - Starting A Project of the Character Kimimaro From Naruto","2 Edits I made that I thought were decent","What exactly does \"Slice of Life\" mean?","Need help finding a childhood anime.","Anime or manga that impacted your life","What's your guilty pleasure anime ?","Major 2nd - Episode 21 discussion","Prolly a dumb question but...","Anime you have to watch","Naruto Vs Sasuke AMV","Full Metal Panic! Invisible Victory: Honest thoughts?","Attention Canadian fans of my hero academia, my hero academia two heroes movie goes on sale for Canadians at cineplex.com on upcoming Tuesday night/Wednesday morning","Comedy genre?","Evolution of Asuna Yuuki","I drew Reina Kousaka from Hibike Euphonium!!","Dropping a bomb on Christopher R. Sabat during the recording of Overlord S3","[Asobi Asobase] Why is hanako crying? + Ending guesses?","What anime character(s) share your birthday?","Anime &amp; Vampires","What sequel was better than the original?","The Novel Connection Between The Tatami Galaxy and The Night Is Short, Walk On Girl","Non Non Biyori CM Movie Release","Journey through White Album 1 &amp;2","What happened with the anime Mirai Arise that was set for 2016?","[Fanart][OC] I drew Utaha in a bunny suit (Saekano)","Question about nendoroids","[365 Daily Movie Challenge] - [#44/365]: They Were Eleven","[Fanart][OC]Just finished Steins;Gate for the first time, had to take a crack at Kurisu, a new personal fave","TOP 10 FEMALE Characters Of The Week #5 For Summer 2018 According To Anime Trending","Could you guys help me out finding thename of an anime from a while ago.","If your favorite anime was based on a light novel, what would it be named instead?","Ace Attorney Season 2 Visual","Happy Sugar Life - Episode 7 discussion","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 43 Discussion","Angels of worth?","The Salty Sea IV - Best Anime Couples/Ships Round 4 Group C!","An Honorary Compendium of Writings on Toshio Hirata (平田敏夫) and His Collaborators","[spoiler] hellsing ultimate relationships","A Town Where You Live is good?","What small thing in an anime spoke to you personally?","HIDIVE to Stream No Game, No Life Zero Anime Film","Future Gadget Lab in VRchat! (X-post from r/steinsgate)","I'm getting my friend a present","Maetel Legend and Uchuu Koukyoushi Maetel before Galaxy Express 999?","I really think SATSURIKU NO TENSION is about the 5 stages of grief and dealing with loss. And I really would like to discuss it.","I was late to the Your Lie In April party","I drew me a kaneki","Can anyone help identify a film?","How was the reception of the first Gundam anime in Japan?","Chio-chan no Tsuugakuro - Episode 8 discussion","What Makes Overpowered Fights Impactful? - The Seven Deadly Sins","Any anime like RE:life?","[Clip] When your cute stalker is more useful than she should [Etotama]","Your Name is toooo good","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E10 \"Teacher!\"","Baby Steps x Shingo Kunieda (Anime x Parasports, or \"AniPara\")","I finished Fist of the North Star. My thoughts on the anime.","Anyone know where I may be able to find Leiji Matsumoto prints like this one? I got this Emeraldas one years ago and I recall seeing others.","Ending of Golden Time??? [SPOILER]","I need help finding Anime","Harukana Receive - Episode 8 discussion","Anime/cartoon help!","romcom where the most outgoing girl actually wins?","[Fanart][OC] Drew Ryuko from kill la kill","[OC][FANART] I saw some great Mob Psycho 100 fanart here recently and wanted to share mine!","A Certain Scientific Railgun: Episode 9 Discussion","Who are some characters that are often oversimplified by people?","A manga that actually was worse than its own anime adaptation","Best Anime Film Director - Semifinal Round","Added Kanna Horns to my headset pretty nice imo","Name an OP/OST/ED that goes almost unnoticed to the rest but they are irreplaceable for you.","Sword Art Online: Episode 16 Discussion","Satsuriku no Tenshi - Episode 8 discussion","best anime on netflix at the moment?","I need some help coming up with a senior quote. I also want to make it anime related. That's where you come in, r/anime.","Any recommendations of anime?","There is something bothering me about Boku no Hero Academia.","What are some art styles that strike you as unique or particularly worth merit?","What do you think about Bang Dream, the best media franchise in all of anime?","Romance Animes?","What's the deal with the \"Giant guy with the Mad Scientist\" trope I see in lots of anime? And why is it ingrained in Japanese culture?","Sentai Filmworks' Night Raid 1931 License Expires","How many new episodes could be released if Hunter X Hunter would continue from where it stopped (2011 version)","Here we go, but... I really, really like Sword Art Online (Repost 'cause I got quarantined)","Looking for anime where the mc is just a normal guy that goes to school but he’s really cool.","[Rewatch] Mushishi Episode 24- “The Journey to the Field of Fire”","Top 10 Anime songs on 1 guitar!","We Never Learn Colors Spread","Now available: Legend of the Galactic Heroes Premium Box Set (Sentai Filmworks)","Anime Like Evangelion?","Finished Dragon Ball Super with my dad. Need a recommendation for what to watch next","Overlord season 3 episode 8 preview","Who are your top 10 favourite female characters in anime?","Freshly done, went and got an anime tattoo","[Spoilers] The /r/Anime Podcast - Fate Series/Franchise Discussion with /u/Sinrus, /u/fordanguyen, and Fate's Roommate!","Symphogear Live 2018 Promo Video","Akkun to Kanojo - Episode 21 discussion","TwitchPresents Pokemon Marathon - Detailed Information on which seasons and movies will be marathoned and where to get additional information.","Twitch will be Streaming all 19 Seasons and 16 Movies of Pokemon starting August 27 at 10AM PT","Is this a good review of Magi: The Kingdom of Magic? Would love feedback thanks &lt;3","What character is this?","Does \"Chuukan Kanriroku Tonegawa\" have the same vibe and feeling as Kaiji?","What anime opening is the anthem for each genre of anime?","Levi illustration from Spoon.2Di Volume 41","Akira Sekine joins the cast of the “Mahou Shoujo Tokushusen Asuka”","Who's Your Anime Waifu/Husbando?","Why One Piece is a work of beauty","What are some OSTs that you consider GODTIER?","To The Moon Anime Studio Wishlist","What arc is MHA on in the anime and how far is the manga?","Opening/Ending recommendation","[spoilers] two questions about terror in resonance","looking for a recommendation","Subs vs Dubs?","Mission for the ANIME ALPHABET!!!","Drew Ange from Princess Principal","Could you give me some recommandations based on MAL ?","How did everyone get their anime pre internet?","Legal quality anime subs","Anime Trending Polls","Serena from Pokemon [Fanart][OC].","Those who watched the newest episode of MHA, is it safe to watch if I haven't watched the film?","Anime where Japanese voice actors speak only English","The Almighty DBZ series","In Your Opinions, What Is The MOST Emotionally Intense ANIME?","[Spoilers] Mirai no Mirai discussion - Australia wide release","Does anyone know if there is a copyright issue with the Naruto opening song Blue Bird? It was dropped from Chio's School Road E5 dub.","Is Anime mainstream in Japan?","Nobunaga no Shinobi: Anegawa Ishiyama-hen - Episode 21 discussion","I need a new anime","Download english dubbed anime","Kimi no wa (Your Name) available digitally","I'm looking for an anime similar to HxH and My Hero Academia","[RELEASE] r/Anime Sings 97 - Koi Wa Chaos Shimobe Nari (Haiyore Nyaruko-san W OP)","Back Street Girls - Episode 8 discussion","[Fanart][OC] Katsuki Yuri","Relating to characters in grounded series","Fairy Tail 2018 PV. Begins October 7th","This made my day, for albedo fans [Overlord]","recommend me something based off my mal","Am I the only one that thinks hunter x hunter is overated?","When have you officially become an anime weeb?","I drew Golden Freeza a Couple day ago for a friend! Really happy with how it turned out!","Muhyo to Rouji no Mahouritsu Soudan Jimusho - Episode 4 discussion","High Score Girl PV3","What are the best anime based around fighting","Sketch of Kaiser Reinhard von Lohengramm","[cosplay] Aqua cosplay by Ruripuri!","mob psycho 100","Painted these a few years back. They will always proudly be displayed.","Looking for an anime with dark MC","Trying to get seriously into anime.","Yume Oukoku to Nemureru 100 Nin no Ouji-sama - Episode 8 discussion","Senjuushi - Episode 8 discussion","Iroduku Sekai No Ashita Kara anime will be coming to Amazon Prime","Does anyone know anime where the mc is unpopular but gets the popular girl/boy?","JoJo's Bizarre Adventure Part 5: Golden Wind (Leone Abbacchio) Preview","I Absolutely Fucking Hate Soul Eater NOT!","The chinese webcomic \"Wei, Kanjian Maoerduo La!,\" Japanese title: \"Hora, Mimi ga Mieteru yo!\" (Hey, Your Cat Ears Are Showing!) will be receiving a TV anime on October 3rd","Recommendations for a newbie?","Remember Kabaneri of the Iron Fortress? I drew Mumei!","Which of these shows is the most iconic in the west? Pokemon, DBZ, Naruto or Yu-Gi-Oh?","Newcomer to Anime","Any good anime about Mathematics?","How can I enjoy anime to the fullest?","what's your favorite show that has less than \"100000\" members in myanimelist?","[Clip] How To Confess Love [High School DxD]","Dear Crunchyroll: Stop.","Isekai Maou to Shoukan Shoujo no Dorei Majutsu - Episode 8 discussion","Groovin Danza [Diebuster Mashup]","Casual Discussion Friday - Week of August 24, 2018","Banana Fish - Episode 8 discussion","Rahxephon rewatch starting next Saturday","Taro Misaki (fan art)","Hataraku Onii-san! No 2! - Episode 8 discussion","Yami Shibai Season 6 - Episode 8 discussion","Stumbled across a random rap song that uses Yoshimura's Monologue from Episode 9 of Tokyo Ghoul Root A.","The Salty Sea IV - Best Anime Couples/Ships Round 4 Group B!","[Clip] I Dont Understand Dating Girls Game | Gekkan Shoujo Nozaki-kun","[Rewatch][Spoilers] JoJo’s Bizarre Adventure - Stardust Crusaders Episode 42 Discussion","Describe the plot of your favorite show in the worst way possible","I drew Hina from 3-gatsu no Lion","Nendoroid Ichigo Preview (DARLING in the FRANXX)","Shakugan no Shana Summer doodle","[Video]NGNL Moive review by criminally underrated Aaox","Neon Genesis Evangelion OP by Yoko Takahashi Live","What is the best/worst boob in face moments?","Is Eromanga-sensei actually trash or is that a meme?","Using anime to discuss typically non-anime related topics","The Devil is a Part Timer dub or sub","[Fanart] [OC] I drew 'Holo, the wise wolf' (Spice &amp; Wolf)","Just watched the pilot episode of Tokyo Ghoul season 3 and very confused. What did I miss?","[Rewatch][Spoilers] K-ON! Rewatch (2018) - S2E09 \"Finals!\"","Looking for suggestions","Spoiler - shinsekai yori - possible solution, correct me if I'm wrong...","Irl Waifus?","F-Zero anime","Anime lovers I need help","Can anyone identity who's on this shirt?","Recommendations for new shows that i would like?","Need good action / fantasy anime","Faye Valentine Fan-Art (Cowboy Bebop)","[OC] [FANART] I drew Zack from Satsuriku No Tenshi or Angels of Death I thought you beautiful people would like it","Sword Art Online: Episode 15 Discussion","Quick question about jojo’s","Is Mazinger Z Infinity any good? Your thoughts please!","High Score Girl Is Really Interesting!","Steins;Gate 0 OP1 except with the Island ED music [Clip]","Is it really that hard to fine a good manga/LN then turn it to an anime?","First Ghibli movie","I want to give a speech about anime!","Best/Worst jojo part","What anime had you crying?","[Rewatch][Spoilers] Little Witch Academia Rewatch: Episode 25","[Nekomonogatari Spoilers] Amazing character analysis on Momogatari's main character Hanekawa","Could there ever be an anime set in 1950s America?","OYSTER's \"Choukadou Girls\" (Over Drive Girls) series will be receiving a TV anime adaptation","A Certain Scientific Railgun: Episode 8 Discussion","Umaru Doma VS Sagiri Izumi","Any heisting anime?","[Rewatch][Spoilers] Monogatari Series - Tsukimonogatari Episode 4","[FANART] [OC] My friend hired me to make him a New Game! gif","FLCL Progressive/Alternative soundtrack preview","Fullmetal Alchemist or Brotherhood?","Any Echhi Anime’s on Hulu?","Paid to write about anime?","[OC] [FANART] Princess Mononoke","Lord of Vermilion: Guren no Ou - Episode 7 discussion","[Fanart] [OC] I drew Kaguya-sama in shaft anime style","[ENG] The Essentials of \"Fate Series\" - History of Humanity's Strongest Heroes - FGO 3rd Anniversary","Redubbing an Anime","Will there be a Gakuen Babysitters English Dub?","What anime should I watch?","It's the bottom of the ninth, bases loaded, you're up to bat. What's your anime walk-up song?","Diablo from How Not to Summon a Demon Lord","ANNCast - Final Franxxtasy","Sci-fi anime’s?","Shichisei no Subaru - Episode 8 discussion","No Stupid Questions - Week of August 23th","Boruto AMV - Naimononedari by KANA-BOON","Incredible fan site based on Serial Experiments Lain","A great example of how students typically conduct themselves [Chio's School Road] [Clip]","best action, scifi anime?","Phos time! From Land of the lustrous.","Post your MAL thread","What do you think the ratio is between people that pirate anime and those that don't?","What is the most depressing anime?😢","Key Visual Bokutachi Wa Benkyou Ga Dekinai","Slice of life/drama","[Miscellaneous] Moe Anime Overload: Update 11","More of the cast from the \"Tensei shitara Slime Datta Ken” TV anime has been revealed.","Problem with names","What MC has caused you to suffer the most second hand embarrassment?","What are some shows that I should watch next?","Mid-long ASMV project ready to be shared on Reddit","Looking for a certain kind of anime - Anime Suggestions","My thoughts on Cells at Work in under 60 seconds","[Clip] Thanks, young American! [Kaleido Star]","'Laughing Under the Clouds Gaiden' Movies 1+2 Review - These movies add to the characters and story mythology very nicely, even if the cliffhanger ending of the second makes for a long wait until the release of the third film.","Boruto: Naruto Next Generations - Episode 70 discussion","Which anime have the most fan service?","So I tried to draw Itachi..","Shoujo☆Kageki Revue Starlight episode 7 preview","After 3 years my gf broked up with me. So I need some good Ecchi-Harem-Romance Animes.","The most visually creative Anime you've seen?","Why lip syncing in anime is so shit?","A silent voice, Ishida's sister","Who are your top 10 smartest anime characters?","For those who don´t know, The Piano Forest(Piano no Mori) anime series will be avaiable on Netflix on September 28. Also check out the release dates of Juushinki Pandora, Lost Song and Hisone To Masotan","About Shingeki no Kiojin Season 3","I Fight Cancer That Reviewed Cancer","Why Done People Use VRV Instead Of Crunchyroll","Attack on Titan Season 3 - Interview with Eren's VA, Yuki Kaji (English Sub)","Tokyo Ghoul: Re Season 2 PV","TIL: All of Steins;Gate is available to stream for free through Funimation's YouTube channel","Berserk question","I drew Shigeo from Mob Psycho 100!!","Steins;Gate 0 - Episode 19 discussion","Please help","[Rewatch] Mushishi Episode 23- “Chorus of Rush/The Sound of Rust”","Whats the first anime you gave 10/10 and 1/10?","High Score Girl - Episode 6 discussion","A Certain Magical Index: Episode 18 Discussion"]