["What is it that we are living in the “golden age” of?","What are the strangest \"house rules\" you've seen in a person's house?","Other than doing the homework while the teacher is collecting it, what’s an “extreme sport”?","What is the most disturbing book you have ever read?","What is a way customers for your profession can help you out/make your job easier?","What is the worst place to live in America?","How do you answer \"Tell us something interesting about yourself\"?","Goodwill workers of Reddit, what are some of the weirdest/ most interesting things people have donated?","What is the “bible” of your field of study, profession, interest or hobby? What are some of the most valuable, essential, foundational texts in your area of interest, whatever that is?","Gun manufacturing workers of Reddit, what is it like going to work the days after a mass shooting?","What is cool when you are in your 20s but sad when you are over 40?","What is blasphemy among Redditors?","When was your gut instinct correct and got you out of a bad situation? [serious]","Reddit, what was the best thing about your worst SO?","What part of reddit pisses you off the most?","Redditors with prosthetics, do you take them off before having sex or no? Why?","What subculture do you not understand the appeal of?","Married people of Reddit: What was the biggest waste of money at your wedding?","How would society be different if we re-legalized dueling?","What's the most inappropriate thing you've been asked in a job interview?","Tomorrow, all money will do a Hard Reset. Everyone will have $0 and will gain money again once the next paycheck comes in. What do you do today?","What is your best piece of \"don't ask me how I know\" advice?","Redditors in their 20s/30s who didn't go further than highschool , what are you doing now ?","What is the most disturbing movie you have ever seen and why?","Which character from a movie was insufferable from the very start?","What are you boycotting and why?","Bus riders of Reddit, what the unspoken code of bus conduct bugs you most when someone breaks it?","What song will forever be associated with a movie or scene for you?","Pizza/Delivery drivers whats the weirdest thing you have seen whilst working?","You wake up one morning to find out you've been gender-swapped, and have to spend the next week as a boy/girl. What are some of the things you'd spend the week doing or experiencing?","If you could combine two video games, what would they be and what would you call it?","The germans say that Dutch was created by a drunk german, The dutch say German is just Dutch spoken when really angry. Are there any similar sayings with other languages?","Teachers of reddit what was the trashiest thing you've seen a parent do?","Parents of bullies, how did you find out your kid was a bully and how did you confront them with it?","Which futuristic film is more than likely going to be reality?","What movie would be even better if every character was replaced with a Muppet?","Doctors of Reddit, what are the dark secrets in the Hospital that you never share with patients?","What is something that stops working right after it works best?","[SERIOUS] How can we combat corruption in the American political system?","What are we living in the “dark age” of?","What quote would be improved by adding the word \"bitch\" at the end?","What jobs consist of frequently disappointing people?","Without providing context, what lesson did you learn from your last relationship?","What is your worst \"anything's a dildo if you try hard enough\" story?","Other than an improperly rolled burrito falling apart while you're eating it, what is a minor misfortune that disproportionately infuriates you?","What was something you saw that you weren’t supposed to see?","What would you say it’s your gender’s most powerful feature?","What word do you find yourself using much too often?","What’s something awesome about having a dick? And alternatively, what’s something awesome about having a vagina?","What personality trait, quirk, or habit do you overlook the more attractive someone is?","What will be the final post on each subreddit?","Who are 3 of your favourite music artists?","What are the best arguments for the existence of God? [Serious]","Where is the strangest or most unexpected place you have accidentally run in to someone you know?","What items would you put in an \"I Don't Care Package\"?","Pilots of reddit, what was your \"Glad passangers are not aware of this\" moment?","What sequel is better than the original?","What was the dumbest way you hurt yourself badly?","Other than OP putting their answer in the title of an AskReddit thread, what Reddit trend makes you irrationally angry?","What would you consider to be the biggest event in internet history?","Are you a cat person or a dog person? Why?","People who use r/gonewild any pro tips for taking good selfies of your butt hole?","[Serious] What do you believe society will morally accept by 2030 that is currently considered taboo?","What was The \"incident\" at your school?","What non sexual sensation is honestly incredibly satisfying?","What is the worst place to fall asleep?","What is the weirdest punishment you have received at school?","Why was the 90's so great?","What shook you pretty bad?","What’s a really trashy tattoo idea?","What is the weirdest thing you ever heard someone hate for religious reasons?","What are some things you've had to \"learn the hard way\"?","Other than living, what's the most worthless thing you've ever been forced to do?","At what times is being polite considered rude?","Gamers of reddit, what is extremely easy to kill in a video game, but would be absolutely terrifying to face in real life?","What everyday item has improved in quality the most during your lifetime?","What’s a job/profession that people take WAY too seriously?","What is the nicest thing a stranger ever did for you?","What’s that little thing you do to “pinch a penny” that most people don’t do?","All the national animals of countries go to war, who wins?","If you died today, what do you think is something that you will have hated to miss?","What is the worst place to live in the world?","What's something you wish you could say to your mom/dad, but can't?","You can banish 3 public figures to a remote island, who would you choose?","Aliens scavengers have invaded the US and are willing to spare each state that brings them a worthy gift. What does each state bring?","What are some good horror movies that not many people know about?","if reddit set a cash prize of 100$ for getting to the front page what would you post in hopes of making it to the front page?","[Serious] What is the worst case of bad/lazy parenting you've ever seen?","What things will kids in the future not know the meaning behind but still reference such as can you roll the window up?","What is seemingly sexy to a lot of people but a major turn off for you?","[Serious] Current or ex-military, what's the worst order you ever had to obey?","[Serious] Redditors who have lost a friend/family member to a cult, how did it happen?","What's an old game you still play today?","What is the weirdest lifehack that has worked for you?","Kill As Few Patients As Possible Is A Real Book For Medical Doctors, what would the title of a book be based on your profession?","If you had that machine from The Matrix where you could instantly learn anything, what would be the first thing you learn?","Aside from eat lunch, what do you do on your lunch break?","What is something that didn’t annoy/piss you off until someone pointed it out?","What are some of the most toxic subreddits?","Mars or the Moon? Which one should we build on first and why?","Older gay people, what was it like being gay during the AIDS crisis?","In what way(s) are you turning into your parents?","Reddit, what are your sex tips for women?","Where is the craziest, non-toilet, place you have ever pooped?","Reddit, what is the the most difficult conversation you’ve ever had to have with someone? [serious]","How do you like your eggs?","What is your weird way of eating something?","What's your fight song?","What the weirdest thing a child has said to you?","We have to explain to school-age kids what a big deal each new Harry Potter novel was. What else was once a huge deal that has to be explained to people now?","What do you think a tinder profile look like from the 1960-70’s?","What would you do if you suddenly had a million dollars?","What was the most disgusting thing you have ever found in a gym locker room?","What's a joke that a 4 year old would understand (and laugh at)?","What Are Some Of The Best Examples Of People 'Cheating The System'?","You've been kidnapped. You can call on one fictional character to make a rescue attempt. Who do you pick?","Single men who have slept with married women: why did you pursue it? Was it purely physical or was there an emotional connection as well?","LGBTQ people of Reddit, what is something you want to ask straight people?","[Serious] Redditors who have seen someone rage-quit their job, what happened?","What's something you're really good at but no one cares about?","How would you use the rest of your time if you were limited to 1 hour computer usage a day?","What’s your favorite song outside of your favorite genre?","In your honest opinion, what deserves the title ‘priceless’?","What is your piece of advice to someone starting college this year?","Reddit, if reincarnation is true, what do you want to come backs as, man, woman, animal, alien, what's your choice?","What rule in your workplace was made because of that one time?","What fun activity did you do as a kid that, in retrospect, was actually really dangerous?","What makes someone give off a bad vibe?","What, in your experience, is the most quoted movie of all time?","What's the first thing you look at when you're checking someone out?","Redditors who left it all behind - why, when and how?","What made you think \"What the hell am I doing with my life?\"","What would make you stop using Reddit?","What’s one rule that your school/workplace has implemented that absolutely backfired?","Relationship counselors of Reddit, what do you think about relationship subs like r/Relationships, r/Relationship_Advice, etc?","What is the luckiest thing to ever happen to you?","What weird food combination is surprisingly good?","What's your favorite \"shitty\" subreddit?","Restaurant servers of Reddit, what’s the dumbest/most absurd reason a guest has sent back their food?","How do people with social anxiety get into relationships?","What have you done that society said you would regret, than you've never regretted?","People who had extremely religious parents growing up, what are bizarre rules you had to follow?","What are some common and appropriate things to talk about at work?","What is the biggest lie you tell yourself?","[Serious] Medical professionals of reddit what are the craziest thing someone has told you under the guise of doctor patient confidentiality that was NOT covered under doctor patient confidentiality?","What are some of the worst feelings in the world?","What, suprisingly, helped you get through a tough time?","What are some cool places to explore with google street view?","When you're feeling blue, what always puts a smile on your face?","What is a profession you respect and admire, but could never do?","People of Reddit, what are your favorite obscure references?","Redditors that sit at the very front of a movie theater, why?","Any Redditors here ever compete on the old Nickelodeon shows like Guts and Legends of the Hidden Temple? Also, what was your experience like, did you continue onto different shows, were the challenges fair?","How do you cope with feeling lonely?","Ex fast food employees, what is something we should all know before ordering a certain menu item?","Men of reddit, what would you do if your best friend sexually harassed your SO?","[Serious] Doctors - what part of the body do you practice on and what's the most common way people fuck that part up?","What lessons or skills should be taught in schools that currently aren't/weren't when you were in school?","What’s a scary airplane moment you’ve experienced?","People who are fine with 3-5 hours of sleep a night, what's that like?","What’s something that happened to you that no one will ever believe?","What's something that we will most likely never have a complete answer to?","Without stating where you live, how would you describe where you live?","What are you craving right now?","What is blasphemy among gamers?","Hey reddit, what are some fun and cheap date ideas?","How do dogs tell the time? My dog gets fed at 5.15pm. Today I was napping at 5.15. My dog nudged me awake. How does she know?","What are you supposed to do right now that you're not doing?","Hotel employees of Reddit: what are some ways to get better service, room upgrades, etc. when checking in?","If people could sell time from their lifespan, what would the going rate for 1 year be?","Doctors of Reddit, what is your opinion of Universal Healthcare/Single Payer if ever enacted in the US?","What musican's death hit you the hardest? Why?","What animal species from Earth would aliens be most impressed by?","If you could maximize your income by doing whatever you're best at, what would your job title be?","What's for dinner tonight?","What YouTube Channel deserves more attention?","What are some things that once pointed out, can't be unseen?","What is something that everyone should have in their car?","What's the best interaction you've had with a celebrity?","Would you like to meet the opposite sex version of you? If yes/no, Why?","What is something we are constantly surrounded by yet rarely notice?","What’s the worst game ever to be popular?","What was the weirdest object you ever received as a birthday present?","[Serious] Children of abusive and/or extremely strict parents, what was the hardest part of your childhood, and how are you doing today?","If your favorite genre of music was a physical thing that you could touch what would it feel like?","Redditors who personally know a celebrity, what does the life of a famous person look like up close?","Those of you that got bad grades in high school, how are you doing in life?","Ex-smokers, what made you quit?","When do you believe you were wrongly labelled as 'the bad guy'?","[Serious] People who have experienced war, how did that affect your perspective on life and people around you?","What movie, video game, book, or short story do you find the lore/universe to be the best and why?","Musical fans of Reddit, what song is currently stuck in your head?","Where is the best place to grow up in America?","What is a good gift for a guy who seems to have everything already?","If you had a pet pig, what would you name it?","What's a joke it's too soon to make?","People who lost their job because of something they did on Reddit, what happened?","What are some movies that you think everyone should see at least once?","Dr. Strange saw 14,000,604 futures where Thanos won. What was the weirdest one?","If you could bypass the system and forcibly implement one law, what would it be?","What’s the most pleasant sounding accent?","Without revealing your age, what was the biggest trend as you were growing up?","Whats the best story you've heard about yourself?","Regardless of how you feel about violence, what person do you feel is begging for a punch to the face?","What is the last photo you took that you would be willing to share with Reddit?","What simple lifehack completely changed your life?","What is your favorite game that no one seems to play?","You are given 1 million dollars. But every dollar you spend, you are blind for 1/4 of a sec. What do you do?","What's a dying art?","Homeowners of Reddit: What is the craziest thing that's ever gone wrong in your home?","What are some overrated jobs?","Would your 10 year old self be proud of who you are?","Veterans of reddit, what is your honest opinion about kneeling or not participating in the national anthem?","What are you proud of, but never have an excuse to talk about?","If you could start your life again, would you and why?","Redditors who adopted a very old dog, how was the experience?","What are real life equivalents of the blue shell from Mario Kart?","What fan theory was so ridiculous it made you laugh?","What was a popular rumour you remember from when you were a kid?","What is something that is really popular now, but in 5 years everyone will look back on and be embarrassed by?","What's your longest running online friendship and how has it affected your life?","Students of Reddit, how do you keep your ID's and keys with you?","What show would you recommend for somebody who is in desperate need to find a new one to watch?","What are your top 5 favourite PC games?","Who or what cheers you up every single time?","Redditors who moved from a big city to a smaller city/town to attend college What was it like and did you like it?","Why would my apple tree, which has grown apples every year until now, stop producing apples?","Who are the biggest assholes in your neighborhood?","If I wanted to set a trap to capture you, what's the best bait to use?","What’s the most amazing thing anyone has ever done for you?","If you could change one thing about how the human body has evolved, what would it be?","What did your coworker do that really made you dislike them?","What invention do most people think is great but is actually creating big problems?","What social norm do you hate the most?","What is something everyone else finds funny but you don't?","Defense industry workers- what do you think after seeing your company’s hardware being used in a military action ?","Doctors of Reddit - What was your first experience with a patient dying, and how did it affect you?","How did you pay for college and how long did it take you to pay it?","What was your, \"Oh fuck — I'm old,\" moment?","You can know the honest answer to one question, about anything, what do you ask?","If you could go back 100 years and bring one current technology with you, what would you bring to benefit humanity the most, and why?","How do you forget a painful memory?","If you could change sex for a week, would you do it? If so, why?","What's the worst thing you are willing to do for $1,000,000?","What animal species, if given human-like intelligence and a drive to overthrow humanity, would give humans the most trouble in defeating them?","British folks, if you were living in the US and homesick, what kinds of things would you want to receive in a British-themed gift basket?","Reddit, what is your favorite 3 topping pizza combination?","Where was the craziest place you had sex?","What does it feel like getting front page of reddit?","If you were God, how would you design the aftelife?","What is an annoying habit, behavior, or characteristic you have realized about your family?","People without gold, what is that one post you always wanted to gild but never got the chance?","What's a NSFW joke you know that is so dumb it's funny?","What does a happy, worthwhile, and healthy relationship look like, and how does it form about?","People that don't eat the 2 end slices of a loaf of bread, why not?","What’s the most petty thing someone ended your friendship over?","What TV couple were you really rooting for, but didn't make it?","What's something that was completely normal 100 years ago that is not now?","Regular reddit people, how much should an engagement ring cost?","[Serious] What do you like about yourself?","What was the most disturbing scene in an animation movie?","If you could know the absolute and total truth to one question, what question would you ask?","[Serious] What is the best way to help a rape victim who you are close with?","What's the longest rollercoaster of a comment string you've seen on Reddit?","What's something that happened to you years ago that you're still bitter about?","What is a movie you hated when you were younger but now greatly enjoy?","What is the best country to live in?","Redditors with PTSD, what's your story? How do you cope? What can others do to help?","Older brothers and sisters, do you guys feel bad about how bad you treated your younger siblings when you guys were kids?","What do you watch on YouTube when you're drunk?","What video game was great when it came out and now is just filled with nostalgia from the older generation?","What is the 'brushing your teeth before a dentist appointment' of other situations?","What movie title if taken literal, would change the movie plot completely?","What Can A Woman do, that Most Don't, That Men appreciate?","If you weren't humans, what would you like to be?","What is a book everybody should read in their lifetime?","What do you think has a 50/50 opinion poll split?","If Satan made a car, what features would it have to make it as inconvenient as possible?","What's something about yourself that you always want to tell people, but never really get the chance to do?","Is mental illness overdiagnosed? Why or why not?","What was the worst teacher you've ever had?","What’s the pathetic feel-good meal you make for yourself when you’re starving but you’re also lazy or drunk?","Captain Ahabs of Reddit, what are your white whales?","Do you ever feel like you are being watched when you are alone?","What was the first thing you ever saw and remember to this day?","What's a good motto to base your life around?","Redditors who work in retail, what's the most creative nickname you've given to one of your customers?","What \"good\" thing turns into a \"bad\" thing if you have too much of it?","Redditors with synaesthesia, what is your favorite song?","Whats is your best youtube comment?","What laws in your country are total bullshit?","If you had to be intimate with a muppet which one and why?","Men - what's the best good morning text you've ever received?","Who is your favorite historical figure that doesn't have any skeletons in their closet?","What is the best way to earn money by internet ?","People who like dick, what's more important, girth or length?","People who’ve had to kiss people’s ass for a living, what was your breaking point?","Other than procrastinating on Reddit, what should you be doing right now?","What is your main goal(s) for the next year (an update in 365 days time will be expected)?","What is the most advanced/cutting edge technology currently being developed that has been proven to work?","What is the first thing you would do to make the world a better place as a leader with absolute power?","What historical person do you disagree with, but respect?","How do you sell someone an idea, without giving them the idea?","What is the most underrated hobby/activity you know of?","Whose death would you celebrate?","What are the best sunglasses for outdoor work (maintenance/landscaping) new to this type of job a friend recommended Oakley’s flak jacket?","As much as you love your SO, if he/she were to pass away, what's the first thing from the house you will get rid of (after an appropriate period of mourning)?","Without actually saying it, what’s your favorite color?","What's the biggest secret about your profession?","Fellow gamers, what have you done in a game that made you wonder whether or not you have a social life?","Redditors who make up stories on AskReddit, why?","People who believe in ghosts, why do you believe?","Parents of Reddit, when are you able to sneak in sexy time?","What's the easiest way to spot the difference between Confidence opposed to Arrogance?","If life gave you lemons what would you really do?","Men of reddit: What is a beauty trend amongst ladies you don't care for and merely endure?","What did you worry about in high school that didn’t matter in the long run?","What is the best way to ensure people won't forget you?","If you could choose where you are born, what nationality would you be?","You’re tasked with ending all life on Earth. You’re invincible. What is your first action?","What are some of the best, universally legal, inconspicuous items you can use for self-defense, that would fit in a backpack?","What is your I got really drunk for the first time story?","How do you respond to blatant negativity towards something you are personally invested in?","Hotel workers of Reddit, what are some of the most memorable conventions that have come through your hotel?","You die right now and suddenly come to, surrounded by your alien friends holding a bong. They ask if you had a good or bad trip, what the most ridiculous part was, and if you would do it again. What do you tell them?","If cows can be infected by not being milked, what happened before they were domesticated and had no one to milk them?","Hey reddit, what is your “The Winchester” (comfort zone place you usually end up)?","Which tv show actually had a satisfying finale?","How can you overcome being an uptight person?","[Serious] Dear teachers/professors, what is something one of your students has done that has caused you to remember them and want to bump their grade?","What conspiracy theory do you think is 100% true?","What's the deal with BuzzFeed?","What's your favourite video-game side quest of all time?","What is the best food, and what is your argument for it?","How would you react if you were out at a comedy club tonight and Louis CK showed up to perform a surprise set?","What do you blame your school years for?","What is your best \"What could go wrong?\" moment that actually end up very bad?","1,000 mice are currently heading to you to attack you, what can you use to defend yourself with in the current room you’re in?","What is happening with the wildfires in the west? It was said that some would last for months but hasn't been reported widely, lately?","What’s something you wish was still a thing?","What is the most unusual thing you have used as an alternative when there was no toilet paper?","What subcultures do you find interesting and why?","What is your favorite character from any tv show, movie, book, or other platform? And why?","People in retail who have had their life ruined by a customer, what happened?","Could you ever see yourself killing someone? Why and for what reasons?","What's your 2 truths and a lie?","Conservatives/Liberals of Reddit, what is your most Liberal/Conservative opinion?","Why do we treat teachers so poorly in America? How can we fix this?","What's your \"I WAS SO CLOSE\" moment?","What movie cliché really grinds your gears?","What do people lack the most of in our present day era?","[Serious] How do/did you deal with mental illness?","What's the strangest thing you've ever found in a bathroom?","Smokers and ex-smokers of Reddit: what’s an unexpected way that your smoking affected someone else?","Adults with ADHD how do you cope without meds how do you start concentrating and stop fidgeting?","What’s the most embarrassing moment of your life?","What book made you cry in public?","How do you keep yourself awake when seated in a 2 hour lecture?","Men of Reddit, what do you want to ask women that you're embarrassed to or don't know if it would be appropriate to?","What is the most annoying type of person?","If you are what you eat, what are you?","What's something that is mind boggling to you?","What's the most diabetes-inducingly sweet thing someone's said to you?","To those who have kept records of the past (diaries/blogs/etc) to look back on, what did you find out about past you?","Doctors who have delivered a baby that clearly didn’t belong to the husband/boyfriend, what happened?","[Serious] What's a weird aspect of your life you prefer not to tell people about?","What would be the most unforgettable post you read here?","What's the silliest insult you've heard?","What isn’t what everyone thinks it is?","Gamers of reddit, what popular trope do you hate in your favourite game genre?","The year is 1092 and you've been drafted for the Crusade. Whats somethings you do before your big battle?","What's something that you loved that was unpopular but later became popular ?","If you had to watch one Youtube video 1000 times, which one would it be?","We used to be able to fly commercially at twice the speed of sound on Concorde, what are some other examples of us going backwards in technology?","What is the weirdest thing you have seen in someone else’s home?","Medical professionals of Reddit, what percentage of parents, etc do you see that are actually anti-vaxxers? Is it really that popular or do we just hear about it more?","What is a now defunct restaurant in your town/area that you miss dearly? What was special about it?","People who live on the edge of a time zone, how does it affect your daily life?","What's the video you watched that made you realize you'd gone way too far down the YouTube \"rabbit hole\"?","If you were to make a snack subscription box of the most iconic American snacks, which foods would go in it?","People Who Go To The Gym, What Do You Really Think When You See Other People Setting Up Their Phones To Record Every Workout For Their Fitness Instagram Account?","What’s a good answer to the typical “name an Interesting fact about yourself” on the first day of classes?","What's something that scared you as a child, and continues to scare you today?","What's your best (worst) example of someone living long enough to become the villain?","What is the album that helped you through the most difficult time in your life?","What is a behaviour you know it is inappropriate but you just love to do it?","Which person in history do you believe has led the most remarkable life?","[SERIOUS] People of Reddit who’ve had weird feelings they were being watched (and the instinct turned out to be true and not paranoia): who was it, why were they doing it? And how did you find out?","If twitter had always been around, what are some tweets we could expect from famous people?","What should every student do to make the most out of their last year of university/college?","What would be your 'Make a Wish'?","If There Was a Modern Day NWA, Who Would Be in it??","If you were a dog, what would you be thinking?","Cops of Reddit - Have you ever conducted a search of a vehicle, found nothing illegal, and helped the owner put all their belongings back where you found them?","What is something you're surprised that we cannot yet do with our phones?","Redditors who grew up with stepparents. Did they love your or were they terrible? Were stepdads or stepmoms worse? Tell us your stories[Serious]","What is something that you used to absolutely hate but have recently changed your mind and now enjoy?","Whats your most disturbing life experience?","[Serious]What is easily mistaken for depression but isn't depression?","Which series/film/book has had the most impact on you as a teenager?","If 1000 clones of you were scattered across the world what would be the most probable outcome?","Your employer now requires all personnel to enter work with “walk-up music”. What’s your song?","What’s the one ‘incident’ that happened in your school?","If you had Pinky as your sidekick, how would you try to take over the world?","What the fuck is stopping you from doing what makes you happy and how are we fixing it by the end of today?","What's your favourite movie quote without naming the movie?","What is a mind-boggling fact about the human brain?","What would be the worst thing to hear as you are going under anesthesia before heart surgery?","If you could do anything at all for an entire day what would you do?","What's something that irritates you when other people do it, but you justify when you do it?","Ladies of Reddit, what do you look for in guys?","What fictional job would be bad to have in real life?","People of Reddit: What's the weirdest thing anybody has ever stolen from you? Or if you're a thief, what's the weirdest thing you've stolen?","When did you realize YOU were the problem?","What show has a better opening sequence than the show itself?","Professional house cleaners of Reddit, what are your clients expected to clean or organize ahead of time before you come to do your work?","What's the thing that you had before it was cool?","If real life worked like movies, what would you take advantage of?","I often hear crazy girlfriend stories, what's your crazy boyfriend story?","How financially broke have you been? And what kind of things happened?","What is something only attractive people can get away with?, what is something only ugly people can get away with?","What is the strangest “All rules are there for a reason” rule you’ve heard?","If you could make the entire world watch one movie, what would it be, and why?","What song will you ALWAYS sing along to when it comes on?","Redditors that have hooked up with your friend's mom (or similar), how did things turn out?","Did you ever cheat on your SO? did they find out and if so, how?","What song will you always associate with a special situation?","What's something that one plain looking person you know could change to become hot overnight?","Gamers of Reddit, what is your favorite quote from a video game? What game is it from and why is it your favorite?","Have you ever had a near death experience if so what was it like?","[Serious] What do you believe happens after we die and why do you believe it?","What’s the biggest lie you tell yourself?","What will you miss most about the world when you shuffle off this mortal coil?","People who have attempted suicide, how did the experience affect your view of life?","Reddit, what was your worst post-purchase regret, and your biggest waste of money?","What piece of advice has stood the test of time for you?","Parents of Reddit, how have you had to protect your children from imminent danger?","Adults of Reddit, what's one thing you didn't learn as a child that you wish you did?","What's a book you've started to read, but just can't finish?","What's the scariest medical condition you've seen firsthand?","To all the bullies on reddit, why do you bully?","If you could be anybody for the next 24 hours, who would you be and what would you do?","At what point as a child/teenager did you realize your parents don't know everything/aren't the smartest people in the world?","Why has it become a social norm to be disgusted/embarrassed by bodily functions that every other person on the planet experiences every day?","Reddit, what makes you angry almost immediately?","Adults of Reddit who still sleep with a stuffed toy: why and what is it?","Gangsters of reddit, is there a time when being a rat is ok like if someone is a rapist or child molestor?","How did you get rid of your self hate?","What's that one thing you LOVE more than anything, that you know someone else HATES more than anything?","What thing/activity was stupid, is stupid and will be stupid?","If you could really sell your soul to the devil, what would you sell it for?","Reddit, What are some irl stat boosts?","When was the time you were most paranoid?","What's an opinion you hold that would piss off experts on the subject?","[Serious] What was the worst job you've had, and why?","People who are always late, why?","What should you do when you've completed PornHub?","The last blockbuster video store is in Bend, Oregon. If it was in your community, would you use it, why or why not?","What are some unspoken formalities (i.e. you must only button the top button on a suit) that people should know?","What are some disturbing and confusing games or movies?","Where are you not welcome anymore?","When reading a policy on something, why does it seem like there is always more don'ts than dos?","What makes a person beautiful to you?","What would you do if you found out that you were an insane person and that every person in your life was a paid actor trying to help you through your illness?","What would you do if you suddenly had a million dollars, but they're a donation from a notorious drug dealer?","What do you struggle with?","Even though there are more than 1.8 billion websites on the Internet, why do we all navigate to the same select few over and over?","People who repressed memories and forgot about them, what made you remember?","When did you have the \"What a time to be alive\" moment ?","If you absolutely have to poop in public, where do you?","Why do job applications ask for race, gender, disability, etc? Doesn't this perpetuate discrimination by encouraging reverse discrimination?","Anti-vaxxers of Reddit, what are your reasons?","[Serious]Heath Ledger as The Joker, Tom Hanks as Forrest Gump, what other actor was born to play a role?","What's your favorite smell?","Adults of Reddit, what do you remember about the quiet kid from school?","What were some of your favorite pastimes in the 70s, 80s and early 90s when technology wasn’t readily available?","What did you laugh at that WAS NOT funny?","What is the one driving habit you see, and infuriates you beyond measure?","Who is your countries worst serial killer?","What is one embarrass moment you would not share outside of reddit?","When you hear heavy metal electric guitar.. what do you think of..?","What do you think when people post \"Taking BF/GF applications\" ?","What has been the best day of your life so far?","If you could stay at one age forever what age would you choose and why?","What industry would you not work in due to incompatibility with your moral compass, eg porn, gambling, defence etc?","What is your \"This is the worst client ever\" story?","What big industry is useless because smartphones replaced them?","What TV show just got better and better until it ended?","Women of Reddit, is it a turn off to you if a guy plays video games? Why or why not?","What teacher had the greatest impact on you, and why?","Whats the worst thing you regret saying to someone?","People who have gone long periods of time without sex, has it impacted you in anyway, whether positive or negative?","What is your favorite fake \"deep\" quote?","What do adults do that have never had any friends or hobbies?","What is an animal that looks cuter as an adult than as a baby?","Every night before you go to sleep, you pray to the God of Time Travel to send you back to a point in your past so you can change the course of your life. After taking a bit too much flu medication, you wake up the following morning to find your wish granted. Where and when are you, and why?","Who is your favorite YouTuber and why?","[Serious] How do you get out of the house when depressed?","What's the best place to live in America?","What was one small thing a potential love interest did that made you instantly unattracted to them?","What does it mean to be good in bed?","What reddit trend needs to stop?","Human anatomy/human evolution experts of Reddit, what is the reason for love handles? Are they intended to be used as their name suggests?","What are some good “modern” board games?","Southerners of Reddit - What’s your favorite colloquialism?","What is something that made you laugh hysterically that other people might not find funny?","Americans of reddit, what is your opinion on guns, do you think there would be less or more preventable violence with or without them?","Have you ever had gf/bf from another country? Where was she/he from?","How effective are cheap peroxide and mouth guard teeth whitening kits really? I spent $600 on a dentist last time and would prefer to spend $20?","What is something you're very proud of but wouldn't tell others about?","What’s the best advice that your parents ever gave you?","Married couples of reddit, the ones who don’t have sex anymore and even get to the point of sleeping in separate rooms, why stay married? Is your happiness not important enough to actually find intimacy and love somewhere else?","What conspiracy theories turned out to be true?","Is social media mostly beneficial or mostly harmful among people you know? Why?","What Would Be Your Weapon Of Choice in a Zombie Apocalypse?","Your laughter is now changed into an animal sound. Which one do you pick?","What was the weirdest assembly you had to sit through in school?","What is generally considered dangerous, but is actually very safe?","What is a fad from the 80’s that everyone said would fade away but is still around today?","Teachers of all age groups, what was something that you absolutely HAD to send a student to the principal/headmaster/dean for that deep down, you found hilarious?","If you were an NPC what items would you drop when killed?","What unethical experiment would have the biggest positive impact on society as a whole?","What makes you the most furious out everything happening, in your life or in the world at large?","What’s the best part of your job?","Reddit now has a sanity mechanic. What strange things might happen to a user if their sanity meter is low?","What is the best way to shoo a fly?","What companies/brands could you NEVER support?","Which reddit post best summerize all of reddit?","What are the books that make you feel happy ?","What’s your go-to “on a budget” meal?","What do you regret doing in high school?","What are some of your personal ghost stories?","What's the weirdest thing someone caught you doing because you thought you were alone?","What is your weirdo secret?","People who rejected their admission to an Ivy League, why?","What are good songs to sing/listen to while in the shower?","What is the best \"so bad that it's good\" movie?","What are the best ways that your significant other shows that they want to be with you?","What is your fondest video game memory?","What's the most depressing sentence you can think of?","[Serious]People who prefer to stay at home most of the time when not working, what do you say to those who ask why?","If ready player one level VR was invented tomorrow, what fictional universe would you most want to visit? What is the first thing you would do?","Other than love, what would you say are the key elements to have a healthy, long lasting relationship?","What's the worst thing an ex took from you?","What setting in life should totally have a slider rather than an on/off?","What is the biggest misconception you believe people have about you?","college students, how do you spend your day after classes each day?","It is revealed that someone from the last 300 years came here from the future. Who would you suspect and why?","Who is the worst friend you have ever had and why?","Men of reddit, who’s the funniest woman you know?","What do you automatically downvote whenever you see it, no matter what?","What are we in the Dark Age of?","What is the most obscure publication you subscribe to?","You have the superpower to see the day when someone dies. You realize almost everyone in your home town dies on the same day. What do you do?","What BIG thing(s) are going to happen this year or in 2019?","What are the reasons that you did or didn’t move away from the town/city you grew up in?","To those who it applies to, what’s it like not having depression? How do you cope with normal issues and just sad times? And have you compared yourself to someone with depression and thought how you don’t have that?","How many small animals (squirrels, rabbits, birds, etc..) do you think you could take in a fight? What are you fighting, and what’s your strategy?","Do you believe there are planets with intelligent life on them besides earth? Why or why not?","What was your strangest experience applying for a job?","What was the coolest thing you have ever done, besides my mom?","What is the most fun game you've ever played?","How do you will your self through a mountain of homework?","What is your favourite painting?","How many different hot sauces do you own?","[Serious] What did you see that looked like it came straight from a cartoon?","How much does it cost to you to have an Internet access in your country?","You’re given $10,000 to cause the most chaos possible. How do you use it?","How high is too high?","What is the most effective way to study?","You are in a room with anyone in the world you choose (dead and alive). You have three yes or no questions. Who do you choose and what do you ask them?","What subjects are taboo in your circle of friends?","How did you fuck up on the first day at work?","What’s the worst thing you’ve had happen to you when you rejected someone or ignored their “compliments”?","Whenever talking about Reddit out loud, do you say \"r (subreddit)\" or \"r slash (subreddit)\", or something else?","What are the four most annoying words in the English language?","What is your favorite iPhone app?","How have your \"what do you want to do when you grow up?\" Answers stacked up to real life?","Can anyone axplain what these Younique cards are?","In 10,000 years, when archaeologists are digging through the ruins of the United States (because it was destroyed by a meteor), what baffling things are they going to show on “Unsolved Mysteries”?","What are some alternative form of government you can come up with?","What is the creepiest thing that happened to you while on vacation?","Redditors of Reddit, what is your accounts top post of all time?","What's a good fantasy adventure book you can recommend?","You wake up in the middle of the night and see a lonely child standing in front of you and staring at you. What's the first thing you're going to do?","What has been ruined by its own popularity?","What's a problem we need to be talking about but aren't?","Redditors who work in airport customs/bag control, what is the strangest thing you've even spotted in a bag?","In the states, how come there is never a Chinese restaurant commercial?","What is the best \"second best\" that you can think of?","Which actor/actress was a terrible choice for a role they performed in a movie/TV show?","Without giving us any context, what was your best rated comment so far?","What to you would be a realistic reward worth 25 years of enjoyment before ending with a long, drawn-out public Blood Eagle execution?","(Serious) When you think of someone who is fit, who do you think of? Do you think you could ever be that fit?","Your favorite band are touring for the first time in years, but they're not coming to your town and the nearest show to you is a day's travel away. You don't know when you'll get another chance to see them. Do you try to get out to see the show?","Law Enforcement of Reddit, what is the biggest or most consistent waste of your time?","How many hours do you actually spend on Reddit while at work?","Why do you (or do not) think we need feminism?","Entrepreneurs of Reddit. What made you take the leap from idea to execution?","What's a joke you know that is so stupid it's funny?","If you've gotten to know someone through online interaction, how did it play out?","[Serious] Do you think the popularisation of incest themed porn will have negative consequences on younger viewers? Why?","Rich people of reddit, how did you become rich? What did you work as?","What is something you can't stand hearing people say?","We hate small talk, we can’t always find the appropriate time for deep talks, but what constitutes a “medium talk”?","What's something that's really expensive in one country, but really cheap in another?","Next to Scrubs and the Office what shows do you keep coming back to?","Robot sex brothels are emerging in the world. How would you feel if one popped up in your neighborhood?","What is a good remedy for loneliness other than people and pets ?","What was the biggest lie you were told as a child?","What about a person IRL screams \"I use Reddit?\"","What did you get punished for in school, despite you being innocent and/or being in the right?","What kind of food have you never tried?","Redditors who have been involved in a Sugar Daddy/Mama scenario, what was it like and how did it work?","What is a one year period of your life that you wish you could relive, but not make any changes to?","You wake up tomorrow as the only human being left on earth. What are your short/mid/long term plans?","What’s the most ridiculous thing you have bought?","What's the most disgusting thing you saw while working in a restaurants kitchen?","What is your “freshman year shitty roommate” story?","What is your life-changing food hack?","What's a forgotten meme?","What are the reposts of real life?","How was your day?","[Serious] Redditors who work from home, whats your 'side hustle'?","Other than phrasing an askreddit post as an answer to the question, what’s another annoying reddit trend?","What is something you can reuse but most don’t?","What just pissed you off?","[Serious] What makes a good president?","Dear phD students/ former phD students of AskReddit, how have you been mistreated/abused during your phD studies? And if so, if you quit, did it get better after?","Builders / postmen / repairmen who have actually had sex with a client on the job, is it like the movies?","Other than the famous \"taste bud taste zones,\" what are some other infamous mistranslations?","What do you hate the most about yourself?","How did your boss fuck you over?","What is the most comforting book you've ever read?","What is the best place to live in America?","What’s the biggest sign that your childhood has ended?","What is your story of the time Law Enforcement had you \"dead to rights\" but let you get away with it?","Redditors over 30yo, how hard it is for you to get new friends or maintain existing friendships?","[Serious] Opponents of Democracy argue that the majority will tyrannize the minority. Are there then any examples where a nondemocratic government successfully prevented a majority from tyrannizing the minority?","What products work significantly better if they are custom fitted?","[Serious] What is the weirdest dream you've ever had that you can remember vividly?","By law, everybody has to now wear a warning label when in public. What does yours say?","What ruined your day today?","What is the craziest coincidence you have ever personally experienced?","What's the most impressing thing a date has done that instantly turned you on?","What would you say to a three year old boy who likes to pull his pants down and pee in public grass?","[Serious]Current and former drug addicts, what are the real warning signs that yourself or someone you love is becoming a drug addict?","What is the male equivalent of yoga pants?","How did your management torpedo company morale?","What's the best thing about a really really hot day?","What are some strange unspoken rules for human mating rituals?","What would be the best way to utilize shape shifting abilities?","Expectations vs Reality: what songs people associate with your favorite genre? And what songs you think should be more associated with your favorite genre?","What physical feature seen as attractive is more trouble than its worth?","How do you notice that someone is interested in you?","What makes you grateful for your parents?","What's something unusual you would dump somebody over?","What’s the best superhero movie you’ve seen?","How is gentrification good or bad for society today?","What’s one rule that your school/workplace has implemented that actually worked well?","What would a funny name for a sex doll club be?","Whenever I accomplish something, my brain goes \"Now, you relax and do nothing for a while\", although there are things I rather do. How does one change learned patterns for gratification?","Change one letter in a movie title, what's it about now?","What video game has the best A.I. and why?","What's your favorite non-religion-based swear?","Venezuelans of Reddit, what is life like in your country right now? How are you guys surviving with such a weak economy?","What is the worst or best experience you have had with a nurse?","[Serious] What’s a job where you get paid while being idle most of the time?","How do you break up with somebody who loves you?","What did that one teacher do or say to impact your life either positively or negatively?","Could randomly crying over shows from my childhood be related to my trauma?","What’s an obscure fact about your countries history that everyone should know?","What are some excuses you can give to your boss so you can skip work to go to an interview for a new job?","What is the worst place to live in the UK as a university student?","If the devil owed you one wish, what would you wish for, so that he can't trick you?","What, exactly, is so problematic about 'third wave' feminism?","What \"acquired taste\" album is worth acquiring a taste for?","What is something you do that you don't think anyone else does?","What do you feel is underrated about your country?","You and the exact copy of you have challenged each other to death for the glory. What is your battle plan to win the fight?","If you were a ghost, how would fuck with whoever you’re haunting?","What's 'happiness' like for you?","What law benefits a small group of people to the detriment of everyone else?","What is the worst thing you've done that you're willing to admit to us kind NON FBI agents over here on Reddit?","[Serious] If you had one hour to speak alone with president Trump, what are some things you'd ask him?","What’s the weirdest object that has sentimental value to you?","You just got split into 5 different core parts of who you are. What are they and what are your thoughts?","Married people of reddit who spent less on their wedding but still had a great time, how did you do it?","Why did you delete your social media?","What moment from a TV show or movie scared you as a kid?","What's the weirdest conspiracy theory you've ever heard?","Hey Reddit, how do you wash your dishes?","Redditors with autism or aspergers, what is something you don't understand about those not on the spectrum?","If you were a ghost and could possess people, what would you make them do?","What was your childhoods favorite meal?","What’s your story about picking up a hitchhiker?","Fellow broke people of Reddit, what are your go-to cheap meals apart from the classic Ramen noodles?","What was your social status in high school?","Often in illustrations, the USA is shown as an eagle and Russia as a bear. What animal would your country be represented as?","If the devil owed you one wish, what would you wish for, so he does not trick you?","What fictional character do you relate to the most?","When is the preferable time to answer the door to a takeaway driver? Before or after the knock?","What do you do when you can't fall asleep?","When's the last time you cried without any negative feelings attached?","If you could start your own country, how would you govern it?","What’s the worst way you’ve been broken up with?","What career paths have you seen total idiots achieve success in?","Which Movie have you watched multiple times that has been great with every viewing?","What is your go-to method of relieving stress?","What was your \"cool guys don't look back at explosions\" moment?","Reddit, what is the dumbest thing you’ve ever had an argument with someone on the internet about?","No more 'raining cats and dogs'. What two animals do we choose to update this phrase?","Redditors who live alone, what was the moment that you've regretted that you live all by yourself?","What's the worst physical pain you've ever felt?","You’re a doctor. You can save 5 dying patients, but in order to do so, you have to kill one healthy person for their organs. What do you do?","What was a conversation you had with someone, but only made sense years down the road?","What's your favorite piece of clothing?","What does everyone think about the supposed ban on the sale of diesel cars in the UK in 2020?","Which TV show is criminally underrated?","What do you think is the most common fact that you know, that you think everyone knows?","What are your favorite \"feel good\" or \"wholesome\" threads or subreddits?","What do you hate about your parents?","What's something you should never buy in bulk?","Redditors who have received gold, what did you post to get it?","[Serious] When was the last time you had a vacation?","What games have you bought more then once?","Sports fans, what is a superstition you practice that you believe will improve your team's chances of winning?","Resistors who suffer from depression, how would you describe your experience?","People that work in jobs where you're frequently bribed , what was the best bribe offer that you have received?","Which movie hasn't been voice-over'd in English and is a pure gem?","What are you currently failing at, despite giving your best effort?","Reddit, what’s the worst part about your best SO?","You find 8 million unwrapped USD in pristine $20 bills in a duffel bag - no one is looking for it. How do you spend this money without being caught?","Looking through your retrospectacles, which previous reddit posts are now really cringey or inappropriate?","What’s the most universally beloved comic?","What is something so simple that it should work, but never does?","What. embarrassing phase did you go through as a teen?","Gamers of reddit, what’s a game (new or old) that really connected with you emotionally, through either immersion, story, or characters, that you never get tired of?","What are we still living in the “dark ages” of?","What are the downsides to living in Canada?","What is something you want to talk about that you can't IRL because it's too weird?","What is the worst experience you’ve ever had with zero tolerance policy at schools?","What words or phrases have you found yourself not using over the past several years?","What movie quote would be the funniest if you replace a word with daddy?","What's your favorite food?","What is the most effort you’ve gone through to avoid talking to someone?","what do hugs mean to you? what do they mean physically and mentally to you?","What is the name of the group chat with your friends and why?","Who are some celebrities that are older than people would think?","What do you find to be grosser, and why: peeing in the shower, or brushing your teeth in the shower?","What is the perfect tool for a given job?","Having just learned that most are pronouncing Boston's basketball team (Celtics) incorrectly, what other words are nearly always mispronounced?","What did your date do that made you say, \"yeah I'm not seeing this person again\"?","From the perspective of someone in 1910, is our current world an utopia or a dystopia, and why?","What items should never have a \"buy one get one\" sale?","What games do you play with your colleagues in order to kill time at work?","What’s your favorite movie quote?","what is a symptom that you wouldn't think was medically serious, but is very serious?","What celebrity is full of shit?","What’s one thing every women should know?","What do you think are the most romantic songs/what are the most romantic songs you listen to?","How would you approach rude old people to give them advice so they can stop being rude?","What's your mike-drop speech you have simulated in your head for long?","People who use speaker phone in a crowded office environment, what's your deal?","What is the worst thing that's popped into your head during an orgasm?","What’s the right word for preparing marshmallows over a fire? Are you a roaster or a toaster?","How do people deal with being unlovable?","What is something that is illegal, yet regularly done unnoticed?","What genuinely offends you?","Shitposters of reddit, how do you shitpost ?","What's your favorite chain restaurant?","What numerical volume level(s) do you prefer to select when playing music?","(Serious) Male or female, what constitutes being a hoe?","(Serious) Redditors who've contemplated suicide, what's your favorite thing about being alive?","What do you think of Jordan Peterson's views that the current trends of social justice will not lead to a better society but to a Marxist type dystopia?","Nightshifters of Reddit, what is your best advice for someone adjusting to night shift?","Why did the 80's suck?","For popcorn, everybody knows about butter and salt. What else is good?","[serious]What was your biggest mistake that held you back, when getting into shape that you overcame?","What is something you know that you wish you could just forget?","Given we have only explored 20% or so of our oceans, what are some mind-boggling things you think may lie in the deep sea?","What’s the most difficult question you’ve been asked in an interview, and how did you answer it?","How will people of the 2100's remember the 2010s? Will 2010s-2020s videogames be considered retro by then?","Other than someone who thinks breakfast for dinner is dumb, what oddity would be a dealbreaker for a potential partner?","Tear gas makes people cry and laughing gas makes people giggle, what other kinds of gases do you wish existed?","Apart from peanut butter, what is a thing that you often see in us movies which does not exist where you live?","If you met Sherlock Holmes, what would he deduce about you, and how?","Without saying their name, what could a historical or famous person’s tinder profile look like?","What is your objective in your career ?","What are some less well known wonders of the world?","What's the worst food to have to clean up in a microwave or oven?","[Serious] What caused your best friend to become your ex-best friend?","Redditors, how are you? What's happening in your lifes in this period?","What is something dumb that you regularly do?","What is the most satisfying feeling in the world?","What is your top 5 songs to listen to during a storm?","Redditors who were part of a cult, what’s the worst experience you’ve had and how did you get out?","What's your missed connection?","What exactly is Sparta?","What silent majority do you represent?","What is one thing you wanted for Xmas/Hanukkah/Holiday that you never got?","What is the most metal story from history?","What's a question you've been wanting to ask, but feel like you cant ask someone close to you for whatever reason?","What’s one drink, besides Everclear, that you’ll never drink again?","Reddit: What is your favorite “first-job” story?","What is your favourite browser videogame?","(Serious) College students headed back to school, how much do your textbooks cost this term?","What image, photoshopped or not, would confuse the hell out of people from 200 years ago?","What's that one habit of others that really impresses you?","[Serious]People of reddit who have autism (or are pretty sure you do) - what do you wish your coworkers or bosses would understand about you? What do you wish you could change about your workplace's environment or policies that would make it easier for you to be there?","Other than this format of question, what's your least favorite trend on Reddit?","What was the most triumphant way you or someone you know quit your/their job?","Whats the strangest true story your grandparents/great grandparents ever told you about their experiences?","Will you conform to using the new human microchip? Why or why not?","What's a moment from your childhood where you realized that your parents are normal people too?","Which popular reddit fan theory is completely wrong?","What does it mean to be a woman/girl/female ?","Which celebs have too crazy fans to say “if you see me in public, come and say hi”?","What's the most effective way of making yourself go to sleep?","What are some good drinks to get when going to the bar?","What advancements in technology are theoretical, but just not here yet?","What is something you wish you had a use for?","What are some non-English subs? Where is everyone who doesn’t speak English?","Which song is always playing in your head?","What was the worst reality show MTV ever played?","What's the most expensive thing you've seen a person break where they had no concept of its value?","Disregarding science and ethics, what trait from an animal would you want?","Palaeontologists and Archeologists of Reddit, what's the neatest thing you've found on the job?","What is the best thing you enjoy that typically is not for your age?","What is the dumbest way you’ve been injured?","If you were in a position to have to ask help from an ex, or not get the help you need, would you ask or not? Why?","If you could get everyone to participate, what organized event would you create?","Reddit, what is the worst thing about your best SO?","What are you embarrassed to admit you have never done/tried at your age?","What would happen if VR got too real?","What is something that everyone looks stupid doing?","Is dating someone who is your subordinate acceptable?","If a news anchor just observed your entire day through your eyes, what would be tomorrow’s headlines?","Besides speeding and jaywalking, what's a law you break fairly often?","If you could bring one dead celebrity back to life, who would you choose?","If milk in waxy cardboard boxes is called 'cartons' and in glass cylinders called 'bottles'... what do we call it now?","How did you know what to do after high school/college?","What’s the grossest food that you just can’t get enough of?","What are some of the best nicknames you know of and how did they get them?","People that don't have to work (for a living), how does that feel? What do you do with your time? [Serious]","Remove one item of clothing from existence, which item would have the biggest effect on society and why?","For those who've been punched in the face, what did it feel like? What went through your mind?","What's something you learned to do that has saved you a lot of money in the long run?","What are the best old askreddit threads to binge read?","If you had one dying wish, that was honoured by the worldwide population, what would it be?","What is the weirdest kink you can think of?","What is something science can’t explain?","to people who's family/friends have died because of the death penalty, what's your opinion on it?[Serious]","What’s the worst hairstyle you’ve ever had?","what is the best thing about reddit?","What's the worst job you have ever had?","What childhood treat have you not had in forever but now really want to go out and get some of?","You wake up and discover you've been given a superpower in your field of education. What's your superpower?","What is the funniest snippet of conversation you have heard from a passer-by?","Are there inventions of which we still don't know the mechanism of how it works?","What is the most (70's/80's/90's) thing that you still own?","What's the\"cheapest\" thing you've ever seen someone do?","Are you willing to compliment the next person you speak to and tell us their reaction - why, or why not?","Which movie shook you to your core?","In hindsight, when did your parents save you from making a very bad decision, but their interference really upset you at the time?","What historical figure do you most wish could do an AMA?","What is the best Ben and Jerry's flavor you can come up with?","Besides paperwork, what's the most boring part of your job?","What was your romantic-comedy-in-real-life moment?","What’s something you don’t particularly enjoy doing but would still prefer doing over nothing at all?","What was your last excuse for flaking out on a friend?","What would you do of your income doubled?","What is the best insult you have seen on the internet?","What job looked good but you soon learned the lesson \"never judge a book by it's cover\"?","What celebrity should've been in \"Men In Black\" as an alien?","Parents of reddit, do you pack lunch for your kids or do you let them buy? What's cheaper and how/why do you do it?","What's the highest number of upvotes you've had and what was your comment?","What do you worry about daily?","If you could copy your current timeline, go back in time, and edit a decision to see how your current life would change, what would it be?","What’s your favorite SOLVED mystery?","Chris Hansen is starting a new show, \"To Catch A _______\". Thinking of yourself, fill in the blank, and what bait would he use to lure you in?","What sports team/person could you NEVER root for?","Gay Men and Lesbian Women of Reddit, what are things you have always wondered about straight people?","In about 100 words, how would you describe your life?","Redditors who believe life is a simulation, what is your argument and what made you believe that?","What board games should everyone have at home, with or without children?","What country is the strangest?","What are some common time/energy suckers that people can avoid to be more productive?","What is one Tv show that should come back on Tv?","What's something that you expected way higher from?","Students of reddit, what advice do you have for new college freshman?","What's a song of yours that you got sick of because it's at the top of your playlist?","What wouldn't you do for a million dollars?","What is something you did because someone used fear to get you to do it?","No matter how ridiculous, what is the most interesting battle between two real people/fictional characters that you would like to see (e.g. Mike Tyson vs. Floyd Mayweather, Dumbldore vs. Gandalf, etc)?","What's The Dumbest Reason You've Got Detention In School?","How did you announce your pregnancy tonyour partner, friends and family? Or how was it announced to you?","What stuff do you usually think about when you randomly zone out?","What famous person has the most interesting Twitter to look through?","Where were you during the Cleveland Balloonfest in 1986?","How many people out of almost 20mil subscribers check /r/askreddit in 24hrs?","What is the most dangerous yet low paying job?","What's your reddit vote 'philosophy'? In general what is your criteria for upvote/downvote/leave alone?","People with a ton of free time at work but stuck to a desk, what do you do all day? (besides reddit) [Serious]","What one thing gives you so much nostalgia, that it's like going back in time?","What's the difference between evilness and (violent) mental illness?","What’s your cure for hiccups?","What's a food/dish that grosses you out?","If you could have a physical/physiological upgrade (ex. Night vision), which one would you choose, and why?","What's the most insulting thing you've been told from your teacher or boss?","Which is your utopia (dreamland) ?","What are some of the biggest \"oh, sh*t!\" moments in history?","What's the grown-up version of \"my dog ate my homework\"?","What use will humans have after we are all replaced by robots and AI in the workforce?","What has been the proudest moment of your life so far?","What do you miss most about an old friendship?","What G-rated film would you remake as an R-rated film?","What's a cheesy movie, book or song you like that no one else seems to appreciate?","Have you ever been a regular, and abruptly have never been back to seen them again? First of all, why? And second of all, what are your thoughts on them?","What’s the most coincidental day you’ve ever had?","What is a low-stress job that pays a living wage?","What situation in your life did you try your best at, but still ended up being the \"loser\"?","Hotel workers of Reddit, what are some weird, interesting, and/or sexy stories from your job?","what are some true crime stories that give you absolute chills?","What is the dumbest thing your friend has said to you?","If you could be the definitive expert on any topic, what would it be?","Hey Reddit! What's your best one-liner?","Redditors of Reddit, what is your catch phrase?","What is a habit you have that you know is gross, but you refuse to stop doing?","What is your favorite animal, and why?","What is the most beautiful piece of music ever written?","Have pickup lines ever helped you? In what way did they affect your relationship with someone?","Who is the most incredible stranger you've met while traveling, and what was your encounter like?","What’s the story behind your child’s/your name?","What is that one moment you will remember forever?","What's the worst/most embarrassing thing someone would find if they went through your text messages?","What would be your best alternative to a Burial/Cremation?","What activity that doesn't require much physical effort could be considered a sport, like chess?","What makes someone an \"adult\"?","We only hear about succesful artists. Artists of Reddit who failed, care to share your story?","Americans, does September 11 (as a date) still elicit a heavy feeling? Why or why not?","What is due for a comeback?","What comic series/graphic novel would you recommend to someone who has never read either before but wants the best possible introduction to the medium?","[serious] Could the President remove the US flag from the White House and fly his own? Even if there's a Federal law, who would enforce it?","What's the easiest task you've failed at?","Who is your favorite character on Spongebob SquarePants?","What made you realize it was time to turn your life around?","People who are against Universal Healthcare, what’s your reasoning?","What's the stupidest thing you've confessed to your significant other?","[NSFW] Strippers, escorts, prostitutes etc. of Reddit, have you ever developed feelings for a client? If so, what happened?","School's comin' up so it has to asked, what are your best motivational tips?","mobile redditors, what theme do you use, and do you use night shift?","Lets say a documentary is being made about reddit, and some subs get a 5-10 minute portion about their importance in reddit history. What Subs would have some of the more interesting stories?","Why are people from southern California the way they are?","If you could access 2118's Wikipedia, what would your first search be about?","What's the best \"Fuck you\" action you've done to a sibling?","Throughout history the US government/military has always had top secret, cutting edge technology (SR-71, GPS, ect). What is something they might have now that will be common knowledge in 20 years?","What moments did someone walk in on you doing something totally innocent but looked really bad at the time?","Which was your favorite dead meme?","What was far better than it had any right to be?","Introverts, what are your hobbies?","What do you put in your body that you probably shouldn’t?","If weed gets legalized worldwide what's the first thing you would do ?","Who turns the streetlights on?","Every country in the world is invited to bring one item to be judged at a potluck. Who brings what? Who wins?","What is the best way to fight a hippo?","What is your favorite life hack?","If you could live anywhere where would you live?","Which film title perfectly sums up your sex life?","What's the worst thing your ex Gf/Bf did?","What was an experience in which you believe you were singled out because of your appearance, ethnicity, gender or other physically obvious characteristics?","People who work in restaurants, preferably kitchen, what are your craziest stories?","What are some creative, inexpensive ideas for updating a rental apartment?","What's your go-to happy song?","Adults who had a rough childhood, how do you deal with daily life?","Why or why not do you tip? Who do you tip and who do you refuse to tip?","What's a job that seems appealing but actually sucks?","When's the worst you've ever needed to pee?","[Serious] What is your priority in life &amp; why?","What's something that you are belligerently intolerant of?","Musicians of reddit that take requests, how do you know every song?","People who have been kicked out of school or suspended, what did you do?","Retail people of Reddit, what is the oldest / oddest / rarest old stock item you've found in the stockroom?","Reddit, when did you have to eat something horrible to avoid being rude?","People who live on the borders of time zones or international date line, how do you use your powers of time travel?","What song are you embarrassed to admit you love?","What do you think are the reasons for the number of mass shootings in America?","What is it like playing a video game where the map has been modeled after a place you’re familiar with?","What t-shirt design would be inappropriate for you to wear at work?","What actually is better than it looks?","Lucid dreamers of Reddit, what's the most fun you've ever had in a lucid dream?","Bruce Lee vs Muhammad Ali - who would win in an MMA fight?","How do you guys deal with comparing yourself to others?"]