["Episode 239 - Fact Fight feat. Matt Bruenig (8/23/18) | Chapo Trap House on Patreon","Episode 240 - The Shittalk Express (8/27/18) by Chapo Trap House","Bernie Sanders will be introducing legislation to give employers like Amazon and Walmart the choice to either pay workers a higher wage or pay taxes equal to the total cost of federal assistance programs their workers use. If an Amazon employee uses $100 in food stamps, Amazon would be taxed $100.","r/neoliberal goes on a date","Andrew Gillum will \"refuse to sign any death warrants,\" vows to suspend and review the death penalty which has \"a racial bias,\" he says.","We already have gulags, we're just sending the wrong people to them.","\"Bernie’s army in disarray\"-Politico","Trump's presidency literally just got ended","chapo.jpg","On revolution and the ongoing national prisoners strike.","Real Shitpost Hours","(IMPORTANT) Ben Shapiro is 5'4---UPVOTE TO SPREAD THE TRUTH. (IMPORTANT)","This shower isn't working right, it keeps getting me wet.","When you realise just how much Friedman and Reagan loved their country","Contra points is going on Chapo.","Popular open source project bans companies that assist ICE in their license agreement.","sanfrancisco.jpg","Elon Musk might be the best argument against the existence of a meritocracy in America","Shit they're on to me!","Arguing for intersectional, Marxist analysis in an apolitical/centrist sub","CTH at #6 on NYT bestseller list","🤔🤔🤔🤔🤔","Ron DeSantis just said FL shouldn't \"monkey this up\" by electing Andrew Gillum","So-Called Professional Gamer Not Even Racist","this guy's magnum opus tweet thread about chapo","Prof. Philip Mirowski explains the neoliberal thought process","Rare photo of Robert Menaker and his family planning their century long mission to destroy the Democratic Party (1945 colorized)","Jack Posobiec gets triggered by Google","15 of the 19 GOP incumbents who voted against raising taxes to raise wages for the striking Oklahoma teachers lost their primaries last night","Trump tweeted about our guy Gillum and was too afraid to @ him, so the mad lad called him out","Trump called Gillum a socialist on Twitter lmao","21 Days Later...","That's what I love about antifa, man. I keep getting older, they stay the same age.","The book is #6 on the NYT bestseller list in hardcover non-fiction posting thread","I think they’re onto something here...","Downvoted for truth. Please support me.","“Party Up in Here” by DMX starts playing.","Kalashnikov takes on Elon Musk.","Hillary in 2016: \"Medicare for all will never, ever happen\"","Corbyn: \"NATO was founded in order to promote a Cold War with the Soviet Union.\"","Let's take a moment to remember what this sub is REALLY about","And this is why writers have editors","They're ranking races based on how attractive the women are now, guess whos #1","EnoughSandersSpam continues its slow transition into EnoughChapoSpam","Jeremy Corbyn called for former US President Ronald Reagan to cancel a “disgraceful” planned visit to a German Military Cemetery at Bitburg in 1985, on the grounds that it contained the graves of 49 Nazi SS officers.","[Virgil] ive finally fulled my dream of becoming a new york times bestselling author just so i can harass jonathan chait","I have the #1 post on r/politics right now and I still feel dead inside","Won't someone think of the troops?","It’s happening. The govt is stripping citizenship","The Book made the NYT Best Sellers list","The stereotype that universities are left-wing echo chambers gets popped hard in this Twitter thread by someone taking a cultural sensitivity course full of aspiring cops","Weed smoking conservatives be like","The Democrats' Near-Total Silence on the National Prison Strike Speaks Volumes","Nick or Stav are going to be on the pod tomorrow","reformism.exe","Palin not invited to McCain's funeral","\"- Well, how do you live under capitalism, comrades?\" A large poster on a street of the former USSR.","Andrew Gillum, who wants to abolish ICE and supports Medicare For All, HAS WON THE PRIMARY","Every outrage-culture YouTuber in a nutshell.","Lmao can't even wait 12 hours before going full racist","Final political compass","Democrats have full control of eight states. Republicans have 26.","Just picked up this sick new gaming mouse pad","Not Safe For Liberals","CIA and Saudi Arabia Conspired To Keep 9/11 Details Secret, New Book Says","[GAME THREAD] Nixon v Cuomo - Wed Aug 29 @ 07:00PM EDT","Hungary imposes a 25% tax on university research related to refugees, causing them to halt their programs","17 year old Union Mine High School student, go on Chapo","Rack em","Ben Garrison destroys leftists","/r/neoliberal members are absolutely flabbergasted at the concept that humans might only need to work three hours a day in a well-organized society (echoing Bertrand Russell and John Maynard Keynes).","Current Affairs | Surprise, Turns Out The Left Is Still Alive - Andrew Gillum’s victory in Florida shows that the progressive left is thriving…","Guy, I don’t think Andrew Gallium is going to make it.","The Book is on The List, Douthat and Brooks articles on their way","Gov. Cuomo: \"If you allow the public sector unions to strike, teachers could go on strike. There would be no school, children wouldn't be education... It would clearly be mayhem.\"","Very normal climate","Australia may ban Chelsea Manning from entering country","Cuomo on Nixon: \"There’s only one corporate democrat on this stage, it’s my opponent.\"","How can you kill me when I'm protesting if I'm already dead?","NUANCE","Alex Jones confronted live on InfoWars about trans-porn on his phone","Massachusetts Democrat calls for Clarence Thomas impeachment","The US is denying passports to Hispanic Americans born near the Mexican border, denying they have citizenship, and throwing them in ICE deportation centers","It is always worth remembering that neither Human Rights Watch or Amnesty International opposed the war on Iraq.","Elon Musk Could Face Legal Action After Asking Why Cave Diver He Called A Pedophile Hasn't Sued","Meghan McMeme, colorized (2018)","Liberal German politician (FDP) on Nazi mob in Chemnitz: \"Antifascists are fascists too.\"","Dungeons &amp; Dragons Affiliated Artists Say ICE Detained Them","Anyone else would be forced to resign in disgrace over this, but not Cuomo the Lesser","Libs irl","A wild Neo Liberal has been spotted","McMegan solves pedophilia","Socialist Rifle Association is good folks","Good thing they're white men","Ted Cruz: \"While you were rocking out, I studied politics. While you were having premarital sex, I mastered the debate. While you wasted your days in a cool band in pursuit of music, I cultivated a network of conservative donors.\"","How the black vote carried a progressive to victory in Florida","Who the fuck cares","Jordan Peterson giving sex advice: \"Sexuality has to be regulated\"","Kirby is good","CringeAnarchy apparently thinks this is a 'misquote' purposefully made to make DeSantis's comments seem racist...","Amber's Sorry Ass: Advice for the man with no plan . . . for the future of the world system","Drinking water to be shut off at all Detroit public schools - Latest round of testing for lead and copper prompted superintendent to shut off water | Shit ... why can't they just modernize the school infrastructure and spend what they need to on the school buildings?","This is what Politico said a week before Andrew Gillum won the FL Democratic primary for governor","Elon Musk doubles down on 'pedo' claims against UK cave diver","Progressive values give voters something to \"vote for, not just against,\" Andrew Gillum says","Hasbara twitter is being extremely regular again","Gavin Newsom Reveals Plan For Single-Payer Healthcare In California 'Regardless Of Immigration Status'","👏Identity 👏 policing 👏 is 👏 OK 👏 when 👏 we 👏 do 👏 it.","DSA National Political Committee votes NOT to endorse Cynthia Nixon","Cuomo Received $25,000 From Weinstein Lawyer’s Firm as He Suspended Probe","What do Obama and George RR Martin have in common?","Dumbest tweet of the day","Elizabeth Warren's new bill would give a lifetime ban on lawmakers becoming lobbyists","I found the unicorn in the wild","Absolute gal weighs in on Beto attacks","Nixon vs Cuomo debate starts now!","Simon go on chapo","Ben Shapiro Declares Himself Racism Expert, Proves He Hates Blacks and Muslims Equally","Anti-US healthcare discussions on the reddit front page almost every single day now","High School kid, go on Chapo.","guys I told thegreatawakening bot that im not gonna post here anymore","Bottom Text","\"Jeff Bezos recommends using fear to drive work ethic and innovative-thinking — even when things are going well.\"","Attn Central Florida Chapos","Schumer agreed to fast track Trump judges in exchange for maybe renaming an Office building after McCain","Bernie-endorsed Andrew Gillum wins in a shocking upset in the Florida Dem Gubernatorial primary","Gwen Graham wanted a Republican to be her running mate","Even Politico isn’t in denial about this one.","Robocall Allegedly From White Nationalists Uses Mollie Tibbetts' Death in Anti-Immigration Argument","Almost half of Americans can't pay for their basic needs","Matt Lubchansky fires shots at lanyards","British conservatives triggered","Systemic Catholic hierarchies are why we are literally living in hell","Disturbing video from inside the DeSantis campaign shows DeSantis staffers trying to dissuade him from using slurs","Cuomo: \"I experimented with marijuana in college.\"","Texas GOP viciously mocks Dem candidate for playing in a punk band, participating in youthful hijinks, and having friends","Hey mods!","Walt Disney World Union Workers Win Deal for $15 Minimum Wage","Just a bit of genocide in the Times of Israel","The Great Lakes are as fucked as anywhere else","Facebook After Capitalism - Jeremy Corbyn’s call for a “free and democratic media” promises to break the stranglehold of the established monopolies. And that also means taking on tech billionaires like Mark Zuckerberg.","damn","The human rights community lost a champion","Tucker Carlson is a racist with a weird face. Here's a meme about it... PT. 3","it's the only way folks","Ben Shapiro Knows A Thing Or Two About Racism","Thoughts on Gavin Newsom?","petition to rename the \"hezbolabour\" flair \"Jezbollah\"","Hm","Peak civility, starting Obama, McCain and redditors","LMAO Is the best they can do?","Poverty Impedes Cognitive Function","JP is right: all great works of art and science have been done by the volcels","69 days until the election. Nice, more like No-ICE","Champagne Socialist Will Menaker Uses Extravagant Proceeds From \"Podcast Book\" To Hire Full-Time Personal Ass-Scratcher - Disgusting!!!","Chapo Exclusive: Matt's Leaked Yearbook Photo.","In the primary, Gillum ripped Graham to shreds for voting for the Keystone XP Pipeline. After losing to him, Graham immediately endorsed Gillum.","Dirtbag Anthem - What's up Fatlip?","After finishing fourth place, Jeff Greene endorses Andrew Gillum","Why is the chat for this sub locked?","Narendra Modi also failed to protect Muslims in 2002 Gujarat massacre where almost 2000 died. He was banned from the US for this","😤 it’s time for us to be the Little Rock Nine of gamers","Arkansas Minimum Wage Increase ($11/hr by 2020) Certified for November Ballot","China declares Uyghur identity a contagious disease","Israel advocate Ravich named to senior intelligence post, planned US-Israel cyber project against BDS","Matt Wistfully Contemplates Hellworld.","#Breaking: Police are also now investigating the petition that led to 5 death threats levied at Jeremy Corbyn this week. Of course this is not newsworthy which is why none of the UK press are covering it.","Primary Wins of August 28, 2018","it’s been too long since a comedian has been a guest on the pod","U.S. denying passports to American citizens along Mexico border - The Washington Post","Guy, I don't think Andrew Gollum is going to make it.","Kevin Drum DESTROYS both the book AND Matt Bruenig with his galaxy brain","Individuals with mental illness are criminalized and underserved we need to talk about their struggle more","Industrial farming is one of the worst crimes in history","Fox News Can't Stop Doing Stale &amp; Dumb 'Left The Left' Segments","FLORIDA GREYWOLF MOBILIZATION THREAD","Think work is great?","Can Cuomo go one question without mentioning Trump?","What makes someone a member of the ownership/capitalist class?","Daily reminder that US cops are disgusting pigs: Nurse arrested in ER by detective after legally refusing to handover patient's blood tubes • r/medicine","elon musk culture capitalist","No hint of self-awareness at all.","Conservative friend knew El-Sayed, but not Whitmer","Where should I donate the book?","In Their Words: Head of the International Republican Institute, funded by the National Endowment for Democracy, brags about meddling in Malaysian elections by boosting the opposition for the sake of turning Malaysian into an American client state, \"the long game\".","Follow this thread to see Cuomo self-own himself a seemingly unending amount of times debating Nixon","Support our troops wives","Bernie claps back at Amazon","California Becomes First State To End Cash Bail","Liberals: \"Show some respect for our war heroes.\"","Must-watch: Leak from Al-Jazeera documentary where undercover journalist captures anti-Palestinian astroturf student group spreading propaganda about BDS and SJP for money","Chapo drug of choice","South Sudanese students booted from Israeli community after residents claim they'll bring 'rape, murder and break-ins'","‘Can You Stop Interrupting?’ Tempers Flare in Nixon-Cuomo Debate","Chairman Meow and his little green book (Colorized, 1964)","Literally proving Will's point about The GOP hating McCain","A real, honest to god take from /r/protectandserve","This primary season, don't forget","with all due respect, sir","[X-post from r/enoughowensspam] Just a friendly reminder that Candace Owens is a transphobic asshole.","Pretty much fucked","1252 days after it started, NYT finally questions our involvement in Yemen","I can’t imagine me now watching this trailer and immediately wanna go see this Michael Moore movie. Epic cringe.","What is the popularly accepted meaning of \"Globalism.\"","Why the Russia hysteria is complete garbage - absolute takedown of the modern day lib red-scare","[Joe Arpaio] \"In the waning days of his Senate campaign, his bus was virtually empty and his campaign manager was driving it.\"","Why are liberals such tremendous pussies?","The Summary of the Promise &amp; Failure of the Obama Administration in chapter 4 is SPOT ON","it's official folks, the left is bad","I think Trump is going to try to force the internet to be nice to him","Good fucking riddance","AOC praises Gillum, who she endorsed, for his upset win","how long would this take in a normal country?","Florida Gov race: An optimistic guy who wants to help people versus a Trump CHUD","DoughnutGate is a thing now.","napalm brain","The Nixon v Cuomo debate is tonight","Review: The Chapo Book is Too Political","Kings stay kings","The Senate took six recorded votes on Trump's nominees today. Only senators to vote NO six times: Booker, Brown, Durbin, Gillibrand, Markey, Menendez, Merkley, Sanders, Schatz, Udall, Warren Senators who voted YES six times: Donnelly, Hassan, McCaskill, Tester","Prison Strike Statement to the Press, August 28, 2018","Andrew Gillum projected to win FL-GOV nomination","I couldn't finish this without feeling the urge to puke, despite the delicious taste of neocon tears","John \"McNoBrain\" McCain puts country first again o7","Hardcore Ted making those BUCKETS all day","Pathological insanity","🌽🌽🌽","Desantis making a hard play for the Clinton voters against Gillum already","Schumer Surrenders","Extremely online shitposter Spike Milligan was making Virgin-vs-Chad memes in 1942.","Not a racist. Just wants black people to \"own up to their own mistakes\"(ugh).","shoes lookin like a fam","If Gillum becomes the governor, Bernie has the Dem nomination race on lockdown for 2020.","Nothing but respect for MY president","*Nelson Laugh*","Thinking of buying a bottle of champagne for when Kissinger dies","Venezuela! Venezuela! Venezuela!","The Onion on a roll","I want to puke","He did it! Left wing candidate Andrew Gillum beats centrist favorite Gwen Graham in Florida gubernatorial primary.","Andrew Gillum may be the most important win in any primary this year after AOC","Just farted in the library but thankfully there is nobody sitting near me","Resistance: Bernie had absolutely nothing to do with Gillum's victory. Gillum: Actually, he did help me.","Interesting new developments in, uhh, racism by Spanish-speaking Canadians","Why don't Italian Americans like communism?","The Jordan Peterson Meat-Only Diet","Officer Roy Oliver found guilty in murder of 15 year old Jordan Edwards. Bye bitch.","Already Tired Tomorrow","⭐️1","Bill Scher getting that sweet sweet ratio","Teacher tries to get out of union dues b/c unions are part of a \"grand Marxist agenda\" to destroy \"that which Christians hold to be most vital\". Is it okay to agree with this guy and also be glad he lost?","Matt stares at Will's butt (2018, fursona-ized)","The official shift of CTH","Hey Michigan, we stopped OUR white woman","Fire emoji","Article calling John McCain a \"human rights champion\" pictures him alongside Oleh Tyahnybok, leader of the Ukrainian neo-Nazi Svoboda party","I Voted.","Farage taking the grift to the next stage - \"Standing up for white people is clearly too awkward and difficult for our Prime Minister.\"","Deeper, daddy! 😦💦","Let’s check in on chuds obsession with David Hogg and yep - still fucking weird","Don’t know if there’s many The Orwells fans here but they just broke up after sexual abuses allegations","lolwut?","Gay plantations are the best plantations (X-Post from r/WhitePeopleTwitter)","Does unrestrained capitalism create a “police state”?","Fighting ICE with Javascript","This whole sub is getting a whippin'","Best twitter account","This guy is totally going to win, Florida is a fuckin stupid state.","The absolute boy","France loses their shit that a little girl in a hijab is shown in clothing advert in another country.","The Sun Does Not Revolve Around the US","Broke: Snitching","Sad news","o7 =========|🇺🇸=========","Fanboys have a totally normal reaction to the idea of Disney casting a non-white mermaid, in \"the little mermaid\".","So we're gonna have a Bernie backed candidate against a Trump one in Florida.","David Garcia has won the Arizona Democratic governor’s primary. Garcia is running as a progressive and supports Medicare-for-all and campaign finance reform","POLICE 'BAIT TRUCK' Backfires","Centrist libs be like.","The Texas GOP is feeling owned","I'm a Neoliberal. I read the Chapo Guide book. Here's my critique.","Andrew Gillum starts his victory speech livestream with a Migos song","What happened to the Republican Party?","john returned to his home planet","“Blue Lives Matter”","Looks like the anti-Chapo man has the self-awareness capabilities of a toothpick","How could we not talk about family when family’s all that we got?","Expanding BED Tactics to the KSA","why no r/CTH irc?","Lukács on the chapo sub","My man Desantis is having is all about having Normal Ones","Our newest antifa supersoldiers","Rate My CHUD","Heated Gaming Moment Brought to You by an MDE CHUD.","Mesut Ozil quit the German team over racism. here redditors talk about how he is mannerless asshole","Watch liberals cry seeing Gillum mention Bernie","Brazil's Coup And The Inevitable Sociopathy of Capitalism - MR clip","not a cult","Late to the party, still wanted to post","In An Unprecedented Move, The US Postal Service Released A Former CIA Officer’s Security Application To A Republican Group","If the turnout percentage when compared to the primaries for Florida’s 2018 general election matches that of 2014 and 2016, Gillum will win.","Kill Me. Okay. Kill them. Then kill me.","Just got back from the booth in Florida","Don’t ‘monkey this up’ and elect Andrew Gillum, Trump-endorsed Ron DeSantis says of black candidate for Florida governor","Why does Glenn Greenwald keep lending credibility to a white supremacist like Tucker Carlson?","Typical job interview in late stage capitalism","Remember to support the PKK","Cursed image","WTF I suddenly love the IDF: \"IDF not tending to mental health of snipers who shot Gazans at border, despite PTSD risk\"","Fascinating new development in MGTOW biology","Federal court rules police can shoot a dog if it moves or barks when officers enter a home","UN Scientific Paper Suggests Capitalism Has to Die in Order for the Planet to Be Saved","Broke: Calling neolibs/cons warmongering psychopaths","some music to get you into the revolutionary spirit. grandson: Blood // Water","I'm OOTL here, what is cumtown?","if every article about chapo starts off with how much money they make","Radicalized a few friends and it feels good","Ranking the Chapos by their posting ability","What do we have to do to get Trump and Musk into a full scale Twitter war?","Obama to visit Kolding, Denmark. Will cancel if it's made public what he will be paid [translation in comments]","Globalists: The End Of Empire &amp; the Birth of Neoliberalism w/ Quinn Slobodian - MR Live - 8/29/18","Sure, Bill","lol","Libs lol","Before the May-bach, I'd drive anything","Imagine Trump red carding journalists at a press conference","Andrew Gillum, a M4A Bernie-backed progressive, wins the Florida Governor primary for Dems","ComradeJimmyDore.jpg","Elon tripples down on calling that cave guy a pedo","Corporate Democrats: We're the only way to win!; Also corporate Democrats: *consistently lose every race*","Don Lemon interviews Tallahassee Mayor Andrew Gillum after FL gubernatorial primary victory","Chuds have infiltrated the sub, quick post that gif of Anita eating popcorn!","As a Democrat, VENEZUELA!!!!!!","What happened to lakelly99?","An underrated dunk","Why are some liberals anti-socialist?","Bourgie scum asks how to legally fire pregnant lady.","Varg DESTROYS, RIPS APART and ANNIHILATES leftists, with 20 STABWOUNDS THAT ACTUALLY CAME FROM THE GLASS THAT THEY FELL ON.","What Differentiates Gillum from El-Sayed?","Why does the left refuse to acknowledge this simple fact about the difference between genders?","This might be one of the more deranged articles I've seen in a while. \"Glenn Greenwald Wants To Be Kinder, Gentler Russian Stooge White Nationalist Fucking Moron\"","I made my favorite bit from the book into an uninspiring quote photo.","Baby Face Charlie strikes again","Siding with the Palestinian struggle is not antisemitic","blackwolf 4 audiobook?","The book has many utilities","The Proud Boys are openly admitting to being Neo Nazis.","Based Righteous Student go on Chapo!","Peter Coffin gaming channel","Brazil to send troops to Venezuela border","holy shit","The Louis CK Discourse","Felix: always wondered who the magazine Quillette was for until I realized it was for Gen X try hards who say \"savage!\"","Ok which one of you did this?","The Texas GOP is trying out a novel line of attack on Beto that I think we should appreciate","Extremely disappointed by JS programmers backlash against Lerna revoking ICE collaborators license","Zucc Smokin Meats - SONGIFY THIS","Does anyone know the relationship between the Chapo guys and the Pardon My Take guys?","4chan nerds are photoshopping David Hogg to look female, calling him Daisy, and then having sexual fantasies about their Daisy Hogg memes. I feel like this is some... new, uncharted form of self-own","Can I have an upvote for your brave troops?","bitter online nerds jealous of the hustlers and winners of this life. #SuccessWin","Any Aussies here feel ashamed to be Australian?","tfw you're a musician only known for one song, and you constantly live for that moment where people cared about you","The Boys made it to Politico: 'Is This the Stupidest Book Ever Written About Socialism?'","Neera Tanden go on Chapo!","Ben Shapiro picture in the book (CHAPO KID ZONE)","How to Be a YouTube Skeptic","Ess'er has a totally not racist reaction to Gillum winning","Tallahassee Mayor Andrew Gillum projected to win Democratic primary for Florida governor","Don't Talk to the Police","(~˘▾˘)~ Imagining the establishment tears and Trumpster pants shitting if the Bernie candidate beats the Trump candidate in Florida ~(˘▾˘~)","CNN Posts Dumbest &amp; Funniest RussiaGate Article Yet","Senator John McCain Chased off the Navajo Nation","No one actually gives a shit about grave-dancing: A play in two acts","Politico already targeting Florida Primary winner Andrew Gillum with a hit piece","the DeFranco subreddit is far more insufferable than The_Donald","Heartbreaking: The Worst Person You Know Just Made A Great Point","Leak From Censored Israel Lobby Film Exposes Anti-Palestinian Operatives","Lib fails to see how his thinking led to the underclass voting for Brexit...","Elizabeth Warren's Definition of Capitalism","Abolish prisons...and Harvard","Megan McCain looking like she is taking a shit","Free.All.Politcal.Prisoners.","r/badeconomics tries to dunk on Bernie's tax plan","Youtube destroyed critical thinking and mainstreamed fascism, fuck YouTube","The real reason that Politico ghoul didn’t like the book","Here’s how the U.S. is helping massive theft in Venezuela","Rare photo of Will Menaker with Senate Majority Leader Mitch McConnell","Ever since I stole this puppet from the ventriloquist museum, I've started having vivid nightmares every time I sleep. I've also been glimpsing things in the corners of my vision and hearing faint whispers when no one is around.","Seattle teachers vote to authorize strike if no new contract deal is reached","I'm still with HER","This is the Rosetta Stone of Boomer memes, study carefully students for the nuances of the anxieties these people face","Neoliberals are big mad about Andrew Gillum winning","Ed Krassenstein's tweet about the FL Gov. Primary hasn't aged well in the 5 hours its existed","I don't want to get ahead of myself, but Gillum is gonna be president soon","Anybody out there want/know how to start a Co-Op Farm?","Capitalism and Fascism","AP Finally Calls It: Andrew Gillum has won the Democratic nomination for Governor of Florida","You guys claim to be \"\"\"leftist\"\"\" and then fantasize about \"owning\" other human beings","The FB dirty dozen brain geniuses' manifesto against the problem of (political) diversity","I've found the best chud research paper ever","It seems like it was only 20 days ago that @politico was writing the obituary for Sanders-backed insurgent candidates who supported crazy things like abolishing ICE.","Words of Wisdom from Karl Marx.","UN says capitalism is killing the planet, chud in /r/environment has the answer","A tale of two attitudes","Absolute ACAB Unit indicted in infant daughter's death. In awe at the size of this human thumb.","ANDREW GALLIUM DID IT THE ABSOLUTE MADMAN","Florida may slowly be exiting Hellworld. This is big, folks.","Matt to get himself killed on September 11th","hell yeah dude","Old man go on Chapo","Our Uncle David has shit-posted on McCain all week, and he is good to us...listen to the Dollop.","Anyone else noticed how the libs and the right are afraid of leftism being cool or leftists speaking colloquially (without academic rhetoric)?","lol bye bitch","Gov. Shutdown Of TeleSUR &amp; \"Empire Files\" Explained By Abby Martin","Can we make weapons manufacturing illegal?","Pour one out for the poor cops who are victimized by anti-police groups for murdering unarmed people","Emmanuel Macron’s environment minister dramatically quits live on air, questioning president's green credentials","Kyle Kulinski on McCain","#pizzagate","Top 10 Anime pranks","dolphcel","#Resistance is furious at Ali Velshi for stating that Bernie endorsed Gillum","Middle East civilian deaths have soared under Trump. And the media mostly shrug.","Andrew Gillum vs Ron DeSantis is Bernie vs Trump in Florida","Our big boy president revving up our evangelicals for fascism","Assuming Kavanaugh is confirmed, it's very likely we will be staring down the barrel of another Lochner era in law","Botched software update bricks Tesla car and it cannot be driven now • r/StallmanWasRight","the chud diet","RIP John McPlane","Gillum campaign volunteer link for Florida folks here","ok at first I didn't like it but after a few listens this song honestly slaps ass","What are you doing Will","What do you guys think of FDR's proposed Second Bill of Rights?","When you thought anti feminist YouTube couldn’t get any lower they’ll always surprise you","A YouTuber referenced in one of our recent articles objected to being called an \"ethnonationalist.\" We have updated the piece accordingly.","Ben Shapiro may have bought the book","President Ahmadinejad is the most relatable former world leader this is the hill I will die upon","Where do US Republicans fit on the global political spectrum?","Virgil's predictions for 2018 midterms: \"...it would be easier if McCain left his seat...\"","Saw this on twitter","Siri, show me the most Enlightened take on Twitter","Elon's dorky Twitter fans are the fucking worst","uh","The Sitdown w/ Mike Recine Ep. 42 - The Catholic Church (part 2) w/ Angela Nagle","Totally normal birth announcement, from totally normal country","Is it worth it to try and debate with Pro-Clinton dems?","YO FLORIDA GANG","Amateur soccer team's away shirt goes viral because of anti-fascist message","Best way to get the book shipped to Europe without Amazon?","Cute new trend in baby shower gifts: Donating some of your own paid vacation time to a pregnant coworker to add days to her scanty/nonexistent maternity leave!","Mike Cernovich, Ian Miles Cheong, and The Gateway Pundit all lie about another mass shooting, gets disproven by the person they falsely accused","Fuck yeah I know so much about philosophy now.","This headline makes me want to bash my head against a wall.","Nunber c is me unironically","The Republican nominee for FL governor, ladies and gentlemen...","Matt Christman is the kwisatz haderach","Upvote to instantly teabag your local Nazi","Hey socialists, consider this:","National Prison Strike Week 2: Statement to the Press and Updates from the Incarcerated Workers Organizing Committee","Normies are having a field day joking about communism right now.","Some more 'sort of good' primary news - Arpaio loses senate primary bid.","Ni","For those just finding out about Gillum, here's his campaign kickoff message from last year","Shoutout to u/JohnsDoe for buying me the book because I’m broke ☺️ best community on Reddit","Progressive Tallahassee Mayor Andrew Gillum wins Florida gubernatorial primary; will battle MAGApublican Ron DeSantis to become the state's first black governor","Is this praxis? Armed revolution when?","click to die immediately","Virtual phone banking it's a thing","Some alpha postal worker does not seem to be a fan of the commander and chief.","87-Year-Old Ohio Man Aims to Work as Truck Driver to Cover Wife’s Medical Expenses","Liberal hero drops a truth bomb on the excited progressives of /r/politics","Can't wait to see Tesla stocks soar now that Musk has clarified that he did not in fact cry during the NYT interview","TFW the alt-lite grift starts running dry ;(","fuck the Yankees","🚨CHAPO TO SUPPORT TROOPS, BBQ🚨","all the ideologies are in a random order","Codeine Crazy is the best song in the 2000's chat thread","Gillum just won the primary in Florida...","A “Social Wealth Fund” Could be the Next Big Idea","From what I see, Gillum seems great, but is, um, considering how badly he was polling is anyone concerned that Russians hacked the election for him?","This picture radicalized me","Elon Musk is putting the past behind him, moving on from the take-private fiasco and getting back to focusing on calling that British cave diver a paedophile","That's going to be an amazing grift","National Geographic puts Will on the cover, calls him \"the cutest\"","Tallahassee Mayor Andrew Gillum wins crowded Florida Democratic primary, could become state's first black governor","Blairite: \"Jeremy Corbyn has every right to purge Labour. We missed our chance to do it to him\"","My boss is an idiot posting thread.","Florida Primary Election Results","Not a self-help cult: r/jpb upvotes long-term dysphoric who claims to have replaced their need for gender transitioning by \"comprehend[ing] the concepts of animus/anima, as well as the need for their proper integration\"","Extremely normal picture of Callista Gingrich","Trump: I remember Pearl Harbor. I'm on to the Japanese.","REAL M'FUCKIN SUCCDEM HOURS here in hours in FL right now","Soros customer service issues","Being the true centrist leftist that I am, for every bad take I post from a libertarian, I will also post a good one","In Fort Worth, where only 6% of electors participated in the previous midterms, a woman is facing 5 years because she didn’t realize she was ineligible to vote","There’s a teachers strike going on and the distrinct/county has threatened to take away teachers healthcare unless they shut up and go back to work","Michael Shure reports the Florida Republican Party is \"afraid\" of Andrew Gillum","Everyone's favorite pale-headgeared rescue force joins the McCain circlejerk: \"his tireless work for the oppressed and vulnerable live on and will continue guiding our actions as humanitarians and human rights defenders\"","Corbyn is now as bad as Enoch Powell","Bill Scher’s weak shit looks like a knockout to the sufficiently dull and beady-eyed","Just listened to chapo and PSA on McCain back to back ama.","Schumer is fast-tracking 7 Trump-nominated court nominees","Youtube fucking sucks","The Chapos Team up With Actual Children to Play Fortnite on Will's Insta Story.","PART II: Slowly but surely, /r/neoliberal is becoming a community solely based around getting mad at Chapo Trap House hosts and this subreddit","New People’s Policy Project video on the Alaska Permanent Fund","so how long until gillum makes a tweet about supporting small business or some shit","How about instead of war criminal it's war HIMinal and it's a John McCain just for us guys?","Anyone playing Trump Tweet Word Bingo?","Noice Da 6'9","Reminder","Chapo Yikes House","powerful","DEMOcratS aRE tHe ReAL RAcisTS","Finally, worker solidarity in tech.... oh god damn't.","Matt's power of prophecy knows no bounds","What episode do they read through the Virginia Heffernan article?","You all have heard of NazBol. Now get ready for...","How Corrupt America’s Dictators Are | OffGuardian","Immigrants are sending their children to daycare please do something","My sister and I could have gotten one copy to share, but politics is spite so.......","when you definitely aren't mad","Turns out the Notion of Justice may have a few sputtering breaths left in it. A cop is actually going down for murdering a black teenager.","Ben Shapiro casually promoting homophobia","With the hurricane death toll at 9/11 levels, should Puerto Rico become a state or reach independence?","Apparently the democratic party didnt claim the early death of the bernie wave.","Wrestling fans are good, folks","“Far Left Dems Concern Me”","TFW you're a liberal and you treat Nazis and Jews as one in the same.","Still think public housing is cool?","Resisting the bourgeoisie starts early","Once again, Uplifting News reports on the dire state of our capitalist hellworld","In the face the pseudo 'gotcha' of \"Venezuela!!!\" Why don't we talk more about China?","\"Fairly amazing admission from McCain's 2002 book. His own words contradict the prevailing posthumous narrative about him\"","Why hasn’t Ben Shapiro taken a shot at Chapo Trap House yet?","hey just popping in to ask u guys if u can rate me 1-10","Either this sub has grown big enough to attract the weirdest people on reddit or it's being astroturfed by dumbasses","CHUD story posting thread","What happened to the podcasts from the Intercept? (Intercepted with Scahill and Deconstructed with Mehdi Hassan)","Sad that this had to go to court in the first place but Food Not Bombs wins challenge against Ft. Lauderdale legislation restricting sharing food with the homeless.","My cabinets are communist now.","Free health and dental (including for life partners) and 3 weeks paid vacation each year","Protestors, go on Chapo! These patriots are expressing the very meaning of Freedom Isn't Free.","/r/libertarian chud out in the wild","Musk: I DID NOT CRY! NYT: \"We stand by our description. Musk’s emotion was audible. It is not true that his voice only cracked once.\"","ESS poster, when discussing a response in email correspondence to Noam Chomsky","McCains may not like it but this is what a real war hero looks like","When you don't know history or sociology","F*CK John McCain","Callista Gingrich is the weirdest fucking person in or around politics","Human rights is when you bomb countries to further the geopolitical interests of your class and state","The United States is NOT a first world country","Oh my fuck. Some dumbass Boomer got a Qanon tattoo.","I just want free stuff tbh","What do you do when your dead end job is starting to turn you into a tankie","Shout out to our brave troops!","Libs, rocking themselves to sleep:","Tom Carper’s Long History of Defending and Deregulating the Banking Industry","Malcolm X on Liberals","Neera getting owned over the Politico / Bill Scher review","You Can't Control What American Socialism Becomes","Normal Country","Don’t Forget the Other Asians o7","Uh oh","Dick Pulled Back Out Again","ok, hear me out: the purge...","Why was ICEpatrol such a big deal when public records contain the full name, position, salary, location, and hire date of every ICE employee?","The Arizona primary results are coming in and the winners on both sides are jerking off praising McCain in their victory speeches","Finished Detroit: Become Human, and despite some problems (mostly with Markus' storyline) I really enjoyed it.","So who the fuck is Bill Scher and why are we dunking on him","Red Kahina busts out the calipers","I always hated math","Asked if @Google should be investigated, @POTUS said it's \"really taking advantage of a lot of people.\" He tweeted this morning that @Google searches on him report more bad news than good. He said there are 1000s of complaints \"and you just can't do that.\"","Louis CK fans are pissed about his return on stage after a 9 month vacation...lol jk","The local Narcho-ChristBol debate club","Google responded to Trump by saying that, “search is not used to set a political agenda and we don’t bias our results toward any political ideology.”","I’m fucking horrified: “Far right vigilantes ‘hunting down’ migrants in Germany”","Meanwhile, in Russia","Man writes think-piece about why he feels he is no longer welcome in Jeremy Corbyn's Labour Party. Man was an advisor to Nick Clegg, Deputy Prime Minister and Liberal Democrat leader, during their coalition with the Conservatives","MRW Jamie Kirchick, Noah Rothman, and Eli Lake retweet an article by Bill Scher about how the Chapo book is stupid","Trump might actually make his first good decision as president","Will the Florida governor's race have a heated politics moment?","Trump, at the request of UFC President Dana White (a Trump supporter/donater), has helped to bury former UFC fighter (and current union organizer) Leslie Smith's complaint to the NLRB","\"So you actually did nothing &amp; yet imply you are a truth-seeker. The Twitter name you chose is @yoda.\" All-time by-your-logic from Elon Musk","Paul Joseph Watson Quotes a French Marxist in Latest Video. Nazbol Confirmed?","They let anyone in the White House now","Banned from communism101","The Mods of magicTCG Are Bastards","Sony Announces ‘PaRappa the SoundCloud Rapper’","Effort post: Consider helping out the District Sentinel Sam's if you like a short daily news summary with a good leftist perspective.","Anyone know of any good podcasts/ news sources covering Latin America with leftist analyses?","Is this the stupidest face to have written about politics?","Hurricane Maria caused 2,975 deaths in Puerto Rico","Love me, I'm a liberal","70 times more people died from Hurricanes in Puerto Rico in 2017 than the government claims","So there are now classes teaching cops how to get away with killing someone","Laura Loomer Announces Congress Run In Hopes Of Regaining Twitter Verification, Forcing People To Hangout With Her","Emails Link Ex-DHS Policy Analyst To White Nationalists","\"The discourse of the stall will prove our salvation\" - Bakunin or someone else I guess","Contrapoints with a thread on Jesse Singal","Adam Savage go on Chapo","U.S Media is a joke - complete annihilation of our media system","We are living in a chud fanfiction","Dead Prez go on Chapo...Or....We need more socialist rappers","The white flight suburbs surrounding Baltimore continue to be awful","Conservatives proving themselves racist while trying to argue racism doesn't exist.","Question about Nazi Germany","who's the ginger socialism guy","How democrats feel about John McCain","Sam seder annihilated milton Friedman with FACTS and LOGIC.","I never thought I would post a Slate Star Codex article here, but life is a funny thing","Ok bitch, if Chapo is so fucking smart, why won't they debate iDubbbz?","Tucker Carlson is a racist who probably digs Hitler. Here's a meme about it.","Why Did John McCain Continue to Support War? - Taibbi","Oklahoma Cop Has A Heated Wing-Eating Moment","Here's a black pill for you before you go back to larping","Haven’t even posted there once","If someone doesn’t fucking send me money I’ll fucking down load the book as a PDF.","Fire up the guillotines for ICE","There should be a soundcloud rapper named No Planes Theory","Random Canadian, go on Chapo","Official Bernie 2020 campaign posters released","\"After 6 hours of interviewing and waiting, we were handcuffed and taken, through the airport, to an ICE detention center\" for a minor paperwork error","Leaked clip from the suppressed Al Jazeera documentary reveal the guy behind the Canary Mission, which harasses and smears Palestinian rights activists","Will Menaker, bullied by rival podcaster.","Haters make me famous","Huriccane Maria death toll","Local ben shapiro fan club leader 1791L getting brain rot","Imagine not understanding the paradox of tolerance.","Ex-Balch Springs police officer Roy Oliver guilty of murdering teenager Jordan Edwards","Narcotics/Addiction Perfectly Encapsulates the Contradictions of Capitalism","The Identity Mistake: Review of Mistaken Identity by Asad Haider","Florida Primaries Thread","\"Let's distract everyone from my horrible week by test marketing censorship of Google searches\"","Toddler Died From Pneumonia Six Weeks After Leaving ICE Detention","Do you think a student loan (or more) debt strike would work in the future?","Person shot by Chattanooga police moments after their suicide","4chan nerds are photoshopping David Hogg to look female, calling him Daisy, and then having sexual fantasies about their Daisy Hogg memes","Free Healthcare Is Amazing","Eli \"Eggy\" Lake weighs in on Jeremy Corbyn","Are the struggle sessions over","\"Ingroup/Outgroup\" is the new Horseshoe Theory","Who, exactly, is the enemy that future robo-soldiers, trained in the slums of Detroit and LA, will stalk in the labyrinth of Third World cities?","Media Continues Writing Premature Obituaries for the Democratic Left","Big Tech's dangerous crackdown on social media (Mod Rebels Ep. 23)","To See Why Capitalism is Ackshually Really Good","Sam seder yet again destroys milton Friedman with LOGIC.","Thank you for your service, flatbed truck! (tankies btfo)","They don’t teach you this at West Point","Hurricane Maria: Death toll in Puerto Rico much higher, estimated at 2,975, new study finds","I'm probably not the first person to think of this...","Having a good one","[Muh 4.1%]There's no need for a UBI, just get a job at fast food or retail that you have to apply online, pass a personality quiz, and be interviewed to be rejected.","i know this is random, but any lucha underground fans here?","Can y'all believe that a bunch of billionaires acting in their own self-interest doesn't actually work as an ideology?","🤔🤔🤔","RIP","stolen valor","An ACAB tale: Llano, Texas, Police Department nearly wiped out in series of indictments","matt is disabled.","Felix w/ a problematic Takeshi 69 take","Russia calls McCain a war mongerer. I guess they're taking cues from Trump to shit on his grave LOL","You say ACAB but","Buy the book","Recent Trends in Military Recruitment, presentation from the national network organizing against militarization of youth","In addition to being an arcade emulator, the ability to put in infinite coins makes MAME a 90's rich kid emulator.","Petition for Trump to double tap McCain funeral","Environmental degadation is destroying our ecosystem and threatening our food supply, how can I profit from this!?","Sen. Wyden Confirms Cell-Site Simulators Disrupt Emergency Calls","\"Don't speak ill of the dead...\"","You'll cowards don't even no fap","What do u guys do for fun?","Hugo and Jake: Jordan Peterson Doesn't Understand His Own Cognitive Dissonance- Reading 12 Rules for Life Chapter 4","Tragedy","\"This Day in Labor History: August 28, 1963. The March on Washington for Jobs and Freedom takes place in Washington, DC. Let's talk about how economic issues are completely erased from our public memory of civil rights and how challenging employers was central to the movement.\"","ok the kid at the end of this ad is totally jacking off","John McCain's Funeral Is Set To Be a Real Who's Who Of Bad Men and War Criminals","Any other straight MoC here find that most straight women of the left have a strong preference for white men?","Climate Change idiot here. So it's going to get hotter right?","Star Wars: The Last Plinkett Review","Escape from the University of Chicago","\"turns out you can sell multiculturalism to racists by calling it cultural appropriation and letting them think they're annoying someone\"","Slowly but surely, /r/neoliberal is becoming a community solely based around getting mad at Chapo Trap House hosts and this subreddit","As the age of AI looms, what is the future for labour and unions","Karl Marx","Some real praxis would be to create a nationwide college textbook piracy ring for students to escape this extortion racket","The thread to end all threads","Green Party’s Hawkins calls for state to take over Spectrum (Actual socialist in NY gov race)","Muh horseshoe theory","Found the most cursed mix of chuds and nerds","Laura Loomer: \"When I run for Congress in 2020...\"","Sir! Sir! We should all be supporting Google, a great patriotic American company that is proudly standing up to Orange Cheetoh Dotard Drumpf! Use google whenever you can, we are the resistance! 👏👏👏","John McCain Wasn’t a Hero - John McCain's greatest achievement was convincing the world through charming banter and occasional opposition to his party's agenda that he was anything other than a reactionary, bloodthirsty war hawk.","All the Arizona (Deedra Aboud, Mary Matiella, Raul Grijalva) and Florida Justice Democrats (Chardo Richardson, Sanjay Patel, Pam Keith, and Michael Hepburn)","Proud Boys openly supporting/being neo-nazis","Elegy for John McCain","Reminder that US gun culture is reactionary no matter how woke you pretend to be about it.","Is this the stupidest book ever written about socialism?","Did Amber contribute to the book?","white america dot jpg","Calling It Now: There's No Way John Kerry Will Get This Treatment When He Dies","Given that Black Americans are disproportionately brutalized and victimized by our economic system, forging a radical democracy absolutely and uncompromisingly requires simultaneously combating both racism and the degradations of capitalism.","Why the Blue Wave Missed Missouri's 1st CD - Black Agenda Report looks at Democratic Machine politics in the black community","Priorities","Ken Jennings go on Chapo","Golden thread","Blessed content","Maverick.","༼ つ ◕_◕ ༽つ ANDREW GILLUM TAKE MY ENERGY ༼ つ ◕_◕ ༽つ","That look...","The Chapo Tour is underway.","this is the flimsiest fuckin hardcover I've ever bought","Poll: Majority of Democrats and Republicans support Medicare for all","Can somebody explain what Trotskyism actually is?","The best way to buy the book is to get it with the audible free trial and then immediately cancel","libs these days","Felix is a King","ABC News in D.C. Calls Dead Pedestrians “Lazy”","\"oh yeah pedes, we got the shooter, we saved the internet!\"","Cursed Image","The praise for McCain genuinely scares me.","Oh go fuck yourself","I fucking hate this cruel reactionary culture","It's scary what America can do to your body","How the fuck is Anna khachiyan different than any random Pepe dipshit again?","The following was found on my friend activity tab on Steam","RIP to a true poster.","hey vegans","Hey Rockin' Ch-Ch-Ch-Ch-Chapo Babies, Azealia Banks Apologizes To Elon Musk, Starts a Tesla F-F-F-Fan Fiction Contest!","Nationalize drug manufacturers!","President normal brain takes aim at (((Google)))","Hideo Kojima Go On Chapo","What does o7 mean?","uhhhhhh","Matt Christman, at the exact moment of his radicalization [1999, colorized]","Afro-Pessimism and the (Un)Logic of Anti-Blackness | Black Agenda Report","[Extremely Felix Voice]: THE CHAPO HOSTS ARE SO FUCKING LUCKY I HAVE A LIFE AND I'M NOT REFRESHING MY PAGE EVERY MINUTE WAITING FOR THE NEW EPISODE","Steven Pinker is Actually Rodney Alcala","PPP's new paper: A Social Wealth Fund For America","cursed image","Jacob Rees-Mogg wants to oppress the Irish again by restoring a hard border with Ireland","McCain's heaven","has ben shapiro ever debated anyone with a brain?","What is meant by \"scratch a liberal, and a fascist bleeds\"?","Celebs becoming woke commie cats.","We don't talk enough about Gary Vee","Attention Brocialists: Medicare for All is Racist","Welcome to Vietnam!","I’m totally in support of a maximum wage, but my imagination is lacking right now. What do you think would be the effect of those resources being redistributed?","haha what's up you fucking liberal soyboys what is this place","Some troubling news for incels...","Mick Mulvaney looks like a Nazi character in Raiders of the Lost Ark","Trump Bestows Medal Of Honor To John McCain’s Tumor","It's easy to trash McCain's legacy... I prefer to remember him honestly. Here are some of his accomplishments.","Toronto opens first Sex Doll Brothel","WOKE: NBC Follows McCain Death Announcement With Two ‘Masturbating’ Men Wearing Dolphin Heads on America’s Got Talent","Excuse me, what the fuck","Mythological Obama, run for president","RIP to the latest joke that Felix has beaten literally to death","is this ideology","Dem Gov. Candidate Demands That Gov’t Should Pay for Universal Health Care for Illegal Immigrants","Basically y'all","#gamerstrong","neoliberalism.txt","Kurt Schlicter wants a purge of the GOP","Arizona primary question for residents","Damon Young go on Chapo","This is what keeps Donald J. Trump up at night","It sucks when politicians don't live up to their campaign promises","MAGA TRAIN! CHOO CHOO!","Francis Fukuyama (End of History guy) proves he is dumber and more racist than we thought","The master plan","I'm going to the DC show on 9/5. Any other Grey Wolves wanna meet up?","Hbomberguy talks about going on Chapo Trap House","Lauren Southern - Literary Mastermind","So, when are we gonna get a John McCain cum tribute?","Music Monday","Nothing like privileged neoliberals mocking the poor to own Nazis.","What's with the McCain hate guys?","My post modern neomarxist political ideologies course at college opened with a moment of silence","late post: asian author Celeste Ng tweets picture of harassment directed at her because of her relationship with a white man and her professed lack of attraction for asian men. Asian twitter and /r/asnidentity blow up.","by 2020 we won't have any words left","my cross-posts seem to be broken (from /r/FellowKids)","Truth","Rise and grind 🇮🇷🇮🇷🇮🇷","Click this to explode your brain","People who browse on new on braver than any troop","Centrists Won’t Save Britain | Liberals are peddling an ahistorical nostalgia. The people aren’t buying it.","What did he mean by this?","Glenn Greenwald go on chapo (again)","An even-handed analysis of McCain's legacy","\"Blacks are killing each other in droves and the left downplays this\"","Are Aristotle and Plato reactionary philosophers ?","Dave Rubin gets demolished","I threw up","\"Humanity is inherently selfish, just look at me\"","#Respect","A Twitter thread in which I drag every single US President in order.","Welcome to the No-Go Zone","You, a smart person: Education is a right and a necessity and schooling is not and should not be subject to market forces. Him, libertarian: by your logic, that means government grocery stores.","Will gets into Beaudrillard","when you're enthusiastic about centrist politics","Cuomo vs. Nixon Debate? It’s Already Heated (Literally)","AS PREDICTED: White House leans on the death of Molly Tibbets to advance racial resentment, complete with \"family separation\" dogwhistle","Sir! SIR!","Broke: saying \"y'all\" to appear folksy","Neoliberalism: The Movement That Dare Not Speak Its Name - American Affairs Journal","Today the White House salutes a true patriot","\"Semper post\" - the real original absolute boy","Check out the liberal version of JBP \"Chaos vs Order\" shit","Chapo Cold House","David Richardson, running in Florida's 27th Congressional District, calls to abolish ICE","Donut 8%er &amp; Sally Albright fan calls Briahna Joy Gray a racial slur in order to attack the \"brogressive racists\".","Neocons are proof that Stalin was right about Trotsky","White supremacists are talking about murdering students at UNC for tearing down a Confederate statue.","The next governor of Florida!","Left media silent on Andrew Gillum until recently..","What McCain Built...","[I know, it does not blame guns, sue me] Jacksonville, FL: Another Preventable Mass Shooting.","My reaction when that new Chapo is a day late again &gt;:(","Report: Toddler died after contracting infection at ICE family detention facility","Petition to UNLOCK: Episode 239- Fact Fight ft Matty B Stats","these Indian proud boys sound lit","Police of Dresden, Saxony, Germany openly admits that there are Nazis among their ranks: \"In the end the police is a mirror of society. We have all political currents.\"","Anti-semitic white supremacist conspiracy theories getting 3.2k upvotes on /r/memes","The Hardships of Part-Time Teachers","Obviously, *ideologically* I didn't agree with him.","tfw Q finds donuts suspicious","NRATV Bashes Madden Shooting Survivors for Wearing Headsets.","RIP John McClane, a real American hero","Meanwhile, on CNN.","Tucker Carlson is a racist with a weird face. Here's a meme about it...","Another win for the marketplace of ideas","Chapo Dead Pool","Tone Def","Any good wholesome leftist communities ?","The first gamer-american president","where’s my chapo","There is a third choice.","how about stopping doing this","Watch as Trotskyists try to deny he ever said this...","reminder that oligarch failchildren are and have always been dumb as shit","Go off King","Amber Frost sounds like what John Kerry would call yellow snow","\"The big idea that could make democratic socialism a reality\" - Matty Yglesias is sort of good again folks","capitalism.jpg","In the same documentary it is shown that the US Justice Department invoked national security reasons to prevent Humberto Loya Castro, the lawyer of Chapo’s Sinaloa Syndicate, from being summoned as a witness to the trial against Vicente Zambada Niebla.","Lindsey Graham Continues \"Fire Sessions\" Tour","Reading about McCain I stumbled on the story of Vo Thi Sau, an Vietnamese anti-colonial rebel who fought the French in the early fifties. She was executed at a horrific prison later used by the US and South Vietnamese","Fucking bangs that if you get killed by someone with a skin shade darker than #ffffff, your death gets politicized by known rapists: Donald Trump and Bill O'Reilly.","Lee Carter is good, folks","Why the fuck is this on my school agenda???","Reminder that QAnon, like stopped clocks, is right twice a day","This is the future liberals want.","Malcolm X on white liberalism","Leaked image of Will Menaker as a child","Will Menaker's First Fortnite Win","Rest in Power, Comrade Tibbetts","McCain's only mistake? Sarah Palin. Thanks, Vox","I will mace myself in the face if Donald Trump doesn't get re-elected","lets abolish PE","Antifascists RESIGNED!","Olympic-level mental gymnastics from Boss Ross","Tinder minus poor people.","Rohingya: UN calls for Myanmar generals to be prosecuted for genocide, war crimes and crimes against humanity","In Which Magic Players Figure Out We Need To Abolish ICE.","The Chapo Mindset is...","Trump can't out-compete dead men for attention.","A real war hero - Yuriy Trushechkin","Deplatforming works, folks","I don't expect the country that allowed Dick Cheney to shoot a man in the face (and have HIM apologize to Cheney) will somehow dump Trump outside an election","/r/ShitAmericansSay banned me for posting McCain's g**k quote, so I'll just leave this here","Report: Baylor Secretly Infiltrated Sexual Assault Survivor Groups","The_Donny is not sending their best to debate Chomsky","When socialists run for president","\"We are the Robots\".","Just accept the fact that sunday eps are monday eps now","You ever clench your bhole and have it crack your back?","Glenn Beck's Restoring Honor Rally was 10 years ago today.","Owning the libs is cool and good","Trump is terminating NAFTA","Drumpf tweets \"John McCain was a fried dingo's anus\" JK here's some news about the prison strike - students rally at San Quentin","Inside the secret network providing home abortions across the US","So Sad","Libby Watson twitter thread on an insane pharmaceutical sales rep message board","The Home Alone movies are facsit propaganda for children (and adult children).","Loukanikos the Greek anarchist dog, a photo thread.","Nazi Dipshit Milo describes his take out orders as \"A gender neutral bathroom\"","Jordan Peterson’s tweets attract a certain type of people.","\"The $999 price [for an online textbook] was set w/ good intentions, though we realize now that we needed to explain the rationale behind it better.\"","Traveling labor organizer?","supersoldiers don't forget to order your new uniform","Some info on how to support the Prison Strike that has nothing to do with John McCain","We haven’t dogged on Elon musk for a while, so I thought I’d defend this pizza wheeled genius is just trying to save our lives with rockabilly and super cool tech.","Sam Hyde has turned into a depressing right-wing car video guy.","Hey we did a thing in Austin.","International Assadists References Directory – Kester Ratcliff – Medium","lord help me I'm back on my bullshit","Local libertarian unwittingly makes an excellent point about libertarianism.","Democracy Now calls out whitewashing of the history of John McCain; one of the most misogynistic, militaristic, uncivil men in U.S. politics","Was the entire Hippie movement a psy op?","As everyone tries to outdo each other on McCain takes, here comes Ben Garrison.","Chapo will never be on time again","About 1000 Neo-Nazis ran through #Chemnitz today, declared an open hunt on migrants and refugees and attacked everyone who didn't look \"german\" enough.","Rich Boy - Throw Some D's","If the podcast doesn’t come out by the time I have to drive home","Zephyr Teachout explaining what electing her NY AG is so important","What have YOU done for the troops today","If DSA continues to endorse and support candidates who are willing to make compromises with the capitalist class for respectability’s sake, we will lose the trust of the disenfranchised and we will be unable to meaningfully organize","\"I like McCain, but his hawkishness was probably his worst quality.\" \"That's a weird way to spell best\" - /r/neoliberal is at it again, showing how it's totally not just conservatism against open bigotry (unless John McCain is using racial slurs, which is actually fine).","Slavoj Zizek on Beethoven's 'Ode to Joy'- Matt Christman","My comrades who are sick of the capitalist system can we get a drunk thread? I’ve messaged a few friend about a socialist revolution","Never cuck out. Always defend the USSR.","I wish I was John mccain so I didn’t have to read this entire thread of people being dishonest morons","The Other Side of John McCain","Kushner Companies and Michael Cohen accused of falsifying building permits to push out rent controlled tenants","Miami's history of CIA ties and propaganda campaigns","The Ice T = Dril conspiracy continues to be compelling","The Fact that Libs are Treating this as a Monumental Event in 2018 Shows How Poorly Equipped They are to Deal with Fascism","The Only Force That Can Beat Climate Change Is the U.S. Army","You're watching bird up, the worst show in the Gulf States","Leaving the fuck mccain stuff aside for a second, what happened with every idiot that complained about taibbi and felix here?","Kalashnikov, famed for their rifles, unveiled a concept electric car, which looks exactly like you'd expect a concept electric car from Kalashnikov to look like.","Guess who they're saying might fill McCain's Senate seat?","They said there were two fathers, one above, one below. They lied. There was only ever the Devil. When you look up from the bottom, it was just his reflection, laughing back down at you.","The FBI file on Einstein includes some interesting theories, including that he made up relativity as part of a communist plot","Joe Biden Backs ‘Public Option’ Foe in Primary Fight","McCain’s Kremlin Ties (in honor of Sen. McCain's passing)","THATS A GOOD THING YOU FUCK!!","When u nut but she still etc. etc. etc. etc.","Queers Bash Back","Y'all eat here?","German Neonazis gather near Karl Marx monument","\"All politics is local\" is far less useful than \"All politics is incestual.\"","\"My heart is in Havana\"","A Bloomberg News reporter wrote an article covering Wells Fargo's ties with the NRA. The Wells Fargo CEO complained about it to Bloomberg News so they reassigned the reporter.","Ethan Hawke shared a good take about superhero movies. Now watch as the manchild hate-nerds at AV Club throw a massive shit fit","the crime drama Ozark as a critique of Neoliberalism","This tweet just won the internet","Hillary Clinton (2016 - Found Footage)","THE BRAND IS STRONG!","Alex Jones repeatedly uses anti-trans slur","Just a reminder that the \"bone\" McCain threw to Obama when he said he wasn't an Arab...","/r/EnoughCommieSpam throws out all the common \"CTH is T_D\" tropes as they get super mad about this sub's response to McCain's death.","If I see one more commercial for JB Pritzker for Illinois Governor I'm gonna jump into the river with a cinder block tied to my ankle","This BRAVE PATRIOT fought a losing war against the Vietnamese for the United States. Why aren't the Flags at half mast for him Drumpf???","#Resisting racist Trump and brogressives by *checks notes* saying racist shit myself","Lefty computer science/tech podcast?","Do you subscribe to any publications?","Scientists Warn the UN of Capitalism's Imminent Demise","German Neo-Nazis gathering in Karl-Marx Square in the east German town Chemnitz.","Hey Bernie and AOC! Let Council Member Sawant show you this is done.","WTF I love Trump now","\"Take to end the girl fired from nasa takes: unless you're literally fucking paying me to be professional on my personal twitter goddamn fuck. off. It's capitalist horseshit that we have to be beholden to labor even when we're off the clock. Stop being bootlicking dipshits.\" (thread)","Sweden: Truth, lies and manipulated narratives?","One Dead McCain, 2.5 Million Dead Iraqis","how the fuck do you know whose voice is whos","So according to the highly intelligent people of /r/worldnews, there can't be poverty in Palestine because there is an obesity problem (according to twenty year old statistics before the blockade and mini wars)","Great thread on sectarianism and dogmatism on the Left","I can’t say I disagree with this thread.","Donald Joins the bending over for the war criminal","I hope this sudden influx of chuds and freaks proves to you accursed mods what we knew all along","guys... the man in the white house... he's very twisted... hmm... he's almost like... the joker... makes you think doesn't it?...","Reading suggestions: Stupidest books about socialism","Children at Australian-run immigration detention camps 'google how to die'","Looking for readings on Iran","This woman was fired from a Tim Hortons near Flint, Michigan. Her crime was being at her disabled son’s bedside in the hospital before he died instead of working a shift. Take a look at what the manager had to say to her.","tfw u see the coochie","Florida Democrats basically picked a Republican to represent them in Congress","The Guardian has decided that Trump colouring in the US flag wrong isn't a product of his stupidity, rather it's evidence that he's a Russian agent.","Behold, the boomerest of all boomer takes.","Today in Praxis: Thieves Replace Police Rifles with Toy Replicas","Some incredible self-awareness from these cops","In which reddit collectively realizes that everyone just fucking hates working","The world understands America is a profoundly and fundamentally unstable country. They're right.","Serious question, what do you think of your favorite hosts making 100K+ a month form you and now they're making profit from you by selling you a book?","He's running","Chapo Music Minute: Anti-Flag - Racists","I FIGURED OUT WHY THERES SO MANY COMMUNIST FURRIES","An All-Caps Chat With the Band Behind “White Nationalism Is for Basement Dwelling Losers”","Thanks Candace","Donna Brazile: \"Democrats voted to removed automatic delegates from the first round of voting. But we still have seats at the table. We are still in the room and very much capable of setting the menu.\"","The Coup - I Love Boosters","Is this sub an inside joke or are you all absolutely fucking retarded?"]