["State of the subreddit","Hawk investigating a drone","Shogun Vader","Guy took a picture of his bruised fingernail every day for a month (u/classicjondor)","25 November 1941: Sailors jump from the hull of HMS Barham as she capsizes and her magazines explode.","Cutting fruit with a power washer","Fabergé eggs are jewelled Easter eggs by House of Fabergé gifted to Russian Tsars Alexander III and Nicholas II (1885-1917)","Best Handwriting in the World (2017) from grade 8 student from Nepal 🇳🇵","Making a mirror","Since blind people tend to forget memories faster than normal there’s a company that will make 3-D version of your memories.","The daggers of Toetanchamon. One made from gold and the other one of meteorite","Fast draw world record at .295 second","The aftermath of a toxic sludge spill in Hungary","The \"Old Croghan Man\" Preserved torso of a man found in an Irish bog from 2000+ years ago","Nice Reflect of the San Francisco City Hall","Spiral Drawing","This is horrible but with natural art","Mountain inside a Swiss water bottle","Drawing circuits with conductive ink","Flatpacking a wind turbine","A Shipwreck under the Milky Way by Mikko Lagerstedt","This digger working on the side of a cliff","Water spout created by massive fire","Triple waterfall -- Lebanon","Moroccan tree goats","The way Rhinoceros beetles attack.","Facial hair; razor vs electric shaver","In 1995 Fred Rompelberg pedaled a bike at 167 mph (267 kph) using a drag racer to break the wind. Nobody has broken his record.","Driftwood Lion","The Joker’s introduction on the original TV series and Nolan’s Dark Knight","2018 Audi A8 reacts to a potential side collision by lifting the side to protect the passengers","Empty Road in Hawaii","Raining,,, only there","A shiver of whale sharks being fed by divers off the coast of Cebu Island in the Philippines.","Central Nervous System","A drawing with circles","Create the problem and sell the solution","The underside of a lily pad","Faces ... illusion","IKEA uses projected arrows instead of floor stickers in order to not have them scratched off by people walking over them.","Blood vessels in a human head","marble operated door lock . make sure you dont lose your marbles","A furless bear.","More balance and control from Monster Jam's Tyler Menninga and Grave Digger (credit to u/shamus608)","This is cool in a grim kind of way","Lake Kaindy , Kazakhstan","Wringing out water in space x post from r/oddlysatisfying","Looks like its a virus","Running over a lit cigarette butt with a vacuum cleaner full of gunpowder","Carving a wooden Minotaur smoking pipe...","PsBattle: THIS POLICE RABBIT","Time-lapse Sequence of Jupiter’s North","guy explains what a 4D ball would look like","Why owl handlers must wear gloves","Negative drawing","Anatomy of a Sarlacc","A witness to Abraham Lincoln's assassination appears on a 1956 TV game show","Up close look at a Horned Puffin 🐦","Archway Truck","A deep sea fisherman decided to start taking pictures of his unusual catches and what came out is a gallery of freaking weirdness","Fruit Ninja: Pressure Washer Edition","Finland night stars by @JuusoHD","Man Survives Shark and Bear Attack within 1 Year Period","This aquarium kitchen","Phages are parasites of bacterial cells. The viruses attach themselves to bacteria and, using their tail as a syringe, injects their DNA into the bacterium. The phage DNA then takes over the bacterial cell, forcing it to produce more phages.","Sometimes you just gotta jump in.","Kiyotsu Gorge Tunnel- historic lookout tunnel in Niigata Prefecture, Japan","The Vatican, turned on its side, against Angel Falls, the tallest waterfall in the world","Red-Glowing Jellyfish from the Deep Sea","Water transfer on shoe","Sperm Whale is Not Camera Shy","Inverness Shipwreck","Pointillism, using markers on a whiteboard","The preserved vascular system of a shark.","5 screw drill","Compare the actual size of countries and be amazed!","Why pau more for the same?","16-cell human embryo on a pin","Yokosuka Japan Pokemon Go event. 5 phones at once for raid battles","Television with a bullet hole in an abandoned house. Link in comments (OC) 800x1200","The inside of a peach pit look like an almond","Hear the Original, Never-Heard Demo of John Lennon’s “Imagine”","Water slide in a cruise ship","The Thoughts of a Spiderweb: Spiders appear to offload cognitive tasks to their webs, making them one of a number of species with a mind that isn’t fully confined within the head.","Cops in Quito Ecuador dress like superheroes to make them more approachable by children","\"The Force of Nature\", Lorenzo Quinn","TIL: There are goats out there that can produce Spider silk","The world's population by year.","How this snail eats a worm","Nautilus bowl","Jellyfish washes up on the shore after eating a fish","Whats your average mpg?","It's a giant paper mache ball","A Baby Tree Kangaroo.","Never knew they looked like this from below","5 Explorers Who Mysteriously Disappeared","Elephant with dwarfism, about 5ft tall and fully grown.","Justin Willman Makes This Guy Think He's Invisible","Catching freshwater snails","Claw Machine Master","Vestrahorn Iceland at Stokksnes","Some The Biggest Heavy Duty Hammer Forging Factories, Extreme Ring Rolling Fast Machines.","A Longhorn.","More than what meets the eye","Grandpa re-living his childhood days","Tianjin Binhai Library in China incorporates bookshelves into the stairs and seating to encourage reading and exploration.","This kick ass sand picture in a bottle. No glue used.","A Soviet propaganda poster from WW2: According to the fascist race-theory Aryans must be: Blonde like Hitler, slim like Göring, and beautiful like Goebbels","I saw a hawk with heterochromia iridum, or two different colored eyes","🔥 When the sun hits a pelican's gullet just right, you can see the fish in its mouth","Don't try this at home.","Banana art","Tennis ball spinning just looks like another miniature galaxy","Human printer printing a human.","What your favorite dinosaurs actually looked like","Realistic painting of a citrus fruit","The Irishman (2019) Images Ft. Pacino, Scorsese, Cannavale and Romano","Two different water droplets side by side (look closely, it is not the same droplet copied)","Hong Kong Carved Onto Duct Tape By Takahiro Iwasaki","Was told you guys might enjoy this","In 1963, then 7 year old Yo-Yo Ma performed at a benefit concert for an audience that included President John F. Kennedy.","DEA Merit badges.","Table salt art. (Artists name is Bashir Sultani)","How to catch small sea snails.","Whirlpool Turbine","Lord Farquaads castle in Shrek is designed after my university’s library","I spent a year recording radiators to make music | Andrew Huang","Impressive welding skills","Diver’s found giant squid in New Zealand","Flying birds overs Lofoten, actually one of the best photograph of this place","This ring based on the aurora borealis","China's destructive laser rifle has a half-mile range","Keanu Reeves has casually been Crashing Wedding.","A sharp knife","Mind Collage painting done with india ink","Irrational clock","Sneakers Display is out of this world","A fight scene between shape-shifting beings in Lotte Reiniger’s 'The Adventures of Prince Achmed' (1926). The oldest surviving animated feature film.","Breaking ice on a trampoline in slow motion","Huge","Sufi Muslims show devotion to saints by putting swords in their eyes.","Watch 1993 New York City in High Definition ! A DTheater DVHS Demo Tape provided by Techmoan !","Cat lungs being inflated","Women's Pockets are Inferior.","Incredible Minecraft build timelapse","Anodization of titanium🔥","Fire Whirl in British Columbia","And that's how the Kraken was Born","Contact juggling","This solar spark emergency lighter.","Best urban spot of Hong Kong !","Surfing a rain-swollen drainage ditch in Hilo, Hawaii, via Shawn Pila on Instagram","Perfect and REAL reflection of the vesturhorn mountain in iceland","What are the chances","Epic lightning storm over Tokyo.","Carved skull in Zürich window is horrifyingly beautiful","View of Madonna della Corona Sanctuary (Spiazzi, Monte Baldo, Verona, Veneto, Italy).","Chandelier made from human bones","Amazing Electron Microscope Images","Lavender field of Valensole, France [OC] @Grafixart_photo","AR superhuman power: see trajectory of thrown objects","This wind turbine spinning way too fast","This is the US side of the Boquillas area in Big Bend. Mexican nationals make trinkets and souvenirs and place them on a rock just across the Rio Grande. No direct exchange; just an honor system. Note the raft and pickup truck in the clearing across the river.","Human embryo on the tip of a pen","150 Tons Silo Lid Open Effortlessly","Iceland Black Church","Juggler","A filtration device for wine, mega size!","Graphite before pencils","Make Clear Liquid Turn Purple Instantly! EVEN While Pouring It!!","Same boat with and without a gyroscopic stabilizer","Abandoned Singer Mental Health Center in Rockford Illinois","Spider Net Building Timelapse","Buildings Swaying 9.1 Earthquake","“Tumpak sevu” in Javanese basically means “a thousand waterfalls”","Walking on air.","Torres del paine in Chile","open lane in a forming traffic jam","Every dot is moving in a straight line","Vesturhorn in Iceland","How traffic signs are fabricated","The view on Lake Braies in the Prags Dolomites in South Tyrol, Italy (OC) Grafixart_photo","The two penises of a rattlesnake.","Generative MIDI Composer: Procedural Braindance","Strange device i saw at a friends house. All-in-one: phone, radio and toilet paper holder","Ferrofluid on a screw.","A mural seen through blue and red foil","High tech robotic arm shaving noodles from a block of dough","Flying an Ultra-Lite over Bryce Canyon National Park","War at the watering hole.","Leonardo da Vinci’s double helix staircase inside the Château de Chambord, built in 1520.","This Two-Dimensional Bakery on Google Maps","The Wrecked Ship of Inverness (which now burns under the flames)","Nature at night","LEGO crawler crane at 1:24 scale","Double exposure 3D graffiti by artist insane51","In Japan there are people hired just for this.","The Necromancer ... A Calling from the Dead","Kalashnikov releases Soviet era style electric hybrid and it looks like something out of The Simpsons.","Turn an ordinary PENCIL into something COOL!! - DIY Tutorial","That's one big 'splosion","Time lapse","I never noticed.","Over the last 14 years, world wide Google searches for \"porn\" more closely resemble searches for \"weather\", and searches for \"math\" more closely resemble searches for \"ghosts\".","Mysterious new brain cell found in people | Science","Crowd at the Pope's Mass in Dublin, estimated at 130,000 - compared to 1,250,000 in 1979","Beautiful temple in Hong Kong","Technician films fireworks launching from behind bulletproof glass","This tree's shadow","A small ant biting a branch whilst holding up a rock","The Modern Mummies of Papua New Guinea. A rare look at life and death in a remote village in the West Pacific.","Moonlight at Patagonia","Origami horse made from baking paper","Realistic Head On Crashes Simulation","Guy in a wheelchair on the highway.","Beautiful aurora reflect in Iceland","Cork trees live to be over 200 years old and their bark can be harvested every 9-12 years","This vine has an interesting way of finding sustanable support.","Cannon follows gunners head movement.","Nimble Fingers","USA vs Russia Arms sale.","Magical Kirkjufell in Iceland","How money is counted in different countries (different ways of handling money while you count it)","how chain links are joined together","HMS Queen Elizabeth leaving Portsmouth before setting sail to the US to start sea trials with the F-35","A beautiful mantis shrimp","Picture of fire i took","Parmesan Carving - BEST CHEESE CARVING EVER","Lightning strikes water","Don Logan | Rage and Resentment","Condensation on windows of indoor pool behind plants (yucca &amp; frangipani)","He's flying a TIE fighter","This ice cream cone","Evolution","Reflect on the Castle of Mont Saint-Michel in Normandy (France)","Amazing high resolution image of Saturn taken by NASA's space probe Cassini.","The Gelmer Funicular - Switzerland - info link in comments","Perfetcly Synchronized","Cross section 3D model of a human heart","Baby stingrays","This is why the kneecap is a useful thing","My friends cat Charlie is a hermaphrodite [NSFW]","Laser Engraving and Cutting Jeans","Wooden Celestial Mechanical Calendar and Orrery","This is just pure freaky.","A clamped artery (top) and vein (bottom) gets released, while white blood cells try to cling to the vessel walls.","The water molecule is an allergen in the exact same way peanut proteins are allergens. It is the only known allergen (compound capable of directly binding to mast cell IgE receptors) that is not a protein or a hapten.","342.000 More to go: Get Stefan Karls Family the golden Playboutton","Wold's lagest hula hoop","The way my Cola froze","Aerial view of Hong Kong","It's easy now!","NASA maps atmospheric aerosols in psychedelic image","Black dude chilling with mako sharks","Sand design changes with different sound waves on plate","The amazing level of detail in this painting","Not mine, but it belongs here.","Perfectly framed by Trees [OC] Grafixart_photo","Everlasting lightning storm - Lake Maracaibo, Venezuela","MINI WORLD! Best TILT SHIFT Clips","Cow eats burning coal","Building a 13th-Century Castle in the 21st Century","Perfectly timed ball launches through a hoop four times","Chiang Kai Shek Memorial Hall - Taipei, Taiwan","I think this applies","Hippo herd from above","Handmade paintbrush","Neon-lit street in Hong Kong","Eosinophils - a type of immune cell - swarm and destroy the larvae of a nematode worm.","Roller Coaster model using a 540-degree orientation (3π) Möbius Strip track, and a frozen 'car' traveling above and below the track without crossing an edge.","Bacteria visible to naked eye","The way titanium get colour with different voltage","Miles, and miles of hose resting before a well deserved shower. Taylor Creek Fire, Oregon 2018","\"Dazzle\" camouflage for ships.","Best way to throw a ball.","Must've taken hours to get this much detail in one painting","Earthrise on the moon filmed by the Apollo 10 crew","Early analog access memory used an amplifier and a pulse shaper to create a loop from the input to the output which maintains a signal as long a power is applied. This device stores 1.5 kilobytes and is filled with mercury.","I Compiled a Video of 60 Rare Historical Photos You Won't Find in Your School Books","Lighting striking the water","My Local Wal-Mart feeling really happy.","Molveno, Italy.","Gravity defying beads","Incredible Photo of both the Aurora and a Forest Fire in Canada's Yukon Territory","A different perspective of the great pyramid of Giza.","Patek Philippe Nautilus Fully Hand Engraved","Making art with mirrors.","Orange County Fair at Night","Venus and waxing crescent Moon coupling in Nepal","Full afterburner","A tool to plant saplings","Intricately detailed Alien motorcycle","Low-poly golden origami tiger","The Moai Heads of Easter Island, Chile - by Grafixart_photo [8000x10000]","Long Exposure Picture at a busy Airport","WonderCube -- a tiny smartphone accessory does it all","Now you know where to bring your girlfriend for your future meeting","One year ago today, the NHC began tracking a tropical wave over western Africa for possible development. That would become Hurricane Irma, one of the strongest storms ever recorded in the Atlantic. Here's a video timelapse through the brunt of the storm's 180 MPH winds on the British Virgin Islands.","A rare photo of a Japanese Samurai wearing Kusari Katabira chain armor with Hachi Gane forehead protectors and wielding Naginata. Japan. Circa 1800s","The Amish raising a barn in 2017","What r/offmychest does if you subscribe to r/TumblerinAction","The tomb of urban designer Ildefons Cerdà is his design for the city Barcelona","Second World War in Northern Ireland | Map showing areas of Belfast which were subjected to the Blitz on dates shown.","The devices are called \"Uritrottoir,\" which combines the words for urinal and pavement.","Cancer Progress: Much More Than You Wanted To Know","1000 degree tungsten ball vs. homemade lead anvil","Spiral sketching","Tiny eggs inside a tiny crab inside a cooked cockle.","Dream in Color","An unusually clear look at the shock wave that accompanies a deflagration","Field size comparison of different sports","Camera stabilization programmed to track the stars.","Mercury interacting with Aluminum","Interesting narrative on How Imran Khan became Prime Minister","this rock eroded by wave action","bale wrapper","The ceiling light at the LEGO store.","Bagger 288 excavator impact over 33 year","How a Sewing Machine Works","Plasma vortex.","The first x-ray light of a nuclear blast, before the casing has even exploded.","A real slice of a man","“If you see me, weep”. Drought in Hungary is revealing “hunger stones” in the Elbe river. The stones have been used for centuries to commemorate historic droughts — and warn of their consequences.","Cool clock.","Volcanoes On Multiple Celestial Bodies","Cracking an egg underwater","This tree in front of a lamp post feels like Tim Burton.","Slow motion demonstration of a survival tool known as a fire piston, which works by rapidly compressing air causing ignition.","This drone footage is amazing","[OC]Lime drink lighted up by torch changes colour when drank","Lenin's outfit has changed within the 100 years in his tomb.","Creative artwork made with sparklers","Saw this man in Dublin last week","The neon filled streets of Hong Kong during heavy rain","Titanic vs modern cruiser.","never look at it the same again","This plastic bag look like a water ocean.","Man saves minks from fur farms and takes it and his pupper rat hunting (WARNING: graphic)","This spiders camouflage.","This plant has no chlorophyll","Kirkjufell mountain during winter, Iceland - Grafixart_photo","The way these ants build a bridge with their own bodies to cross surfaces mid air.","Year by year timelapse shows the inexplicable movement of stars throughout the IC 1101 galaxy. Scientists say this is the first proof of some form of dark matter.","Big Brutus (people for scale).","Inventor Franky Zapata reveals new Ezfly hoverboard","Woa","And that’s how you Improvise, adapt and overcome.","The Indigenous Mexican Corn That Uses Air as Fertilizer","This is Interesting!","psychedelic painting created with acrylic paint","A real time map of satellites orbiting Earth","Constructing a miniature V6 engine.","The best way to put on a swimming cap","The Falls, The Moon and Mars","The History of Opium","California lawmakers pass bill to erase old marijuana convictions","Perfect shot.","Smoke bubble on water","South Dakota tornadic supercell","[OC] Carcassonne, France","Stairway to Heaven negative harmony cover is really interesting","A $244 Wagyu Steak Course","Physicians at UMRC develop a way to fabricate artificial organs that mimic the real thing (Video in the link)","Sugru moldable glue","reminiscent of an hourglass for some reason","Dragline excavator bucket for open pit mining","Landing on an aircraft carrier in bad weather.","Wood Splitter","A wooden mirror","One of the best photo of The Black Church of Budir in Iceland by Grafixart_photo","When glacier water meets the river, Norway.","Not a caterpillar","[OC] Ants carrying away their lunch","The way this water flows.","We get awesome lightning!","The origin of the American saying \"a little from Column A, a little from Column B\" comes from Americanized Chinese restaurant menus such as these.","Blue lights in restroom prevents drug users from finding their veins","The perfect angle","MLB pitcher Justin Verlander charged $1 million at Beverly Hills Hotel for being a 'Dodger Killer'","Taking a couple steps back to appreciate the full detail.","Whirlpool Turbines Can Provide 24/7 Renewable Energy For Dozens Of Homes","This plastic bag look like a water ocean","Plasma Vortex in Magnetic Field","Adam Savage made a bottle opener from a hammer with Laura Kampf","Bond of Union on an Etch A Sketch!","Milk kitty tase test","Mindblowing! AI copies dance moves of one person onto another.","Row Crop Flaming","Asperitas Clouds Over New Zealand","The Long Room at the Trinity College Library in Dublin","The cycle of an equinox clock","This Shark","Girl treated with experimental gene therapy for spinal muscular atrophy doing push-ups like a champ.","German forest fires setting off WWII bombs.","I found this particularly interesting, removing bead wires from old tyres","different voltages change the color of Titanium","Pouring water on sand that is still hot after cooking over it","Wife made son a special cake for birthday","This dragon lamp","Dummy with realistic tissue used to demonstrate surgical capabilities.","Plate Printing","Super flip kicks","A fully transparent rain forest frog","Venice from above.","Last second of a life","Now we can take Milky way shot with just an iPhone","Working Venom Mask","Special effects used to visualize the movement of lightspeed travel in \"Solo: A Star Wars Story\"","How a shotgun works","Noodles delivered by waterfall","The way titanium changes colour at different voltages.","Candle press?","The way he started this lawnmower using a drill","A few months ago you all liked my ISS-Moon photo. Yesterday I finally got the International Space Station transiting the Sun.","China's Waterfall Building","This jalopy has a Jim Beam bottle attached to the dingle shmingle","Removing Splinter From Foot","Motorcycle Storage Shed","Combined flute (upper half), Oboe (lower half) and walking stick carved primarily from Narwhal Ivory. Made by Georg Henrich Scherer, Butzbach, Germany. 1750–57 AD.","Multi-Pitch Whistling","this is art","I try hard to make an unusual photograph of this iconic places (Mont St-Michel) Grafixart_photo","The CORRECT way to use a can opener.","The Paternoster Lift","Interesting dance","How this clock changes between time, date, and temperature","Stairway to Heaven's Gate, Tianmen Mountain National Park, Zhangjiajie, China","Perfectly symmetrical violence never solved anything","She is thinking lily pad can support her weight","Long Surgical Pin Pulled Out From Man’s Face","Fruits and vegetables looked different in the past","Early days, Michael jackson","DIY Colored Pencil Wall Art // You've Never Seen Anything Like This // Woodworking Build","Why Czechs don’t speak German","This guy solved a Rubik's cube blindfolded in 17.33 seconds. This time included him memorising the cube and solving it.","Drought In Central Europe Reveals Cautionary 'Hunger Stones' In Czech River","Have you ever watched a snail shower?","Swingball Shakespeare","Robot-Made Burgers Wow The Crowds In San Francisco","Human skin after 55 hours of swimming.","Laser tattoo removal","Satellite Images 1984-2016:How Earth Changed","Ancient Egyptian Pregnancy Test Survived Millenia Because It Worked","Ever wonder how trains run year round in the Great White North?","Arnold Schwarzenegger's son with Sylvester Stallone's daughters","I just made a horizontal version for computer of my famous Moai Head, enjoy it","View from a rear facing motorcycle helmet camera in Australia","Wow","Unusual Desert of Namib Photograph take during Mammatus Cloud and Sunset, Namibia @Grafixart_photo [OC] [2000x2500]","An augmented reality sandbox","Dad Shows What Would Happen If Children’s Drawings Became Reality, And The Results Are Both Terrifying And Funny","AR Alduin dragon from skyrim","When fisherman plays golf.","Have some Pi","Pencil Drawing of Thanos","Glide glide slippity glide in the Swiss Alps you can Summer Slide","Man removes bee hive in field with his bare hands.","Wilderness Safaris Bisate Lodge Rwanda","This Greenhouse painting impression","The way these blades spin in harmony.","This radar effect made the cut for an upcoming game","UnicornsAndJerky's friend's cow looks like outer space.","3 story dog house including pool","Dash 8 hitting the deck","Shotgun Firing Mechanism","Pouring water on sand that is still hot after cooking over it.","portable washing machine","Justin Timberlake was Secretly hired by McDonald's with $6 Million to write a Pop Song and Mind Fuck the World","Ancient Frilled Shark in Japan","Gear Heads take note: Jaguar to make an electric version of 1960s E-Type sports car!","The Krubera Cave is the Deepest Cave in the world, and they still haven’t discovered the bottom yet because it takes so long to descend and ascend","This rock skipping pro","Ancient Girl's Parents Were Two Different Human Species","Stamping ceramic plates","Antelope Canyon, USA","This hilariously demented (brain-fetish BDSM) fanfic for the classic god-tier Nickelodeon cartoon Rocko's Modern Life is the very first one to have a proper feature-length sex scene between Filburt Shellbach and Dr. Paula Hutchison (canon married couple that even has babies in Season 4 of the show)","Namibian Night Stars, South Africa [OC] (1801x2400)","BMW Vision Next 100 wheel turning","Interesting","Mutated Grape","A photo trend that combines generations of cities","To Sua Ocean Trench","Bioluminescent algae","Picture of hurricane Lane from the ISS.","This Sewn Boat","On the road with a Mammatus cloud at Atacama by Grafixart_photo","Sandblasted porcelain","How realistic a fake planey can get","When traffic comes to a complete stop in Germany, the drivers, (by law) must move towards the edge of each side to create an open lane for emergency vehicles.","Please Wash Your Hands","Asperitas clouds over New Zealand","Machine removing bead wires from old tyres","Unnecessary but interesting staircase at local law firm","The First Meal Eaten on the Moon Was Bacon","Water ice in the moon's craters confirmed by NASA","What to do with your cat's extra hair","The Cave Motel Room in Northern Arizona is listed as the \"Largest, oldest, deepest, darkest, quietest\" motel room in the World; and you can rent it.","For all the people who think a rock is just a rock - Ammonite fossil from the Jurassic period","F-35 thrust vectoring","Where do these lines cross?","The way these awnings open up on this building.","Reindeer tenderloin from Lapland, Finland","A Roman bronze pessary for insertion into a woman's vagina for one of three purposes: a device to support the vagina or uterus; a form of birth control; or as a medical treatment, 200 BCE-400 CE","Optimal routes by car from the geographic center of the contiguous U.S. to the center points of all counties - animation","This is a Circumhorizontal Arc","Perfect Mountain Reflection in Iceland - By Grafixart_photo [OC]","A 1962 electronic calculator that uses piano wires to store information","Loading bar animation makes the cut for an upcoming game","Liedenfrost Effect causing an air bubble around a red hot metal ball.","U/codyredcody peeled a golf ball. Photographer James Friedman, my friend, cut some golf balls in half","A chair you can wear.","“Apollo 17 site, the tracks laid down by the lunar rover are clearly visible, along with the last foot trails left on the moon.”","Snake hero","Folded dollar bill","A 300 year old piece of wearable tech: an abacus ring from Chinese Qing Dynasty era.","Japanese Spider Crabs Growing 12ft Long","Rain of stars in Bardenas Reales, Spain","I cut and peeled off the shell of a golf ball and inside is this rock hard blue ball","The History of Tea","This Bullshark Deterrent","This emote can dance to anything","Amazing night market shot from the top in Hong Kong","One roll of toilet paper in Venezuela costs 2,600,000 bolivars","Today I fed the tiny jumping spider that lives on my desk. Pen and human hair for scale (banana was unavailable). [OC][OP]","edible water bottles ( more in comments )","Rainbow Appears During Detroit Tigers' Moment of Silence for Aretha Franklin","Solar Flare","An 18th century vampire hunting kit...","There's no rotational movement in this gif, but take a look at how a linear movement is transformed in a wave","Probably one of the most spectacular shots of the total solar eclipse of August 21, 2017","Ever heard about volcanoes steam rings? It's a very rare but spectacular volcanic phenomenon x","Realistic animal painting.","Hikers attempt to escape from Glacial National Park Wildfire","Wait for the blue.","How to open locks with a lockpick gun","In rock climbing there is something called the \"fall factor\" - In this diagram, if both climbers were to fall, they'd fall the same height before being caught by a clip in the wall, but climber (1) would experience twice as much force as climber (2), due to less rope available to stretch","Humpback Whales bubble netting near Great Bear Lodge.","Towers of Dubai breaking through the clouds","You scared the hell out of me!!","The boat car","This is a model of the Quetzalcoatlus Northropi, one of the biggest known flying animals.","When the wind hits","Smoke blanketing WA state from Canadian fires [Drone Footage]","Have you ever wondered how sponsor logos are painted onto the tarmac on the runoff areas in Formula 1?","A brilliant optical illusion induced by the colors of the clothes","I checked all where I am","A flooded desert - Lençóis Maranhenses National Park, Brazil","Toy car precision","Air Force Uses Bears as Test Pilots","This Truck Can Swim, Climb, Drive Anywhere","How likely you are to die from different activities and behaviors (micromorts and microlifes).","Your scientists were so preoccupied with whether or not they could, they didn’t stop to think if they should...","Stars Keeper in Easter Island [2400x3000]","Milky Way &amp; Bolivia (Image Credit: Xiaohua Zhao)","Have you ever wondered how sponsor logos are painted onto the tarmac in runoff areas?","I just graduated from the University of Glasgow in Scotland. I'm a black American. This is the video I made on how I made it happen","Erin Leahy (pianist from the band Leahy) plays a Novelty Act on the Fiddle","Tree stump remover","Wooden carving Ragnar Lothbrok as smoking pipe...Do you think!! Its the World's best Viking pipe ...?","How much does life weigh? Researchers unveiled this cantilever scale designed to detect minute fluctuations in a living cell’s mass. And this is a single cell","Rocket assisted take off","Floating taxi in Hong Kong","Splitting a rock","Snow Tree under Stars @Grafixart_photo","Ex-Pakistani president Asif Ali Zardari's expulsion letter from his college days for \"Hatching a plot to take over the administration of the college\" and proclaiming himself as its Bursar","She's ready to roll out","Eerie Skyglow Called 'Steve' Isn't an Aurora, Is 'Completely Unknown' to Science","A real life Falmer cave (Waitomo Glowworm Caves, New Zealand)","Cucumber harvest","This moving square illusion is a consequence of the so called 'motion binding' perceptual mechanism","2 Seasons 1 Tree @Grafixart_photo","5 Most Unusual Japanese Islands","Rock split","Whale saying 'Hello' to some whale watchers","3D sound...Wear your headphones for best results...","Sculpture by Do-ho Suh named Karma","The entire observable universe squeezed into one image by NASA.","This stingray trapping fish before eating them","Sting ray using body to trap and devour fish","3D Mural","VAMPIRE CRABS PALUDARIUM... SO CUTE..... 🤗","Computer animated launched-ball-powered calliope from the early 2000s. *Animusic*","Winding road into the darkness. Carlsbad caverns, New Mexico.","Laptop lid closed most of the way","Printing some plates","Marijuana under electron microscope.","This is genuinely the first time i’m seeing a peacock fly","I found a huge Spanish coin metal detecting in Vermont","Splitting rocks","It looks a normal behavior for mantises striking a dancing like pose. This photo by Hasan Baglar was taken in 2014 and later won the National Geographic Photo of the Year","Jets doing low passes are awesome!","Throwing ~2.5kg of flour on a fire (kids don't try this at home)","This mailbox is a mini crane.","An origami Nazgûl I've folded from one piece of paper.","Found in the Errera Channel on the Antarctic Peninsula this immense iceberg showed obvious signs of being sculptured and worn by the icy Antarctic waters and winds","Look up in the beautiful Hong Kong","Truck that lets you see front of the road to pass safely","The ripples created in the water of lake Natron, Tanzania, when thousands of flamingos gain speed before taking off","A dew covered Ladybug","Making noodles","The rare 'Crown Flash' phenomenon","Awesome Sand Sculpting","Meet Sue, the largest and best preserved Tyrannosaurus rex specimen ever found with over 90% of the bone volume recovered","Hidden World Inside","My Paludarium with vampire crabs 🤗","Long exposure of trench warfare during WW1","Abyssal Gigantism: When Deep Ocean Life Grows Extremely Large in Great Depths","Cabling at the Woodstock Festival 1969","This stabilized gun on an artillery boat","Footage of a oil producing well and how oil flows through perforations","Incredible wood carving","Maori rock carvings at Mine Bay, New Zealand","700,000 year old stone tools were found in the Philippines despite the fact that known humans didn't arrive until 600,000 years later. Researches aren't sure how humans got there or what early hominid could have even made them","Above the clouds in a Paramotor (By: Tucker Gott)","Aurora seen through melting ice caves in Iceland","Post Malone's Airplane Trajectory after losing a tire","The size that ammonites could assume 400 million years ago","Ex-Pakistani president Asif Ali Zardari's expulsion letter from his college days for \"Hatching a plot to take over the administration of the college\"","A bright brilliant blue glows from within an Antarctic iceberg","Cut a paper circle, fold it so that the circumference falls on a fixed point. Repeat. This is how you paper-fold an ellipse","The prosthetic this woman received is beautiful. Info in comments.","Pineapple farming","You can step on lava","Amazing Halloween costumes","The first recorded “firearm” invented around the 10th century in China, known as the Chinese Fire Lance. Made predominately from bamboo.","Mammatus clouds","You may be cool... But, you're not \"Stan Lee playing the Spider-Man video game on an Atari 2600 with Spider-Man and Green Goblin rooting you on\" cool.","Fitz Roy Mount in Argentina - Grafixart_photo","This paw has a small paw mark","Facial Capillaries.","Amazon Opening Facility Capable of Processing 1 Million Packages Per Day.","Praying mantis encased in amber","Ex-Pakistani president Asif Zardari's expulsion letter from his college days for \"Hatching a plot to take over the administration of the college\" and proclaiming himself as its Bursar","Wildfire smoke in Washington","SLO-mo lightning","Fire SKy and Firefall at Yosemite USA","Full mech suit at Cologne Airport","Water ice 'detected on Moon's surface'","A Starfish Making it's Way Back to the Ocean","German movie vs. Elon Musk","Various ways to fuck with your mind w/o drugs.","The way these posts line up!","Pink Sunset at Salar de uyuni in Bolivia","The way this sunrise lined up with the road behind me.","We are able to see planets forming in distant solar systems. β Pictoris is the second brightest star in the constellation Pictor, located 63.4 light years from the Earth. The planet β Pictoris b is visible orbiting its host star in this composite image","Electric Guitar....","Mt Elbrus, the highest peak in Europe.","10 Creepy and Mysterious Radio Transmissions","Late for your flight? Singapore Airport has a 12m high slide","What's inside a Tesla Battery?","Humpback Whale and Diver Shake Hands","It's a paper little bird.","Corn snake with two heads","How laser cleaning works","Blue spider","River in Iceland","Tom Hardy's inspiration for Al Capone is bizarrely...Bugs Bunny","Ameristar Casino's fountain has spouts aimed at each other"]