["Legendary Heroes - Marth, Hero-King Banner Megathread (8/28/18)","Grand Conquests Megathread (8/29/2018)","Father's armor","When your friends ask you which units you used to clear the abyssal difficulty","Unyielding King","Press A to submit to Abyssal Grima","Robin Abyssal F2P Guide with NO skill inheritance","Feh's comic artist of this week (@Katura69) has drawn Laegjarn and Laevatein having their meal together.","No thanks, i think i’ll pass","The struggle is real","Yukata Delthea by @kazakami_73","This isn't Kansas anymore.","Thanks to Grima giving me a 2nd Snorkel, I could finally do this with my Fae and Kana.","Hero-King","Kiran is taking me to PAX! I wonder if you'll be able to find me!","Out-of-context advice for new players","MRW everyone and their mom is completing abyssal while I am still getting pounded by Marth's Falchion on turn 1","Leaked image from Chain Challenge 11/12: Abyssal Mode.","Did you ever work so hard only to lose all hope at the end of the road?","A step-by-step recipe on how to fail at FEH.","These new heroes need to get serious with Marisa.","My very own +10 Hawkeye! Aka Winter Tharja but green infantry","Marth Abyssal F2P Guide with NO skill inheritance","Say the line, PM1!","2 New Cipher Cards for Hinoka!","I just noticed that Legendary Marth is wearing earrings in his art.","Marth LHB - Abyssal &amp; Infernal F2P Friendly Guide","Bless you Phoenixmaster1","No Veronica? Do you have 2 blue dancers? Try this Abyssal Marth solution instead!","Friendly reminder that Amelia is the only summonable armor unit to be added to the game since launch that's not an alt.","Developers Respond to the SI Deleting Skills bug","They're finally making a Fire Emblem Heroes cereal","He remained with me, no matter the circumstances - My first +10 build, Reinhardt","True Fear","19 minutes in and the round is already over? Is this the new Grand Conquests?","💖 💗 💕 They both came home 💖 💗 💕","The Meta Ends Here","Found this JPN player clearing Abyssal Robin with no SI","I doodled a happy Lucina","After HOURS of trial and error, my Flier Emblem team defeated Abyssal Grima! (a.k.a., I don’t have B!Lyn so I panicked and did this)","F2P Marth Abyssal: BLyn, LIke, Ursula, Olivia. with SI","When Hero King and Sable Knight stay in the same castle.","Early Pheonixmaster1 had no idea what was to come...","Does anyone else want to tell him that they were separated in Sacred Stones?","Ephraim Can You Wink? ;D","Some Festival Micaiah fanart art that I finished drawing today!","Emblema de Fogo - Casos de Família","Best thighs in the barracks™","My Nowi can beat Marth as long as she's not a dragon","Abyssal F!Grima solution to Cherche lovers.","Hardin and Marth height difference (both drawn by Daisuke Izuka)","I knew my perfect infernal grand conquest run was over when this demon spawned on an enemy fortress","After hours of planning I finally beat-","The Legendary Hector I was expecting (drawn by Soeda Ippei)","My very first 5 star +10, just in time to be obliterated by Marth: F!Corrin!","Aesthetic Braves here! Also, some random blue hair guy","Robin LHB Abyssal F2P Ft. Veronica, L!Ike, B!Lyn, Olivia 1 SI (Wings of mercy 2)","Lyn Doodle, let me know if you think I should finish it!","Abyssal rewards should have been accessories RELATED to the heroes we are challenging","Abyssal Axe Knight Chad","Camilla Emblem vs. Abyssal Robin LHB","Please don't call Prof. Arden slow","Ares wreaking havoc on Abyssal GrimaF Map","Taking my Lyn off the bench ever since launch (Build/Suggestions)","Spongebob or Patrick?","She's a Killer Queen! A +10 Lilina Build","This doesn’t look like Kansas either...","The struggle of saving orbs to +10 your fav when they're added but have to skip many good banners to do so.","FE in other video games style","I drew our sweet Celica!","Met a very shy unit","I've been using these monster since the 2nd GC. She truly is an Army of One. I don't know you but if you are there, thank you so much LelouchVi","Maybe next time","Hero-King Marth vs Prince Oliver (&amp; Co) Infernal FEH LHB","Abyssal Marth and Robin Guides. Relatively F2P/Low investment.","Abyssal Robin clear with brave archer + 3 dancers","Narcian...story in comments","Whatever happened to Sakura Whale?","My first +10: Lillina","Legendary Marth and Jamke flairs now available!","Abyssal Grima - FTP Horse emblem + dancer","Fuck you cleric. What have I ever done to you? Why can't we just get along? Why do you heal Marth and the damn green mage every time I deal any damage to it? Why do you cower in the back and not rush over to suicide into my nowi? Why do you make my life miserable?","Why does IS feel the need to shove reinforcement every fucking turn?","Marth Abyssal one-turn clear using only unmerged and +1 units","Chrom and Family takes on Grima [Infernal]","What is written in each mage's tome?","Maid Caeda Edit I Made","Celica hates horses","Abyssal Marth in Summary","♡ ~Lissa: Comfort and Joy~ ♡","Insane man whales for +10 unit, normies shocked as credit card cries in agony","Me after spending all 200 orbs on CYL 2 before L!Marth was released","Post the unit that will never come home and why you want them","If your FGrima has this build...you need to rethink your life","MRW I tried the most insane difficulty this game has to offer","A warning from the future.","How I see the salty ones","Which units have Southern accents (Not Donnel, Neph or Rebecca)","Armored allies of swift death","Forging Bonds with Marth","Round 1: Last place / can't even play? Truly A++ game design","Abyssal Marth","I've noticed something else about Grand Conquests - some of the areas that were previously knocked out are being reset to 0 score in the middle of the round","When you try to do the Abyssal difficulty Marth map and all your built units are dragons or have low Res","Theorycrafting Discussion: Valflame Refine","Team Tip the Scales vs. Grima (Abyssal)","Post your reasons as to why you're not going to be clearing Abyssal mode if you decide not to","Legendary Hero Calendar - Aug 28, 2018","Grand Conquest Basic Guide: Improving Scores on Infernal+","This subreddit right now","My clear of Robin LHB as a free to play","The current state of FE:H with the influx of Accessories.","When you finally obtain that hairpin.","If u/ImmortalLucario follows through with his Elise cosplay, I’ll post a cosplay of myself as Lyn.","Future Legendary Hero Predictions","T-thanks Hector","F!Robin Abyssal Semi-Guide - Nino, Olivia, P!Olivia, B!Cordy (Skills/Units somewhat flexible)","QOL - On LHB/GHB/BHB it would be nice to take back moves like Mila's Turnwheel","Clearing Marth abyssal with no dancers","When God graces us with his presence","What skills do you think could use a 4th rank?","Hoshido Emblem faces Abyssal F!Grima","Wow, loving grand conquest so far!","Lucina spars with the Hero-King (Abyssal)","Completed F2P Arena Core: Marth ft. Dragon Friends","Waiting for Phoenixmaster","Animated Bruno comic by @AAnimatorYellow","CYL2 Reunion","Chrom is ready to kick ass in Smash AND on the battlefield","Archanean Baddies Take Back the Castle (Marth Infernal Clear)","Need advice for flyer emblem team","CYL3: Do it for her!","After countless abyssal failures, we cling to hope that the long lost hero MKV may return","New Abyssal difficulty map for Fallen Takumi leaked","Here in the beginning, and proclaiming the end: My first 5*+10, Kagero!","When your growths rate are interfered with","Veronica, Lyn, Micaiah &amp; Azura vs Grima: Legendary Hero Battle (Abyssal)","How it felt doing Abyssal Difficulty","Legendary Marth by @zunbayasi","Arthur becoming a true hero (not mine)","I’m a man of my word","how many levels of difficulty can IS come up with?","New Bruno mini comic by Kozaki","L!Marth Build Experimenting with Def Smoke 3","The tier list on Gamepedia lists B!Hector as an axe unit. Old habits die hard.","Abyssal Grima - One Turn Clear - No Merges","Eirika Declares War on Infernal GHB: Robin","Putting faith in bladetomes: the abyssal map clear that took two full hours (ft. Flier Emblem)","My first +10 unit: L’Arachel, The Peerless Princess of Beauty!!","Streaming FEH","Wilya 2 : Radiant Boogaloo","Who should i swap for Reinhardt after i level him up? Im at a loss","new meta","Greil Mercenaries, move out! (Bought Cipher cards)","Cheapest Abyssal L!Marth Solution by far from altema.jp","There's light at the end of the abyss","So, Intelligent Systems...","For the first time ever, I feel worthy of my units' praise","Dragon emblem is dead, they said","Marth will one day get Exhalted Flachion: will you swap out his Overdrive?","Summer Takumi Supported Solo Grima LHB Abyssal","From the Askr trio, who would want DC the most?","Linde clears Grima Abyssal","Calling out u/Flingar - Infernal Marth with Green Draggos","And so it begins...","Unpopular opinion, but I actually really like the Abyssal modes!","Bridal Ninian: +Def/-HP or +Res/-Atk?","Laegjarn's smile is so cute","New player here - Is spd+/def- considered good IV's for brave lyn? Also, I noticed she is quite an older character. Is she outdated at all? Ty in advance!","Can someone please help e make a team with these units i have, and what skill i should use on said units ?","my thoughts on L!Marth","Best build for +Atk/-spd Brave Celica?","Should I summon for Brave Ephraim?","FE Heroes: Abyssal Legendary Marth LHB Solution (F2P Friendly)","Project Feather Injection!","Legendary Hero Battle - Robin (Abyssal, No SI)","We should be able to upgrade 4* +10 to 5* +10","Granblue Love Live! In Fire Emblem Heroes Sprite Form!","Just found this screenshot on my phone...I sort of miss these days, pre-SI","Upcoming Refined Weapons","Anyone notice the AI BMs you by killing a stronger unit?","Abyssal Grima with 1 merged unit and medium SI","PSA: A new Colourless Legendary Hero is pretty much confirmed for November","Abyssal Marth 1 Turn, no 5* exclusive SI, no supports","B Skill for distant counter Camilla","September Legendary Hero Banner Predictions","Let’s all take a moment to appreciate that FEH has no ads.","Abyssal Female Grima Clear Low Merges","For the last few days, IS has had a crippling addiction to Hector (Also what are your thoughts on Forging Bonds changes?)","Is Sharena a good user of Steady Breath + Aether ?","I actually hate myself rn (Abyssal salt)","The reality of Abyssal","The issue isn't that we lack endgame content, the issue is that IS thinks Arena and Arena Assault counts as endgame content.","Team building help centred around Brave Celica","It's rare that you get to see this","Another Abyssal Marth Clear-- Flier Emblem","The CYL Marth we could've gotten.","Who to summon for my free brave summon?","Nice start into my Grand Conquests","Obstruct and Miracle's Abyssal Marth clear, feat. Raven &amp; Lucius","My Cordelia in GC with full Flier buffs","Abyssal F!Grima clear with Veronica and her newfound friends","I just wanted to say good luck to Phoenixmaster and other people who make f2p guides","For the first Hero battle in a year. Full team Assembles for Abyssal Marth.","I made a video of Celica taking out a bunch of people to the rhythm of a song!","/u/The_Space_Jamke where you @","Who wants Res Tactics more on my tactics team?","Marth Abyssal Clear","Holy shit, what happened to Grand Conquests?","Shanna solos Abyssal Marth and Robin","My 5 Star Selena! Got the last merge earlier today!","I had to sacrifice one of my greatest units for his skill...","Cursed Image (Don't click if u want 2 sleep soundly tonite)","Abyssal Robin solution using Veronica + dancers","Please stop IS, I'm begging you.","when the map is full of dragon units","Posting my Abyssal Grima clear before it’s too late","The Everyday Life of Heroes - FEH Manga - Ch. 39 \"A Quick Break\" by @maikantopia","Arena assault and Possible improvements","Well guys, for those who misreaded \"Abyssal\" as \"Abysmal\" (Or prefers \"Abysmal\" for any reason), I have good news for you.","you aren't ready for the truth","Really want an Infernal difficultly for the Main story.","How Abyssal Difficulty Was Developed","F!Grima Abyssal No Merge Clear w/ Alm, B!Lyn, The Reinhardt, NY!Azura","I'm a Dragon, you dork! (Heckin superb you funky little dragon)","Petition to change 'Cannot use' to 'Restricted to' or something similar, when it gets this cramped, because this is getting out of hand...","Would you consider it budget friendly to just use AOE skills for Arena assault filler units?","Easy clear using near F2P units","My ideas for new content, updates and changes to Heroes","Battle of the Ages","The Abyssal GHB Final Boss to end all Abyssal GHB's","Campaign Mode (And Idea for Endgame Content)","Legendary Hero - Marth: Hero-King + Jamke - Lv 1 &amp; 40 Unit Stats [Datamine 8/27/2018]","FEH LHB Robin Abyssal Rein x Blyn double dancer comp","Player Phase Pretty Boy: A L!Marth Build","Fe7 emblem team","The Eternal Struggle","Marth really needs to slow down","What accessories would like to see available in gold?","Abyssal FGrima LHB Autobattle 1 Turn Clear, courtesy of u/ardx","Super Close Grima Abyssal Clear","Who are you guys using for this arena week?","Sneaking up on Dragon Emblem","Abyssal Grima clear with Sacred Stones heroes","Legendary Robin Abyssal with my Chrobin Team","My first 5-Star +10: Lukas","Change maltets Appearance to this or riot","Here's Brave Celica!","I had to pull out all the stops, but I not only cleared Marth's Abyssal LHB, I also still managed to do it with my usual touch. Behold, as one small sheep destroys a Triangle Adept Raven bully and dozens of other unremarkable enemies with the help of dancers.","This isn't my run but I thought I'd share. Marth' s Abyssal LHB, Psuedo-F2P and no merges.","Predicting the Next LH Banners (September-November 2018)","Legendary Marth Assist....","F! Robin LHB Abyssal run for funsies.","Tip: use Astra if you want to clear abyss maps easier","My solution to the Abyssal Robin Map","Any other frustrated orb hoarders out there?","Beating Abyssal Marth: Featuring an Unorthodox Brave Lyn and AI Manipulation","So I've had an extra Olwen sitting in my barracks for a year...","Jaffar &amp; Friends ft. The Reinhardt vs. Abyssal Marth &amp; F.Grima (All Reinforcements Slaughtered)","Infernal Marth with all Green Dragons","Nino+3 dancers Abyssal Grima+Marth clear","New Cipher Card for Oscar - Joined-Art along with his brothers Boyd &amp; Rolf!","Did you find the new difficulty fun?","Roy and Lilina clear Abyssal Grima","Did somebody say tHe eNeMY!?","Inevitable Legendary Marth Joke","The new update contains data for a new 'Abyssal' level difficulty","New Marth sprite lookin snazzy","I drew Lachesis","Brashperation Takumi takes Abyssal Grima for a wild ride","36 hours into not having Marth","oof","With the new abyssal difficulty does anyone think we will get infernal chapters in book 3?","[Reupload] Abyssal Grima vs Ardent Miracle (Brave Veronica &amp; Brave Lyn + 2 Dancers)","The unit build I'm most proud, and a very different take on Raven (my 2nd +10 project!)","Summon the Legend","I honestly forgot what Muspell was called.","I am so happy we finally got Fire Emblem’s Face of Franchise alt in Legendary Banner on Red pool!","This map was more rewarding to beat than pulling an off banner 5 star. Abyssal Hero King Marth clear.","Tiki emblem vs infernal Mar Mar","L!Marth clear infernal with Dragon emblem(HA!) + Veronica","Updated official chart of Legendary Heroes, their Blessings, and stat boosts!","Feh losses her crown when you demoted from tier 21 :(","The Lad from Afar fights up close! A +10 M!Morgan showcase","LMarth Abyssal 200 IQ AI manipulation clear","When priorities shift","Minerva/ Legendary Marth look very similar! (same artist)","Marth: Hero-king Abyssal clear","L!Marth's special animation reminded me of this little gem from a while back...","As the summoner of the Order of Heroes, you have the sudden need to flaunt your authority and superiority amongst the mongrel units you command.","did someone call for an overused meme?","(Unsure of popularity) Opinion: I like the Abyssal challenges","Almakin executes order 66","new hats make Arena and AA harder!","My strategy for the Marth Abyssal","the dragon killer weapon i hope for","Summer Nephenee by @aone_9110","Remaining 2018 Legendary Hero Schedule","New \"Abyssal\" Difficult for F!Grima's Map","My first +10, for one of my favourite units in the entire franchise: Soren!","Jamke is coming!!","F!Robin Abyssal clear. +10 Nino and P!Azura","Abyssal Robin - No merges and little SI","Abyssal L!Marth Clear","So we know Jamke stats and skills, so let us discuss as well as weep.","I drew Leif!","We don't deserve her.","Here's when the Legendary Heroes (Marth, Fjorm, Gunnthrá, Robin) will return next!","The “Abyssal Difficulty” Vent Thread","Battle Menu idea for the Abysmal content","I beat Robin on Abyssal!","Marth Abyssal w/ The Reinhardt &amp; Nino","F!Grima Abyssal Clear (S!Corrin, Cordelia, H!Nowi, NY!Azura) - low merge","3 Reds, 3 Blues, 3 Greens and still 1 Grey","Double ''blow'' skills at tier 3 incoming plus skill refinery?","Xander and Veronica","Jamke Character Art!","LRobin Abyssal clear (No Merges) : Wings of Mercy 3 Electric Bungaloo","Could Legendary Marth hurt his CYL3 chances?","How do I improve my HHenry?","Marth LHB Abyssal Difficulty cleared using Masked Marth, Reinhardt, Ike and YT! Olivia (Not meant as a guide)","Equipped skills invisible, uninherited somehow?","Flier Emblem vs F!Grima LHB - Abyssal","CYL was just bait","Making the Impossible, Possible","WIP piece of my favorite princess! Only had enough time to do half of the drawing. Who would you like to see as Lucina's fireside chat partner(s)?","No Ayra or Karla? No problem! (Lucina build)","F!Grima Abyssal clear (Reinhardt, Axura, B!Veronica and any dancer)","Accessible Brave Bow Guide for Marth Infernal feat. Setsuna","Arena: Brave Ephraim vs Grima","Where are your dragons now??","Zelgius can proc instantly with special fighter and slaying edge.","What accessories are you using on what characters?","Marth Abyssal ft. Lafast, L'ara Del Rey, mysterious singer and a dead meme","Bridal season might be over, but this is always in my heart!","Katinum Disco I","FEH LHB Marth Abyssal with The Reinhardt &amp; Co [low merge]","New manga page is out","Legendary Hero Battle: Robin, Fell Vessel Abyssal Rebout Megathread","Fourth Bruno comic + Behind the scenes talk","Next gray legendary hero comes in November!!","Abyssal Marth with +0 Reinhardt, +2 Brave Lyn, +10 Nowi, and Dancer","I draw Legendary Marth and his granddaughter, Exalt Lucina","Weird Alm Yankovic","New best lance unit they say","I can't help but feel that Intsys is about to do something really stupid/ shady/ player unfriendly in the near future.","Camilla Emblem vs Abyssal Marth LHB","(Infernal) Grima gets destroyed by a magic powerhouse (Nino)","Do you ally support all/most of your units?","With the Hero King out, what teams and builds are you all running?","FE:H was my first FE game, after trying others and actually losing units forever when defeated, I was genuinely frightened while playing","Random new support skill thought","The Mario Bros view on the new Legendary Marth.","FE Gods of Dragon Slaying","Abyssal legendary heroes Marth and RobinF map clear with Camilla-only team","Should I change my build for my bad iv L Marth","As long as I can summon him more than once, I will be fine","Took me 4 hours to figure this F!Grima map out and finally did it!","Post-cyl2 pre-cyl3 community voting","Abyssal Robin: Fell Vessel Clear (Sanaki, S!Corrin, NY!Azura, Cordelia)","I beat F! Grima’s Abyssal map! Holy crap this was hard.","Making my first tactic team. What's my best options?","Grima VS Marth battles","With everyone saying dra-gone","(Infernal) Nino Wrecks Marth","When Legendary Marth Got Announced","(Repost) Streaming @6:35PM EST for B!Celica with 1,509 F2P orbs (-6) that I saved.","Legendary Hero Battle: Robin: Fell Vessel has returned with new Marth: Hero-King Battle! Clear the new Abyssal difficulty for gold accessories","Wyvern Lord Camilla!","Legendary Hero (not)confirmed, Post-it Mage Ephraim joins the battle!","A dreamer dreams of getting Marth","Do the gold accessories look good on anyone?","Do you think they will rerun the gold accessories on the abyssal maps in the future?","How to Survive an Encounter with a Dragon","This sub today","Using guides to complete Abyssal challenges robs you of the only meaningful reward","Fire Emblem Heroes: Voice Clips - Legendary Hero - Marth: Hero-King &amp; Jamke","Welp, so much for the leader of my Dragon Emblem team","Marth LHB Abyssal run for funsies.","Brave Celica and Veronica by @Are_you_mie","Paralogue 24-3 Genny Solo Clear","Daily reminder for forging bonds orbs","Using Hector feels like cheating","Marth Abyssal - Nino +10, Rein, two dancers","Which units have you pulled for based almost solely on hype, and you then regretted?","Marth! You son of a","Has IS said something about the devastating glitch?","Robin* abyssal clear","My first +10: Dual-Phase Melee Soleil! ​","Ike and Soren run over Abyssal Marth ft. Gravity on a horse","Here is my Fell Robin abyssal mode clear.","Legendary Hero Battle: Marth, Hero-King Megathread","Foolish Samurai Warrior (Digital Remake)","The Current State of Banners (My Hero Academia Season 2 Spoilers)","Not the cheapest units, but it gets the job done","Who are your 'I'm not spending/summoning unless it's ___' characters?","Flier emblem vs Abyssal Marth","Eirika x Hatsune Miku","Showerthought: perhaps the reason IS is just giving golden accessories when clearing infernal is to measure how many people can actually clear them","Quick chibi drawing for L!Marth","Robin Abyssal Clear: Not really a guide, pretty heavy SI and merges used","FEH meta shaping 101","My experience this last Arena Assault.","My Abyssal Grima clear!","Anyone else having trouble deciding who to free pull?","Berkut &amp; Alfonse outfit swap, arena core + non-Askr/legendary semi-regulars chibis","The Shepards V Legendary Marth [ABYSSAL]","After Thought on Abyssal","A!Tiki build suggestions?","Marth's Abyssal LHB Run with Hector Emblem","A rough Take against Abyssal Grima","Robin LHB Abyssal mode cleared using my main four [MM, Ike, Rein and MGrima]","Please don't do this.","Arena replays on defense would be super cool","U/EgyptStar81 gave me the idea","LHB Marth Abyssal Clear, Finally made it! Plz i need Praise XD.","Got a brave sword. What do?","Marth, Hero-King Unit Discussion","[Frederick Unit Build] Made it to T20 for the first time, thanks to my first +10","Thar-tre: Dark Mage Bartre","I figured out why I couldn't decide on a blue to 5*+10 as f2p","(F)Grima's LHB Abyssal Difficulty Run (featuring Legendary Marth)","Abyssal Robin LHB Clear! (Raven, Lucius, and friends)","How do I make Lon’qu workable?","Binding Shield vs. The Dragon Meta","My Second +10 and Lovely Axe Killer Olivia!","How does Anna edit documents?","Robin: LHB - Abyssal Clear - Dragon Emblem with help from Brave Veronica","How viable are dragons now?","Bride Valter :p","What are your FEH pet peeves?","Joined-Art Cipher Cards for Cordelia &amp; Severa!","Unpopular Opinion : F2P guides should not exist for Abyssal Difficulty","Abyssal F!Grima - Only base 3-4 star units with base 3-4 star fodder (and one Ares)","How would you guys feel about being forced to use units you wouldn't normally use?","Marth Abyssal Map Clear Ft. Lilina!","If Alm gets an alt, I want it to a \"Conquerer Alm\" where he's like a mix of Rudolf and Walhart.","Trying to figure out Abyssal maps","So the faceless enemies in the Marth LHB...","My \"Fire Emblem Families\" collection is done for now! The three illustrations are here!","Marth: Listen Up Ｐｅａｓａｎｔ","Hero-King Marth Wallpaper &amp; Icon edits! (Plus a Marth Guiding Lucina Wallpaper!)","Abyssal Legendary Marth Clear!","If someone can beat Marty’s battle with only green dragons (Fae, Myrrh, Kana and Grimboy), with video proof, and within 24 hrs after it drops, I will kill my only B!Celica","Update is out","Brave Lyn + 3 Dancers vs Marth: Hero King (no commentary, fast gameplay)","The Marth Alt we truly need","Robin: Fell Vessel's next appearance","Robin: Fell Vessel Abyssal Clear","How's the leg banner treating y'all?","Finally beat L! Marth’s Abyssal map! This thing pushed me to my limits and I had a lot of fun!","Anyone else remember this?","Prediction: L!Marth’s “Fire Emblem” Special could (FINALLY) introduce a new skill-line of Spd-based specials.","F2P mentality doing 10th stratum quests","What's Wilya?","Loving The New Banner!","Legendary Marth occasionally gets one shotted by Nowi","My biggest problem with abyssal..","Mixed Tank Hector (Description in comments)","Fire Emblem Heroes - Legendary Hero!","Sorry, I had to use my phone to edit since I'm not near my computer but here's some friendly anti dragon propaganda","I am officially not bothering with the new Fuckyou Difficulty [Warning: Dead Sea-levels of salt right here].","Newcomer to the Game!","Brave Lyn + 3 Dancers VS Robin: Fell Vessel (just want to share my clear, for fun)","It taste like or🅱s","Would you guys build L! Marth with an Ayra-style build?","Defeating Abyssal Grima ft. Merric the Dragonslayer","Fire Emblem: Marth Hits a Pedestrian","F.Grima LHB Abyssal Clear - B.Roy LA!Lilina L.Ephraim B.Veronica","Abyssal Marth Solution With Rein/Lyn","Infernal map strategies","I don't know about you guys but heck abyssal","Poke","This Week In Fire Emblem Heroes (August 28th -&gt; September 3rd 2018)","What are your summoning superstitions?","The DragonEmblem Saviour.","Abyssal Robin - No Merge/Moderate SI Clear","Totally Canon","Liking dragons sure has been an emotional ride.","[Weekly Writing Prompt!] Brave Heroes make an entrance!","When your man wearing the fur you got him.","\"Legendary Hero (Marth: Hero-King)\" Banner Video Summary","Kagero (Hares of the Fair) Arena build?","Halloween Jakob sketch","Should abyssal be more accessible?","Marth: Hero-King Infernal Clear (with Female Corrin, Olivia, Sonya, and Lachesis)","Marth respects dragons","Idea as a continuation to legendary heroes; Legendary Villains","I still can't believe it, someone pinch me!","Unit Showcase: Player Phase Faye","Legendary Marth with singlehandedly destroy the dragon meta.","When you get shut out of T21 but...","Kozaki Yusuke made a third Bruno comic","Would you like a simplified Chinese version of the game?","A slot for Gunnthra..","My reaction to the Legendary Banner colorless pool","My first +10: Dual-Phase Melee Soleil!","Legendary Marth in a glorious nutshell","Abyssal Marth Clear With Flier Team","Persona 6!","Practical Way to Organize Favourites for Arena Assault","Need help building a Fliers Emblem","How to be Brave","Athena gets powercreeped. For a second time.","For new Mar-Mar: This is Old but still good?","Post-it Valter doesn't get a caption (or ink, yet). But he does have an invisible apple","L!Marth isn't the only dragonkiller out there: Cloud Maiougi+ Summer Linde","Abyssal L!Marth clear, with a +10 Nino.","Marth - Abyssal: Nowi, L!Ike, Olivia, Reinhardt","me trying to build glass cannons units","Gold Equipment should give stat boosts.","Flora: a Speculative Build","Legendary Hero meets Echo Fighter (Gone Wrong)","Do people here actually want pantless Marth to be brave hero or you guys just memeing ?","The \"New Banner\" Starter Pack+","ψ M̶͍͈͕̮͔̈́̀̆İ̶̙̀N̴̨̧̦̓̓͒N̷̙͚̽Å̴̺͚͍͚̐̈́ ̵̨̰̮͘͝͝M̷͚̻̒̈́̽̌̔Ǐ̷̢̢̘̜͖̔̂̌̀T̵̢͂́͒E̷̘̣͑ͅI̶̢̙͔͓̿̀ͅT̴̞͚͘Ê̷͉̮͓̏ ̸̱̺̯͚̐̕Ķ̶̹̺̌̓͆Ú̸̧̝͍͓̈̽̕ͅR̸̙̝͔̜̼̈̓͛Ė̵̥̻̲̼̲́̎̔͊ ☠","🎵And the players tried to take the field, the Marth-ing band-🎵","I’m ready for the Legendary Banner","Infinity Marth","Changed GC rewards system","Does anyone get anxious over forging bonds?","My immediate thought","Raising BST's?","Brave! Veronica","Jamke being in tonight's datamine?","Olwen aged terrible with meta and should get demoted","Accessories!","2 CYL forms","Friendship ended with Marth","When someone asks if you’re ever going to stop playing that mobile game and go make friends","When will Legendary Marth return?","Veronica bonus unit = easy mode","Abyssal is bad, here is how to fix it. (I think?!)","We will get the 3rd legendary hero of Awakenings","Extra Floofy Gunnthra","It’s taken about a month, but I finally finished my amigurumi groom Marth to go with Caeda!","Dialogue Choices in Forging Bonds: How about it?","Finally, a unit NOBODY can \"My Nowi can beat him with X build!\" post","New Arena bonus units starting 8/28!","Just because you're called a \"Legendary Hero,\" doesn't mean you are one.","Who's good with safeguard?","Legendary Marth got me like","The Red Helmet was made to match the Red Owl tome","We now have 3 swords, 2 lances, 1 axe and 2 bows legendary weapons...","Arena/Assault Overview &amp; Thresholds - Data Collection [August 27]","Abyssal in future","FEH Fandom Four Panel: Legendary Marth Reaction","Subtle addition of a Leaf on Leif in the banner art","[Marth Infernal LHB] Dual Corrins assisted by some friendly Hoshidan healers reverse the Fate of memes.","How to be a brilliant tactician","Breath Squad ft. Gladiator VS infernal Marth","Can you hear what Gordin says?","Oh, hi Marthk- a different Nowi build","Lilina! I'm borrowing Forblaze!","Beast Units","Looks like our boy made it","This Game and Gacha","Fun Fact: Hector no longer has a 100% S+ rating ratio on Gamepedia. Another Fun Fact: Only Hector can displace an entire tier of lance units and make it his own","The Defenders of A!Tiki, the best lance and the best Shield (Effie and Sheena)","Player Phase Nowi Arena build","The long-awaited arrival","Another Autobattle solution feat. Lloyd","Exalt Lucina by @a_meno0","My first +10 (mostly F2P): OG Tharja","The Good, the Bad and the Old Celica","How Hyped is Japan for Legendary Marth? Japanese Sites GameWith, Altema, and Game8 Have Each Already Placed Him In SS Tier For Rerolls","Alternative Legendary Marth Uses (Armor Emblem)","When you're using Dragon babies","Brave Hector BRUTALIZES Arvis Infernal GHB - One Turn Clear + True Solo + 100% HP Finish.","Best kit for L!Marth?","My Greatest Achievement/Arena Team Showcase (Not Quite F2P)","Julius and Ishtar go to Olive Garden","I drew Maribelle!!","Community's mindset when voting for CYL","Next +10 Project?","Finally made my boy, Donnel, +10","Marth Finally Brings His Best","The biweekly Fire Emblem Heroes writing thread (8/27/18)","Leaked footage of Legendary Marth against a Dragon unit.","Trivia about LMarth","Father fodder","A little late, but here it is folks","\"Pierce the sky, Maltet!\"","Julia and Deidre vs Nowi","Is any of this still relevant?","Beast Units Idea #1(?)","Apple bottom jeans, boots with the Fir, THE FIR!","Legendary Hero Marth Artwork!","Ephraim on the next Arena session","Arena/Assault Overview &amp; Thresholds v6.1 [Arena Kill Bonus]","This is L!Marth","All hail the magic conch!","Why would Intsys do this?","I drew Brave Veronica Chibi!!","Sooo, with the Legendary Hero being Marth...","Kagero is the best. Thank you IS localization team for adding this line that the Japanese Language version left out.","Okay, Marth's B-Skill is annoying to dragons but can we talk about his special","I present to you my latest (F) Corrin build: F*** off Marth","Hoshidan Summer Florina","3ple Waifu, Titania, Hinoka and Lilina casual","The extra score for bonus allies make Arena a lot less enjoyable for me","Kazahana","(A follow-up from my vent thread:) If you truly disagree with how IS handled the concept of Abyssal difficulty, please send feedback to let them know.","This game is quoteworthy.","Death Blow 4, The Reinhardt, a Shifting Arena Core, and A Desire to Not Waste Atk Tactic","State of the sub for the next 3 hours","Old 3/4 stars should be removed from the summoning pool and should get their own permanent 3/4 star summoning banners","Marth fans: What do you think of the L!Marth?","After a lot of waiting and a lot of rolling here's my +10 Brave Veronica","Kozaki Yusuke made a second Bruno Comic","Disgusting (ignore the crappy crop and text, mobile)","i have a strange feeling that Roy's Going to become a Red Bow Unit","So when do we get to refine Armads as an Armads upgrade?","My New Team - Looking for Suggestions on How to Improve it.","Didn't see this mentioned but Garm's effect works with desperation","Grand Conquests pre-registration open!","4 Healers of the Apocalypse vs Chain Challenge Chapter 11 and 12","Mia (art exercise)","\"I don't pick fights I can't win\"","Is anyone else thinking that Binding Shield is a bit redundant?","A controversial take on Marth","[Stat Speculation]Legendary Marth","+10 Hana -Tankier than normal","Mr. Safety Dance","My first 5 star exclusive. +10 Brave Celica.","Bruno by Kozaki Yusuke","L! Marth stat speculation","Your #1 Fan: A Refined Sharena Build","if skill inheritance had 0 restrictions","Local Maniac Destroys Entire Armies with a Spoon: Legion Build","Naga-dammit IS, couldn't you have waited a month or two before giving him his first, non-color-shared banner?!","Legendary pity breakers don't seem so bad this time around!","Did anyone else notice the forging bonds clip of B!Celica demolishing an armored lance?","Latest Chapter of “What’s With This Sassy Lonely Princess?”","Marth's B skill the Binding Shield is a Dragon Breaker and Sweep","I drew Ayra as Sailor Mars","Just got pity broken by a Mist after spending 300 orbs trying to get B! Hector AMA.","Trying to make the best of what you have","Saizo: The True Wielder of Sky Maiougi","\"I think I've come about as far as any man can.\" A +10 Chrom showcase, the second piece of my tactics team! A little late to celebrate Smash but oh well","Another bamboo pic x)","Noontime snacking! Legendary Robin True Solos Micaiah &amp; Sothe BHB Infernal","Guinivere, Princess of Bern (Theorycraft)","proteccelica.db4","Should IS start rerunning Legendary Heroes outside of Legendary Banners?","Possible Exalted Falchion effect for Alm","“Pick a God and Pray!” Frederick +10","Is the RNG in this game rigged or am I just getting screwed?","Lucina Strikes Back (her fifth alt)","&gt;&gt;the one accessory I want","Bors: Uncomfortably Close (Unit Speculation)","Lene is so strong all she had to do was push this man and he was deleted","TIL Hliðskjálf is the name of the high seat of the god Odin. The imagery of Odin riding atop Veronica's staff into battle has had me giggling for the past 10 minutes.","Gotta love how Robin (male grima) looks so dissapointed when his special procs, like: \"Oh boy, here I go killing again!\"","The golden accessories for the abysmal difficulty are probably the most dumb reward they can give for the torture that is the abysmal maps themselves. IMO","Marth Banner and Chances","Olivia Feedback","My Stat Prediction for L!Marth","(Repost because I fell asleep typing up her descriptions) Here’s my first +10, Soleil","Very Fast Hinata Moving at Incredibly High Speed","My Personal +10 Challenge","Drew Ishtar","B-day gift from my Bf","/r/FireEmblemHeroes Weekly Question and Team Building Thread (08/27/2018)","Did they just manage to powercreep Regnal Astra?","Confusion about marth","How many orbs does everyone have for tonight and do you plan to use any them?","Reaction Stamps: CYL2 Edition!","When will we finally get another colorless legendary hero??!","Happyronica","New headcanon:","I +10'd my favorite Fire Emblem character of all time! (+10 Dual-Phase Soleil)","Off My Chest Thread: CYL2 Edition (8/26/18)","/r/FireEmblemHeroes Weekly Summon, Pull, and Achievement Thread (08/27/2018)","How good is ExaltedFalchion looking?","I refuse to accept it. My Nowi won't be killed by any Falchion, not so easily!","Palla Stops the Belhalla Massacre in One Turn","New Game Mode Idea","Subreddit Bonus Quest #7: Absolute Paragon","Slowly losing interest in stuff / Here's one last comic / More in the comments","My First +10 Unit, Eirika! (F2P)","brave_Celica.exe (An Unoriginal, but Highly Merged Brave Celica Build)","How to get CYL Alm and fulfill Celica’s wish!","Celica v Kiran Ultimate Climactic Battle 2018","You know what rhymes \"alt\"?","She's a brick...HOUSE - an Effie build","Is it considered a \"true solo\" if the other 3 units have Wings of Mercy for no reason other than to escape enemy range?","If the Legendary Hero is Corrin...","Grima Emotes","Yesterday I drew Veronica. Today I opened up the game and she's not there along with the gems I used to pull her. Now i'm salt.","The Alm alt I'm actually waiting for","In Another Universe... [Cross-Post from r/soulworkeronline]","PSA:After the legendary trailer tonight, hector will be 2x in forging bonds","Recorded every hero summoned and their stats for a year","I’m gonna be here for a while. *sigh*","Leave it to Kyouma Dark!","5* +10 Seliph Build - 'Speedy' Seliph","If Arden could have access to IVs, he would have a Spd superbane.","The Black Knight on his true form - Zelgius True Solo Playlist","What specials would justify a 9 point cooldown?","Bride Julius :P","Veronica asking this question to the wrong people","Actual wholesome social advice","What do you expect to happen when our legendary banners are full?","Blessed Gardens: First Grounds challenge released!","Marth's Guesstimated Stats","Brave Celica, more like Bae Celica.","oh look another F!Grima on Legendary banner","The secret behind Death Blow 4","\"Time for fun?\" A +10 Fae Build","Catria True Solos Infernal Xander [No Distant Counter/Healing]","3ple Waifu but is on twitter","Heroes with Healing Skills banner!","Anyone have a picture of their brave hector and/or Ephraim with their respective advanced helmets from the forging bonds quest","Pity-Break Revenge-Killer Nino (+10 in spe)","A Win-win Situation","Best Videos About FEH (or FE in general)","Exalt Lucina in revealed in Cipher!","Unpopular Opinion thread/new legendary hero Marth counters!","When the WINGS OF DESTRUCTION gets careless","Met this monster in arena that destroyed my entire team.","We know Legendary Corrin will happen sooner or later, but the question is, will they be Male Corrin or Female Corrin? Which one would you like?","Remember that Hero Rises teaser during the Ylissian Travelers FEH Channel?","Swap etc","Barracks upkeep","Should I give up on Micaiah?","Protector of dragon lolis, killer of anti-dragon units: a LA!Hector build","4* Merges","Special or vengeful fighter on Sheena","Last Day Legendary Banner Predictions","Vote on who you think the next legendary will be!","New game mode idea: Colosseum","No regrets","Is it worth killing off a limited unit you love for a rare skill they have? Foddering Saias for Spd Ploy 3 - A topic","How sure are we that the next Legendary is a Fire Hero?","Arena for 4 stars only? Suggestion","My speedy Amelia build","Lucina cosplay","Is an unchanging +40 core possible?","I'm gaining EXP.... You can still hear me gaining EXP....","Can I at least get some four star L'Arachels or Reinhardts IS?","i dont pick conversations i cant start","Anyone else not really care about summoning anymore?","A picture of Fire Emblem Barst appears on the CDKeys site for some reason.","Blessings/Affinities: Grima and Robin","Brave Alm","Concept: Hero Refinements","Finally made my first +10 unit this weekend! Fae :( :( :( :(","Can we be fucking fair with races for once?","That's a nice suit of armor you got there, Ephraim","Arena Team Post, Again!","Fire Emblem X The Legend Of Zelda?","What is your favorite special line?","IS is working on the issue","Did Marth Just Block Roy From Being A Fire Legendary Hero?","Let us end Dragon Emblem together!","Legendary Hero Predictions","Summer Leo OF DOOM! Jk, but I really dig his build. Tactics Team!","\"So this ... is the power of the Gods\"","an unexpected twist","What unit is more oppressive: Reinhardt, or L!Marth?","Summer Robin and Grima by @meno_fe","Close counter healers","My +10 Brave Veronica Build from the stream I did sniping for her.","My Tellius Team","Masked Marth looks really cool with the dancers mask accessory","August was the Month of Alts","Beast Unit Speculations","We NEED to buff INFANTRY!!! (and cavalry lol)","Here is my (eventually +10) Soren that I’d like to show off","marth but hes pantsless and a real champion at mario kart. leaked legendary marth alt you read it here first kids","A player phase Hector build","We must be Swift as the coursing Mulagir~","Morgan to make your day happy","The Wave Team, Full Dagger Team Showcase.","Does anyone else feel Intelligent Systems is releasing too many dragon slayers?","Hoodie Dress Lucina","When you open your text messages","FINALLY she's here to stay &amp; here to SLAY","Brave Ephraim fanart!","L!Marth's Binding Shield is not that strong, in fact it is pretty weak.","Ain't Sheena BEAUT!?","Ran into this scary Nowi in arena. Enemy phase unit my a**!","\"Muscle Daddy Emblem\" Arena Core Complete! (Plus One Bonus Boy)","How many of you lads still use vanilla Hector?","What are some things that you wish to be added the most?","Eirika/Ephraim/FE8 art set by ふみ [pixiv]","[FEH Comic Dub] Moms and Dragons","So F.grima in another L.banner","Phone wallpaper of Yuurei_art's yukata Anna! (Full image in comments) #AnnaCYL3","Low/No Investment HM farm - No 5-Star needed.","As great as L!Marth is, his dragon counter abilities are a bit too much..","Theoretical Atalanta in FEH","FEH the Super Summer Festival! (Tiki will be fine, they're just showing off)","The little Fir that could. Fir - the Sword Student","Since L!Marth has Exalted Falchion, who thinks it would be possible that the Awakening Falchions can get this refine?","Forging Bonds Predicted Schedule PDT","I drew M.Corrin and M.Robin","Who all is stashing away for Myrrh Merges? (Should have a banner in a week!)","Speedy Oliver","Legendary Julia?","Is inheritability something IS should go over again?","[Debugging/Recap] Regarding the Skillset Glitch...","PSA - This rare, yet devastating glitch can totally mess up your units.","I know who's going to be the next legendary hero...","Thank you to the Devs","Best 175 BST Unit VS Worst 140 BST Unit (Thought Experiment)","Slight Remedy for IVs (Maybe?)","What stops you from spending when you can but shouldn’t?","Despite the recent pattern breaking now we have enough information to reasonably guess the remaining upcoming heroes.","Fire Emblem Heroes PvP, and how it can work","I wrote something else.","Legendary Hero Prediction","Ever consider the mean stuff people say to FEH Youtubers? (Also, which channels are you subbed to?)","FeH releases a subscription model doubling your orb rewards: Do you sign up?","Brave Celica","Dumb Question: What is the cutoff for getting into t21 this week?","My last minute predictions for the August LH banner","What is the best assist skill on armors?","The Blazing Gang","Not the Best Timing for that Greeting, Myrrh","DAD! I'm borrowing Armads!","Lukas with all non seasonal inheritable lances","My melee Myrmidon Nowi","I’ve submitted an inquiry to get an official explanation of legendary Marth’s Exalted Falchion effect.","This isn't Effie! Compensation karma when","Shield Skill Buff","The ONE Legendary Rule They Haven't Broken Yet","Anna's Secret Stash, a FE swimsuit zine, is returning! Here's a poll to see who you want in the book!","If IS gave everyone a free unit of their choice, who would you pick?","What buffs would you give?","Will this sub stop complaining about dragons now?","What if FEH launched with Classic Mode?","This build is so Close...","Everyone is worried about grounds maps coming out but I think it may work out if the group all the blessings into one set of grounds maps.","I randomly decided to go all in on Sheena, so here's a Player-Phase one!","Brave Celica!","M. Kana vs. Micaiah and Sothe True Solo (Infernal) (No Commentary)","Fire Emblem Heroes - 8/25/2018 Auto-Battle Rival Domains Feather Farming!","Black Knight best accessory","Making Forging Bonds Worthwhile and Uniquely Rewarding","You guys requested it ; Celica in Mae's outfit","Delthea and Ishtar Clothing Swap by @valcard992","Rival Domain autobattle Pass strat - August 25th","They've Basically Followed this Legendary Banner Rule","Brave Celica's Sword Should be called the Sword of Omens","An extremely fair and balanced OC from ya boy Ruler: The Future of Female Myrmidons","Cipher Summer Livestream - New Cards &amp; Art Featuring Heroes Characters!","if you couldn't tell already, I really like the new accessories","Debunking Tier 20 &amp; 21 Access Myths","I made a theorycraft list of some of the most interesting and useful ideas for the game","What is FEH goes PVP?","our biggest fear","Corrin fanart, October came early","This Soleil or a Brave Celica?","My first +10 as a day one player, Soleil!","If you're not gonna actually optimize your sets for scoring, the score gap for high BST powercrept armors really isn't as big as people make it out to be.","As a day one dolphin player, today I deleted the game","Artoria in FEH","08/28/18 Legendary Banner","Mods please add a flair for bug","The Warrior Priestess, Celica!","I see many people wanting a Legendary Alm to be a red bow, but isn't that counter-intuitive?","When you give up finding your older brother and settle for a replacement.","How to improve Reprisal/Vengeance","Fallen! Legendary Lucina fan art.","What colour and movement options don't exist yet? And other possible units? (Wall of text)","...What?","Apparently, troubadours were able to wield swords in FE4 and FE5.","Lock Screen/Home Screen Thread","PSA: If anyone needs a Cordelia that can get into WoM 2 for HM farming you are free to add me.","Not today","Frustration while playing Forging Bonds","\"Looks like I was a count's daughter after all!\"","I think IS should add the option to change the castle music.","Saizo flood...advice?","FeH Anime is a thing that should happen","Would you be upset if the new legendary hero was red bow Camilla?","Reminder that poison strike is a budget 240 SP skill that helps your bonus unit to score kills as long as you don't one shot the enemy unit.","[COMIC] just heck n ephraim bein bros","Brave Celica Fanart","Should IS let friends duel each other in real time PvP?","Best boy Lyon build, feedback is welcome!","New legendary hero speculation!","Rival Domains HM Grind - Aug 25, 2018","In an alternate (and terrifying) universe, CYL Celica paid homage to her Awakening version instead of her original gaiden version.","How to get into Inheriting (f2p)","Dark Sky Singer","So hinoka has made an appearance to another game","Brave Veronica by @sakurapion","Klein, NO! DON’T DO THAT","RD Autobattle Clear (8/25-8/31) feat. Galeforce Cordelia","How is my L’Arachel build? Do you know if it’s good or not. I’m looking to keep Ivaldi too.","A good Armor Emblem? I need help Xd","Who did you give your Red and Blue helmet too?","Help with Defense Wins.","How would you make your underpowered favorite unit better, within reason?","Add him to the game already you cowards","but first we need to talk about parallel universes","2 Turn RD Auto with BCelica + 2 ranged WoM2 (no dancer)","HM Domain Farm of the week (details in comments)","What infantry unit would become busted if they became armored?","Based on a true story","The bravest (and most expensive) Hector to date. +10 showcase","Red Infantry vs Blue Armor? Yes, that is absolutely the play","Oda Nobunaga in FEH (My favorite Archer)","I could use some help with my cavalry team","My upgraded Dragon Duo (A.Tiki and Fae)","Can't help but respect this person's #TeamCatria dedication","When you get tired of Zelgius in arena","Another way to pick your free cyl2 unit.","Zui Zui Robin","Brave Veronica Sketch","I think I understand why this game is so addicting.","Which Brave Veronoca should I use?","What if Quan was added to FEH?","Should Forging Bonds come with a Login Bonus?","How Fjorm counterattacks from afar","Would Hector be Disappointed?","Oh I totally didn't see you walking in over there!","Truly masterful strategy","How I feel about my job...","Oh, thanks Hector!","Post/Rate teams","Choosing your leader...","An IV feature in Heroes?","A DAILY REMINDER! Don't forget to do Forging bonds for your 2 orbs","New Rival Domain Auto","so there are many great candidates for the helmets but please consider:","I don't think I can make this any worse than its already done...","[Comic]Every Summoners worst nightmare","I'm making a family tree graph (incomplete)","Nero in FEH (Making these are fun)","Retro Celica is Beautiful; you guys are just Mean","He knows!","Marth, Tiki and Caeda for my FE families collection!!!","Literally Unplayable","Warrior Priestess Celica","There's one thing he can never take from him","“There’s no escape for you this time. You might as well give up!” Introducing my first +10, Seliph!","Theorycrafting Magvel Heroes Part 5: Gradans","When Duessel gets added into heroes..","When you realize that you should have picked Ephiram...","There are far better options of equipping this helmet than in Ephraim","2 New Cipher Cards for Titania, including SR!","I can't even be bothered to play the arena anymore.","Predicted Rejecting Destiny schedule","Android App Icon Update: Arrival of the Brave (full album &amp; template in comments)","Since I never got my summer Soleil I decided to draw my own. Take that, IS!","We Are Betrayal - an arena defense team made of all Evil Takumis","Melon Slicer Lyn (Art by @yagaminoue)","Reinfeld","My feelings from the CYL2 banner","When the free orbs are running dry","Played Around With B!Celica’s Kit","Two Helmets (repost)","[Chat] Can we please talk about how cute the Princess Diadem EX looks on literally anyone?","when you get baited by your own team","Veronica by _mimium_","Let’s predict next months new weapon refineries!","Another Klein build!","Anna wanted in on the summer festival fun, so I commissioned this art from Yuurei_art! #AnnaCYL3","Shoutouts to u/GetADefWin for the free defense win this season 🙏"]