["[META] Update on the rules","Turning off trending notifications:","Since these cups are everywhere now, I figured we needed one for our profession, too..","The state of SO","How to debug your code","The Wireshark release we didn't want.","Well, should've known!","3 guys were riding in a car; a hardware technician, a systems analyst and a programmer.","Chill out man","These Americans!","what are your current state? and don't lie loool","Code commenting made easy","Give this movie a name...","How To Respond to Robot Spam Texts","If IT recruiters had a playlist","Identity","You're right, Python's where it's at","If you want a break from the sliders","Chrome-chan only digests RAM","What a helpful chat","Python's Unicode support in a nutshell.","My experience with visual studio so far","I mean basically...he's right","ofc its a dealbreaker!","When you type faster than IntelliSense can parse your code","Perfect for when your program doesn't work","Thanks windows","Fresh outta data science bootcamp","One of the best dev story i've ever heard","Hello World but it's in excel and crashes half way through","C sharp","Ominous sign telling me where arrays start...","When Windows transforms into signal converter","Machine learning","A whole generation of “coders” was created","Worth it?","First time with Matlab","Interesting thought...","Advantages of being a girl (no_sexism)","The words of a broken man.","When programmers make whiskey.","*cough* Python *cough*","I have no idea how to code, but I enjoy opening program files, finding the font names, and changing them all to Comic Sans.","The future is now","Someone is going to have a hard time finding its key...","Bokowski’s shitty quotes","In intro to C class.... Professor said // won't work so we have to use /*..... I just want answers.","No exiting vim","Announcing BritSH - a bash-like interpreter for all your Brits who feel bash is too Americanised [Link in the post]","When you need a library","The brute force dream","When you try Python 3.x for the first time","I wish Ryan Gosling would say this to me :(","Building a raft","When I'm asked for estimations for a task, which is not defined well, so it can get way more complicated","Comparing apples to ciders","Build failed","The solution to 99% of all syntax errors.","I know that this isnt directly programmer humor but it highlights the struggle of being a clutz when working on hardware.","Poor stack","Safety Instructions","Ron Howard: It didn't.","A Day in the Life of IT Support","real programmers be like","My best work friend","Sure thing bro!","Do you know your hardware?","A programer programed the program that programers use for programing programs","Did you know that C++ supports Python like docstrings?","The wonders of c","I found an old VBA module I built before I learned what arrays and loops were...","I just let the seniors handle production issues","A lesson to never learn...","Fibonacci indentation for Vim","When does your opinion become mOpinion?","Coding in the name of","True evil","Leaked Google Chrome source code (2018, colorized)","Getting stuff done in Lisp be like","I think my Computer Science teacher might be on this sub...","Glassdoor's web devs show no remorse...","When you need to code an application at work using a programming language you haven't used for several years","Being the IT guy at work","Types are no excuse!","True Hacker","\"I don't know how to Regex\"","Sometimes, when everything is shit, you just need a good extension method.","He fell down the stairs for the rest of the summer: Predictive keyboard writes a new chapter of Harry Potter","Stack overflow in a nutshell","I was suprised too","Kernel Gaddafi","my friends tell me they are \"programmers\"","Windows Firewall code exposed","Rege̿̔̉x-based HTML parsers are the cancer that is killing StackOverflow","Somebody must have changed my code! i'm sure","Quora is truly a magnificient place","JS ecosystem in a nutshell","bash : cd : home Permission denied","Me too, thanks","Wow, I sure screwed up","Yeah, that sounds about right","Can someone help me","Found this in the code for a $400,000 robot","How I feel when I deal with Python Multiprocessing","Minimax","When you don't understand the task, work smarter.","That's one way of putting it","It's easier to use... ¯\\_(ツ)_/¯","I don't have permission to read this...","Padawon","Stack overabuse","Storing a single byte in C","Some title","The bravest of souls","I still have nightmares about Visual Programming 101","Git Tutorial 5: Branches (Create, Merge, Delete a branch)","CSS is awesome awesome","Did from the scratch","Sooner or later..))","60% of the time, it works every time","Looking at old code","Become a front-end web developer","Gondor calls for aid!","Me, extending my application","[Unity] Believe it or not, but I get payed to write stuff like this","This commit message is relatable","Pull Request","Determining if Authentication has timed out acts like a quantum state. You can't check it's status, without affecting it's status.","500 errors","Gave 90 percent of my stackoverflow points as a bounty","This is why you should use https on websites","Learning how to Git. Those first commit comments will be fun to look back on.","SJW trying to learn C","I mean they're right you know","Was searching for freelance data scientist jobs and found this. It's beyond my abilities.","Cars can run Javascript","Word...!","What are you really?","Every Time I Write Code in C","What programming really is.","I have finally solved the array index problem forever! (if forever is C# only)","I want to kill myself","Can't tell how much i hate those ads","Well-played, Gates. Well-played!","Old meme in 2018","Git Gud","Android Studio throwing shade","Was killing time at work and found the Hyper Text Coffee Pot Control Protocol (HTCPCP)","The joke about the type.","That's why I don't like web dev","Call Neta...","Found this in G.T.A V.","best feature ....","Life as a Software Dev xD","NPM pls","I wish I knew VB","Standup is okay","Wrote some code y'all might wanna use","Anytime QA brings a list of bugs to my attention.","Keyboard designed exclusively for programming Lisp","[Title couldn't be found]","Soap here comes in packages","Starting him early","It is now!","What do you use?","I found a bug in my Alpha-Getti","A boolean cube.","I just started linear algebra today. I can't believe the kind of persecution I faced in class today.","[Meta] I will only ever see my own posts on this sub","Design, code","Classic!","Open Source-rer","I’ve seen this happen","Completing a simple Automate the Boring Stuff challenge after struggling for hours","Tinder line I used: We must share common values girl, because you and I are a natural JOIN. 😅","👿","You wanna know how you get bugs, that's how you get bugs.","Guess which programming language will come next.","Useful C# help","Guide to Software Engineering Job Posts","Testing your APP's offline capabilities.","True so","In what coding language was the first coding language coded in?","Let's just say IT's a mistake!","Gooey User Interface","The best theme","ya fukcs","This bar in Strasbourg gave me a bit of PTSD flash backs","The Truth Hole","Good ways to learn programming?","A Terrifying Thought","funny story about javascript","How to become a Senior Software Engineer","Car mycar = new Car(); //OC","only true graph","and other jokes you can tell to yourself","Found this gem while browsing old projects. Apparently callbacks weren’t a thing when I was 14.","Me and my friend while coding","Joins on Joins on Joins on Joins","C# updated","When people advocate for 1-based indexing...","And on the 9th day, the Lord gave up.","Rebrew in Rust","Ships are not precise","Yes, it's true. We have issues like this.","naming variables be like:","I feel like those “learn to code” promos all over the reddit app are a personal attack.","I didn't choose them, they chose me","Array starts at 0","You're suspended!","What's your child texting about?","Cake day","Why you should not learn to code.","Matlab: Time starts at 0 but arrays don't","Checks out.","Bug or feature","Congratulations SnapChat","Guy from my uni made this for our class (hehe)","When you download a project from the internet and code inspection kicks in...","Worst app ever","What you think?","Is he wrong tho?","Hue hue hue hue...","The real way to make a \"loop\" in C++","Databases","I pull","NASA's 404 Page","My mom was looking through my history today","Be like Bill","Russian Roulette: Programmer Edition","Gotta Hate Those Last Minute PRs","I'm amazed dark theme hasn't completely won but I still see light from time to time.","Waiting for gradle to build","Too late for this?","No problem fam","[Python] Recursion...","Lambda calculus vs Turing machine","When python can't handle the truth","After learning that \"its turtles all the way down\"","-Wswitch","Me irl","I want to hear a good ARP joke","I'm a junior dev and my husband's learning to code. Our insults have turned into code.","\"In JavaScript objects are king. If you understand objects, you understand JavaScript.\"","Amazingly good security","Hahahahaaaaaa -_-","So using Walmart's API authentication is apparently a thing now.","What programmers really need","git push -f","this is how programmer deal with the deadline...!!!","Waterfall vs Agile vs Reality!","Input mustn't empty.","Witching Hour","Oof","This programmer knows his priorities in development","The Last Physical Machine","Reddit's algorithm for trending posts in a nutshell","Two way encryption with middle man attack...","Changing the rules","Java should be pronounced Hava because sometimes it treats you like a Spanish lover and sometimes like Spanish Inquisition","If there is a better explanation of the feeling at the start of a proj/module/etc--I don't know it.","Bullet-Proof Coding Methodology","Not enough jquery","Who else wanna learn C++ in 24 hours?","StackOverflow, where actual research and facts are... so distressing!","[Humour] Privacy matters","When you setup your first server and you get your first message from another computer","Very fascinating NPM packages","Use the .dmg, it worked for me","I can't be the only one who reads it Weird A.I. every time","I’ll hAcK into your girl’s heart","When you're on r/PrequelMemes and r/ProgrammerHumor","Use sudo rm -rf / to hack","Religion Evolution","I was going to tell you a joke about how networks on the beach use sandswitch as a play on words...","Dennis Ritchie explaining infinite recursion.","These GDPR cookie notifications have really gone far lately!","Python 2.7's Nightmare!","End","Please don't hurt me","If Microsoft made a blender","Python &gt; Scratch &gt; Java","If you are a new programmer","Some intern messed up prod data","Little did I know, I have been coding correctly this entire time","Found it funny (also the original comic art goes to shencomix)","I enjoy watching the world burn.","“What should I write for my Commit Comment?” nvm","HOME SWEET HOME SWEET HOME SWEET HOME SWEET HOME SWEET","Localhost Invitation to the girl I went on a date.","why?!","Just started programming, am I doing it right?","Um, because you need to.","Console gave up","TIL something’s wrong with me","Sooooooo 5 bug fixes Microsoft?","HTML and CSS are same?","smooth criminal","Git on it","Use Kotlin to make your pseudo-code syntactically valid","When I join a new dev team and they ask me how my code looks.","I felt this","Hard facepalm email from NYU engineering (majoring in CS)","with hope and faith in my lord....","VAMPIRE.... ZOMBIE..... PROGRAMMER","Using callback functions for the first time","programmer starting to prepare for DS/Algo starterpack","I think the Host OS is overweight...","#Priorities","Trying to understand someone else's code...","When someone asks to explain what it is you're doing exactly.","Another rare picture of people from r/hacking","Luck is just god executing the random command","🌳arithm","C+","Infinite Loops is a good cereal brand name","Look at this absolute unit","root@terminal:~ kill downvotes","Learning a new language","What people think I do","Goodbye","[META] The ever-lasting battles between programmers","Hello, Fellow Kids!","Met someone closer to Hofstadter today.","When the intern does if(document.querySelectorAll('input[type=checkbox]').checked) and thinks they figured it out","[ ... ] is a joke about why I hate blackboxes","Rando doesn't understand how much he understands","Because some programmers are InfoSec too.","SVN is better","Which one?","Death I don't fear...but that thing...","The True Way to Write an Exclusive-Or Statement","Sign on the professor’s door","git checkout puns","Let me just turn off anti-virus and install this .exe","I might have made this app myself","This sums it up!","Delicious!","\"One epoch should be enough, let's just try it and see\"","The operation x++ actually returns the value of x before increasing it by one, which means c is better than c++ by one","Whenever I need to remember which weeks I took vacation...","Rule of thumb for programmers","HTTP 477: Butterfly detected","TCP joke.","CSS is Awesome!","What can I say, C# is dope","If people talked about everything like they do CS","That moment of joy","How i imagine people from r/hacking","The assignment was to implement a semaphore class, any ideas on why I failed it?","Html does make the best android apps...","Spent an hour digging through code today, and all I found was this bad Star Wars joke","Ten types of people","[Meta] Thank you, r/ProgrammerHumor","When your app is perfect","Pascal...","Don't you just hate when this happens?","Repurposing this meme","I refrain from using my sin_port until after marriage","ONE. MORE. TIME.","Java method naming standards","She’s an engineer and in her Tinder profile she said computers &gt; humans","if (poker.AI.level &gt; 9000) { raise(); } else { raise(); }","rip weekend","Get to the productioooooon!","Hey guys, the line #237 in my code have to be considered as commented out","From r/animemes, still should work here","Hulu devs had fun with this release note.","I did it guys &lt;3","Facebook starts their percentage arrays at 1","The 3 keys making lives easier","A Public Enemy","My love for PowerShell grows every day I'm forced to use it.","When your Smart Speaker is hooked up to a Smart Switch","Just started learning React this week, and I couldn't get this comparison out of my head.","Was reading the linux kernel source code when... Too relatable","Developer’s Serenity Prayer","Coders vs others","Gimme the vogals","Even Java devs hate HTML","Looking at your code after your coworkers \"fix\" it","Finally, a job posting that's just like real life.","This default indentation level","People like this are why programming is so frustrating. Can it be more obvious what the issue is?","When developer are mad...","\"CSS is a programming language\"","Git 101","ButtCrackin, a new shitty git client","A Python class","First windows, now Linux too?","Java is just an island","Funny exchange at work today","Have celebrity baby names gone too far?","Found this PSA for VIM users on the road","I think I made a *small* mistake","$HOME","Transferwise release notes","I just found my favorite example of underflow","Computing so advanced that you can't even C it","Docker Addiction","An offer of free cup of coffee for Programmers","Working on a cliff hanger","This MS Azure ad that popped up on Facebook","am I using git right","Stumbled upon this gem today","[classic lit] The Story of Mel","My manager told me to start using error codes other than \"1\" for our automated scripts.","Refactoring","No second thoughts on this","The next holy war?","Naming convention !","Programming Languages","The progression of a project in github","So this is now my resume","Bill Stiteler on Twitter: \"Sea of Rust\" (2017, @Massawyrm)","Every day","Rip","SaaS subscription management - It's all about control.","It doesn't work... Or it work... In both scenario they thing... WHY???","VBA's where its at","Silly Kids","How long will it take?","This shouldn't be considered spam, right?","Think like a programmer.","When your coworker approves your Pull Request right away","Bug? Or Feature?","My new Wallpaper :)","Defaulting date of birth to the current date is always a good prank.","C++ roulette","You can never be too sure","Bless the rains","Tinder didn't work out, maybe I can generate a hottie","AskReddit thread about coders talking of their experiences","Not Wanted","Well played, Mr Enterprise API programmer","Document a bug to turn it into a feature","How I start class every morning","Programming isn't for everyone....","Hackers","How to make your users love you 101","Using Java for game dev","When the client asks when will that feature he wanted be ready","When you are just to lazy to address all the things in a 1.5gb update","I'm convinced","_","How do you program that ?","My neighbors must love doing null validations","Here is a little joke for you","&lt;h1&gt;Yes. I know the math in the picture isn't linear algebra.&lt;/h1&gt;","Sometimes it's just not your day","Windows 95 in Electron","When your code becomes unreadable","[WP] For 24 hours, all programmers can commit code into any repository without any consequences.","OK Cupid programmers having some fun with the app update:","Call me \"Scala\", Maybe?","hmmm","When world's first Antivirus blocked a virus: unaware of this, developers of that virus must have been spent hours of debugging virus code thinking it is some bug in code that caused virus to fail/crash.","Life of a Designer vs Life of a Developer 😂","AI is just if statements","I might need this later","Programming Exercises","Sometimes I Hate C","My delivery driver has an interesting name","Oh Python....","Well..","my kind of sorts","position: static | relative | absolute | sticky | fixed;","Revisiting an old side project","to fix bugs","just a javafx devs thing,,","You made two Misstakes, first you write the Password in Plaintext in js, and second you used the Password: password.","android_development_irl","\"You're a wizard, Harry\"","The problem with programming in Hitler...","As a tribute for Stefan's death. I shall make a language where arrays start at 1.","Guys, arrays start at NULL and end at buffer overflow","Only For Programmers","version control","What the client actually wants vs what the developer thinks the client wants","Fixing Your Git Repo","Easy choice","No can do","Im so lonely...","Be like Java","I wonder what the http gang will do about it","The function I need.","No wonder learning programming is hard.","Took me a bit, but I finally got to page fifteen in my book","How many of you have *contributed* to humanity?","My soul's deepest wish","Google's recaptcha is checked","Just try running it again","When Friends Become Enemies","Repositioning elements with swing is a pain in the ass","Don't programme open source, Microsoft dare you!","while (!songend)","Looking at the code on Time’s website and this little surprise made me smile.","When I ask someone to check my code","JavaScript is like Car Carpet","Must have 5 years of experience. Entry level","Programmer's workout","Stress Relief Big Enter Button","Tried to read up on REST, developed a liking for kale instead.","Running a startup business and needed a new email!","So I was trying to figure out RegEx and got bored","As a PHP Developer, this is me browsing this subreddit.","segfaults got you down?","/r/ProgrammerHumor is leaking","Programmer born","Adventures from Intro to CSC","Real programmers use cuneiform","Writing a for loop","It's null Wednesday.","AJAX is Asynchronous JavaScript and XML. Except it doesn't have to be async, it doesn't have to be JavaScript, and it doesn't have to be XML","I guess SO does not always have an answer","My brain when I say **T O D A Y** is my cheat day","Ajax...","oof","My friend just asked me why tech people are so weird. I made this to explain.","..","The three principal virtues of a programmer are Laziness, Impatience, and Hubris.","When programmers design the bathrooms.","FTFY","If character is lost","When your console program is written poorly","Tribute to Stefan","Draw text using OpenGL!","Post vacant for Swift developers...","Android strings.xml file","Debugging 101","opensource is the \"zero point energy\" of software because it can spread from a few to millions of users near instantly with 0 marginal cost, given the computers millions of people already have","Visual Studio at it's best","Certificate has expired","I'm In. [OC]","Can it be?","Dependencies 101","42 Minutes to say the word \"No\"","More like lolNet","When you actually get users","AI will take over the world","Eclipse IDE browser is best browser","Every gun we have","If Rammstein did code","@CyjaneK: Cool let me see what new I can find in this update! Maybe group calls? Telegram:","Picture of my secret git stash","When you go to lunch with programmers they inevitably start sorting something","In light of STEFAN KARL death I suggest we start Arrays at 2","Recruiters be like","Beach umbrellas start at 0","Every word of what you just said was wrong","Teaching UDP like...","Today was my first day back to school","True or False","they're worth less then this meme","What’s the worst part about UDP jokes?","worked out for me","If you dont code in this you might as well code in mindstorm","JS tries to the Best Possible Thing ...","Typical post...","Found in a college bathroom","Best way to avoid hacker","badjoke.php","We've all been there!","What's the worst about about UDP jokes?","This AskReddit answer","bool","PHP logic","Errors","I'm doing number theory homework and I just caught myself doing this...","Let’s Blockchain healthcare!","In order to achieve something you must commit time and effort","How programmers cope with depression","Is this the real life?","One of our QA engineers was panicking for not being able to connect to local QA03...","Easy","I mean, I guess","Eid Mubarak","merge conflicts","sometimes it's difficult","Not on Friday evening","My situation as a programmer...","😎👍","Found this on 9gag. Thought it would fit here","when you use a program that searches \"J Cole\" insead of using the songs on his page","A big F for Stefan","When debugging a problem","&lt;hack&gt; reddit &lt;/hack&gt;","There's a bunch of error messages on the website","My boss asked me to suppress an error. This was my first thought.","[OC] Has science gone too far?","Seems about right","An interesting title","My coworker's design philosophy","github socialism","Manually controlled ad hoc polymorphism in JDK sources","My data structures class this morning was... interesting","Different Types of Programmers. Which one are you?","Sorry guys..","The only calamity that can stop a programmer is...","WE SHALL SETTLE WHERE ARRAYS START AT FOR GOOD. WITH A POLL.","Shh...don't upset the developers","It really do be like that sometimes","Sigh...","О(n^2)","slipping in mild obscenities","World of Warcraft streamer's game crashes due to add-ons. Someone asks him for the logs.","M'alloc","Boredom does not exist in Sql Server.","what happens when shrek forgets his base case","Traffic Control Protocol","How to be a scrum master","Java has always been fun","Is this a merge conflict?","Programmer's mask","The most exciting games","At least its not as bad as Java Classes.","What you’re telling me I can’t really create the next Fortnite without a line of C#?!","I made all the possible \"bit-byte\" memes from the English dictionary, so we can move on now.","Lets settle this one and for all","Internet Genus","What Do You Call A Girl With a Nice Face but No Body?","Chill down VS","If doctors worked the same way developers do...","Testing 101","tnnArxj06cTHq44gCs1OSKkjLY","Server and the manager..","Wow what a great update I really want to download that, thank you Microsoft","The indentation debate just ended!","Windows","Many enter. Few exit.","Requirements Engineering Lecture 1","Browsing c-sharpcorner.com in search for answers when I see this ad...","There is no god","Coding is racist","Brøether, måy I háve some cödë","Implementation","slideDown all the things","It's me sometimes","Management liked this for our dev area... But we're a dot net shop!","Google assistant passes the Turing test!","IN THE ZONE","Computer vision","Hey guys, arrays start at 2","When you got enough of coding and your mind be like","To the hobbyte guy","When someone says HTML is a programming language.","Python gets me like nobody else ever will","Hobbit","When someone says a keyboard is faster than a mouse for editing code","You don’t need to update if it doesn’t exist","Choose your debugging methods wisely","When you have to choose a variable name.","Visual Studio","I hoped they would learn by now","who needs a build system anyways","Deadlock explained","Sigh. That's not what I meant by security...","You didn't even check!","2B or not 2B","Exercises to stay healthy on long programming sessions","//TODO: Think of a better title","Managers be like","When I have such result and look at it, I feel good as the programmer. But my friends think I am strange when see how I smile looking at it.","[Serious] My back end developer uses a light coloured theme. How do i perform an exorcism to remove the evil daemon possessing his mind?","Use descriptive variable names they said","I dont generally leave it on for so long, but I'm surprised I survived any memory leakages. I'm sure you've seen worse.","Challenge accepted.","Ouch","chicken.chicken","It was nice knowing you guys...","When the AI takes over","Unexplained phenomena","Arrays? Nah, not in my coding style.","There is no excuse","Thinking like a programmer","Scumbag intern","Need help for funny answer","Actually happened to me","Found this beauty on a HTML help forum","So in Philippines, they pay with PHPs ?","Great Dad","Starting college today...","A personal attack","My List of Completed Projects","It finally happened","Why did the intel employ get fired","Actually not happened to me","A Thought I Had This Morning","Best Languages for Hacking","CSS is a Language 🙃","Xzibit","The future is not far from now","SQL Rocks!","Post.title","Ifn't","We have all been there","Save it so you can listen to your C++ source file","Error : train not found","Cancer Memes","Compiling code","How to code in 6 easy steps","The r/ProgrammerHumour dream job","fuck matlab up","Why not","My life in a nutshell","What OS to use","After learning some HTML and CSS for web scraping reasons","Bash ni🅱️🅱️as be like","Someone on my uni's web dev team seems to freqent r/programmerhumor and wanted to try out the bad UI in prod","Ancient Egypt unit of measurement","Is my baby an AI?","Title","When you learn to define results in Google by using \"\"","Always do it","i'm not a fan of larry ellison","Programming comments","try {} me","Is this a test within a test?","Oh no","That's what I call a gangbang","Rainbow Terminal","console.log(this);","The truth from Computerphile","Bite","Every Single Time I revise","Forever alone 😢","On my professor's slides in the parallel programming course","Corrected","To be fair, I tried to warn him.","Fixing my code","Arrays start at 0","He could have done it himself but in fairness to His Holiness, HTML is a rather difficult programming language to learn","./a.out","How to Design for the Modern Web","Thanks for telling me what I need to fix","var shitpost;","Now that’s dedication","Found on StackOverflow","You haven’t been taking the best care of your Git repository, and now you’ve been struck down by a grisly merge conflict. What’s your course of action?","Sure, why not?","The Virgin Null Pointer vs. The Chad Monad","unpopular opinion","Perhaps I should take up crocheting after all...","Infinite Wisdom","WebDev_Irl","When the breakfast area in the hotel is more active than you.","I used to write buggy code...","Threes Rev 1.1","When you edit your code directly in production","Me reading off IP addresses to coworkers","Anyone??","The War of Error Handling Paradigms","Old Printers anyone?","Thanks for clearing that up. [not allowed on /r/whoosh]","Shittydesign irony","We need more of these people","It‘s harder than you think it is.","How to write unmaintainable code","When you're gathering requirements, but also feel motivated","Found in a dorm room that was turned into an office","After debugging we found this to be an accurate representation of what was going on in the code.","We've ascended","Are they trolling us?","Java vs Coffee","Let’s be real tho, I’d rather debug a Saudi Arabian WP template than listen to a bootcamp ‘grad’ hypothesize over integrating Blockchain into their Fortnight idea","The definition of a full-stack developer","Recursion means recursion","Infinite Recursion is Everywhere You Look","Game Development Budget","Only the best hackers work in binary","Android in a nutshell","Life of a programmer.....","How to Pronounce clang++","the truth","This car covered in chips and circuit boards at the Dream Cruise in Detroit, MI.","Go back to Rust","I made volume slider where it's hard to select numbers divisible by 2 or 5 but also any time you release mouse it move slider left or right","The flag made me laugh","The reality of working with servers","This Reddit post had 7 up votes","Shamelessly stolen off Twitter","High stakes HTML","This guy codes too much C++","Intresting Programming Launguage","It's really fun to maintain an app that uses poorly documented libraries, I love wasting my time reading source codes..","Working with a client","When she says those four special words","The room number at this hotel","cursed_belief","Time to open in Notepad++","A week after starting Linux and customizing it to perfection","Hack the web people with objective B++","only reddit smart enough to post jobs in their site console.","Press any button to continue","Tough prerequisites","How programmer runs?","What people think about my machine learning work vs what it actually is","Forgot I had a spicy yearbook quote a couple years ago","I'd pay to see that","PROGRAMMERS HATE HIM! HE MADE A O(1) SORTING ALGOROTHM!!! FIND OUT HIS SECRETS HERE!!! (NOT CLICKBAIT)","The best language","If Queen were a dev team instead of a band","I am $GOROOT","You died and went to programmer hell. What was your sin?","Unintended negation","You cant fool me Cave Johnson","Weird Error. Not OK!","object oriented assembler","The Ultimate Hierarchy","How inefficient of him...","Does anyone have this?","Saw this ad pop, feel free to rant about blockchain again","Happy DOS","When you are paranoid","On an ask Reddit post saying “what is something everyone thinks is very common but is actually extremely rare”","Everyone in this subreddit wants to kill me after they read text below","When you click reply all on an email that was sent to the entire engineering department","Found in parking lot. Made me giggle.","==","Junior programmer dips into the engine code for the first time","Justice for Glitch!","Knowledge comes from researching a technology. Wisdom comes from debugging said technology.","There's no such thing as a perfect programming langu...","Know the difference","Dont mess with a dev :P","Why use VSCode when you could use VSCod! \"Free. Open source. Runs underwater.\"","Now I understand why Visual Studio has so many problems","“Skilled craftsmen are a dying breed”","Checking equality","My daughter is learning math","Would be cool that the Pokemon Go developers use mongoDB","When your company goes too far with micro-services","The joys of testing","Jailbreak your iPhone using HTML","h[A]rd to fix • r/perfectloops","Not the most uncommon joke, but I just started working on my old code...","TCP/IP vs UDP","Computer science is not for kids","Damn fuck those guys","Thats definitely the main reason","Ctrl+Shift+J","[OC] Overflow Protection","Name a more skub language, I'll wait.","Zachtronics gets it","Thanks Hulu","Ubuntu!","What is the size of an integer on a 32-bit system?","I code with a pen all the time!","Quora STD's","Hey guys, I know I shouldn't ask for coding help here, but I'm honestly so stumped...","How entry-level engineers of reddit view technical interviews","My brother asked about my 5 liter orange juice magnet. I asked him to show it to me and this is what he was talking about","GOTY","Is this Australian Version Control?","Now you see me 2: I didn't know where else to post this. I'm just upset.","Dattabase","What does Visual Studio do really well?","Me: I'll just call this variable f for now because I'll be typing it a lot, and rename it later","It's a crime","Frequently Bought Together","New programmer at the company I work for","Go home Visual Studio, you're drunk.","Coding with recursion is hard because there’s very little room for error. Either your program is correct or it’s correct or it’s correct or it’s correct or it’s correct or it’s correct or it’s correct...","Debugging a 10 year-old codebase","Caution Visual Studio","Humble beginnings...","Frequently bought together","Yeah, it works!","This guy has it figured out.","Whaly?","When your project was just supposed to test some concepts but now its a full-fledged program","The creator and his creation","How most devs use Dagger...","How to show dominance","I have a bug","Hmmmm","Well... ok","Very clever...","Forget webcam covers, install Linux","Works every time","Spelling is hard","They do it to themselves","Finally a crystal clear error message (xpost r/geek)","Deadlock Explained","Which one is your favorite ?","Wanted: Computer Hacker","How to pronounce VI","The year is 2070. The python version is 74.1.","How did the developer land a position as a plumber?","d = (a + b) * c","Its the evilest thing imaginable...","What is a \"senior\" software engineer? The difference between junior and senior engineers.","I’d buy this book","Asking for nudes","Large insurance company makes payments extra difficult","Admiral Grace Hopper taped a moth in her notebook, which was stuck on a relay on the Harvard Mark II Computer in 1940 with the remark: \"First actual case of bug being found.\"","if(Funny){ upvote++; }","If Programming Languages Were Weapons","Even Gambling sites advertise with blockchain","Found this on twitter, figured it belonged here","IT professor has all the school tests as comments on his website","you have tested the site in IE?","System Owner: That's not what I wanted","Stylecop like","For those who did web dev in 2007","Work distraction","Have you ever wondered how boolean values are defined? Well this is it.","Typical open source project...","Perfect!","Coding vs Debugging","Specific Function Naming is Important","HAHA YES I DEFIANTLY KNOW WHAT THIS MEANS","Come back exception! Where did you go?","It really do be like that","ProgrammerHumor with a dash of iamverybadass","Want to be a hacker? Just install this app","Nice! Oh wait...","Six Stages Of Debugging","Every single damn time","... but the automation tests passed!","I mean, it works!","Sudon't know me","When you mess up and hope no one notices.","A long standing question","Sometimes we disagree with colleagues about the project...","Normal People vs PHP Devs","For when your boss expects you to work free overtime","Well, I could spend a year learning to create games in C#...","MicrosoftVS: Where should I put the breakpoints window...","Why is Microsoft Access called Microsoft Access?","know the risks","The software engineer’s guide to asserting dominance in the workplace","Git's official documentation.","So true!","He must be a programmer","Too many lambdas","Happens to me everytime","Why everybody is afraid of PHP ?","Some r/comedycemetery material right here!","Ermm","How to tell if a developer is stumped","code for cupcakes?","Git 'er done: a short story of tragedy","How about a high-high priority ticket then?","How to use Git - NOT!","code made very faster","Time to Commit Toaster Bath","Feature Creep: Bradley Fighting Vehicle Evolution","Every time you try to fix a broken CI pipeline...","Got this from a friend - thought it would fit in here.","Had to have a website with JS and CSS in the HTML document...","Every first time linux user","$PlsKillMe","When Another Programmer QA's your feature","what I can do","please give in the text into the box to proof that you are not a robot. well","CI/CD Dream vs Reality","The right attitude, two months after taking over a legacy project.","Coming back from vacation","A welcome change","tests/silenceOfTheLambdas.js","When your country's election is coming up &amp; your code gives you bad vibes.","Something something github activity...","The problems with making a website for an orphanage.","*butchers code*","10 secrets to becoming an Engineering Leader — quickly!","I figured this belonged here.","What if we tried designing C a second time?","Integer Overflow is a Fleeting High","Just to be clear","it really do be like that sometimes","My favorite kind of autocorrection. Hopefully full emoji support is coming in the next Chrome version","REEEEmails","Look for the hidden enemy",":x","New Programmer","Nailed it","*shakes fist* SEG FAAAUUULTS"]