["Brigading and our policy about Brigading (If you followed a link from somewhere else to get here, please click this)","Seriously, no need to be an asshole about it guys","One person's patriot is another's terrorist","Please take away my healthcare!","Way too far.","Wait for it...","Can't do it when I get elected.","An unfortunate trump self-own","Surprise Mutha F*cka!","Smarty pants!","Fair and Balanced Google Searches!","Trump unveils official White House portrait.","And that’s a job","My favourite of the grumptrump photoshops floating around","This","You know most of his assets are invested","In Case Of Constiutional Crisis, Break Glass","Who to believe?","Remember when Democrats kept posting anti-McCain/Romney videos almost two years post election(s)? Me either...","Miss Piggy did a spot-on cosplay.","Anonymous sources say...","@ me next time","Weiner Circle coming in hot","Do u ever look at stuff and wonder how it got there?","All the Presidents Men","It’s the simple things...","Don't believe \"anonymous source\". He's a big fat liar!!","The Googles (Crossposted from Advice Animals)","It’s probably a toss up","John McCain's epic farewell mic drop — J.D. Crowe/AL.com","Yeah, Yeah but I still don't see collusion","Using Trump's Narcissism for Good","\"he's out of his cotton-picking mind\"","No dessert until you finish dinner.","I love the uneducated.","The channel guide knows what's up","Mirror, mirror","Bread lines","Very in touch.","Guess what....","Huge Sale!","Hornswoggling? Not even once.","The Best Deals","President \"GoodBrain\" is Out-Trolled","“Don’t trust anonymous sources” -“John Barron”","for real though","Garrison, Corrected","WOW!!! The state fair managed to fit every single elected libertarian into one booth!!","When ur patriotism for the troops is so strong you do not even think about what ur sayin'....","Lock Him Up !","Ugly American","You have to have a high IQ to get this meme","Why Google Is Anti- Trump.","Russian bride.","Crosspost from r/standup","Out of touch Trump","John McCain","It took way too long to make this.","Google response to Donald Trump searching himself.","Well said indeed.","It's at zero each and every day.","Car service advertisement in Basel, Switzerland","Well, maybe he moved there","Alec Baldwin Has Gone Too Far!","To space and beyond","Hallelujah!","The most annoying toy ever.","Billy oh Billy","Enema of The People.","Is this where the Pepe frog meme comes from?","At some point Obama's got to get fed up with Trump's criticism, and respond like this","McDrumpf","You mean NOT MEXICAN, right?","If Donald Trump doesn't like Google's search results, then maybe he should start his own search engine.","Aaaany day now","I'm not sure it wasn't intentional...","Hmmmm","Snowflake. Let’s get Trump to google himself the right way.","“I always felt like I was in the military. (I got) more training militarily than a lot of the guys that go into the military.” -donald \"cheeto\" trump on his prep school military experience .","Lyin' Press","Just another typical day for our President...","I'd actually play this!","Lafayette, Louisiana","Logic Need Not Apply","Their stupidity is astounding","Preparation","\"Tonight's selection of various flatulent sounds will be simulcast live and in stereo on your local NPR station.\"","Sure, why not... not like religion is not a mix of lies anyway.","At least they're keeping warm","When considering regulating internet search results, White House staff determined it would be simpler to provide the President with a laptop upgrade. 100% protected from 'fake news'.","T.Hanks","Peach Mints","*christian conservatives","HAL loses it.","Don's Ron and his Unsubtle Racist Dog Whistle","You guys attention is in the wrong place.","“My parents died in the glitter mines” 😂","politics","MRW Ted tries to Cruz on me but I'm not into incest.","The definition of insanity is doing the same thing over and over again and expecting different results","\"I just like history and the police\"","Trump dissed the mayor of Tallahassee, Andrew Gillum (Democratic candidate for Florida Governor)","When the shooter is white","BINGO !","All aboard for Azkaban!","Trump Brands Google ‘Unfair Liberal Witch Hunt’ After Viewing Search Results","Coming soon...","Why stand for the National anthem","One More Time - *plays on loop*","John McCain's Funeral Requests","Calling it like I see it","Search Results","Life under capitalism","OC","h","Now You Know Why","trump approves the 1st space force project","Fixed that for you Bronco","Sometimes InspiroBot delivers.","Two Funerals and a Wedding -","They're so special","When you don't like your reflection, it's the RIGGED mirror's fault!","Republican Patriot vs Republican Traitor","The White House can and should do WHAT?!","Who brings a gun to Walmart?","Flynn defense fund.","Do as I say, not as I do","I’m guessing most are cocks","What would you do?","touch decision","The Art of the Deal at Work! Do the math.","No wall needed.","Some will say it’s fake","Always prepared to bone America","Trump Revokes Puerto Rico Recovery Funds After Learning Hurricane Maria Had Fewer Survivors","Troll Level 5000","Redcap Logic","The answer to all of Trump's crimes","What else do they have in common?","Bot is correct","Alex Jones explains why he has trans porn on his cellphone","The inventor of the internet is why Google is anti trump. It’s the Al Gore Rhythm.","Was it before or after he simultaneously condemned civil injustice protests and condoned neo-nazis?","Randy Quaid bringing Trumps tweets to life allow them to exude the villian archetype they so deserve.","Times Cartoon - McCain Row","God has spoken","Make defecting great again","The good old days","Yup!!, This really happened","Immigrants Killed My Family","So true™","Captain Bone spurs knows where his allegiance lies.","Comprehensive list","They're coming to take me away haha!","Must be rigged","How Low.","What a singing voice.","When satire is accurate","Trump supporters after his South Africa tweet","Trump when he googles himself","Maybe this is what the problem has been all along.","Politics vs Policy","SURELY there's nothing that can be done about it!","A shirt for true PATRIOTS","Rare Look at Trump's Inner Monologue (Circa 2018)","Google search for idiot.","You just don’t.","Not down with the sickness","Somebody had to tell him","Donald Trump’s signature wrestling move","When you have thin skin, it stings more...","Donald Trump - In His Own Words (Animated)","When it's a slow news day...","What this morning's headline really should have been","Google Google on the wall...","It sounds great in the echo chamber...","The bravest stance","Bad boy Benny","When Trump Googles himself and is surprised by the negative coverage","That skin is thinner than it looks.","trump the flag humper","Booze and Politics, a Proud Tradition.","Reaganomics in a Nutshell","Does this sound like fake news or not?","Because otherwise Hillary would have traded all our Uranium for child prostitutes on Mars","Shout out to my local Post Office for honoring Senator McCain better than the White House.","Welcome to the Neighborhood, Homeless Guy","A polling place in Oklahoma.","Phew, glad she's ok. Anyone else?","Like calling the ACA ObamaCare?","This is an actual listing on the official White House Gift Shop","\"Trump attacks Google\" looks like Simpsons predicted another one","Poor Donald...","He's not in danger.... We all are.","A little photoshop experiment: 10 Shopped Photos of Trump Looking Average","I think this explains a lot...","The Emperor Has No Stability.","Just Another Typical Week in America","Trumpoloni sees conspiracy everywhere.","Meow_irl","The Simpsons continuing to come full circle","Today's Puzzle:","you've got to be shitting me","Getting fewer by the day. RIP John","Someone show that to him","DOG gets the call","Top search results in Google Images for the word \"idiot\"...","High School","The only way I can picture Ted Cruz is as an Elvis impersonator.","Further South North American Free Trade Agreement","More than one reason she was unpaid","Devin Nunes goes to London","We did it, Reddit!","Mueller Rents Giant Warehouse to Store Evidence Against Trump","It All Makes Sense Now","We already knew this","Google is #Fakenews","When Trump says Google has RIGGED results to make him look bad...","Back in my day...","Alan Dershowitz's new book","Nice try Google News! /s","WWII chronicles colorized","Hmm...","The President Is Googling Himself.","TRUMP TWEETS: IT WAS CHINA THAT HACKED!!!","Google's response to Trump","Long live to the Queen, literally","\"Ted Cruz Tough as Texas\" - Vote Beto","Old man yells at cloud","Google search fixed","The loyalty vote.","Donald Trump Claims Michael Cohen is ‘Untrustworthy’ Because ‘He Associated With Me of All People’","Google's New Logo","Republicans Outraged Over RedTube Censoring Of Conservative Voices","\"Trump and McCain\"","Reddit do your thing so Donald Trump can find something good when he Google's himself.","This just in...","My friend hopes this will help the President","Painted our Nation into the Corner.","Clickhole \"A Historic Summit: Donald Drumpf Just Finished A Marathon Day Of Diplomatic Talks With A Man In A Freddy Krueger Costume Who Introduced Himself As The King Of Scotland\"","A Little Help?","Trump's rose colored googles","Trump demands Sessions investigate mirrors for rigged reflection","Worse than coluding with Putin to steal the presidency!","Who's Laughing Now?","White House Flag Now Moving Minute To Minute To Indicate Trump’s Mood","Have no fear, Rudy is here!","The exploits of John McCain","\"SHAN'T!!\"","Autofill is the primary threat to our democracy","Simpsons did it first","Russian Babushkas destroying apple products","Your tax dollars at work","Can't we just taco about it?","I am a very stable colorer, the best ever colored more than others ever colored before, hanging in museums.","Words of family wisdom","Frakking fox news, man","John McCain's sense of humor","Google gets it","What Trump imagines will happen with his anti-Google tweets","USA logic","Trump: ‘I Remember Flying The Plane That Bombed The USS Arizona During Pearl Harbor’","Trumpism!","Cannot","This needs to be viral","Free firefighters? Public parks? HEALTHCARE? COLLEGE?? Too spooky.","Words for our time","Good question","MRW I’m not invited to his funeral but they still force me to lower our flags","GEOTUS","A window display in my local book shop.","Weird Al: “Please don’t take a pickaxe to my star.”","Trump to Austrian: \"G'day, mate!\"","Trump Calls Lucile Bluth (Arrested Development)","OMG! Where's my phone?","Donald Trump Toilet Paper!","Best Post Today","This feels very appropriate today","To Infinity and Beyond! We have headed into some sublime Matrix level stuff here I supposed.","If I click my heels 3 times will they all go away?","Old man yells at algorithm.","He's not a crime hero.","Trump news in Pidgin English","New Ted Cruz Campaign Ad Features His Kids Begging For Beto O’Rourke To Be Their New Dad","Maybe voting is a good idea?","Guilty Donald Going After Google","Time to arm the kids","Trump plus Curb","Classical trump","Beating around the bush.","Who is Ted Cruz? Cruz Clues.","Don Lemon REVEALS Trump \"N-Word\" Tape","Bye bye","The shiny objects keep coming.","Donald Trump at John McCain’s funeral","cHiNa HaS bEeN rApInG uS","Bamboozled","This applies to many people.","We need him","Weird Al joins Hollywood Walk of Fame: 'Please don't pickaxe my star'","Abraham Lincoln would be proud","Ironic?? The Chemtrails got Alex the transphobe","NSFW... Sexy Theresa May twerking","Keeping the distance between them...","The decline","Stable Genius read the wrong column and then bragged about it!","Obama’s ‘only’ scandal","Disrespectful Don","Ladies &amp; Gents, the worlds smallest man!","Mike Pence Shame Cube","Most Richest Guy Ever! Ever! Ever!","I mean no disrespect, but...","Da real threat","Who cares if my daughter was raped a murdered? These tacos are delicious!","True Shtory","Trump supporters demand...","It is time Trump take antibiotics","Modern Day American History.","Better not kneel!!!","Immigrant treatment &amp; Nazis","R-e-s-pissed-c-t.","Irony: writing a book about how it’s the OTHER guys who are the brainwashed ones- and then titling it after the catchphrase of the fucking Borg","Trump rally","While the hosers try to act \"tough\", the United States will continue to make great deals with our Allies.","Criminals don’t follow laws anyways, so what’s the point?","Fixed Tweet","His behavior is starting to make sense now...","He can’t pay for Pecker anymore","Putin’s Beotch...","At least three have done it on purpose","Interesting view","Like like sack of boiled potatoes and hate.","Feminist am I right","Speak ill of the dead","I'll see your Beavis and Butthead, and raise you Ignorance and Want.","Always...","“America lost a true hero today!” - Donald Trump","Hard pass","Lots of flag stuff in the news recently. What does it all mean?","Damn entitled millennials spending money on avocado toast","Bannon actually looks healthier in this cartoon than in real life.","What big eyes, grandpa!","\"But that wasn’t real communism™️\"","Nice","Republicans are Jonesing","Disorder In The Court","The Purple Heart","Flag Returns to Half Staff After White House Aides Explain Concept Of Death To President Trump","We all must make sacrifices","From the Stable Genius who doesn't even know how to color an American Flag......","MAGA","trump's personal guide","Donald Trump And The TIME Cover: An Animated History | TIME","It really do be like that","We All Know He Prefers Heroes That Didn't Get Captured","Efficiency.","Russia must really love Trump. This is a real burger place in Krasnoyarsk Russia.","Trickling Down","As popular and respected as a bulging cyst.","DID I SAY \"WEREN'T\"?","You got it Rudy!","Joe Arpaoi's Theme song","George looks pissed","Let's play bingo!","F***king buses!","Punchin’ Houthi","IF YOU EVER GOT IMPEACHED - A Randy Rainbow Song Parody (sung to a tune from \"The Wizard of Oz\"","A good old throwback","This suit gets itchy","I order you to be quiet!","Lil' Donnie","Impeach","Even Spiderman is ashamed","The Last Witch Hunter","Trump Convinced He Can’t be Convicted by Witch Hunt Because “ If Anything I Would be a Wizard Not a Witch”","It’s been a ride so far","Presiding by example","Quick - call Alex Jones and QAnon! They *knew* Satan was involved...","Hehehe","3 buttfuckers using algorithms..lol. No.","White House Releases Moving Statement Honoring Woman Who Called Obama An Arab In 2008","Filternet. |Thejuicemedia|","Trump Says He Heroically Avoided Capture in Vietnam by Staying in U.S.","Donny needs a time out","I’m more of an all borders kind of guy","A Moment From Trump's Childhood","I'm a Republican and I support making fun of people with disabilities.","To be fair there is a resemblance...","This sub today","Featuring stunning views from every area.","Don Jr. takes on a comedian","Brennan's Bigger Voice","Not sure if I should laugh or cry.","Is there nothing that is beneath him?","It’s not too late","The OJ Simpson “Interview”","Trump gets a call from the IRS","Inquiring minds want to know!","So John McMcain goes to Heaven...","The Entire Political Spectrum In One Chart","Nobody’s Perfect","In Light of our New and Improved NAFTA Thanks to Trump","What would you call it?","Our president ladies and gentlemen","The official MAGA flag","The GOP Midterm Strategy","Entirely believable","Trump confuses Mexico with Canada right after getting off the phone with Mexican President.","Mueller coming for the Trumps","trump having comms issues with Mexican Pres. Pena Nieto (set to VEEP credits)","They're putting chemicals in my porn!","The Incredible Shrinking President!","The woman running for John McCain's seat has something to say.","Let’s check in on Paul’s status:","Saw this license plate. Kudos for putting it out there so publicly.","Libertarianism","Throwback to When McCain Trolled Senate Republicans When Voting on The Obamacare Repeal:","No Bone Spurs","If You Ever Got Impeached - a Randy Rainbow parody","Number of times I've posted this: 4","Holy Sweet Liberty!","The third one.....","America","Protected by the Highest Office","NICHE -- When your thoughts are no longer mainstream","Re: Libertarianism","Bill Watterson predicted the Q-Anon cult 25 years ago!","The Tweeting Dead.","Would be good to add to Trump advisors reading list (x-post r/wallstreetbets)","Clinton for the win","Mass shootings","Let's not be any harsher on Trump than we would be on a pre-schooler","Hunting Witches, Flipping Snitches","... found cookie monster with a gunshot to the back of the head. An apparent suicide.","The only good fascist is a...","America Likes Ethical Leaders","It's what he does","Hello Darkness My Old Friend","Creepy Uncle Joe","Local news paper trolls with this headline.","What Trump really meant with the flag","Are we still doing “phrasing”?","Bush had a shoe thrown at him, trump had a........","It should basically be illegal","Trump's Parade..","Newer and betterer trade agrement: USMTA","Devolve","Time NOW !!","Biff's America","Nothing can clear the Senate.","A Military Parade for Trump? RIP Sen. McCain","I'll take two","I blame grand theft auto","The flag that Trump was actually trying to color.","Only the best","And We Did Great","I would have posted it here first, but it's not really very funny","Trump and the Bowling Force","I made this AWHILE ago, but like a fine wine","I Mean, That Sounds Pretty Damn Fun","Tick....Tock....","A moment of reflection","Trump gives Vote of Confidence to Mike Pence as Possible Future President of USA. - Aug 2018","How to bring Socialized Healthcare to The United States in 3 easy steps:","Dotard in Chief having issues calling Mexican Pres. Pena Nieto (set to VEEP closing credits)","Second draft of the Cartman character (1996)","John McCain RIP","Every delusional redneck today","\"IF TRUMP WAS A TRAP RAPPER PARTLY FROM ATLANTA AND RUSSIA WAS HIS PLUG?\" OVER9000 - RUSSIA","Just another day in the office.","Me remembering all the crap I didn’t like about John Mccain","Nothing says \"respectful tribute\" to McCain like an enormous selfie","School safety","Dude can't go one day without being a national embarrassment...","Fauxahontas","GOP takes a break from endorsing pedophiles, supremacists, and corrupt wife beaters","The way it is...","Fish don't need to collude to swim in schools","What a convenient time to pretend to have class","Living the life","condolences","Both sides are the same, guise.","That should do it","Trump Vs. Speakerphone","Well Donald?","The Uninvited","Tar &amp; Feather - The Libertarian Regulatory Scheme","Back to school shopping with Betsy DeVos","Omarosa has arrived","Sale Of BET To White Supremacist Group Results In No Changes To Programming","For a moment I didn't realize that it wasn't the real Trump. AND YET I was not surprised","Anthony Scaramucci introduces 'Trump Family Special' musical","I'm not a crook!","Sending thoughts and prayers to those indicted","I'm waiting John.","Me @ Michelle Obama in the 2020 Presidential Election","This is a masterpiece","So Much Winning..","At this rate America is more likely to ban video games than ban guns.","Stable Jenius","The 2020 campaign is officially underway","Divided We Thrive","Trump got people nervous..","Just made this for a coworker.","Weisselberg and Mueller comic [OC]","Mueller gets the part.","The number never changes","Stephen Colbert Drools At Omarosa's Trump Tape (YTP)","Flying high and proud atop The White House.","RIP our Great Hero","A shame Trump has changed the MAGA flag, I liked the old one","Awe","La traite d'esclave de provenence d'Afrique n'est pas mon probleme.","\"Liberal\" in the US vs \"Liberal\" everywhere else","Trump said he would provide his tax returns, didn’t he?","The rats know when it’s time to leave a wreck.","Red, White, Blue and Brown?","Marked herself safe","I saved this photo ages ago but can't remember if it was a pro or anti Trump meme","Wake up a hero, go to work a hero. Not true. Over a lifetime, there are only four or five moments that really matter.","A parody, but painfully close to the truth.","rip","And just like that... no one on the right cared that Trump raped a 13 year old","Accidental Chomsky","Fox news' comments is back at it again...","Gonna go ahead and say “no he didn’t misspell republican”","Double Standard","Brexit negotiations in a nutshell","That's not right. That's just embarrassing.","The Trumpamerica Flag","Satirical McCain obituary","This is just insane","IS IT JUST ME ?","The Getaway","RIP John McCain","U.S. Secretary of Education, Betsy Davros","A prediction of Trump’s statement about McCain","When you find out that Donald Trump is your dad.","Headaches","I turned my negative emotions surrounding current events into laughs","Not As Smart As a First Grader","Worst Garrison Cartoon Ever?","If Stephen King wrote a book about Trump","Hmmm","Shut up and take our blood money","Our President ladies and gents","Liberal versus Conservative Agenda","Ima just leave this here...","It’s all about him","okay, this is epic","The new American flag","If Nixon were president today","No one will ever be happy","John McCain, American hero","Went to see Ted Cruz at his speaking event and wanted to try a new filter to confirm a theory...","Liberal Redneck - Campaign Ads/Vote for Tristan","I bet it tastes like crap","Burn the Witch.","Ourn’t prez-prez","Feeding time","tic toc tic toc ...","Every night, except golf weekends.","Cheap at heart","trump so horny","O O F E D","World's most efficient media dollar spend","Every Trump rally","How many more...","NBC awkwardly segues from a solemn report on John McCain's death to... well...","No collusion... Wheres the collusion... Show me some collusion","Puts out fires.","I think that's the wrong flag Donnie.","A true hero","I knew a stripper named Felony...","Trump's Plan to Replace ObamaCare","How to be Liberal guide by Sacha Baron Cohen","The MAGA dilema","Meet Karen Doctor, the totally real, not Russian at all, Trump supporter.","Alex Jones Joins The Gay Frog Community","Look! MS-13!","Whenever Trump supporters mention Hillary or Obama when Trump gets in trouble","Just like that","I just can‘t stop laughing about this. Congratulations to the author, sadly I found no name.","Today's Doonesbury","AMERICA!!","I'm sure this will be downvoted. The left cant laugh at themselves.","I'll second that","Outspoken transphobe Alex Jones accidentally revealed a tab on his phone open to...you guessed it!...transexual porn.","Loooooooool","Sunday get togethers are about to be much more fun","\"Alternative Flag\" or Nambia's?","Trump wakes up to the horrors of his own making","SERVILITY","She sure did","Found a tin predicting the rise of the alt right","Best meme of the week on r/the_dumpsterfire. If this isn’t humor I dont know what is!","Seriously tho","RIP, John","Sometimes reddit does the humor for you.","Preparing for his Fock Snooze show.","Doonesbury","America...the way it used to be...the way it is going to be...","Trump Sings Believer by Imagine Dragons","He made the thumbs down great again. Rest In Peace John","Misaligned text","Trump for 8 years","Dude has the answer key on his lapel....","What better way to honor McCain's legacy than to have a mass shooting the next day.","Republicans constantly being assaulted from all sides by 'liberal reality'","This is the funniest shit you’ll read all day. Sorry, not sorry.","Emperor Donald","Our lives are a cheesy 90s summer disaster flick.","Lost","Because you know Trump didn't write this himself...","Tweet tweet.","History repeats itself, except this time he committed treason, and dollars don't fix that.","That President has done ~everything~ wrong.","Found in Berlin, Germany","Suspicious activity this morning...","The Daily Struggle","\"anarcho\" capitalism","🙂","Video of Trump trolls downvoting /new in politics.","Respect the flag!","Hey libturds, Trump was drawing a \"blue lives matter\" flag!","Mike Doonesbury's summer daydream","Honestly, there's like a million different captions you can use here","Tell the Fake News I'm taking away Jim Brennan's security clearance for his \"wild outbursts\" and \"erratic behavior\"","This is your brain on collusion","Grafitti on a bridge in Gloucester.","Every morning, except golf weekends.","Libtards","Last time on X-men ....","Trumps New Flag Above the White House.","The Art of the Plea Deal","The best trade deal in history","Hmmmmm","Is this a crossover episode","Pence fantasizing what being \"46\" might be like soon","This pretty much sums it up.","When you forget the correct stripe order of your national flag.","All of a sudden","Promise him a Nobel Prize...","Found on IG, thought it was appropriate.","They're right. Hillary Clinton is definitely guilty of being one thing.....","Dominos with Extra Cheese.","Sleepy Elf has spoken","Bernie Sanders 2020","My name is...","When your past comes back to mow your lawn.","Make coloring cool again!","Just printed this and thought you'd all appreciate it. Please vote.","Republicomrades","The new Republican seal","My friend in the Secret Service says whenever Trump visits an elementary school, before the President enters a classroom, agents have to remove all of the crayons so he doesn't eat them.","Trump Boasts That His Impeachment Will Get Higher TV Ratings Than All Other Impeachments","Take a knee and pray","The GOP way","See above for answer","Be a friend","TRUMP COLORED THE AMERICAN FLAG WRONG","President: GUILTY!","So Much Winning!","More witches than you can shake a broomstick at","Saying extreme bias makes the FBI sound guilty","This right here...","Guess who Great Value is...","Frightening","Eh two, barron?","Video of Trump Jr after he heard about Weisselberg’s immunity deal","The Face of Guilt.","John McCain : Vietnam War hero.... Donald Trump: Not so much","Did trump mess up on the American Flag, or did he mess up on the Russian one? 🤔","Only a small genocide","President Donald Trump doesn't know how to draw the American Flag.","Wha?","Trump trying to figure out who the biggest threat to the US is.","RIP in peace","Tfw there was collusion","Only the best people!","Ben Shapiro Reks","RIP","The Leftist's New Groove","Fox-aid","Found this gem closing up last night.","Shake it Off: Obama Version","Flip flop","Matryoshka doll","What if he actually was as bad as some people claim","It's only for a generation or two, if that's any comfort...","Kind of weird when you read your elementary kid’s school policy on cyber bullying, strongly condemning it, and in the front office is a picture of President Trump🧐","I can honestly see him saying this.","Only Trump can! lol","Trump uses projection so often I'm beginning to think he was born in Kenya","Hey Q conspiracy theorists, see if you can decode this message","That Melania Trump has a stunt double is my new favourite conspiracy theory. The first picture is her walking beside her husband onto Air Force one. The seconds is of her walking off AF1.","Cartoon #2","Hmmmnnn","It would probably cost less than his trips to maralago.","My friend's new bumper sticker","Trump boys frantically burning stacks of printed out emails to eliminate paper trail.","Manufacturing Consent by Noam Chomsky","No one wants a leaky Pecker","r/funny didn’t like this very much, so i’m curious how you feel about it","When you're the President and you have to cheat off children to color the American flag correctly.","Was he trying to color the US or the Russian flag? 🤔","Welcome Mat","Small things are hard to find again","\"I drew the duck blue because I've never seen a blue duck before, and to be honest with you, I wanted to see a blue duck.\" Congratulations Mr. President, you've passed the first grade.","Pretty accurate.....","Another one of these","Time magazine covers from 2017, early 2018, and this week.","John O Brennan","Dreams","Somehow more embarrassing.","We may have disagreed with his opinions and actions, but he was a great person worthy of respect.","spitting them out as fast as his handlers can move.","Trump's statement on McCain's passing","What does it taste like?","How many of you out there feel this way?","Gotta love double standards","Psst... Hey Kid... We have Treason down here...","Donald goes for a swim","Libertarian Just Gonna Kick Back And Enjoy Watching Faith In Government Institutions Crumble","If We Had Republicans Back In 1776","Twitter Trump after John Brennan bitch slapped Dotard.","Drawing the Russian flag with Donald Trump","this guy's t-shirt, lol","Am I doing this right?","Checking for a friend","Anyone happen to have seen my WELL BEHAVED AFRICAN AMERICAN? He was just over there. Oh hello my African American! He then continues to talk like he's not in the audience. Podium banner at 53 degrees, and yes it falls off later.","This seems too close to reality","Helmets everyone","Bill Maher: GOP Strategy for winning is akin to a merger with Russia. He has a solution.","We’ve survived a Greecing and a Madoff, President Donny, we cool.","We can go to the park, after dark, and smoke that tumble weed.","Hmmmm...","The rats always leave a sinking ship first.","How Trump felt last week","It's not what you do, it's how you do it","Laws and Sausages - a webcomic explaining US government","The current state of the victimized alt-right","Pushing the limits of social media","Dey Turk Er Jurbs, Durkur Duur!","B L E S S E D. F R U I T.","\"Putin's gonna love this!\"","Flippers Get Slippers","*Slaps Trump Organization*","An Arresting Development","Michelle has class, the other one not so much","TIME Magazine Cover Series, Feb. 2017 to Now","Keep those wild comments coming. This show is just getting started.","The president everybody","Rep your favorite 2020 candidate in appropriate seasonal styles!","Trump Guided Missile.","DJT Presidential Library","The humor is in how desperate this sounds.","Toni losing it these days...","HMMMMM","Trump be like...","I went to France last year and took this photo, who wore it best?","It's almost 2019. Let's end this crap.","Holy Crap","TIL about the Real Denald Trump on twitter!","GOP Gasps As Red-Eyed Shadow Counsel Smashes Out Of Gestation Tank","Probably...","Truer Words","Don Snow","I really hope not, but he seems to be able to do whatever he wants with no consequences","And just like that...nobody on the left cared that Keith Ellison beat up women","Wow","Special kind of Stupid","Donny Karma","People only mourn McCain because he lost against Obama and hated Trump. Completely forgetting the MSM smear campaign against him in 2008","New electronic voting booths in the south.","For 30, 40 Years I've Been Watching Flippers","This is a cursed image","Trump Nightmares","In 2001 Australian ex-footballer Mal Meninga attempted a career in politics. He lasted 28 seconds","Company Ink","Accurate","Trump's next media appearance: Maury Povich Show!","Well yeah","-","If we sleep on corduroy pillows, we can...","Like a Howler Monkey","\"WHITE HOUSE PRESS BRIEFING\" — A Bad Lip Reading","Mecha-Hillary","you know its true based on last night","When you hear that the National Enquirer has a LITERAL SAFE containing damaging stories about Trump","Lizard peoples' greatest trick","Got voter's remorse? Try this easy trick!","Silly Nancy","New conspiracy theory?","What are they?","Stranger things have happened.....nah...","Truest thing I’ve seen all day","That awkward moment when you're a hypocrit. http://www.chicagotribune.com/news/nationworld/84026237-157.html","This Trump illustration from a Norwegian newspaper","One of the better republicans in my opinion.","Oh yes, the booming economy and low unemployment is all due to the god emperor.","I do love jazz","And they will be built with all the bricks he is currently shitting","Jeff Sessions def didn't sign up for any of this bullshit.","Pull over Mr. President!","Ted Cruz is a despicable \"human\" being, but...","Someone finally got through to Trump!!","He has a very good brain, one of the best brains.","LEGAL murder","It's a pretty difficult decision in fairness","This Really Made Me Laugh.","The gang's all here... eventually.","Silent GOP... Missing Backbone","Comey &amp; Mueller vs Trumpa Troopa","Parasite in office sucking America dry.","all except for one person...","\"Senator, the GOP is investigating the GOP and finding GOP conspirators committing felonies. Who's behind all this?\"","MRW Republicans claim both parties ignore misconduct when it's \"their guy\"","In anticipation of Trump commenting on Senator McCain ending cancer treatment.","Dem foosball players are disrespectin' muh flag and troops!","If I can make it there/I'm gonna make it anywhere/It's up to you/New York, New York, New York","Rip McCain, he was too young","Sure have caught a lot of witches","Why is Stormy always on top?","They really are trying to Al Capone Trump and his capos.","Spotted on a DC freeway","My first attempt at a cartoon","Kim play us a tune","Keep Squeezing, Bobby 3 Sticks!","Hard truth","I think we should all appreciate the sirens in the background of this interview. And yes, Mr. President, they’re getting closer...","Trump impeachment incoming","This is the worst week of my life.","That poor kid...","\"But muh Deep State\"","Crime rate among undocumented immigrants","It's Cohen down for real","Grab ‘em by the pecker.","No one could have imagined that he would be so inept.","You’ve Got Buttery Males.","Polishing the brass on the Trumptanic","Updated Time cover","It seems like everybody's getting immunity this week","In new soviet america...","I'm friends with the President, I'm friends with the Pope, We're all making a fortune selling Daddy's dope","Can they?","Rudy logic in response to this whole week","Politicians be like","Animal Crackers.","Only witch-hunt Obama ever had to worry about.","I think we can all see this coming.","Locks for Goldie.","Trump finding out he won the election","My attempt of a meme. Some perspective for these fools.","Jumping a sinking ship","If only someone saw this coming....",".... but still no collusion... (yet)","Politicians should wear uniforms like race car drivers so we could identify their sponsors.","Follow the Leader","But we should try “pure” capitalism!","Need some clarification from Betsy.","The “Great Negotiator” grossly overpaid though...","Donald Trump is interviewed by Fox News regarding impeachment","Trump as an insurance Broker","Time's Up","Thomas Paine, 1791","Ali G (Sacha Baron Cohen) to Trump","He needs to wrap up the Pecker investigation","Too soon, Geoff.","r/Politics this week.","MVP Pass Rusher","Free Legal Advice","Just In! Studies Show 99% of Trump Voters Enjoy Watching Train Wrecks | The Tilted Glass","Donnie and the Terrible, Horrible, No Good Week","If only..","The nothing burger","Public Trust","Sad but true","A recreation of the moment Cohen turned on Trump.","Falling like...","“Deplora in a Fedora”","Bye Paul.","Get your popcorn ready...","Orange is the New Black","Duncan Hunter is blaming his indictment on his wife, saying \"whatever\" his wife did will be reviewed, but \"I didn't do it\"","Criminals","Trump supporters","Totally A Witch Hunt - No One Guilty of Anything!","This meme almost erases the ridiculousness of Australian politics this week.","Political Hacks and Henchmen","The FBI in the past week...","Great, now I can never unsee this...","White House staffer after the daily toilet tweet storm","Vaccines.","Hurt me","All that's left for Trump to do is steal the Heart of Gold from The Hitchhiker's series.","\"I give myself A+.\"","The current state of Reddit","What is it good for???","Yuck!","Alec Baldwin would be calling within 30 days.","In light of Trump's comments on Cohen's plea deal - look at our president, bridging that cultural divide!","Seen outside a taco shop downtown. Preach!","You got me!","It's treason, then","Robert Mueller right now","GOP Leaders Demand Congressman Duncan Hunter’s Resignation After Discovering He Poor","MRW I look into the future and I'm impressed with my successor.","Trump Gets “Sorry You Died” Letter To John McCain Out of The Way Before Busy Golf Weekend","Don't do drugs","Missing Persons Report","This should work. (OC)","Irony is funny. So sad I had to laugh.","Well maybe not Tiffany and Baron","Sessions Argues Justice Department Will Not Be Swayed By Political Considerations Outside Private Prison Lobbyists, Wall Street Donors, Anti-LGBT Christian Activists","Donald Decided Not To Place His Hand On A Traditional Bible For His Swearing In Ceremony"]