["Frequent reposts that you shouldn't submit","Sidebar Update: Please read and follow the rules.","SUE THE DENTIST","y i k e s","She is unmarried and living with her baby daddy but how dare Disney set a bad example!","She posted a picture of her boyfriend reading Harry Potter to her kids. Jesus is the answer!","Woman Has Gay Panic After Watching a Video of a Lesbian Comedian","Black, female physician talks about her experience with prenatal healthcare discrimination. Random guy implies that she sleeps around and is on welfare.","Guy thinks Mexicans born in the United States are illegal, and is glad to see their families separated","It sure is an interesting thought","Does Trump Know - Science-Based Group? Yeah, right...","Ah yes, another pro-vax vs anti-vax conflict","My aunt is a bit misinformed","Did You Know?","The library she is talking about let's people with those trucks with loud speakers preach Christianity in their parking lot, screaming about us all beong sinners and needing to come to the lord. Their story time is usually religious story books, basically children's bible stories.","not Facebook, but JESUS!","Here’s an old one my own father shared last year.","Breath in the Vaccines","Woman murders friend and lies about it on Facebook","Your dead son vaped?! Better not procreate anymore","Umm, what?","COMMENT OBAMA","Measles isn't that bad guys. Geez!","The world is so strange these days","He also tells his followers that space is water","If you’re not anti-gay, you’re just as bad as a mass shooter, according to this Twitter psycho","This lady is basically saying a 9 year old shouldn’t have said he was gay, and it’s his fault for being bullied. Come on. A kid KILLED themselves, show some empathy","Hmm...","No... I’m not going to think about something so stupid and obviously a lie.","“Which conspiracy theories do you believe?” “All of them”","Abortion is Murder. She also doesn't understand math.","[NSFW] Black Salve is making a comeback, because who doesn’t love a good early 20th century treatment now and again?","I don’t know about you but I’m not sure I see any benefit from “urine sediment”.","It was a video on a farmer discovering a geyser. God must have instructed him to find the geyser and cure cancer once and for all.","Friend of a friend reveals the truth about Chinese double agent John McCain and the late Hillary Clinton","Cuz that’s the same thing","Apparently he doesn’t like shooting victims.","Because people are turning away from god, they’re not having children","Good advice to land yourself in prison","One of my friends posted about being anti vax, so I called her out on it and just.... wow.","That escalated quickly. Just trying to sell a fish tank.","Redditor slowly kills his niece.","Porn is what turns young cildren gay, and its all a big conspiracy. Obviously.","Does anyone else see what I see…???","Cannot figure out what most of this means. Any help? He's also insane irl and talks like this all the time. It's not a 'bit'.","Next we'll have to eat with our bare hands!","I’m not sure what the message is but I think its “Nazis were evil because they were gay”","Weight-loss advice on a clip from My 600lb Life","InsanePeopleYoutube","Saw this exchange in a group. Not only tells him to rape his kids but is driving during the argument.","Oof","The President of this sub is at it again!","Guy goes off on a long one saying we shouldn't feel guilty about selling weapons to Saudi Arabia because they bomb Yemeni children, and that it's necessary.","Found this interesting comment today...","Insensitive meme about McCain's death + \"...the only way to remove ourselves from Hell's grasp\"","This is coming from a guy who is not only homophobic, but also racist and would support a genocide of his ex-wife’s family...","Zombie movies are capitalist propaganda trying to enslave dumb consumers","Unschoolers are so goddamn dumb","My biological dad posted this statement to argue about why McCain was not a hero. I say “biological dad “because he left my mom and me when I was 18 months old then fathered an illegitimate child who he also abandoned. He never paid a penny of child support.","Insane people reddit.","Friend believes cancer cell can run from garlic","Wtf PepsiCo","I can do whatever I want bc Jesus","Sell Puerto Rico","Guys, I found a goldmine of this stuff","Insane runner up: \"teachers don't need a raise because they aren't homeless!\"","anyone with hands is armed and dangerous","All Men are crazy, rapists, please beware.","squint","Snitching has been deactivated until further notice","[NSFW] The struggle is real, I guess?","I unfriended her before I could post my response (in comments), but not one hint of irony here...","thought some of you might get a kick out of this. just let it sink in.","A representation of what fills my newsfeed every day.","I deleted a guy who I have a long and complicated history with from Facebook four years ago, and he’s just now noticed. When he asked me why, I told him because we haven’t been friends in a long time. This is how he responded.","Porn, Sex EDU for Kids, Bestiality, and Porn can only be done on drugs, on pain killers.","A glimpse into my family's beliefs","New Zealanders vs. 1080","Hogg family wars","Country Singers","Horizon at eye level.... you're f'ing with me right? It's not possible to see a horizon!","He was referring to himself in the third person... His whole page is a goldmine of things like this.","His wife is getting a PhD in nuclear engineering.","Didn’t realize that white supremacists and misogynists are Democrats.","Very normal things happening over on Facebook","The reason is: you're an idiot. Don't drink and drive!","I was told I would be granted full immunity.","(conspiracy) my ass!","Recently divorced family friend. All she ever post about these days.","Matrix Malfunction: A Reliable Source for Nutty Comments","Everyone look at me! Oh wait, I don't feel like sharing.","Apparently McCain was trading political favors two years ago in order to have a nicer funeral now","Delusional Grans comment left on a post about a young girl with terminal cancer.","If you can't drive a semi","Her 4 year old grand child is in critical condition after an accident because he was sitting unbuckled with no car seat in the FRONT SEAT of the car and her defense is that everyone’s done it at some point? Nah, lady...","Medical Marijuana = ???","Space travel is a hoax, and I am as dumb as soup.","Not only INSANE but posting False Information about GOOD Businesses.","She's Going to Fight the Law!","Walking in on Your Kids","OP was asking how someone can fall in love with a girl that lost her virginity out of marriage","This 9 year old kid killed himself after being bullied for being gay. This guy thought this was appropriate.","On an article about a serial date “dine &amp; dasher”","Not a Person, a whole “official” fake “science” Page that is anti-climate change, and it’s immigrant post!","Big Dick Nick’s Thoughts On Body Hair","Take that libtards","\"Scientists don't know what they're talking about because they're in their labs all day, they need experience with some REAL jobs\"","Calm down with the thesaurus man.","Big If True","Nurse posts on the Facebook group “Proud Parents of Unvaccinated Children - Texas\". Claimed vaccines were the cause of a boys measles and also wrote: “By no means have I changed my vax stance, and I never will. But I just wanted to share my experience and how much worse it was than I expected,\".","Man seeks employment...","Religious nut with a textbook case of schizophrenia","Obama = Satan","Facebook is not safe.","Yeah just take resident evil 4 as an example!","Can we get a beat on this ASAP?","Man compares working for the state government to being a slave.","A feminist who hates women.","Funny as fk","Chems are causing my allergies.","Okay, buddy let’s just caaaaalllmmm down","I think someone should make a movie about moths now...","Don't let the dark spirits in the pathway to your temple! This is more odd because it was written by a guy","A man threatened to kill himself during WWE RAW last night. This was a TMZ comment. (Once again, not Facebook but thought it for here.)","This guy managed to make Trump's snub of John McCain Obama's fault","Tators???In the tailpipe","You’re just jealous of the beautiful White queens, the fairest of them all","I can't decipher what he is trying to say","Climate change is the way for the world elites to force everyone to come together in the name of doing what they’re told. This goes on for another two full screen shots.","Born in the wrong skin(color)","\"To finish my tattoos, my mom has to die...\"","These are facts.","I am sick and have a weak immune system due to immunosuppressive drugs. I told my sister in law that I can’t watch my niece anymore because she is not vaccinated. These are the messages she sent to my mom in response.","I Keep Hoping Flat Earth is a Hoax, Because These People Are Just So !#@$# Ignorant.","Apparently going broke is the best way to lose weight...","I see SEX!","Concerning the Jacksonville, Florida Shooting.","Dude loves his marijuana quite a bit","I love when people don't understand what kind of group they just joined","The Polio Vaccine Caused Polio","Wow.","One of Many Eye Gouging Posts From This Fucking Guy #yup","those goddamn iguanas keeping us prisoner","Confirmation Bias","Kid's being a crybaby.","Just another day on Facebook","Southside banging","Sun &amp; Moon 50 to 100 miles away from earth, same size about 30 to 32 miles in diameter.","If a baby dies of a preventable disease they deserve it!","The Madden tournament shooting is because of participation trophies","No one ever suspects the illegal American Immigrants...","Video games are more important than human lives","Well this reddit chat is going well..","Trump supporter posts ABC news story, declares \"You would never see this on the news\"","Wait, what?","Oh, Lord....",".....and breathe","Best McCain Tribute","Whatta'bout Obama?!?!? (repost with personal info removed)","NICU nurse witnesses baby with measles. Still anti-vaxx and thought about collecting baby spit to expose her own kid to measles","Romance isn't dead...yet","Is there a support group for insane mothers?","Aliens = Demons","The mother in laws in town...","Brought to you by local Trump supporter...","On a local news story on bullying...","What is Google? What is life? Who am I?","Getting rich WITHOUT human sacrifice?!? Sounds like a scam to me.","Flat Earth rap, anyone?","What in God's green earth is this person on about?","I feel like drugs must be involved here","WAKE UP ENGLISCH PEOPLE","Toxic boxes.","TIL puppies can be sexist and promote rape culture","Flu shots now cause autism","Doctor wanted to save my kid’s life. Where can I find a new doctor?","White guy claiming reverse racism in response to trailer for “Megan is Missing”","My HS nemesis' mom has lost her marbles.","This guy is certain that Mark Zuckerberg has people constantly screwing with his account.","Loco, eh?","Anti vaxxer wins bigly (long post)","The strangest end to an argument I've experienced yet","This was an ad on my hometown’s Facebook group. There’s no relevant information about her skills or services, just rambling paragraphs detailing how she’s failed at everything so far in life.","....I don’t even know where to start","She has photoshopped her right thigh so badly that the door is warped and her hand is flat. And I still can't figure out what she did to her waist, but \"your just as beautiful on the outside, as much as your beautiful on the inside\".","The man who posted this was once convicted of stealing a barn. Now he defines a hero...","Does NextDoor count? These were all posted as urgent alerts in rapid succession.","Do you want a DNA test? Don't worry I don't actually need your DNA.","Scumbag from my FB","Meanwhile at my facebook (X post from Forwardsfromgrandma)","I saw I had a random PM which didn't make any sense...until I looked at their profile. There must be hundreds of these in just the past 2 days..","I'm wondering what kind of \"physician\" this was","Is this something they do...?","“All other mass shooters” smh","Brain Synchronization Cap","Red guy's Facebook profile says he's the \"Harbinger of Insanity\". I guess here's Exhibit A!","In Wake of Today’s Shooting My Cousin’s Dad Had This To Say","Found this on an article on Mollie Tibbetts’ father delivering a eulogy","So crazy her phone has access to Facebook but not Blackboard","It just keeps getting worse and worse.","Today’s statistics brought to you by InfoWars!","Having anxiety about social situations is a sin","The HOTTEST take about Caitlyn Jenner","Russian troll account or ignorant American?","son? can you masturbate?","Free this murder!","Comments on a post about the first same-sex marriage to take place in my town. Congrats to the happy couple.","We've found a cure!","Found one in the wild.","You know what's worse than measles? ALLERGIES.","Saw this, this morning, and thought it belonged here.","This guy got banned from our local pokemon go group for being a creep and an asshole","Guy believes that it's EA's fault today's shooting happened because their game sucks...","*Insert standard counter here*","could also fit in r/niceguys ??? what on earth...","Just your usual Fox News contributor","Help. I need to know","Relationship goals?","I think someone beat him to it (he is very serious)","Can you tell my cousins relationship didn’t end too well?","Comment posted to debunk chemtrails pusher leads to two threads where said pusher refuses to show evidence","Found this on a post about Stefán Karl Steffánsson. Absolutely disgusting mindset.","People who don’t speak English are “Leaches on our beloved America.” STUPIDER THAN ROCKS! LA COCACCA!","Bad Math &amp; Other Stupid Reasons The Moon Landing Never Could Happen - Never Been To Space, No ISS","Celebrating someone’s death, in the name of “peace”","I'm pretty sure people don't shed","\"And then the two Chads started crying and making out, but not like gay making out, like two straight dudes awkwardly kissing not because they were into it but because they were so thoroughly destroyed they didn't know what else to do.\"","Because his game is more important than human lives.","Everyone! Stop having orgasms! The government is using them to control you!","Littarly murder","“defective children”","#Staywoke","Yeah do your research.","On a couple of replies down on a thread about a shooting at a Madden esports tournament","melanin strong organs are TWICE AS MUCH ON THE BLACK MARKET (why else do you think so many ppl go missing?)","What the....","Problems with chemtrails, girls? Your vagina has the cure!","I'll have a dark roast","A FB acquaintance railed against John McCain and his racism. Then used Harry Potter to bolster her argument.","Plays God Of War Once","Crazy Woman comparing abortion to holocaust","He has a point!","John McCain. Father. Husband. Senator. War hero. Ghost?","This guy posts his own rants on top of his own poorly assembled pictures every single day. He even quotes himself sometimes.","Taking god out School caused the shooting in Florida.","My aunt likes to send me Bible quotes and conspiracy theories","You need a exercist","These people and their disclaimers","Q-People on McCain - Not Dead is in Hiding or Silenced by the Government to hide is crimes, Child Sex Trafficking.","Insane people Twitter.","Anti-vaxxer doesn't understand why no one respects her rights.","In the thread of the Madden tournament Shooter","Yeah, be reasonable.","Geez","Can somebody translate? Is he mad over being the side piece or?","Just like the Muslims","The anthem protests are a globalist conspiracy!","Same guy who bragged about throwing bottles full of piss at children while overseas","The comments make it worse","X-Mas cookies","This fits here nicely","Said in response to a shooting at a gaming bar in Jacksonville, Florida","\"Would smash\"","\"Trans people are in our sports!! Don't you care?\" \"No?\"","Vaccines cause the brain to swell","Competitive Madden is full of white supremacists, apparently.","\"What solution is there?\"","Stage IV metastatic cancer. Has 2 young children. Refusing all traditional medical treatment. Insists God will provide a miracle and heal them 100%.","Stay woke, sheeple.","Maybe it's just starting to go? ¯\\_(ツ)_/¯","This woman is always posting hate towards Muslims and how they are invading our country. It drives me nuts.","Oh, your baby died? God just needed snuggles.","In response to John McCain's death","Top comment on Fox News' post about John McCain's death","A comment on a post about a woman complaining about her bum being grabbed in a club. His issue seems to be that she went out, not sexual assault.","Don’t count your eggs after you were vaccinated, cause they disappeared...","Wake up sheeple","Nextdoor is a gold mine","Blocked. Now I have two less assholes to deal with.","Lack of success is based on me not replying to his message...two years ago...","When prayers ain’t working","Should I let my child play Fortnite?","Islamophobic redditer is not good at insults","A mirror tried to take her soul","Guns don't kill people, video games do!","Hold onto your butts, your brain is about to short circuit","Yep, John McCain's legacy is forever tarnished because he criticized Trump a few times","Logged into Facebook for the first time in months, this is why I don't Facebook anymore.","Tacoma WA Police Implicated in a Freemason Sex Trafficking Ring (Nope)","How to inappropriately teach kids about sex ed: Step 1 - LGBT, Step 2 - PEDOPHILES! let's photoshop some shit onto a sign a kid's holding for bonus likes.","Found one in the wild this morning. These are just a few nuggets of gold I dragged out of the mine.","What ❓in the world 🌎","where do I even begin","Comic Book artist and wife mocking those in Hawaii who were and were to be affected by Hurricane Lane. Hundreds have lost their homes, are recovering from major damage to flooding on Big Island and Maui.","Insane rambling on a random reddit post.","First submission from this gold mine friend of mine.. everything is 100% non ironic","Then why’d you ask?","Remember this, shills","This is why emojis should have an age limit...","Um... Holy shit, dude.","Anytime there's a mass shooting there's always people like this...","Posted unironically","I'm sure the FBI will get right on it","Australian nazi misunderstands what gender equality means and says Jews are behind feminism.","She constantly links any story she possibly can to her hated of vaccines.","Not even 24 hours and we already have people like this.","I knew that there are crazy people on Reddit but this is just delusional. (1/2)","I will pay you $4k-12k a month but I currently have $0.","Make your own skanky vadge juice spray to eliminate damage from chemtrails","I made a comment on blackpeopletwitter asking what a Durag is and a few minutes later this guy pm'd me. You can guess what the white word is","3D Films","What did Lincoln do?","She's a millennial herself.","Dreadlocks aren't real because stores... or something.","Anti-vaxxer wants to shoot someone that disagrees with him","Breastmilk: The New Snake Oil","Male ego back at it again with the mass shootings","Well that's some messed up logic","Who would’ve thought a tetanus vaccine would turn into 9/11?","Forgot to post this last year. Immediately unfriended.","How is it possible to be this delusional","I'm really not sure what the point was..","Definitely vaccines, not because of the epilepsy at all","Right, fuck men","Alex Jones called, he wants his Ideas back.","Milo meltdown","I have no words","Antivaccer on russian vaccine misinformation campaign","Oh Utah...","Touched*","Redditor intentionally dumps hot coffee on someone because their leg jabbed into them on a train, justifies it with \"it wasn't hot enough to scar, just to burn\" (182 upvotes at time of screenshot, too, what the fuck)","Welcome to the South.","Right to the point","God, with the help of angels, will smite all white people.","Shameful awful people exist on every end of the spectrum","You have cancer? omg die!!","Never met an AI? Wakey wakey.","I’m a McDonald’s now.","On a post about Polio","Resident gets scared by two young men late at night looking for an iPhone. Community responds with thoughts and prayers and advice... and summons the mayor, and police are investigating.","Well now I crave cupcakes..","Made a post on Reddit that got kind of popular (20k up votes) about how I fixed my car's A/C all by myself. Psycho sends me this private msg: (Reposting bc I forgot to hide his username.)","Does this person know anything about health?","Wedding gifts of 1.5k, OC from Wedding Shaming FB group","My family, sometimes I just don’t know anymore.","These idiots on my feed","Instantly claims that vaccines being extensively tested is false. Proceeds to have to ask for evidence that this is the case. Anti vaxxers are a goldmine for this page.","I wonder what she did wrong??","Pokemon cards are the devil, mama said","Someone's finally asking what we've all been thinking","Facebook friend’s boyfriend sends her this outdated crap from the 50’s. Rather than being annoyed, she fully embraces it and decided to quit her job on the spot to be that “50’s woman.”","very descriptive fetish","Yes you should stop being an idiot","Speechless.","If only there was some way to do that","The day she left her boyfriend at home...","No I really don't understand how you that dumb","The NFL and Government are trying to get rid of men","This guy is white","This person needs to chill","Can't afford wedding, better blame everyone else.","Guy angry that the Eden project isn't disability friendly as its too warm...","Ever take a piss so hot you were cortirizing wounds with it?","Two idiots for the price of one!","Want to be cured of HIV? This \"medical doctor\" knows one simple trick!","Maybe it's because he's 9","Posting an inflammatory statement for retweets","Chemtrails apparently have a toxin called \"vaccines\" in them.","“You’re out of your mind Susan”","I never felt bad for those who suicide","Them Cajuns know more than the entire government!","Personally, I welcome implanted RFID technology... Crazy step-aunt is at it again. I can't unfriend her, the crazy is too good.","WOW! THIS IS AWESOME! I HAD NO IDEA!!","This guy used to seem fairly normal and decent but most of his posts are like this now...the USA’s “muslim dictator”","On a video about a middle aged married pedophile running away with a young teenager without a father, half the comments were claiming she \"seduced him\"","Absolute cracker from my aunt on Facebook.","Atheists: You’re not doing it right.","Colonial settlers did nothing wrong, refugees are freeloaders who don't want to fight in war, and if you've gone to university you're brainwashed and therefore wrong (original post = 31k shares)","[r/VaxxHappened] Arson is a legitimate response to vaccination.","If you resemble a male, kil yourself","Horrible people torturing their pets with Black Salve","Only Americans have rights, obviously.","Please don't try to starve the gay out of kids.","Creeper looking for a \"roommat\"","Dude is fed up with these “memes”","Breitbart's top comments on John McCain stopping his cancer treatment","Vaccines can turn your kid into magneto","Welcome to Trumpistan, where white people are being subjugated apparently.","Anti-vax begger on a transplant list","Convo with an apparent dog breed racist.","Her friend was almost attacked by a dog and now she claims to hate all animals and threatens to kill any animal that shows agression","I hope these people are simply trolls.","Posted below a video about an Iraqi child that was killed by a suicide bomber: \"But if there's no war, all those soldiers would lose their jobs!\" Military-industrial complex at its finest.","This woman's UTI turned into a full blown kidney infection when she refused to get antibiotics... the comments are just as insane.","Just moved into a new neighborhood, and I think the community Facebook group is gonna be a lot of fun.","If you think Facebook is bad, I raise you my anti vaxxer neighbor on Twitter.","I wonder why we don’t see chicken pox much anymore... 🤔","Every single post relating to vaccines or science in general.","Published in our local newspaper today.","On a post about how 2 billion people don’t have reliable access to water","Antichrist the devil with the sasuseno fruit","I wonder if I can ruin my testicles with papaya seeds","So vaccines made a kid magnetic and drew a drunk driver to the kid?","Every Day This FBer Takes A News Article and Calls Them A Pedophile and Her Fans Believe Her!","Mollie Tibbetts Was An Inside Job","This man writes incoherent rants to our local newspaper every week. He also passes out copies in person.","“Arrest men for sexual harassment… no not him!”","[God Emporer Trump liked that]","'Chopped onions inside your sox' is a clinically proven way to not catch the flu","She wants to be a nurse....","Alexa is a spy!","How considerate of him","We've all already been implanted with self-replicating nanotechnology so \"they\" can read our minds.","When adults won’t listen to you so you sneak information to their four month old child in the stroller....","Wow, it all makes sense now!","[NEXTDOOR]How to tell you have some uppity neighbors. (additional comment screengrab in comments)","Antivaxxer exploiting teen's epilepsy","“Woke” woman trying to tell people about Monsters Inc. conspiracy","Transgender = one big BDSM group the public is being fooled into believing is legit","God gave us copious amounts of natural ways to protect ourselves except when we need a heavy metal detox.","Everything has to be political nowadays","And this crazy one reposted a chem trail article AGAIN. “Beware America (apparently especially the Ohio Valley)!”","The Globalists are coming for you!","CHOICES","Gamer friend if mine is just a litttttle delusional","Found this in the Facebook group for a podcast about the paranormal","Fitness Pro disapproves of the “Merlot Curl”","Age of consent is Nazi mindset","This is the best I've seen so far, clearly the oils DON'T make you hAPPIER.","On the topic of Hurricane Lane and Hawaii... 🤔","BUT I NEED a neurologist THAT IS NOT GOING TO BLOCK MY HEALTH","It's a sacrilege for anyone to die of cancer","Grape juice?","Mother angered over 8 week old baby not being admitted into an R-rated film","Slavery was not all bad!","Guy comments on video of men being shot up in gas station reminds me of Cotton Hill killing fitty men and using fattys limbs to kill.","Your standard Flat Earth moroon","A girl was just found murdered in Oregon, there is no information whatsoever, and here are people's comments.","Well, I honestly did not see that one coming....","\"Serious woman only\"","Rabies Shots = Vaccines. Rabies isn't real. Those animals were just hungry.","Spoiler alert: he wasn’t actually nominated","All Chinese people are sociopaths","Government Money Maker, like Cancer!","That was unexpected","What level of woke is this?","A solid clapback spotted amongst homegrown FE cringe on my Fb","Checked up on someone I knew in middle school - got met with full on holocaust denial","I live in the PNW. We’ve had a lot of smoke from wildfires lately. Luckily, someone has an idea!","In response to missing person. Every....single...post...of...hers...is...like...this...","This is my uncle everyone","Ravings of a lunatic","Yer the Chosen One, Donny","Somebody please translate, I’m going blind","We're all tired of waiting for these things to happen to you too","Lord of the Flies","Woman thinks a child still in amniotic sac is a goat/human hybrid.... Proceeds to wish I was aborted when called out.","Got to cleanse the gene pool","Unhindered birth is not painful.","On a video about creepy photos","Just a casual discussion on youth activism that takes all sorts of wild turns.","So..my brother unfriended my dad for calling Trump an asshole 1 too many times. He's officially lost it!","Insanity that I can understand.","Wait, is she threatening to sic her god on a woman for telling her off?","Not being a pedophile means you're a Nazi (reposting because I forgot to censor this insane person)","That's not how evolution works...","I found this on Sabaton’s Carolus Rex","This Guy Won the Gold in Mental Gymnastics","His nowhere near having a relationship but he's already excited to have kids. Also it's followed by a flat earth post.","Is this what it looks like when someone starts to lose their mind?","Post about the search for a hiker missing over 3 weeks is littered with comments like this","Came across this is a TTC group. Religion vs. spirituality I suppose.","3rd world countries have better healthcare, that’s why they die so young from disease that don’t even exist in developed countries anymore","My uncle-in-law is nuts.","In a post about Big Pharma.","Let's Take A Foot Fetish &amp; Call The Person A Pedophile Because I'm Insane!","It's OK if you shoot someone, you still have my vote","Liking something out of personal preference = contribution to society.","ah yes, because making fun of rape and being an awful person is something to be proud of.","as a MOTHER!!!!","Some how news about the cure for cancer turns into a antivaxxers ramble.","It's a mystery! Can anyone explain why she smells of urine?","I present an important message from my Aunt on Facebook messenger. Enjoy.","I accidentally came across a goldmine.","Racist celebrating a mother killing her kids because the children are black. “3 down, 4 to go.”","Insane Person Says, Bring Back Concentration Camps","Introducing the BrainPod","Health f****** yeah I would marry Trump","It's a tragedy","Sovereign citizen/freeman of the land has gone off the deep end","#SUCKMYBEAUTIFULWHITEASS","Apparently Islam is not allowed in Japan. Where was I when that happened?","Hugh Hefner = Pedo, &amp; Playboy Models are Surgically Created Transgendered Men Pretending to be Female.","Well","Cause momma ain’t raised no fool","I stumbled upon this guy's Twitter and oh boy, this is some of the juciest, craziest stuff I've ever had the pleasure of reading.","So now they are going for religious exemption to stop having vaccines...","On a post about an Asian wedding photo shoot being crashed by a cat. One of the many replies about the couple eating the cat for dinner.","The same cost.","Might as well be in all caps","Because science","You don't need to have fun or healthy. That's for sheeple.","Found this incredible piece on the official Led Zeppelin page.....","This is a real person I know. She’s arguing that stopping abortions will lead to doctors killing people for organs.","Someone I went to school with has joined a facebook group for people trying a 100% meat diet. I had a quick snoop and I'm pretty sure they're accidentally encouraging each other to kill themselves","Fuck circle K","This response to a flat earther is gold","Yea it was definitely that flu shot","GUy has a Public Freakout....Racist","Lots of cell phones and wallets","This guy on my Facebook page always says off the wall stuff like this.","Man arrested for having sex with animals, yet Bill Clinton is a free man.","My little Pony = Demonic children’s show. A friend posted how evil MLP is. The discussion went on, and became more strange...","\"Try to stay caught up.\"","Posted by a HIV/AIDS resource center - Let's just enable self-harmers, that will surely end well.","Kate is about to cry herself to sleep because a highlighted issue doesn’t involve her","When you can shoot.","When I called him out on the nonsense term that is “soyboy”","Better call 911 over a 5 cent bag.","What do political views have to do with shooting your refrigerator??","You'll notice some repeating themes","A girl in one of my dog groups... Baby is Disposable but a Dog is For Life!","Okay, here's the rest.","Kill them all!","Put your phone down, but before you do, share my post","On a post about a local petty criminal, two people found love","The Mac &amp; Cheese is Turning the Men Girly!","I have a hunch she wasn’t the only one with horrible vibes.","A new brunch restaurant is opening up...","We hit critical mass in the South, yesterday.. this one was my personal favorite.","This guy is a goldmine","Using Facebook to fight your demons","In preparation for Hurricane Lane, I present the stupidest tweet to grace my feed!","Leninist Twitter sure is a wild place.","Looks like this guy hasn’t been paying much attention to the news lately","Good and Evil. Research it.","If you can’t figure out sex on your own you don’t need to be taught.........","Sounds a bit aggressive","The greatest movement since Christ and #bitcoin","In response to the Dele Alli challenge","My brilliant sister. She just turned 25.","Kid can’t even form words but has the mental capacity to understand and support a President? Aight.","Satellites aren't real -Lucifer","Safe Self Harm... Alllllllrighty Then.","(I know how music works)","wow, NASA is so crazy.","Plenty more of messages like these on his facebook...","He claims people turn on him because he is a Satanist.","Why would she be mad?","How do I have sex with my sister?","Nazi girl misses her daddy [NSFL]","This Really Grinds My Gears! FE - Super-Stupidity!","They hacked his phone","Luciferian Pedos are Left Wing Jews - Stalin, Lenin, Trotsky = All Jews. Satan Wrote the Talmud.","This person went to college.","A comment on a video about Vector, a toy robot","Anoerxia isn’t a disease guys, you heard it here first.","I guess they chose the right page to post it to.","Literally out of nowhere comment on a post about satan","Meth and costumes","It’s too loud","I’m an officer brat so fuck you","YouTube comments are a gold mine.","Buy and Sell groups are a gem (possible nsfw)","Review: Stop asking for tips, you exploitative elitist white bourgeois jet-setters - you don't even know how to make coffee the way Italians do.","The Food Network Page is a goldmine","Damn all those imagrents","Because everyone, even flight attendants, conspire against the Flat Earth theory","The Hidden Truth aka The Obvious Falsehood","You can kill people as long as you pay taxes!","Somebody is picky when it comes to used couches.","On a thread about the man who killed his pregnant wife and 2 daughters....","On a vid about a girl learning to do an Axel.","Oh, US, you abominable whore you!","Satelite weapons and hacked facebook accounts","rat care groups get a bit weird sometimes","Sure you committed terrible crimes against me, but would you officiate my wedding and christen my three children?","He knows where the bodies are buried and that means everyone, everywhere is corrupt, every time!","A murder suspect is Latino, so obviously liberals are trying to destroy America.","Democrats love bloodshed","Conan O'Brien is trying to ruin my life.","Go on?","Real life gangsta soccer mom","My town just recently made it illegal to smoke in parks. Someone’s not happy.","Really? yes, really.","Not sure if anti breastfeeding or pro-prostitution.","\"first of all, how dare you\"","Came across this not too long ago","Ever wanna go on a trip go to Fox News and go to any article and read the comments","Do I need to say anything more about this guy?","I don't think anyone has heard of that","Barbie isn’t respected enough! She’d never pick up dog shit!!!","Posted in a dog group, I cant make heads or tail of this.","Legitimately one of the scariest people I've ever encountered on Facebook. I feel like this guy is going to end up on the news for murder. Imgur link in comments for the continuation.","InsanePeopleReddit? Advocating the murder of innocent employees.","If only she had listened to her Doctor... (posted a day apart from each other)","Did he just threaten me with a blowjob?","Yea treat that 3.8yo’s fever with peppermint oil!","The girl I know posted this. Sorry what??","Adding women to Battlefield 5 = spitting in the face of soldiers","Jealousy goes lengths.","He was arrested for punching her toddler son in the face. And she was arrested for letting it happen.","Trump supporters losing their minds","Yes, because that's the same thing...","Voting is violence, democracy is tyranny.","Old chap toot toot","Jesus Christ.... sometime I forget I moved to the Bible Belt...","People really liked this but I forgot to censor a picture. My bad!","some people hate to be wrong","My Mom's aunt has been getting pretty paranoid lately...","The last days are upon us, we are eating our young. - Anti-vaxxer","Just got back from my nieces funeral and my girlfriend won’t give our unborn child my dead nieces full name","Yikes","It’s totally cool to just cruise in the left lane because I’m stopping you from speeding!","What to eat for free","The saddest part is that he posted this thinking it was actually true","The fires in Washington (and all over)","Nothing like using your own miscarriage/abortion to sell essential oils","This reaction to federal crimes.","Not to be racist...","Ah yes, autism in just one day","I'm pretty sure that's just an art instalation, not a science presentation","Not Facebook, but meh. Manic seeming rant on a post about a kid donating his hair.","Want some beautiful decor? How about baby head cacti!","Lady posted to the local Buy and Sell page. Argued with everybody about her own mistake and then proceeded to call them all idiots.","TV is a sin now","Measeles cases hit record high in Europe, meanwhile in Dumb and dumber live-action remake","So many questions...","Kodak clone confirmed","The reason all of my releationships never worked out is because i'm in love with a fictional character. TLDR in comments","On an Article About the Measle Outbreak in Europe","Justin Trudeau is secretly controlled by a group of self cannibalizing Nazi pedophiles.","Sounds like an equally fun time!","Possible troll, at least I hope so 🤞","I’m sorry what","on post about the difficulties after childbirth, lady thinks jesus makes you immune.","Talking about Parkland Survivors speaking out.","Not see the no dog sign?","Don’t even know where to start","Getting pepper sprayed now means you’re suddenly part of the largest mass brainwashing in history","He fights dangerous gangs between shifts. Just ask Trump.","Dear fucking God","Person who posted this is in veterinary school...","This guy is definitely not turning the other cheek","Nice guy doesn't want sister to date, because he believes in incest.","You are a mammal, aren't you?","Very public manic ramblings of a teen mom turned local burlesque dancer. Constant posts like this.","And that mystery guys name.... Albert Einstein","“What’s happened to our country?”","Time to get rid of your stainless steel pans, THEY ARE TOXIC!!!","Beware of toxic cookware!","Stumbled across this person with quite a blunt bio. Any takers?","Welp..","She got arrested for DUI and killing a biker. Quality lady, right there. (NSFW racial slurs)","Let the applications start flying in.","Because balaclavas are the first step towards terrorism!","You got to be starting something.","A wanted criminal was shot by police in my state and i found this in the comments.","Same guy routinely posts chemtrails conspiracy garbage","Where’s my money ?","Our True Skin Color is GREEN","This person is always sharing ignorant posts that aren't true on Facebook","Hmm","How can people believe this shit","Unstable Quora rantings - \"figure out their overall mental health it has to do with exposing their vital organs\"","Only the most compassionate users in the comment section of r/iamatotalpieceofshit","High school friend’s response to my post complaining about asshole drivers who rev their engines by my apartment at midnight","It was vaccines spreading measles all along!!","Short, Sweet, and Reported to the Police.","Moved to Russia because he hates the US and the US women so much","Nothing soothes the soul quite like a random, scented wet hand to the back of the neck when you least expect it.","Your food is made in labs you just don’t know it!","A response to Brent saying that Obama and Clinton were better presidents","Wash your feet much?","Pills make me gay","Found a doozy","I need decades of psychotherapy after finding this dudes page.","Calls Net Neutrality a bullshit issue, explains why online anonymity needs to be legislated against.","What do you mean by fact or truth?","Caption should read: Divisive sensationalist scheme using carefully procured search result images with concealed search terms","These people will try a natural remedy for anything...","God, the creator himself, speaks...","Actually, that's exactly what elections are for.","Two votes!","\"They always end up dead\"","Woman shares memories of the unbreakable bond she and her boyfriend shared until he passed away","#Jesusonlyplease","Kneeling at football games will literally dismantle the constitution. Because that can happen.","Guy Makes a Very Valid Argument","I thought this might be appropriate for here","Roseanne conspiracy theorists are my absolute favorite","\"Help further your soul along its evolutionary path!\"","No more Blumpkins! NSFW","She nearly died during surgery because of a pulmonary problem that surface once she was under anesthesia.","Prison overcrowding: solved","Over a joke article about a punk singer going back to school.","Leo has some advice for a band about to do a show in Germany","I’m not even certain what the purpose for these is, but I can tell you it’s probably not worth $10.","This children's book would be so much better if it was a bloodbath.","Potato Chips &amp; Emo Band = Proof of Flat Earth!","My friend from childhood has turned to the dark side","Attack the dude with cancer...?","I wish he was trolling...","If you don't want the measles...","Didn’t expect this from my husband’s aunt.","Why can't people just be normal?","Yah good luck with that","I'll just leave this here","Well then.","This was on a video about a suicide survivor receiving a face transplant. Legitimately disgusted by that fact that people like this exist.","This kind person commenting on a post saying an article is false and edited.","A kid from my old high school sent this to my sister","Insane person advocates for civil war and a “cleansing crusade” to kill off the left.","Manages to get all the major topics in one post.","Thyme tea &gt; science","She WILL Smoke Anywhere!","On homelessness.","Im part of the regional MMA scene and am friends with lots of random mma fans/fighters on FB. I haven't met this guy, but this was by far his weirdest post yet!","Casually learning about history, when I'm suddenly ntroduced to a new type of crazy.","So apparently Stephen Hawking died 50 years ago and was replaced?","Hollywood and Washington Are Filled With Pedo and Child Sex Traffickers Lead By the Clintons Out of a Pizzeria.","Yes because trusting only 1 news source is more credible. 🙄","Not pictured: the followup where Blue said her homeopath would help cure autism via Skype.","A proper apology","Madwoman believes Evolution Theory is false, and so, so much more. [Translated]","Anti vaxx roots with a touch of blaming Hillary, NWO, and lizard people","This was shamelessly shared by someone on my Facebook","Genital mutilation promoted by family members friends.","Meet his mother-uck-r","We have BIBLES (Basic Instructions Before Leaving Earth)","Got myself into an argument about donating blood, apparently it was only an argument because nobody can stop being horny","\"I guess it's a common thing in Somalia, but they live in a sewer\"","Random redneck on my post. Wasn’t even remotely related.","Apparently, pro-vaccine folks are “satan spawns”","The best comes last","My family member’s latest rant","I'm at a loss for words. These flat earth groups are goldmines.","Won't somebody please think of the Nazis","On an article about the recent measles outbreak...","Hey kids, hold up mommy's tail for this picture.","This psychotic rant about the 2017 Las Vegas shooting. Because Arcade Fire played in Vegas a few weeks later the whole thing is a hoax.","I hope the tampons are not in the \"slightly used\" category","\"Their are no such thing as planets\" - Serge. 2018","Western Australia has had a measles outbreak...","Screaming for dick, lol","In response to someone saying they wanted to see The Avengers 4 before WW3.","How do people believe these kids of posts?","Who's Smarter Than A Baked Potato? Not A Flat Earther, That's For Sure!","Nobles wiping their butts with ducklings","This dude thinks that since evolution is technically a theory it isn't real.","Oops","Someone destroyed a “Jinnah park” sign in my city","That escalated quickly","This dude has no chill","His account is a gold mine","Well, you know, unless they die","Flat earther also questions the validity of the moon.","I really don’t think it’s just about the numbers here...","The government tracks us from birth!","One of many wonderful opinions from America’s best","Huge WTF Here, I think he's saying Pepsi is covering up the Flat Earth, but it's too wacky to figure out.","Insane nazi bashes all non-european cuisine","Toddler-esque reaction to logic","Apparently native Americans are imposters.","“Satanic Disney trying to get your daughter to give her pussy to the Devil!”","Not facebook but still The question was \"Why does it appear that Donald Trump has problems with his speeches that do not follow logically, or am I missing something by viewing them on news and internet\"","“ My heart was telling me” clearly not your brain","I feel like my time was raped just by reading this","Yes! I want my kid to get sick!!","His racist rants about Obama have long been forgotten.","My ex-teacher has some weird friends (red)","Insane Person Reddit: 7 Years? I Was In Middle School Back Then, But Okay...","People on this facebook page legitimately believe vaccines cause babies to turn gay","If you want more mad flat globe groups then i believe this is one of the best ones out there... 2.7k members....","Sweet baby Jesus","You bitched and bitched and bitched","Don't you hate when that happens?","Local Business Post Gets Awkward","Dude on Reddit comparing me to a guy who punted a cat because I eat meat. The other parts of the convo were just as bad.","Dropping hints.","\"Hiring an attorney or using a public defender is peoples' first mistake. You need a lawyer who is not a bar member.\"","An excellent mix of /r/oldpeoplefacebook and /r/insanepeoplefacebook","Those damn Muslims and their letter boxes","Woman shares a warning about prtoceting your children when posting to Facebook, final sentence \"Avoid keeping children's pictures as profile picture.\" ... her profile picture is of her child","I don't understand how some people can be this stupid.","What the actual hell?","What kind of hospital does this man go to?","Insane with a hint of very smart","Found This Gem On An Anti-Vax Tweet","This guy pays $150 in child support almost every month and is too busy making youtube videos to get a job. But he cant be fooled like you","Earth is flat and 9/11 never happened and fossil fuels don’t come from fossils","The Seminole County Florida tax collector, ladies and gentlemen","On a post about a Whooping Cough epidemic","Just received this friend request- seems legit","What the fuck is this delusional bullshit... Casual hanging out = set up for a false rape accusation?","My favorite person on Facebook! My favorite from this week is the last one. She hit zoom on her web browser😂","Insane people Reddit?","Being a fish is overrated! Be a snail instead.","Stop mocking my religion!","\"Imagine if satan used the phone of an unsaved person's device to do a live stream on you\"","I'm guessing this person doesn't like Trump..","BOYCOTT THE NFL!!!","Fluoride doesnt help your teeth, it calcifies your pineal gland!! Oh no!","\"Trump is doing god's work in record time\"","They have a 1 year old","Native people are just so dangerous that they just HAD to be put on reserves.","On a post about depression","Civilization is weak so I eat raw seafood","Goat simulator is demonic","My aunt constantly posts stuff like this. She obviously has not heard of photoshop.","If being gay is okay then I should be allowed to not vaccinate my children","One of our own...","He's dead serious","Yeah. I live in their heads rent free!!!","Woman posts video of her 12-year-old pug whose back legs are failing, discussion of lifeforces and homeopathy ensues","Found this gem in the comments about an old Nickelodeon show","Fucking Hell","Uhhh, Okay.","Slipping meat into a vegans food","I... don't really have a title for this","Plus I heard they turned the friggin' koalas gay","Sorry Paul, I'm not joined your group","She left out the fact she actually called her dog a \"porch monkey\" and she dropped an R bomb within the first few words. Classy.","Just came across this on a donut recipe on Pinterest...","Summer jobs don't exist according to the U.S president...","Take my kid to a doctor? Nah, a post in a natural mommy group will do it!","This is jambalaya. The ingredients are literally three different types of meat in a sauce.","Ah yes, because chickenpox has never been fatal! /s","Doctors don’t want to heal you they want to harm you. Definitely don’t take their advice on non-fda approved supplements.","Sorry for the politics but I just got told Obama made our small midwest town install lights on the city signage to waste money. Don't worry, Trump's fixing it.","Okay Donna, simmer down a bit.","Woman believes homeless people shouldn’t try to get jobs","The silent majority always conquers.","Found in the Youtube comments","Someone had a bad B-Day","She charges people to read their tarot cards at dive bars.","To Make America Great Again, Let's Hang Andrew Cuomo","Let's play Anti-Vaxxer Bingo!","Every now and then I return to be reminded why I left.","Not Facebook but definitely insane","Wait... What?","Rap battle in the comments","Makes 0 to no sense but OK.","woman thinks people are doing all these tiny unimportant things to her","She’s currently pregnant and the comment is from her babydaddy.","On a post about heavy metals in baby food...","White \"chad\" has angry insane rant about white woman holding hands with a black guy","It’s the Democrats!","Will the real Slim Shady please stand up?","He genuinely believes it too","If you want your confidences back this is the treatment for you . ?","This escalated","Defending a pedophile","ALL THE MAN SHAKE","Not only do vaccinated kids spread illness, but it's ideal if you catch it.","He's looking forward to something happening in 88 years but he's in his 40s. He also clarified that he's not 18 for some reason.","I got the call to violence, but I decided to stay in and watch Netflix instead...","‘’Murdered babies’’","She (yellow) later sent me a private message to appologize for her, as she described him, racist and judgmental uncle (red).","Person came up on my feed today commenting on a fake news article about removing pork from school canteens.","My old schoolmate","Not racist (just hates Muslims like a patriotic American)","My grandma took a sip of the Kool-aid :(","The best around","Posted in a pokemon go group","Quite a shopping list. I hope they didn't forget the Newports.","He's doing this after getting less than ten votes total","I'm pretty sure the reason this genius didn't win wasn't because votes were stolen... Jus sayin","Instagram has some crazy people too","People on Facebook fell for this obvious bot account","Apparently Trump has proof of child sacrifices done by..? From r/greatawakening","RallyPoint: The Military Version of Facebook. Projection is a helluva drug","On an article regarding KKK flyers posted around my hometown","Found in this very sub","“Eating meat is just like pedophilia”","Lambchop","airplanes run on compressed air ✈️✈️✈️","Grab 'em by the prayer","I so want this to be satire","If I don’t like it, I need to leave!","Fake patriot defends Trump and gives former Navy officer a suggestion","Psychopath Territory","Christian Discovers Spencers","This girl actually has a criminal record and is currently waiting to find out if she has to go back to jail.","You're fake and a lameass if you're not racist.","The Trolling of Mr. Red: A Ten Part Mini-Opera","HEALTHIER IN EVERY SINGLE WAY","\"I am going to say something that might generate hate but I don't really mind.\" - My Brother, 2018","I was blocked by two crazy people today.","All I can gather is that somebody got stabbed and Bobby’s gonna need to get a new van.","Sharing personal problems on Facebook is always a good idea.","He’s in prison for sexual assault of a child and witness intimidation...forever","\"How to bypass the system FB\".","This sex crazed pervert.","Sexist doesn’t understand why an entire gender doesn’t just admit that they’re “trash”","The CDC is using biological weapons against antivaxxers!","Yikes!","Silencing those ANTI-LGBT haters","What can you do when your relatives are crazy and racist?","Does flag burning count?","Some 420 Reddit Insanity","Not facebook, but still maybe one of the most racist incidents was ended because of sport and also \"uniter stench of america\"","Does this count?","LGBT definition","Pray the HIV away.","This girl got called out on Facebook for saying the n-word in her snap chat... this is her response in the comments","Current mayor of a small AZ town announces to town FB group that \"party equals agenda,\" but only for Democrats. What a world.","Last Christian terrorist group","Twitter user on Aretha Franklin's passing","10 bucks to anyone who can decipher this.","Business owner has a meltdown over a 1-star review. Color key and info in comments.","This guy on my Google Hangouts...","With all these cures for depression, how are people still depressed?","Redditor compares XXXTentacion to Malcolm X","For the most advanced nation in the world that's fully capable of feeding it's populace, having food and drink is not a right.","Maybe it’s because vaccines made me stupid, but I can’t understand this logic...?","Yesterday she posted a video of herself getting handcuffed for an outburst during her husband’s court, today, this...","A wild antivaxxer has appeared! On a video about teenage brain development.","What the what?","I can’t get coochie therefore abortion should be illegal","Moon landing was faked","She is dead serious","An actual paid political post attacking a friend of mine. WTF Facebook?","Old man gives his opinion on a post by Complex about the best menu items at Taco Bell. Insane for not liking TBell","Satan is destroying my internet!!!","Meth + Schizophrenia = something about the YWCA, Vatican, and other stuff","Why are people so scary?","2 posts by the same person. You guys be the judge ....","Circle k fucked with the wrong guy and his nacho cheese","This Just In: God Hates Dog Pampering","Recruiting for The Illuminati on a soccer post-game recap.","Just another insane antivaxxer mom","Dude completely loses it when told he doesn't quite understand dry-aged meat (from r/trashy)","Mowing torturers grass","On a video ‘proving’ that the Earth is flat because we observe stars to move at the same speed across the planet","Grand jury named 900+ Catholic priests in PA in covered up sex abuse of children and this lady thinks we should give them a break.","Not facebook but yeah","Going “Live” on Facebook when you’re in labor","On a post about Germany opening the door to a third birth option","This guy has made several anti-Google posts but this one really takes the cake.","This person was commenting on a video about using time out as a disciplining method for children.","Thought this belonged here","Guinea pigs left alone 10 days by mistake. OP suggests leaving them alone for 10+ days is a good option when time/ funds are low. Max recommended time away without checking on GPs is 2 days.","We must defeat the powder puffs!","Vaccines as a viable treatment option? Don't be silly!","Maybe if you WOMEN started respecting MEN then you wouldn't get raped!","“The Deep State tried to kill Trump SEVEN TIMES!”","Trump supporters are Nazis","Obama is ISIS! He appeared out of nowhere!","Simply hack the server tch","Found this one on a page for Christian’s looking for marriage","Some people in my family legitimately believe this shit...","Come on Measles!","Where’s the proof that someone actually died from the measles? .... (On a post about a measles outbreak since school started and lower vaccination rates)","This guy has consistently broken into Allen Memorial and harassed patients. He's pretty darn sure that everyone is there as an ongoing part of MKUltra brainwashing.","Might as well get some karma for dealing with this asshole.","Respect your ancestors, drink cow urine.","This lady was looking for a wagon to walk her cat in. She said she can't carry him because he is 15 pounds and would get a hernia. I decided to snoop on her page and that was the first post. X-posted to r/thathappened","Insane people Quora - Why Pakistan shouldn't accept refugees","Antivaxers are the best","Spy flower"]