["/r/AdviceAnimals rules: Please read before submitting or commenting","We're looking for new moderators!","Besides, it's just good URL hygiene","Trust me on this one, fellas.","I didn't want to spend a $25 shipping on each $3 item to get them within 13-20 days","Seriously Amy-with-an-i, shut the fuck up.","There's an elevator at work and I work on the 10th floor.","Checkmate.","I'm looking at you, Google.","From reading the comments on the other post...","Disagree, dispute, protest, challenged, dissent, counter, contradict, debate....","I feel conflicted every time I watch Firefly","\"Who--? ...oh god DAMNIT.\"","Me and my fall allergies","Pot is a \"gateway\" drug, for law enforcement.","To be fair, I've always enjoyed jazz.","Now the whole office is getting sick. Learn from my POS coworker.","I wanted to share something I saw on here but didn't want to go through the process of explaining what reddit is...","Trump regarding RIGGED Google search results","I had used his favourite mug too","Easily as distracting as playing with your phone","95% of people online strive to make ANY point about nothing. All day. Every day.","Well, I can’t go back to that coffee shop ever again","Hospital got rid of nearly 108,000 bill because NPR wrote a story about it","Time to circulate the old resume.","I’ll never see it happen, but I like to think that it does.","I'm not very good at it.","At work, Admins implemented IT policy requiring users to click and drag pointer 100 pixels before drag and drop function triggers in windows.","We were so close!","Scumbag Donald Trump","Best crossover episode ever!","To hell with all of these mailing lists I don’t remember signing up for","The tears just aren't coming, man.","Maybe not a new low, but it's up (down) there.","It's like a Rorschach test with letters instead of inkblots","Old memes never dies","Election News Flash: for the first time ever, Millennial voter roles surpassed Boomers","Thanks for the feedback.","Thanks...?","Redcap Logic","He was delicious","She Meant Sun Roof...","My first maymay here","I just joined my friend's company as his VP of Sales","I have to keep a co-worker I don't particularly care for in my phone's contacts","And usually I am excited thinking I got a message..","I can't believe I'm actually complaining about this.","Out of Touch Trump","Commercial actress: “I finally found bladder control protection that looks sexy”","Awkward fat chick's first time at a gay dance club - I had never danced before and everyone was ushering me to the catwalk. I think I got an A for effort.","The downside of high resolution photography","I've lost a little over 40 pounds so far and had to buy new pants once already...","I just can't win...","Seriously it's like a festival of people in uncomfortable clothes getting headaches","They were on sale.","Sad that I’m proud of this...","i see him everyday too =(","It's all good","Step 2 on how to stop school shootings","Step 1 on how to stop school shootings","Betrayal at House on the Hill can get a little heated...","Started night classes yesterday","I’ve never had such bad insomnia...","I’ve see at least 3 posts about him per day recently.","The first day of school as a stay at home parent","Perfectly logical to some people","Donald Trump’s mentality on being a POW. Genius.","No regrets and it makes me feel less lonely","I'm really tired of looking at these every day","All over /r/aww","Was almost late to work today","Gay deepstate pizza parlor pedophile Mars frogs","Business cat needs some info","Maybe it’s because I am a parent of a mixed child, but ratios seem to be a little off these days","You just can't win","Every website, every visit, this is getting ridiculous...","Actual Advice Mallard","The president this morning","It doesn’t happen often, but when it does it is the best.","It's like the writing equivalent of \"I'm shy\"","Weekend was a success","Or Subway/Train + Bike","They werent allowed their own console because of me","The Best Antivirus","Am i the only one?","It's almost always a telemarketer, too.","I learned this the hard way today while moving across town","Please Don't Let It Smell; Please Don't... Crap, It Smells.","There goes my 15 minutes of zen I had planned","Donald Trump is the worst president ever, 41 percent of Americans say in poll","My mind when depressed","Employer just changed policy, now we have to use our sick pay every year or lose it. Employer is now upset that call outs have sky rocketed.","My friends always want to hangout at a cafe","They came to check on me","Every dog I've ever had","All the birthday wishes made my already great day, extra special &lt;3","When Haters bring the Hate","So happy for you man!","Remember when Reddit was actual content rather than screenshots of things people have said on social media","I'm very thirsty","And just like that...","To the employee who looked over to my computer screen just as I was checking a news site on my break and proclaimed i am 'Slacking off'","College students: Don't give in to sweet smelling lies. Towels have one job, and this practice denies them the opportunity","My MIL is our sitter, she's afraid of driving and talks too much.","Darn summer colds","There was that time I told my wife to \"Calm your tits.\" This was wrong. I have learned to be more civil in my marriage. Thank you Joseph Ducreux.","At age 31, I just threw in the towel on dating in the gay world.","When I heard of John McCain's passing yesterday","Better than nothing?","Arizona Republican Senate Candidate Kelli Ward, people..","I really think I'm the last one here who doesn't know","His kill streak was only two and everyone else was unarmed.","RIP John McCain, but...","The smell suggested he was right","Just forgot the word for gum","It's just curds and whey...","I like to hang my arm off the side sometimes.","2nd day here and I've lost count of the amount of times I've had to explain why we're 5 instead of 6.","The Madden Championship Tournament incident","I disagreed with his policies and still came to respect McCain more than most","Ugh","As a 30 year old with back, neck, and legs issues working 48 hours with a 8 month pregnant fiancee....","My old boss in sales made these 2 consecutive statements to me a week apart.","david pecker?","My life is often improbable","Oh, well...","...but that's none of my business.","every morning feels like hell because of this","Driving gives me anxiety","Scumbag Penis","TIL my laptop is a hoarder.","And I'm almost 31 too","Oh well","Everytime..","Typical Reddit","Never trust a fart","Happens more than I'd like to admit","I remember","Miss just 1 day on r/prequelmemes","It's almost that time of year again","A friend of mines sells them. I was wondering how ridiculous my roll request could be before the DM noticed. he didn't.","I really am bad at making posts here...","Like stink seeking missiles","Facebookpalm","The anticipation of “dem” cool drops and the tears to follow...","We hit it off and spent a week chatting before we realized we live 383 km away from each other","The reason they give you is completely immaterial. In fact the real reason may be none of your business.","that I later recycle","Almost fried my graphics card today","Isn’t it too early for soda?","They showed up in my inbox all at once.","Giraffes Right Now...","I hate doing all that extra verification..","Seriously. Put your phones down.","Dear Kraft Mac and Cheese,","I'm uninstalling these dating apps.","Powercleans and Powercleaning","Maybe give me a paper cut and squeeze some lemon juice in it while we are at it","Oops, forgot again","Am I late?","What! I'm HELPING!","I swear I'll be a quarter mile away and the other person won't go until I make it to the stop sign","what a nice surprise!","Enjoy paying a premium for a unsafe and impractical novelty house.","First World Problems","Like a Pirate.","But that's none of my business...","\"I'M BEING HACKED BY GAY FROGS\" or whatever","I can't seem to get much karma while I'm sober. But when I'm drunk and shitposting....","My boss has to know...","Last night at my son’s freshman orientation","Even though the cosplay is typically better than the actual game...","I present to you... existential crisis dog!!","I'll go back to college on Monday and am genuinely looking forward to it. 12 year old me would have been dumbfounded.","When answering the phone at my company, we start with good morning or good afternoon. The clock hit 12:00 as the phone rang","I've Been Trying To Submit 1 Post All Day","Backache after cleaning my house all day","I wish people would start pointing the finger at the real issue.","Took all day but now I can enjoy my wine","On more than one occasion, a girl has told me, \"I wish I could find a guy like you\"","NFL DOG","I've been doing client care for too long...","When your friend complains about the air quality in Washington.... but then smokes cigarettes?","Lapkin does it’s job.","Every episode of \"Lifestyles of the Rich and Famous.\" I loved this show. RIP Robin Leach.","Something I'm sure some of us can agree on.","When being sloppy paid off","Just got over bad cold, fridge was empty.","Just ordered a raspberry smoothie","When I'm 5'9\", and I see a tall woman two heads taller than me.","Coworkers trying to organize a meeting during the weekend","After a few dates with a girl I got invited to her place for the first time and this shit happens.","It's been 'improved'","Made laugh, comrade.","In response to the study that found that no amount of alcohol is safe...","What is about to happen in 8 days","My Sister Recently Got An Air Fryer...","I saw it on HBO one night and watched the whole thing. I made this same confession to my wife the next day. She refuses to watch it after knowing what it did to me.","Looking at the people in the train next to you","Everything that reaches us is delayed, its just the ping","99.999% of all videos on the internet","He had one rule: Never stay the night.","After staying in the city for years I'm finally taking a road trip.","the weakest point in any security system are the users","Too many ducks","Seriously Reddit, get your shit together. It makes for hard mornings at my office desk.","I paid a lot for it and like to show it off in pictures","It's like the we're all on vacation!","Been hanging out with the guy for 40 years...","Pacific Ocean, baby","I wonder if anyone has noticed","Insulticorn","Being extroverted can be just as difficult as being introverted.","And now I don’t trust he wants to help me...","We had to clarify if he meant \"temperature\" or \"light\"","Seriously though, what's with all the chicks who have their Venmo listed on their Tinder profiles?","TAORAPUORAEPTUITDH!","Since you know everything, you probably already know that you're an asshole. #Insulticorn","That's infuriating","Tuesday got me craving","R.I.P","Just sayin","Current Affairs","Whenever someone contacts me about my resume...","She knows it’s not in the laundry.","Other prisoners there might be getting letters very soon containing a news article of what he did. He was a child molester.","When I accidentally hit new while browsing r/all. . .","In new soviet america... (x-post /r/PoliticalHumor)","Inordinate number of people fall into this category","The exhausting search has finally ended. She's great but no longer having to search is greater.","What's left of the block looks ravaged","\"Kindling, you mean kindling....\"","I feel bad for her family, but I'm also a little bit annoyed","My feelings with all this talk of impeachment...","Sometimes I just wait until another redditor asks for an explanation","I’m sure this happens at a lot of companies...","I don't think anyone'd disagree","As a SAHM who's never worked &amp; has no real accomplishments or skills, I often feel like a stupid, incompetent, loser. I am so d*mn proud right now, I could burst.","If you employ, they will come","All I can put together is that it's something kids do . . . or something.","Maybe it's because of where I live? But still, no question about rights or anything","A little tip for Congressman Duncan Hunter","Verizon Throttled 'Unlimited' Data of Calif. Fire Department During Mendocino Wildfire","When my wife wants me to drop everything I'm doing and do what she wants to do.","I think the word you're looking for is door","I can appreciate this.","I was around long enough in the 80s to know about Maz but too young to have kids who grew up on Stephan...","Tested and it works!","I'm not sure if I'm too old or just really oblivious.","My buddy told me there’s construction on the highway","Is this the start of the Boston marathon, or a new checkout line opening?","Tossed and turned all night. The alarm goes off at 6:30.","Best feeling when getting dressed","I've just been noticing it way too much on this sub.","CTRL+Z","I'm looking at you Axolotl","You either know what I mean or ya don't","With all the talk about impeachment lately, it's important to keep this in mind","Its just going to look as good as everything else I run","Sheep. I meant to say sheep.","Coming soon to a Real News broadcast like \"Fox and Friends\"...","Every time I take off to go on vacation","Reaction to the presidents tweets this morning.","I swear - it is not my fault!","Searched answers for my assignment in Reddit and found one of the recent announcements.","♫It's the pedal on the right, it's on the right♫","I realised this after buying my first packet in over three years...","Big Tittie Problems. You're welcome for the show, colleagues.","I'm still hurting inside","I just want to enjoy what's left of summer...","I've been seeing information and stories about him more and more on the internet lately.","Everyday, just a little more","She's worked two whole hours here since May","FTFTY u/bearlung_","It has now rained for 17 straight days. At the height of what is normally an oppressively hot, sun-drenched summer.","Clarence on Classic Rock","I just want to check my email","#HardKnocksLife","At this point I'm afraid to ask","All aboard the karma train!","Remember this when logging in to reddit","It's his right but come on man...","Thanks for the gold kind stranger! :/","This happened to me with a phone interview for a job recently. I couldn't understand a word the interviewer was saying.","Wish the good times were still Rollin'","knowledge does not imply action","Oops","PETA \"freed\" the Animal Crackers...","Trump’s impeachment prospects just went up.","It's sad that he died but why is every other post about him? What did he do?","\"Faith in humanity restored\"","I only eat the best cookies. I know more about cookies than the mommies. My mom would gestate her cookies for eight hours.","I thought routine checkups were 100% covered...what happened to the medical industry?","Enjoy messing up your life, I'll enjoy messing up mine.","Virizon is smart enough to know what unlimited means right, right?!?!","I Leave the House Before Anyone Wakes Up","I'm really looking forward to the explanations of what makes this time different","It's been a few weeks of this","Classic Catch-22","R.I.P. I guess","Checking a car after the dealer writes that it has manual transmission","Everyday","Bad Luck Brian visits Seattle","So good","Great succe... sry.....","I went to my first college party recently, complete with live band","My Reaction Browsing /r/adviceanimals Today","There can be only one!","When I lose something and someone starts giving suggestions on how to avoid this in the future.","Washing your hands is not enough","In light of The Eagles Greatest Hits surpassing MJ's Thriller in American album sales....","I have a baby boy due on Christmas...","Looking at you Google Support.","RIP but timing...","Now my boss is scared of me...","Should’ve played my cards right and been someone else","Everyone is up in arms how reddit was down for three hours, but here in Europe...","I’ve seen that chin... is he like Max Headroom?","How I feel when there’s a post on the front page I upvoted when it was new.","Could be a bit of both I suppose","When the office installs overly-large rolls of half-ply in the bathrooms.","Don't know about the Staties in your state but here there are no breaks for speeding. Brought dude his lunch though while he was on a detail...","Where does the money go after the offering plate?","My 3 year old just now","I was pretty scared. Still a little shaken up.","They called me back in 20 minutes and credited my account in 2","I dont like being told what to like.","Post Malone survived that flight for a reason.","Thought I hit a Reddit Gold mine","The newest generation of internet users won't even remember","I want to be safe.","When they don't have TOTO - Africa","Mueller's Team Today","Having a toddler, this has been a lifesaver while eating out.","Everything on the front page is a repost","Offered money to a religious homeless person","Sorry.","Reading write ups on the VMAs has me feeling a bit old.","Top Five","I'm seeing all these RIP notices today","The biggest realization after becoming a dad","For those people with tunnel vision and short term memories","Never let on any form of tech literacy around family or co-workers","I was trying to help. Now I might have nightmares","Traffic jam when you’re already late...","Showerthought from a few years ago still makes me wonder","I don't know where this rumor started but it hurts employees.","This Week on Reddit","Good Guy Netflix with the Loud Ass Intro Sound","This is the 3rd home issue I've had this month so I've learned to appreciate the small wins","Life is all about timing, and I have none.","I moved all the body washes and shampoos out of the shower to clean it 4 days ago, and he hasn't touched his since","I have never felt so guilty and been so not guilty in my life.","the front page and /r/all this morning...","Welcome to University, where hope dies and debt grows!","At my annual physical my doctor asked if I wanted an STD test","Is life even worth living anymore?","So you think we are evenly matched?!","Vacation takes a lot out of me","I should just be pleased to be wanted","The kids are headed back to school...","I'm not a 10 but you won't have to guess who I am in the picture.","Told him about when I was raped... when walking my dog.","It's our little secret...","You can make yourself an angel today or someone can make you a devil tomorrow...","Getting excited for eggnog this year again, don't even want to look at the label","Netflix was the chosen one.","Just stay seated and enjoy the wedding, folks","Considering Ringtones.","Hearing about Cohen implicating Trump in a felony","Ruined my morning","The rules are there for a reason","I beat Reddit today","It's the second time I've seen this in a restaurant, and I have no idea why someone would think I want a third-person view...","Me.","No, I'm not salty about Spider-Man PS4! What makes you think that?","Accidents happen in public toilets but...","Scumbag genetics are not treating my dad well.","Me reaction when I see comments on my posts","Alright! Oh shit...","I still have reviews and stars on Netflix shows. The app on the TV hasn't been updated for more than a year.","Holidays in Spain are hard...","The web as we know it has been around for over 20 years, and yet people still make this mistake in the media.","A case of mistaken Identity","I have had it","Finally dusted my keyboard","My girlfriend's dog is the most interesting dog in the world","Doesn't matter how thirsty I am.","How my weekend began","The full college experience.","\"Please be sure to have you're ID [*four exclamation points*]\"","I mean, really...","If only...","How it feels being drunk on reddit","Does anyone else suffer the same way I suffer?","First World Justice System Problems","After laying in bed awake for an hour and a half I turned on Netflix and was asleep again in under 10 minutes.","It was only my work laptop, no big deal.","I can't be on here 24/7 and I miss things.","Thanks, Facebook. That's what I get for leaving reddit.","The word my they were looking for was \"concussion\"","The Lord works in mysterious ways.","It sounds like they're intentionally adding an accent, right?","They think something's wrong with me","It's excuse after excuse and don't know how to break it","The top text is a paraphrased summary. The bottom text is a quote.","It just hit me today.","Joe wasn't very considerate","Landfills?","To everyone shitting on that one guy who slept past an interview.","My response to the needing to piss discomfort post","You the real MVP, Amazon","Interview went so good at the end he started telling me about the company and all the different people I’ll meet.","Seriously folks, they only cost $1 and it helps the planet","Because some parents fail to teach their children this...","It's not how this meme is used, I'm just a little proud of doing something productive","I will always love them both, but she's only making me want to pull away.","Bittersweet embarrassment","Crisis averted","It's alright to be upset but maintain perspective.","The new 10 Guy?","Stability with progress are beautiful things","Driving around town today is an exercise in frustration","There's rarely an hour without a consistent 15min of barking each day","\"Well wife, you're pregnant so yeah, you look pregnant.\"","If you aren't getting any, try following this important rule...","It's a 2012 and out of warranty","Makes deviled eggs so much easier","Don't hold on to petty shit everyone","What's the big deal? I didn't lick them. Crumble them up on ice cream or something...","It really makes me sad...","We talked for at least 20 minutes. Was to stupid to ask for her number or her last name.","So I was in the break room when my coworker pulled this one on me, and for whatever reason I can’t get over it.","Please stop WWE","I'm seriously considering switching to Android for my next phone because of this.","Wife noticed the school next door set up a Bouncy Castle","Well played, ESPN.","Can we all agree?","It doesn't even taste good, but it's mine.","There must be millions of people among hundreds of industries using completely inferior products.","Microsoft be like, we've got some updates for you.","He’s been doing this since her surgery in April. Even paid me for the week vacation I took her on, despite using all my vacation hours during her surgery. Couldn’t thank him enough.","and /r/pagan is too religion-based. Sigh.","After working in a hotel, this is the only thing I have learnt","Because, you know, Depression/Anxiety is 100% simple.","Thanks, uterus!","It lets them know that you trust them and also implies that the job is important.","When your kid says “I wish I’d never been born”","I did it for my mental health.","She lost, but we won","Cashier: “I can help you over here.”","Told the wife, \"Oh look, the phantom of the Opera is showing\"","Home is where you can poop most comfortably","Sometimes alarms and medication don't work...","Giuliani on Meet The Press","Our boss really looked out for his team during the company budget cuts. My emotions dropped to rock bottom and then soared again, all within 10 seconds.","First world or what","Not Sure Which Is Worse To Own Up To","Following his posts is basically a hobby for me.","Damn you, prequelmemes","Voracious Cycle","They're both on different teams so its more likely we don't cross paths at the end of the day, but it rattled around my head all night.","I had the best boss a few years ago","Getting a call from an unknown number and caller ID just says Russia","A Common Sin","My handsome, promiscuous buddy dropped this one on me ...","Happens way too often.","Can you all just mind your damn business? My head furs are none of your concern.","r/getmotivated just doesn’t do it for me","One hardcore motherfucker","Trying to imagine what it would be like for my teacher to be armed in the classroom","A Do-It-Your Damn Self Project","Steam right now.","What can I say? I love Apple's hardware and iOS, but I am completely synced with Google","It's so easy to fix, and yet...","I'm all for equality but then I hear \"Hey guys sooooo\"","I shall now walk left and wait for my cold brew in silence","Sort by r/all","The secret to stress free living","Instead of cartoons, just consist of animals. It's advice animals.","I thought I'd do myself a favour for peak time","Proving that I am the larger child","Ruins the Whole Meal","Best Boss Ever","My boss surprised me with this one just now and the guy just proved himself to be such a class act.","The worst part is that I said \"oh, sorry\" and kept browsing for three more minutes.","I unintentionally fixed the fax machine.","I honestly don't think she realizes it","English isn't my first language","I even lost some skin after my hand slipped when putting the last bag of frozen edamame into the only space available.","Another way to look at the good boss post","I've never been to your site before, and now I'm never coming back.","Brakes can only work so fast","Hey, Catholic Church...","Have a great time, Rick!","HIFW I’m Grocery Shopping and it’s only August","Schadenfreudelicious!","Really feeling like this lately","Bad Luck Lobster","This has happened many times before surprisingly... I feel like one of these days I’ll end up on Catfish.","It's disturbing, really...","new fiance yells at my cats","It feels invasive, and trying to look happy takes too much effort","Sending you thots and prayers","I can't be the only one","Baby Insanity Wolf lifts his leg in public...","Just saw a promoted reddit ad.","Scumbag pen","Why is it so hard?","I never understood it until now.","Just have to last one more day......","I know it, you know it","Advice animals is good, so i like it.","Florida House candidate Melissa Howard said “it was not my intent to deceive or mislead anyone”","Why he hates being called Hootie","Needless to say it got awkward","Took a \"Bride &amp; Groom\" challenge with my Fiancé to determine who knew each other better, and then both bet favors to the winner...","Welp that's the last time I do that","5 minutes is too many","My name's not Connie","Is it T-Hot?","Pretty much me when I come in here.","Oh the joy!","Overlord is One Punch Man!","The best feeling in retail","Hopefully work isn't too tiring...","It's so tragic you don't know how to end the conversation.","I’m trying to look on the bright side.","So you say you don't like road construction....","Being a health care provider and seeing the same patients come in week after week with new injuries","He ran out without a word","I think I’m just going to hide in my house from now on","Taco Bell fans know the struggle.","It's the right thing to do.","Bathroom = rekt","i like to think its people who have bad karma.","RIP Aretha Franklin","First world problem or not?","Loud groups of kids playing games, loud groups of teens eating and laughing, loud group of adults meeting, loud group of seniors playing cards....","Learn it, Live it, Love it, Don’t be an asshole.","Uh, nice to meet you.","So easy to hide a victim if you kill them.","He said it best.","Health &amp; Habits","It takes too much effort to create a new online account for a vendor I may never use again.","PSA: It's an election year, avoid social media like the plague","Like Batman and Spiderman","I don't think I have high expectations but...","Just got back into town after a road trip through Montana","I’m still hiding out in the bathroom","How","Not just a problem for kids.","It's fun at pool parties too","I’m from rural America.","There was dead silence and then this.......","Anymore","Never thought we’d have to use it. But while my wife is out of work I suppose that’s what it’s there for.","The President of the United States has Resigned","Finally verbalized this at 31","Just got back from vacation in Scandinavia...","At the park the other day my kid brought his mom/my wife some feathers. Took me a minute to register what she said and I’ve been chuckling about it since.","It's one of the easiest rules of the road","Love your hustle, but I don’t want to share everything with you","wording is everything","Why do you look so tired?","This one was invaluable when I was at college","Doing a little mistake on a post and it gets deleted","I work from home and moved into a new ground floor apartment 2 months ago. It has been a living hell.","Wife was getting fed up with our issues over the past few years. So I did everything I could to reassure her.","Forges University Diploma For A Degree That Doesn't Exist... Even The Dogs Are Skeptical.","When you’re sweating at 7am","Telling somebody about how I originally came over to Reddit and Digg.com came up...","To the girl whose boyfriend stole her toilet after she dumped him","I can't help but feel that I'm at fault","Every single visit","I’d been meaning to get out of the call center anyway.","After reading the comments of people complaining about hand towels","Answering certain practice questions, while studying for a professional's exam","I'm not even fanatically Christian – just an 80's kid","I've been using a buddy's parking pass since January (he quit and gave me the pass, but it's still under his name), and I've forgotten what it's like to have to walk more than 50 feet to my office.","To the OP of the top post on r/aww right now.","When people post about \"fuck cancer\" but also smoke daily","You The Real MVP","Tit for tat","The successful embarrassment was somewhere between a dad joke and petty revenge","It’s a trap!","Never going to happen, Reddit.","Perspective matters","My elderly parents are not fond of one another","I still get shit from my peers for this","On Trump's tweet","Going to the doctor after 40.","So small but so satisfying when it happens","They are, in fact, from Earth.","You wouldn't believe how many entiled people do this every day...","TIL from r/askreddit. Who knew.","I'm looking at you, Karen","They can provide enough to feed a starving country with all the pizzas and sandwiches","Was feeling a bit anxious about going out with our friends...","Always wear a condom, kids. And wash your underwear properly.","I watched it happen and I still don’t understand how it happened.","Me trying to figure out the time.","I really should have known better","I think it's all just a publicity stunt","A few years worth of commitment - figured it out before I let the cat out of the bag","I'm a waitress and this drives me insane","Pirated Software","If you are having guests over to your house","Thanks Guys!!!!","Even the lowest of us should live the highest life.","Owls are as wise as they are blunt.","I mean, they are everywhere ...","My wife asked me to clean up the floor on my side of the bed...","I almost threw my computer across the room tonight when working with the Windows 10 Photos app","My intersection has a very short left turn green. I’m going to start throwing coffee at assholes who do this crap.","After reading the news of the US Pizza Museum being located in Chicago over NYC....","Knuck if you Shuck","Success has its drawbacks.","America! FUCK YEAH! 🇺🇲","This was a new one..","I'm a distrustful bastard...","A Back-To-School tip for you....","It makes all the difference.","If it works, it WORKS!","There’s a perfectly good floor right there","A typical Brian","This is why I had no cash this weekend","This has been my day today. It's like having a fucking vibrator in my pocket.","I hate this","Nazis in A Country","Intern was wondering why everyone gave him weird looks in the meeting","Thanks, O.J.","My wife asking for salad dressing","We get it, you were around when it was Socially Awesome/Awkward Penguin. It’s Good Thing Bad Thing Penguin now. We don’t need to hear about it on every post.","Secretary of the Interior Logic on Solving California's Forest Fires","Confession Bear","I asked a friend for help","After a few minutes of scrolling through r/insanepeoplefacebook","“You keep using that word. I don’t think it means what you think it means”","Hey, it's the little things.","Pretended not to see a coworker","When my \"91\" year old dog wants to keep going after our usual short walk."]