["Dev Letter: Server Performance Improvements","StarSeries i-League Season 2 Viewer's Guide","What the F? Is this Type B sockets in Russia? Game is literally unplayable","Such a subtle trap :)","Just stopped a car with my bare hands #FIXPUBG","Too much depth of field maybe....","chocoTaco uncovers new grenade bug","Nvidia driver also added the ability to add Catzilla to your games.","When you watch one WackyJacky video","Battle(non)sense: PUBG Unlimited FPS Input Lag Analysis","I don't think he expected me to come this way","Double grenade when i died","Please allow us to step up/over small one foot stairs, etc.","GUIDE: BERYL M762 The best grip + Recoil comparison with other ARs","Why cant we have All Time Stats?","Peeking - PUBG Logic","You can drive through doors with new scooter in Sanhok","Inexplicable FPS drop when mouse pointer changes to hand 'selection' pointer in lobby. Can anyone explain this?","My frame drops in fullscreen mode since last nvidia driver update","Bot Training Mode and Ray Tracing - 4K Wallpaper Fanart","Exploring on vacation in Bulgaria... Checked all the rooms for loot","What's the Point of Replays If...","The last Nvidia driver added the ability to put a green screen anywhere","That's it. I can now retire with a 100% win rate.","ChocoTaco with a Classic PUBG moment","Epic snipe shot - Do not run away from me","Game Crashes Trying to Watch Death Cam More Since Update","PUBG - HellBz - Chinese Teaming/Hacker Invasion - REPORT ALL","Greed can get the best of us - 4K Wallpaper Fanart","Add spectators count for active players","Just wanna say that I'm a god","PSA: Screenshot all your settings","This ones for riggles","0 HP and I was still alive. LOL","Does any1 else always get weird queue times? sometimes 20 minutes for games? I play mainly at night.","FPP queue bugged, no matter which server i pick up.","Got killed by a silent grenade that landed it front of me but made no noise. Happened to anyone else? Video linked.","“Give us a more stable game”","Is the lobby bug ever gonna get fixed??","PUBG voice chat doesn't work?","Are these xbox economy changes coming to PC also?","I see Anti Cheat is working great","Woah! What the hell is going on!? Worst desync I have ever experienced since update. Just me?","I want to thank PUBGCorp for teaching me something new.","Mod support","PC Players: Live server maintenance is now complete and the new leaderboard season has now started.","PUBG Radar Official Community Rankings","Am I insane?","Throwback Thursday And Also My Birthday: PUBG Cinematic Music Video - Down We Go","Despite early signs of growth, PUBG is still rapidly losing players","Streamer is caught off guard after being killed (forgets his host sound)","If it possible to use the AKM as a sniper?","Can you stop this season nonsense","I probably was reported after these snipes...","PUBG Friendly Fire BS!","My adventure so far.","31 KILLS! 3 WINS!","Arrow, the Best SR","Implementing Strategy To Get EZloot","3 vs 1 Clutch D:","Map Idea: City map 2x or 3x the size of Los Leonas","I'm generally terrible at sniping, so this made me super pumped","Disadvantaged and Out-Gunned. Positioning still wins the day.","After watching wackyjacky's beryl test, my assumption has become reality: they stealth nerfed the recoil on the gun","Desync is the greatest.","I'm hosting an online Tournament for PUBG Sept 2nd","JUST PUBG WORLD - how the grenade and the glass work together &amp; succesful kill","Season 8 &amp; Desert Knight Hightlights","Death From Above","If we can't trade items to other players, why is there still a 1 week sell hold??","Why did I reload........","[NEWS] PTS + Xbox 1.0 Walkthrough: G-Coin &amp; Crate System","This Insane Kar98 Quickscope Headshot","Another PUBG Compilation - Pistol Squad wipe, Running SR Head Shots and more!","My groomsman cake - My wifes mother dropped it, nobody got loot 😥","Reviving and Desynce worse than ever?","Let us throw apples through peoples legs again!","Just bought pubg on steam, should I download the test server and experimental server ?","PUBG crashes as soon as entering a lobby - MemoryLeak in FAsyncLoadingThread?","Reason 101 why you should never stick together","BlueHole should activate a system only those players who have Steam Guard on their steam accounts can play the game.","Buy a gaming router, it will make a difference. It did for me.","The Beatles, Vietnam, hide and seek, the bush... This clip has it all.","Yesterday, I peaked. I hit my first turkey as well as having 6 wins out of 12 games","Does anyone even play third person anymore?","Me and my squad were T posing on the menu screen","I can't get this game to look decent. Is it my old specs or settings?","Game preview","Miramar northerner circle EVER FR QC","Queuing duos not working?","\"FIX PUBG\"","Battlefeels 43 - Anyone know this guy?","If NVidia develop the green screen to be better, we can probably end up making our own freestyle settings to produce our own \"nightmap\"...","Fix PUBG Update - Report Feedback System","For the love of god, can we please play Erangel sometimes?","Insane Crowbar Kill","Can't Get Into A Match","It just hurts the soul.","TWITCH PRIME ANIMATED!!","Not possible to play war mode with friends?","What happened to /u/pubg_riggles?","Top right button in custom game","My game crashes every time I try to launch Replay","Update size keeps increasing","Does anyone have good NVidia Freestyle settings they wouldn't mind sharing?","Ranked Seasons","How to achieve 144 FPS @ 2.5k resolution?","Me and my friends love driving as much as possible. It leads to some dumb moments!","How is the new HRTF?","I think he lost his soul.","To the guy who once told me that high ping is an advantage","See ya losers hahaaaaaaa......","I like starting drama between friends","Hwat","50/50 on buying pubg","Season 9 / SOLID START / PUBG / Road to 1st Chicken Dinner Dinner (Highlights) / Clutch play 2v2vME","Peak Advantage","Fly problem","Random 4 x 4 Sections on Mirimar and Erangel?","We’ve came so far in a year","8 man teams or “Metal Rain” needs to happen more","My newest montage is up! PUBG Montage #3","Welcoming Wednesday - Community Questions &amp; Answers for Newbies &amp; Pros Alike! - (August 29)","PUBG Roadtrip Going Wrong","😍😍😍","WackyJacky's Beryl M762 guide","When You’re a Weeb That Plays PUBG","When you're hard at work screwing the people who have to cross to military and things go horribly wrong","So is this player banned for good or no?","Cool guys don't die by explosions","Breaking Down the New Training Mode","PUBGFunny.exe","Is it just me or the NVIDIA update made this game smoother?","Razer Kraken 7.1 on pubg","A buddy was the best man in a wedding. Rings came in a care package!","Dont mind me, im parking my bike.","Stupid mechanism when ending matches","ADD GUNS TO WAR MODE","Johnny Cash would be proud.","He should be dead? Explain. Just curious.","When the Squad asks what I've been doing all game. - 4K Wallpaper Fanart","For all the good things and all the bad things I can say about Pubg, I will probably never stop playing it.","Nailed it!","Do a barrel roll","Seriously, like seriously fix the game guys! What is this...","Beryl m762, QBZ, Or m416?","Unstoppable Assault @ Bootcamp","Converting Rainbow Six Siege sensitivity to PUBG?","An issue I’ve witnessed I haven’t seen mentioned on here: Silent Grenades.","Swift K98 2K","Sanhok ruined PUBG","Buggy hitbox while players are vaulting and getting out of prone.","Just some of our funny and not so bright moments on the battlegrounds.","Temperamental 'Night Mode' via Nvidia Game Filters (Album &amp; Settings in comments)","856 mb update?","Issues playing in 4K thru HDMI","When it's the start of the new season and you just can't catch a break.","I just got an update, what's this update about?","PUBG Twitter: \"An issue was discovered which caused HRTF to not apply correctly to footstep audio. A hotfix has recently been applied to the test servers\"","Update on state of the OC servers...","tickrate at the moment?","After 600h my best play ... im no shroud !","Client side hit registration?","Maybe ramming them at full speed wasn't the best idea","Who else believes that there are a few weapons that need a second look?","since last 2 updates you cant prone on hills or parts of the mountains where you should be able to","Game not loading while alt+tabbed","Car Surfing, Frags and Mishaps | PUBG","Not sure if this is where I should post it, but I am quite a bad player, so this shot felt really good. Thought I'd share it. (424M, my personal record)","I'm unable to find a match in SA server. This is day 33. PUBG support said they are working on it. FIXPUBG","Saved by Level 3 Helmet, then KOBE","This is why you should practice eyeballing distance.","I have 15.3 GB of update pending as I haven't played PUBG for past 2 months and everytime I try to update it resets back to Zero!","When queuing up with randoms gets you a W!","Shroud's PUBG cm/360","Leaked pubg update?","Did anyone else get an update? ~856.8 MB.","Crazy SWAT-like apartment push from StarSeries i-League","Seven Crossbow Knocks Back-to-Back (Warmode)","TFW Kar98k headshots are not enough","PUBG Good Old Days PepeHands","I posted a video yesterday of a hacker but I was highly downvoted for it. I was told I don't know how this game works and he is legit. So I got the report back from PUBG. #WeGotEm. Evidence video in thread and proof or ban. Maybe if you see next time a no recoil hack you would know now.","Deadmau5 Hilarious Moment when Trolled by his Teammate","Test servers live during maintenance?","Gun put away when vaulting *BUG*","1080 Ti unable to load into game","Shark Bite and Turquoise Delight Kar98 Skins in-game?","Unreasonable negative feedback?","PAX Broadcaster Royale talent announcement","I get a head shot on a level 3 helm and no aim punch is applied...","...but does ChocoTaco know about this?!","Bush strat doesn't always work out the best...(usually though...)","PUBG's post processing effect at it's finest.","Pretty lucky, but 3 headshot knocks in about 1 second","Did the VSS spawn rate get buffed? I keep finding them every single game now...","Should PUBG Corp. buff the loot tables? VOTE NOW!","When is the training ground live?","Woke up inner Shroud reflexes while playing last night.","Oldest trick in the book","PUBG - Odd Crashing Issue","PC Players: Live servers will enter maintenance for 3 hours at Aug 28 5:30pm PDT / Aug 29 2:30am CEST / Aug 29 9:30am KST. The current leaderboard season has now ended and matches are currently unranked. Once maintenance is complete the new leaderboard season will begin.","Feel very pleased with my random jump :)","I got stuck because I didn't know there were stairs there.","Quick question about newest download","Worked with what i had","How to include the old maps in mini royale","Revive bug is back","Taking speeders out in Severny County. Another group of criminals off our streets.","Fix the M16","Buy now or wait for full release?","Where did my bullets go?","What is this?","I want to get good at PUBG","Why do some regions prefer TPP and some prefer FPP?","Anyone having issues with micro stutters?","Keep 'em coming! Quad Kill","LOL accidental vehicular homicide","Suggestions for Custom Games","Gun jamming??","TIL School's building (and many other sites on Erangel) is based on buildings close to the Chernobyl disaster","You can ADS while vaulting, but landing takes you out of ADS? HMMmmmm?","Teleportation on it's best","Hunted for 5 minutes /w only 18 rounds. A Survivors Story.","1 Shot 1 Kill + Bonus Vengeance.","Custom game settings string.","It might not look like it, but this is what an ideal crossbow play looks like.","Host connection lost in custom games.","What happens during server maintenance? Hot Fix Question.","When they're waiting for you to peek left or right.","This sums up my PUBG skill son most games - 4K Wallpaper Fanart","Are you kidding me? - Streamable","Twitch Prime help","My Experience on PUBG in One Sentence...","The only thing I will pay for.","Ninja? I think not 😂","Getting a 13 Kill Duo Win w/ My Dad @SLYOLDGUY on Stream! PUBG on Xbox","Render bug or ?","I've found some sneaky spots before, but this is by far the sneakiest!","What has changed in this game since March/April of this year.","SLR is GOD 3 Kills for the Win","Issue/Problem Help","2nd Time with Perfect K/D (squad game alone since first circle)","Pubg freezing","Speed Penalty for different level bags","Since yesterday I spawn in the water at the starting place most of the times","Messing around with replay mode a bit, let me know what you think?","No Mas Polio","Fumes for Bullets Result in Triple Kill With Pistol Finish - PUBG (Squad)","PUBG won't start?","The best thing to come from Insomnia63","Silent buzzing while playing PUBG","The middle guy was a sponge! Triple kill","Accidently deleted E-Mail with FACEIT Closed Beta Code...","Less people hot dropping?","My PUBG experience today.","Update to Test Server 2.1gb","Clean 3k squad wipe","What's going on with matchmaking?","Can’t load in the plane on Miramar only.","The atmosphere in this game needs to return to its Early-Access feel","Cant activate beta code","Network lag followed by teleportation?","Another update, another broken element. Sound is completely fucked.","K98 Headshot followed up by a perfect grenade.","I started streaming for moments like these.","I’m coming over guys!","PUBG - FUNNIEST MOMENTS","Is this P2W, how does he have a shield, SMH Bluehole!","Whats with the long wait times?","Mini royale city map","Mods can we please have a \"Fix low pop server suggestions\" megathread?","First shot","Well... ask and you shall receive","Erangel and Miramar loots are totally fine, stop it","The Beryl Prevents Leaning - BUG","This guy killed me and I thought: “wtf, he must have no HP left” little did I know, I was right...","Close only counts in horseshoes and hand grenades","Whistlin Pete","Combining Erangel and Miramar into the \"Battle Royal\" mode in game selection is not \"saving\" Miramar, It's killing Erangel.","Got my first ever crossbow kill today.","My Video Editing software automatically added music to my one-round roadkill montage","Suggestion: 15 things I'd like to see in PUBG...","We love each other... but this is a Battle Royale and only 1 can live :(","A few Thoughts after 400 Hours","When teammates decide your fate","Clutch 4v1 Squad Wipe (very messy)","2 fingers for quick tapping?","PUBG Twitch Rivals - Game 1 w/ 10 POVs! (inc. Shroud, Just9n, Choco, Swa...","Vehicle Reactions - Fantastic aproache","Falsely Banned. Now what?","WTF just happened?!?! I love this game for moments like this!","Anti bunny hop","Next stop ... Top 10","When playing random squads check your teammates stats","A video dedicated to player \"a1mkeyyy\" (maybe YOU will see this)","Since the last update I can't play anymore, where's the \"Fix pubg\"?","Solo FPP was dead for about 2 weeks ago on SA, a brazilian streamer decided to invite everyone to enter on queue, and...","I suck. How do I get better?","2gb update","pubg.op.gg no rating change?","Why these updates in Prime Time?","Ping limited games when?","Wait, can you actually talk to the person that killed you, for the rest of the game if you spectate him?!","QOL suggestion for Twitch broadcasts: map plugin","Why does this game put away your gun after prone/vault sometimes?","Me and the enemy both pulled out wrong weapons in close quarters battle","Why do we need 40 people queing to start a lobby?","Would it be possible to add a sling attachment for the buttplate that would allow you to run full speed with a gun out?","200 Kills in 10 minutes | PUBG montage","To All the Chinese Player","Anyone else getting this chrome glitch on Xbox? EVERYTHING is chrome, and shiny. While moving it's nauseating, and makes it unplayable because items and people blend in. Been getting it a lot lately.","Can't find any game at around 2:00AM PST for NA?","Sanhok - Amphibious Assault!","5th time today I've been killed out of line-of-sight around a corner. WTF is going on?!","Desert Knights war mode","Replays don't record the entire match if I stay and watch","Wait until TTS OMEGALUL","🍳PUBG CINEMATIC MUSIC VIDEO🍳 KANSAS - Carry on Wayward Son","Airdrop Plane - Directional Sound Issue - Anyone else?","It has now been 5 months since PUBG corp. announced they will test region lock. We have not heard of it ever since nor did we hear about another solution to battle high-pingers","4 shots/3 kills // Squad wipe with M24 // a very proud moment","All You Need is a 4x - m2kFPS Fragmovie","Do skins reduce recoil?","Hi r/PUBATTLEGROUNDS! Doing my Master thesis on esport, Please help me with three fast questions!","Had a 13 Kill Clutch, 1 clip of ammo in each gun, no health, no armor","Beryl has a wider target area than usual for picking up off the floor, obscuring other items from being collected.","FLICK IT / Lumi and Mimigirl both go down by the hands of ContaxS2!","Double barrel proved useless","RESYNC THE DESYNC...","Is anyone in NA TPP Top 10 LEGIT?","Partner: I wanna clear the top of this hill. Me: Got it boss.","This is how I lost a game the other day..","A1RM4X gets dropped on","Well. I called it.","Can the clipbrushing of rocks on Sanhok be fixed?","PUBG should create a permanent separate pre 1.0 version","I'm finally getting into the top 5/10 very consistently... A sign I'll have my first solo win soon?","I tried 4 games today, and quit cause game wouldnt start even with 95 players.","PSA: Players in your games can have 600+ ms ping","How is your experience playing SOLO FPP on EU?","Quick Chicken Dinner","So satisfying :)","Why does it like take indefinitely to find a First-Person-Game in the Asian-server?","WINNING WITH STYLE | PUBG","WackyJacky saddest desync","TTV.m2kFPS - 2018 Summer Montage","After being sprayed down in 2 seconds at 250m by a full auto AKM last night, this was great to see today","weekend montage","Still going up against teams of chinese teamers. These were 8 of the 14 visible. Reported and no response. /rant","A splash of nade , one sprinkle of kar98 action, with a dash of UMP bullets.","Don't have the camera pan up when dead - It allows dead players to make incredibly unfair callouts.","lmao, as a new player not changing from single shot is destroying me HAHA","My sneakiest kill yet!","Can i finish a game please without getting this","I absolutely loved the event, my buddies who struggle with fighting loved it to get some practice but boy oh boy the servers were absolute crap.","Died from... falling?","Highlights Compilation #2 - Fails and Funny Moments!","Two Nutty K98 Headshots","One Fever Crate + One Key","Tips please","Add stones/bricks that can be thrown to mislead where you are","Snow map announcement / teasers when?","World record jump. (&amp; other shit)","WHEN YOU GIVE PUBG ANOTHER TRY","1 bullet in the pistol magazine. Kill or die","Saw my opponents POV of my kar98 shot #FixPUBG","Massive frame rate drops?","Watching a stream on youtube how is this even possible at 1:30 mark?","when the servers are on fire","suicide caught in pubg","PUBG Daily Funny WTF Moments Highlights Ep 367","Did somebody order some headshots?","Should start with Pistols","agile and deadly","They can't even touch this, in a groove","Ez Read","Faceit servers","Found this crazy montage!","I thought this was cool little snipe out of boat","A free chicken dinner","Push to Talk not working","Still suck at editing. Still good at shooting.","Drive by","HP &amp; Intel PUBG Challenger Series Tournament Kicks-Off In September","my friend is a stunt driver","game intermittently skipping/ freezing the past 2-3 days","When you're so good you don't even look at the screen anymore","We are so cute in our death","Why don't we have an in-game text chat?","Do we have an ETA on the AMD crash fix?","PUGB Hub Stats and telemetry","Your ideal loadout?","PUBG 1v1/2v2","I'm trying to educate myself: should I be trying to get SR/DMR + AR every game? Or should I give SMGs a chance? (Are they easier?)","PUBG : Solo vs Squad | Best Sniper Kill Ever","SUGGESTION - Key for changing throwables without getting them to the hand or opening inventory?","Is this new? Jumping with the first crate drop?","SHROUD'S FAN FICTION - (PUBG Animation)","Health + Damage System Rework","fps","Game continues to crash after readying up/getting in game.","Channeling my inner Shroud!","Are hackers using bots, too, now?","Crouch glitch strikes again","A client-side online multiplayer shooter that doesn't allow us to see our ingame latency.","Well aint this some shit!","Me and a few friends have recently started playing PUBG again after a rather long break and we've stopped just after a week.","Character decided to hold the AK like a gangster","This shows the total chaos of PUBG","Anyone have issues with the Berry?","I can spray and tap fire really well with 5.56 ARs, but I can barely hit the broad side of a barn with 7.62 ARs... Tips?","When the Practice Mode is released, you better put some hours in... Because everyone else is going to, and the skill average is gonna skyrocket","A little AWM streak","What happened to the flipping over cars and diving through windows that was in the Climbing, Vaulting, and Weather Trailer?","Close quarters Pro-Tip: Suppressed snipers are looooong","Free-to-play weekend in the works??","I bought this game yesterday and i literally can't get into any solo games. especailly FPP on OCE","PUBG vs Fortnite Worldwide popularity chart","My duos partner was a bit nervous, until...","I just killed my mate who was on my back. #EsportReady","Funny Nade at StarSeries","PUBG Klonni's Best Kills Mountage w/ deadmau5 - monophobia","Bluehole should add an epic victory soundtrack when achieving the chicken dinner","Please reduce the loot on sanhok","Some friends were missing their shots. So I explained why. Guide on leaning with snipers.","Random 10fps drop in game","Everyone is throwing out idea's on their wish list - here's mine:","On a scale of 1 to 10, how mad would being the guy who died make you?","Something fun again: I made another montage of my squad being terrible drivers in PUBG...","Why do people have a second of invulnerability immediately after being knocked?","Since the Redzone is so good, I made a 10h Video of it","2 players teaming up with no shame","PUBG Vehicle physics goofs with 100% more water.","PUBG Kills comp - First time editing, feedback welcome.","Is OCE FPP SQUADS now broken to ?","\"I might martyrdom it\"","/u/DanBennett and his disappointing performance at Insomnia63","Vector Love","Double Kill under pressure","Ammo stacks in inventory","Why there is no Mini 14 in Sanhok anymore ?","Happy to see this happening, we got em!","It's time to buff the loot tables for Miramar and Erangel...","Another 4v1 Post","Almost didn't wipe","When you are distracted talking to the chat but your enemy potatoes","Early clutch, I ain't got nothin left","How many games you’ve played until you got your first kill?","It gets slippery in Sanhok when it rains...","Driving a 3 wheeled motorcycle is the best choice when you want to die...","Cinematic double Molotov kill (@9:30)","My CS skills finally paid off! (My very first shot in AWM)","PUBG ASMR","AWM CQB double kill (while a bit drunk)","Flying isn't going to save you.","Made this for my duo partner who is leaving the country for further studies 😁💓","Handgun","How to park on church with STYLE","When you're better at Rocket League than PUBG","You'd think I got blown up by a grenade","Allright pubg corp.","*Ass Clenches*","Pretty happy with this play on FACEIT (I'm the one coming out the window)","a little moment from my stream today","Hacker or desync?","Vertical Sensitivity Multiplier Question","Hit an amazing kar98 shot to win","I just stared, slack-jawed, at the screen for a while after this...WTF Hit Reg!?","How can players peek with only the tip of their head, whereas I need to expose enough of myself to get the barrel past whatever i'm shooting.","Just got my first ever pc in February, and just got my first game winning kill yesterday!","Twitch Prime Subscription &amp; crate","How the f*ck he killed me? Desync or WTF!?!","Duo killed my friend, just wanted 1 of them dead, vengance fulfilled!","Esports ready.","Shot some boat boys","8 kill Bootcamp rampage with the new Beryl M762","DirectX 11 &gt; DirectX 12?","Stupid Ledge","Well, this is an interesting new way to ride the motorcycle!","PUBG Keeps crashing after patch","So what happened to all that PGI love?","What the best upgrade i could do ?","BRING MAP SELECTOR BACK","Just another day in PUBG","The best PUBG team in the world | Everything OMG did to dominate #PGI2018","Fix the opening of crates.","You all seemed to love our plane tickets so let me show you the rest of our insomnia63 booth","Hi, my name is timbazi and I used to be an PUBGaholic.","[FIX PUBG] Make the crash reporter a separate program so I can restart the game and rejoin.","M16 Iron Sights is effective apparently","Declining playerbase - a discussion","Magic Punch reveals everything","Anyone have tips for solo fpp? Need some serious help.","Sensitivity Issues?","LAWL i just played FPP over TPP","Getting this message when you quit the game is like someone saying to you to wash the dishes while you're on your way to wash the dishes.","AMA request - why ruin everyone's game and play in a foreign region?","Is there any way to get the Twitch bath robe pack?","Three questions regarding the new training mode.","How long do we want to ignore the fact that PUBG lost 85 % of its playerbase in just 7 months?","War Mode + M249 = Kreygasm","4 Guys With Same name Teaming in Solos","Clean your PCS! Pure Happiness!!","Dreamhack montreal 2018","Heart attack?","Win counter in file?","500 hours in, I've not seen this happen before. Is this a new bug?","My buddy spawned in under the map. Then his next game crashes. Does this happen a lot?","1v4 Clutch against all odds","Can we remove gun parts/backpacks clipping through walls?","Opinions on xbox.","Why is there no sportmanship in PUBG.","What's wrong with this game?","Kimspiracy, if you questioned this shot, it was a little nutty.","Practice against bots for the new shooting range","More like \"ThatOneHPGuy\"","Please Fix This Immediately","Sunday Dinner Megathread - Were you a winner winner this week? Share your dinner dinner with us here! - (August 26)","The only time I've felt slightly bad for a kill lol. Poor guy was like a frightened animal.","When you have to leave your group, but it doesn't go as planned xD","Windowed fullscreen","Bug or hack? The pan saved his life...","Playing mobile, this mountain looks like E.T.","If the map is modeled after Siberia maybe replace some weapons with old ww2 soviet ones?","Why is it that every now and then when I get out of a vehicle, my game freaks out and then won't let me pick up anything, and if I open my inventory and try to equip anything it drops it.","THEY DIDN'T EVEN KNOW","A few requests from an FPP player","How do i set up my sensitivity","All for your entertainment :)","None of my friends care but I'm just proud to be this high and needed to show it to someone C:","iOS / Android server","PUBG community always ready to help &lt;3","The new truck on Sanhok is noticeably quiet compared to other vehicles","Favourite event mode ever?","iLame gives inside about trading in PUBG","All Death cams crashing to desktop?","After 8 seasons and 800+hrs, i finally made it to the top 200! What's your highest rank, and what's helped you improve the most?","The current situation with SA fpp","Am naked. Can still play. Error occurrd","AR's are for the birds.","“I’m getting shot from behind!”","Anyone else have issues with PTT in the main menu?","Another couple days worth of highlights","Backshooter decides to play solo","Changing username...","Fast And The Furious: BATTLEGROUNDS. COMING TO A THEATER NEAR YOU!","[QoL Suggestion] Can we have the small objects to be movable / destructable?","OCE on SEA discord players - Looking for more players","This happened in my game earlier and I couldn't stop laughing","brochacho","Keep em comin!!!!","3rd time seeing teamers in SOLO TPP EU.","Huge stutters, freezes only on miramar why? and any fixes?","HE GOT A HEART ATTACK WTF","LEVEL 5 Helmet ? blue hole please improve dmg dealing","Outrun style map","Is 1vs4 still cool? Here is a friends 1vs4 in competetive GLL","Pubg ban","Which would you rather have.. a good anitcheat and a game with desync or a bad anticheat with no desync?","Burn in hell...!!!","What turned a boy into a man. #GoodTimes","PLEASE KEEP REVIVES DISABLED IN WAR MODE EVENTS? Thoughts?","Is there something wrong with the servers in NA right now?","No shame teamers","PUBG is leaking!","A balanced way to buff the M16","Sometimes you don't have to hit your shots to be effective","PUBG Bike Fail","\"I'm gonna do something stupid.\" :D","anyone else notice this typo?","Double AWM Challenge","Are there really so few people playing the War Mode that there is a 6 min matchmaking timer? I find this hard to believe...","PUBG - FUNNIEST MOMENTS COMPILATION # 4","What happened to this game?","its me again talking about smokes @pubg_hawkinz","Remove aim punch from the game","Anyone have link to video of car hackers remotely controlling car for final kill?","QoL Suggestion: Play a short sound when there is not enough space in your backpack for an item.","Everything happened","Please add old map select","Why is the movement in this game so janky. (Rant)","¯\\_(ツ)_/¯","Well this is new","Fix PUBG","Does anyone else have extremely long wait times trying to play War in the morning? NA*","Xbox 1.0 Ready","SR vs DMR in sanhok","He called my bluff","Clutch rescue by my duo partner","PUBG WONT LAUNCH","Peekers Advantage?","PUBG pro scrims 1v3","Issue with loading screen","Never Change, PUBG","Suicide jump Noscope win boi","That one prone guy + hilarious moments","esport mode has wrong circle settings","I added the QBU and Beryl M762 to the Weapon Stats Spreadsheet","1v4 Squad Wipe. Love the AK!","I know Playerunknown loves REDZONE","Sanhok Highlights Cinematic","I played at a PUBG event today! And i got a plane ticket to Erangel! Showing me my seat in the plane.","Double Pan Kill vs UAZ and Shotgun Highlight","2/100 after 50 minute queues","Just a good 8 kill streak from The new event mode.","Love this game","when my squad lets me take the wheel, we become Violence.Speed.Momentum","BUG Spawning without my cloths","Yeah well, I didn't want that one.","Teamkilled 3 times by English speaking players in 25 games of NA squad FPP","Is anyone else better at this game drunk?","....and im done!","[SUGGESTION] Remove RNG redzone and make it a Zone strike players can pick up from crate drops and use effectively.","Bullet Proof Hay Bales Tested IRL! - By DemolitionRanch","How did this not kill him?","Can we get another 8-man squads/flair gun event?","It wouldn't even be this game, it's hilarious","Big thumbs up for Bluehole from me!","Stutters when getting hit were caused by...","PUBG on GeForce Now works with controller?","First the punch, then the grenade. Nice friends!","If you die you can still place a marker on the map.","TPP parachuting glictching out","Welcome Back !","Ok ok, here we g... ahh come on","You Are Not Alone on Miramar","Sudden drop in fps from 100+ to 10-30","Feeling like Hackers have become WAY more common since the latest update.","Pubg on Xbox one","Killing Montage PUBG","Still waiting...","Warmode: FPS drops when getting shot?","Four Man Squad Wipe","So the war mode in Miramar destroyed my hard drive","You know you’ve been playing too much when...","[BUG] BP / Wardrobe missing","Percentage of players who actually bought the Sanhok Event Pass","This sub just gets me, sometimes.","why does the beryl have the same silenced sound as the AK?","When predicting the enemy lands unfavorably.","Queue times 5 minutes plus, requires \"magic\" to queue","1-man predator HUNT EM DOWN","Shruod | PUBG Solo | 20 Kills | VSS Only","You okay there buddy?","Wanna go for the airdrop?","What the fuck is this?","WE NEED MORE (AND MORE) SKINS","9 Kill FPP Duo win on Sanhok with some short Highlight clips.","How bad is the red zone?","taking geometry in school helps in pubg","Going ham/chicken","PUBG ruined Fortnite for me","It's all fun and games until a car blows up.","*input Mario jump sfx*","My first time getting 2 kills in 1 shot....i guess...","Custom Games minimum players should be 5, not 8","Very satisfied with the Beryl M762. Although the recoil is surprisingly high, it certainly needs to be when the gun has a groza level TTK","To the squad that just rode me down (FPP NA). You were both the most impressive and terrifying force I have ever come up against.","My Duo Partner and I broke into the top 1% for Duo FPP.","5 Downs 4 Kills 2 Different Squads WHAT is going on?! - I only saw 1 squad land :'(","Lucky...","An absolutely mental bug almost got me killed","Patch #20 has introduced a number of serious bugs.","Will it run?","Got to love these moments","Super long loading screen going back to lobby","Prison Break Mode (Concept)","The only chancee to redeem yourself when getting shot in the back is having a fullauto MK14","Ironic","The Beryl iron sights does not line up with the crosshair (middle of the screen)","PUBG Mobile Worst Glitch/Bugs:- Inventory Bug","Chicken dinner in Sanhok -Finally The Sanhok Map has arrived - 0.8.0 Beta PUBG Mobile - Download Now","QoL Suggestion: Change the red zone indicator to green when in new zone.","Suspicious bushes (@ 4m,31s)","I got killed by a guy who wasn't even looking at me","War mode sucks","Why do cheaters cheat in OoR servers but not in their home server?","Death cam usually shows bullets missing you?","DrDisrespect teases his new PUBG tournament - “CODE RED”","1000 punch man (hack)","Who doesn't like a good vehicle spray down? - 3 More EZCLAP","Have I become Moses?","Add a (distance) tag to all kills above 500 meters","I bought an SKS just because of this game","Crushed his dreams before he landed.","Esports ready. Blinded by the liiiight","StarSeries i-League S2 Viewer's Guide","Did riggles quit?","Will this computer be good enough to play pubg with decent detail","Semi-auto to auto","Is it just me or do you experience increased desync since latest patch?","Colorblind Struggles","Shroud Reacts To \"Random PlayerUnknown's Battlegrounds Bullshittery\"","I AM THE BEST SNIPER IN PUBG","They thought they were in the clear. 650~ meters. SLR is a beast.","That thing we've all tried in our most desperate hours even though we know it never works... I present... jumping over a car.","FaceIt Beta","PUBG clutches","lmfaoooooooo","Always keep your eyes on the road, my mama always said...","PUBG - MOST FUNNIEST MOMENTS COMPILATION # 3 (2018)","BEEP BEEP!!! GET OUT THE WAY!!!!","StarSeries &amp; i-league PUBG | Day 1 has started!","SALTY SATURDAY - THE SALTIEST MEGATHREAD OF THEM ALL - (August 25)","Let us lock weapons in our inventory","Request for help - Wrongfully 'in-game' banned","Suppressed AWM 15x Scope 700m Double Headshot Doesn't Improve Team Moral - PUBG (Squad)","STOP GIVING ME LOCKED CRATES","PUBG HongKong Invitational! Team Liquid Got the Game 1 Chicken Dinner!","Q: Do PUBG servers run on shared AWS EC2 servers?","FACEIT games give you proper Battle Royale experience","I shot my shot and I missed.","Decrease fog duration, increase intensity.","Realistic improvement for vehicle fights/ general survival odds","Sound Design, specifically where enemies sound like they are, has deteriorated to near unplayability.","Is it worth holding on to the wasteland set?","Ashek is an animal","Why do dead bodies dissapear?","Controller Disconnect Error","Faceit invite giveaway.","Worst experience yet.","Bluehole and community apretiation post","CONCEPT ART - Snow Lobby, Night Map, New Vehicle &amp; More.","Vaulting lvl 3","Man i wish the training map can be used offline too","Highly Skilled Driver Takes Out Choco","[WONDERING - FACEIT] Wtf about these circles ?","Is there any way to only play Erangel?","Why the hell do pans block AWM shots?","PUBG Oceania completely dead?","INSANE SCHOOL WIPE","ONLY SHOTGUN CHALLENGE at Twitch Rivels - Highlights🔥🔥 ( Never seen something like this 😂 )","Set team colors based on the player's name, in alphabetical order. This means that each player has the same color as the previous game if you are playing with the same people.","The new scooter can go through doors","For all Kar98k fans","Decided to try TPP solo today instead the usual FPP","Experiencing bug where the other player doesn't appear to have a gun, but can still fire.","Paranormal Activity","Two jackets datamined","EPIC WAR MODE GAMEPLAY","Handmade map of Erangel by Basil, the Scribe","okay.","Intercepted a vehicle that was about to run over my friend.","Double Airdrop Chicken Dinner","PUBG Servers bad or My PC?","We're going to \"Fix PUBG\".","When two noobs snipe","On The Road Again!","I have noticed a new cheat or bug since latest update: people running through walls/buildings","Great game","Why I love the VSS","Someone should create \"Make PUBG great again hats\"","just9n vs LURN and Wadu featuring 6 9mm","Found the bang bus in the world of outside","C:\\ PUBG.EXE HATE ME","After firing a naked beryl for the first time while standing..","Wow Ashek ranked #1 PUBG streamer based on stats past 10 days","How can I get an Extended version of a Replay of one of my games?","So... I'm terrible at this game. 750+ hours in and I'm still this bad. WTF should I do?","AHGL PUBG Looking for potential caster to stream low level comp maps on weekends","Is there any new Information about the 3D Marker?","Crossbow knock down while getting shot at the same time - I received no damage.","Friendly reminder that OCE servers are still broken","We need a Desert Eagle. One shots up to level 2 helmet.","I want to play Erangel","Recommendations for European Spanish PUBG streamers?","#fixpubg 's crash reporter","The Xbox one subreddit a literally what we where posting a year ago.","Somebody finished downloading the cheats","Game crashing non stop","Meme:RTX 1080ti PUBG Performance","Saw this on a Discord - PUBG seems to HWID ban cheaters now. 👌","How to communicate with a foreign teammate","I'm having a beer with ya all while playing walking simulator","Downed upon impact followed by hitting the car head on","I thirst your friend, you try to thirst mine. My inner demons are very pleased.","The most annoying phenomena in Pubg - When your enemies suffer situational blindness","French player Dahmien7 and Shiv just won 83.102$ at the Omen Challenge !","This weapon really needs a buff, as it stands it isn't worth the time to load in the first couple of seconds of a match which is the only time pistols can be considered anything near useful.","Pixelated effects (bluezone, bullet tracers, sparks from hitting metal, etc.), why does this happen?","I hate motorcycles","Don't try to revive a teammate near doors :(","Finally got another Winner Winner Chicken Dinner after a couple months of bad luck","Typical Winchester (in my hands)","FPS Optimizations for Competitive matches","This doesn’t need to be upvoted: I am trying to figure out if what I heard is the truth or not, does the Thumb Grip boost ADS speed?","Blueballs simply has the best servers","anyone know how to fix the crashing?","What is your go-to general purpose scope?","Tasty transfers wipe to cap it off","The state of this game is embarrassing","Desync? What Desync?","Can I play via Family Share if I use the same character as the owner of the game?","Why do people still play this game?","We should be able to see the gun pool in custom matches before joining.","Beryl M762 | PUBG Cinematic Play","55 yo Australian biker streamer (help him out)","Low fps","PGI Hacks? Weird scoping + super fast Scopechange 8x - - &gt; 4x Can someone explain this to me?","Beryl M762 4x spray !!","Found the R1895 revolver irl (sorry for the noise in the pic)","Sad that i spent my birthday on PUBG. But this made it better.","Lost connection to Host in War Mode","\"The 10 Piece\" - A Cumbii PUBG Montage","sg.ResolutionQuality","10 Minutes of SQUAD WIPES","Perpendicular Parking","new boomerang bullets?","[PU:BG]PLAYERUNKNOW BATTLEGROUNDS[OG SLOTH]","If I have a 6x on my gun and a 4x in my (full) inventory, and I swap them, it shouldn't drop the 6x!","When you have no resources in the end game, you know you've had a fun game.","Trying to die? Don't do Tommy only...","It is time to fix the boat and jet ski...","Quick snipe for the Win!","Why you should always close doors behind you...","Day 2 of having a *specifically* 10 minute 40 second queue. AMA.","I didn't realise they added stealth Trebuchets to the game...","4x Madness","Qbu recoil is ridiculously easy.","Double double-tap in reverse","If you are going to give us locked crates just give them to us CS:GO style","My buggy became one with nature","Everyone who need FACEIT beta","ERASUS - A PUBG MONTAGE","Event mode broken? (crashing or \"lost connection to host\")","Game lags during fights","Friends game won't update","De-sync is still horrible.","Nice aggressive play by Holo for final Twitch Rival game today","Steam displays that Im playing PUBG after I close the game?","Those snipes...","I made a video on the new map sanhok.","Little spot for sniper","Jump inside? That easy? ReallY?","Help please! Master Sound coming through headphones just can’t hear team chat. Microphone not registering since the newest patch.","Poor Guy :(","The key guide is not dynamic so if you have any custom binds you won't see it there. Why?","Is anyone else's in game chat still broken?","Fps drops and stutters?","THE DUDE WAS Trying To Be FUNNY","Kavorca's Kobe Omen Challenge Day 3","Probably the only time I’ll ever clutch a win this good","My girlfriend sneezed and I died","Martyrdom","I found a lvl 0 helmet.","[PUBG] Frag Compilation - 01 C&amp;C Welcome!","First attempt at making a Montage video - what do you think?","They Said to Disable Multi Threading to prevent Crash","I was just trying to die","OZ_2005 - YOU ARE A HERO!","Show the amount of current players searching for a specific game mode on each region.","Doc has an announcement","3 Men Dead Fast in Bootcamp","The only positive attribute to the red zone is the noise cover it provides. The noise cover can be kept even if we remove the red zone.","There was an attempt.","Oh S**t","This weekends Event Mode in a nutshell...","TFW you feel confident you talk crap and then get owned for it","any germans play faceit?"]