["Weekly /r/Games Discussion - Suggestion request free-for-all","/r/Games - Free Talk Friday","PlayStation Plus Free PS4 Games Lineup September 2018 | PS4","Nintendo triggers takedown of 11-year-old tool used to build Pokémon fan games","Spelunky 2 - Gameplay Trailer","Divinity: Original Sin 2 - Update #48: The final update","Denuvo: \"There is no uncrackable game. What we do is protect the initial sales\"","Yakuza Kiwami 2 survey suggests possible localization of Edo period spin-offs, Ishin and Kenzan","Yakuza Studios new IP to be announced next month, three years in the making » SEGAbits","The Fallout-Like RPG Wasteland 2 Is Coming To Switch This September","Gwent single-player is now Thronebreaker: The Witcher Tales, a standalone Full RPG","Marvel’s Spider-Man - New Trailer","Free update to Furi on Steam introduces “Invincible Mode.”","Open-world survival game The Forest launches November 6 on PS4","Battlefield 5 RTX Gameplay - A Stunning PC Ray Tracing Showcase! [Digital Foundry]","Rocket League - Patch Notes v1.50 (Progression Update)","Breathedge. Official Gameplay Trailer. Experience the life of a simple guy with simple needs who tries to survive in the depths of the deep space.","DRAGON BALL FighterZ: Cooler Breakdown ft. Maximilian Dood &amp; HellPockets","'We're Sorry': Riot Pledges Sweeping Changes To Address Accusations Of Sexism","The Good Life now has a publisher","Our First Steps Forward - Riot Games","Zero Punctuation : Unavowed","The Witcher Pen &amp; Paper RPG has been released on DriveThru RPG.","Rumor: Battlefield V Sales Boost Plans Include Making Battle Royale Free, Bad Company 2 Remaster","SCUM - Welcome to SCUM Island","Battlefield 5 Rotterdam Gameplay - New Map, Weapons and Features.","Jurassic World Evolution - Free Update 1.4 Coming September 13","Remedy has announced Vanguard, a \"development team [that] will act with a startup mentality\", and is hiring programmers and designers","Bastion &amp; Transistor are coming soon to Nintendo Switch","Two Point Hospital Review - Worthabuy?","Total War Saga: Thrones of Britannia - Allegiance Update","Lovecraftian preview head-to-head: Call of Cthulhu versus The Sinking City","Disgaea 1 Complete - Earth's Mightiest Heroes? (Nintendo Switch, PS4)","Action RPG Lapis Li Abyss is coming to Nintendo Switch and Playstation 4","Pearl Abyss / Kakao Add P2W items they previously promised to never implement to Black Desert Online","Project Borealis - Update 4","Silent Hill 2: Enhanced Edition Demonstration Trailer (Mod)","Into the Breach - Available on Nintendo Switch today!","Call of Duty: Modern Warfare 2 is coming to Xbox One Backward Compatibility today","The Sinking City | Silence is Golden - Commented Gameplay","Langrisser I &amp; II launches February 7, 2019 in Japan","Persona Q2 New Cinema Labyrinth PV#02","Untitled Goose Game - Teaser Trailer - Nintendo Switch- Coming Early 2019","Psychonauts 2 Update #8 Psychic Powers","Mineko's Night Market - Teaser Trailer - Nintendo Switch","Persona 3: Dancing in Moonlight | Persona 5: Dancing in Starlight - Bundle Teaser","How to Animate a Smash Bros Character - New Frame Plus","Family Man - Reveal Trailer","Fire Pro Wrestling World - Review Thread","Yakuza Kiwami 2 launch trailer.","Hyper Light Drifter Special Edition - Launch Trailer Nintendo Switch","Bringing Natural Selection to life in videogames","Dragalia Lost Mobile Direct tomorrow at 8:30pm PT/11:30pm ET","The Story of Why I Left Riot Games - Barry Hawkins","Onimusha: Warlords - Announcement Trailer","DRAGON BALL FighterZ: Cooler Gameplay Trailer | X1, PS4, Steam","Shovel Knight Showdown Multiplayer Battle Mode Revealed - IGN","Sony Interactive Entertainment and Ideas United Announce the Release of the PlayStation Emerging Filmmakers Program Original Pilot Episodes","Donut County’s Ben Esposito talks diversity, game development, and elaborate Enya references","Dragon Quest XI: Echoes of an Elusive Age - Review Thread","LGR - Maxis Collection and History (Part 1 of 3) 1984-1993","The Universim came out in early access a few days ago and I haven't seen much discussion. Has anyone played it or have any impressions/thoughts about it?","Why From Software chose Activision to publish Sekiro: Shadows Die Twice","Rec Room Now supports VR and \"Screen Mode\" (Flat/Non-VR) Cross play","Marvel’s Spider-Man – Post Launch Content Revealed","Rune Ragnarok Trailer: Rise, Warrior (Steam Early Access September 19th)","Destiny 2: Forsaken - Launch Trailer","Sagebrush. A small Indie adventure game set in a cult compound in New Mexico. Releases 9/18/18","TowerFall is coming to Nintendo Switch on September 27th with 6 player battles","Samurai Gunn 2 - Teaser Trailer - Nintendo Switch","PS2 Classic Onimusha: Warlords Comes to PS4 January 15, 2019","103 - Gameplay Trailer","Parkasaurus - Official Date Announcement Trailer","Nintendo's small, obscure handheld -- The Pokemon Mini","Gran Turismo Sport August Update - 1 new track, 8 new cars. Content updates still free for everyone.","The Messenger - Easy Allies Review","Bungie ViDoc – Forsaken Launch and Beyond","New World Hands-on Preview - Amazon Takes a Swing at a Persistent, Living World","RESEQUENCED Gameplay Preview - New Sci-Fi Action Adventure Game","Cyberpunk 2077 Gameplay Reveal From CD PROJEKT Red","How World of Warcraft Was Made: The Definitive Inside Story of Nearly 20 Years of Development","Ace Combat 7: Kono explains about \"The Sky does not connect into one\" catchphrase found in the JP trailer. And talks more about the game's narrative.","[4K] Devil May Cry 5 Xbox One X First Look! Gamescom Demo Analysis","Forward Line: New world conquest strategy game. Check out the manual.","Dirty Bomb just launched into 1.0, here's a Retrospective","Nefarious Trailer","Warhammer: Vermintide 2 | Shadows Over Bögenhafen DLC Trailer","Shovel Knight Showdown - Yacht Club Game's Blogpost","The Oral History of Treyarch's Spider-Man 2: One of the Best Superhero Games Ever","Monster Hunter Generations Ultimate Launch Trailer","The Sonic Amateur Games Expo 2018 is Live","[Gematsu] Shin Megami Tensei V producer on development progress, potential Nocturne port or remake","Need to Know - The Mass Surveillance Thriller Game is now available","Green Hell Gameplay preview - Tutorial &amp; Survival","Guild Wars 2 Living World - Celebrating 6 Years of GW2","I don't think MOBA players are inherently toxic people. I think it's more that anonymous team-based competition inherently breeds toxic behavior.","Hover – Release Date Announcement Trailer - PS4","Mod Corner - Half-Life: Echoes","For Honor: New Wu Lin Hero Gameplay and Arcade Mode","CD Projekt Red Confirms Cyberpunk 2077 Optimized for PC, PS4, and Xbox One From Beginning","Xbox Live Gold free games for September 2018 announced","Experience Xbox Elite. Now available in white.","Far Cry 5: Dead Living Zombies Launch Trailer","SENRAN KAGURA Reflexions - Release Date Announcement Trailer (NINTENDO SWITCH)[NSFW]","TORN VR - Puzzle Adventure for Steam VR / PSVR released","Strange Brigade Review Thread","RimWorld Beta 19 - Polish the Cannons","Baldur's Gate Retrospective | A History of Isometric CRPGs (Episode 3)","Starflight 3 - Fig Campaign Announcement","Kirby Air Ride City Trial Analysis - GDJunkie","White Xbox Elite controller and Xbox One X are coming to stores","Treasure Stack Nintendo Switch Reveal","The Twenty-Five-Year Journey of Magic: The Gathering","Kingdom Hearts 3: Toy Story Level Live Developer Playthrough - Gamescom 2018","Steel Division 2 - In-Game Trailer","Sausage Sports Club Review: Fantastically Floofy Fun","Streets of Rage 4 - Reveal Trailer","Donut County - Review Thread","Halo: The Master Chief Collection - MCC Update","Video Game 'Dream Daddy' Launches Surprise Comic Book Series","Marble It Up! (Marble Blast spiritual successor) Announcement Trailer - Nintendo Switch","Steam For Linux Adds 1000 Perfectly Playable Windows Games In Under A Week","CD Projekt Red just went live with the title of \"DATA TRANSMISSION IN PROGRESS_\" probably Cyberpunk 2077 related.","The hardest part of SCUM was learning how to pee (SCUM First Impressions)","Official Call of Duty®: Black Ops 4 – Multiplayer Beta","Paid Loot Boxes and Loot Chests Disabled for Players in Belgium - General Discussion","Devil May Cry 5 is now officially confirmed to take place after Devil May Cry 2","This is my take on SuperHot VR","Victor Vran: Overkill Edition - Launch Trailer - Nintendo Switch","Rumor: Nintendo Switch Super Smash Bros. Ultimate Set Leaked In Europe | NintendoSoup","Rune Ragnorok - Rise, Warrior Trailer","Wild Arms: Million Memories Announced by Sony - Mobile Game","Spider-Man PS4 main story takes 20 hours to finish, day one patch confirmed","Why don't gamers care more about a company's working conditions?","Nintendo has confirmed that they will be releasing a special Super Smash Bros. Ultimate themed Pro controller","Valnir Rok Gameplay Trailer","Shadow of the Tomb Raider: Challenge Tombs and Puzzles","Tekken Mobile - Anna Williams (Reveal Trailer) - iOS/Android","DON'T GIVE UP: A Cynical Tale. A comedic retro inspired RPG about the cynical and hilarious realities of social interaction and confronting your inner demons. Demo available.","Marvel's Spider-Man (PS4) - Relationships Trailer","ASHEN | Gamescom Gameplay","Indivisible RPG - Gamescom 2018 Footage","Former LawBreakers Dev Gives Take on Why It Died, Cites Arena Shooter Gameplay Style Not “Widely Accepted”","UNDERTALE is coming to Nintendo Switch on Sept. 18 in North America and Europe","Was Majora's Mask 3D a Bad Remake? (N64 comparison and review)","Xbox All Access financing plan announced","2K makes changes to NBA 2K microtransactions to comply with Belgium and Dutch gambling laws","Obscure First Person Shooters: Wheels! (1998) Gameplay, a \"power wheelchair simulation training software\"","Fear The Wolves - Early Access Launch Trailer","Ace Combat 7: List of All 42 Confirmed Aircraft (2018)","SAGE 2018 - Sonic Chaos Gameplay Demo","Black Clover: Quartet Knights story trailer #2","Assassin’s Creed Odyssey: The Hunt for Medusa Gameplay Preview","Damnview: Built from Nothing Announcement Trailer","Project Hospital - Beta Hands-On","Warhammer: Chaosbane Gameplay Preview [German Commentary]","Report: Gunman Opens Fire at Madden Championship Event","Lucius III 2018 Announcement Trailer","Mario Kart Wii: The History of the Ultra Shortcut","Ori and the Will of the Wisps: New Features - Gamescom 2018","Marvel’s Spider-Man Action Sequence Breakdown","Resident Evil Outbreak: RE Retrospective","Hell Warders - Announcement Trailer","The Indie Post-apocalypse","Sparklite Teaser","Shadow of the Tomb Raider TV Spot: Become the Tomb Raider [ESRB]","DRAGON BALL Xenoverse 2 - Extra Pack 3 Launch Trailer | PS4, X1, PC, Switch","Nunu &amp; Willump Champion Spotlight | Gameplay - League of Legends","Video game music is just as good an introduction to classical music for children as a concert, arts chief says","Forgiveness - Escape Room Indie Game (Offical Trailer)","Gameinformer's interview with Ubisoft Chief Creative Officer Serge Hascoet reveals a few things about the AC franchise","The Music of Kingdom Come: Deliverance - Sounds of the Ages (Gameumentary)","How long it takes to unlock everything in Rainbow Six Siege, as of the Grim Sky update 2018","Imperator - Development Diary #14 - 27th of August 2018","Battlefield V will receive post-launch content roadmaps","Rocket League - Clubs: A Closer Look","IGN Full Strange Brigade Review","Devil's Hunt - Official Gamescom 2018 - Demo Gameplay","How Fallout 76 Can Help Us Rebuild West Virginia","Hell Warders, available for PC via Steam Early Access, is coming to PlayStation 4, Xbox One, and Switch this fall,","Microsoft is the right company to build the “Netflix of gaming”","The Fighting Game from a Racing Perspective | Forging the Level [DarylTalksGames]","Persona Q2 Shinjiro Trailer","The Commission: OC - Gameplay Trailer","[DEV] For those who loves challenging games, my game - Jelly Rescue","Now That Amazon's Pre-Order Discount Is Gone, Games Are Coming Back","Dragon Ball FighterZ - Scaling the Skill Room | PostMesmeric","Tokyo Ghoul [:re birth] Smartphone Game Heads West","Capcom: It Wouldn’t Be Totally “Laughable” To Remake The RE Remake","4Sight - Multiplayer Realtime Squad Tactics - Gameplay with Developer Commentary [German]","Esports Medal Inclusion for 2022 Asian Games Put on Hold .","Kingdom Hearts 358/2 Days - Clemps","Does anyone else feel like Fortnite (battle royale mode)'s challenge/store model targets addicts?","SoulWorker Haru Advancement","Accuracy vs. Overkill: An Overview of HistWar Napoleon","D.Va Nano Cola Challenge | Overwatch","Is CDPR Further Into CP2077 Game Development than it first appears? 2019 release on the cards?","Unavowed Review: \"Unavowed is a stylish urban supernatural fantasy that is touching, funny, endearing, replayable and above all, fun.\"","Fire Emblem Heroes - Legendary Hero (Marth: Hero-King)","Interview with Ethereal: Clash Of Souls Developers (Undying Games)","Marty O'Donnell just posted the full original recording session for the Halo 2 Mjolnir Mix","Gamasutra - Report: Analyzing player preferences from the US games market","Indiepocalypse Now. Mad Maxing Attention Economies In the Age of Cultural Overproduction","Windjammers 2 hands-on preview","11-11: Memories Retold - Gamescom Trailer | X1, PS4, PC","Weekly /r/Games Discussion - What have you been playing, and what do you think of it?","Why developers don't remove Denuvo even after their games are cracked","Fez's Animated Environments","Why Fire Emblem is The Best Fire Emblem - BeyondPolygons","Tech Focus - Dynamic Resolution Scaling: A Great Fit For PC Gaming?","The Blackout Club Beta Gameplay With Developer Commentary","The Amnesia Collection is coming to Xbox One next week","Moving into the new generation, which gameplay system trends would you like to leave behind?","I never imagined just how powerful it would feel playing as a woman in Battlefield 5 | GamesRadar+","Fortnite Content Update And New Grenade Coming Tuesday","SEGA Live! Fist of the North Star: Lost Paradise and Valkyria Chronicles 4 Gameplay","Burnout Paradise Remastered is broken on PC","SOULCALIBUR VI - Azwel Character Reveal Trailer | PS4, X1, PC","Nihon Falcom Confirms the Next Ys Title is Currently in Development","How Hollow Knight makes backtracking fun - Chariot Rider","Resident Evil 2 Remake Devs Talk About Their Focus On Making Zombies Scary Again","Eurogamer - \"Super Mario Party's use of two Switch screens is a technological marvel.\"","Advance Wars - Did You Know Gaming?","God of War Case Study - Matthewmatosis","Grimbeard Diaries - Silverload (PSX) - Review","Yacht Club Games teases an \"all new game\" for Shovel Knight: Treasure Trove","Torchlight Frontiers - Hands-On Gameplay &amp; Impressions (Gamescom 2018)","The International 2019 to take place at Mercedes Benz Arena in Shanghai, China","Ace Combat 7 - Mission 6 \"Long Day\" Gameplay Analysis","OpenRA (modernized remake of C&amp;C, Red Alert, Dune 2000) - Playtest 20180825","Review- Etrian Odyssey Nexus","Enter The Matrix Review - Gggmanlives","Night Trap is Both the Lamest and One of the Most Important Games of Our Time","TimeSplitters creator interview: GoldenEye, Future Perfect, and the Koch Media acquisition","How Playing Video Games Can Shine a Light of Positivity into the Darkness of Mental Health Issues","Suda 51 Games | Almost Legendary","Deadly Individualism: Shadows of the Damned","The Ripper: The Visceral Games project that EA canceled","Disgaea 1 Complete - Persuade by Force (PS4, Nintendo Switch)","Fortnite separating PS4 Keyboard + Mouse players into PC lobbies in upcoming release (e.g. controller vs controller, KB+M vs KB+M)","19 Minutes of Biomutant Gameplay | Gamescom 2018","Nathan Wulf Talks About Lawbreakers, Radical Heights, and Boss Key Productions | Lion's Den","For Reddit Gamers: Do you think the game industry is saturated?","How did the Fallout games become such mainstream hits?","Virtual Reality On The Sega Genesis - The Story Of the Unreleased Sega VR Headset","How Fighting Games Are Carved Up To Extract Your Cash (The Jimquisition)","Ace Combat 7 interviews analyzed/commentated","Thief Arthur from Million Arthur: Arcana Blood has been announced as the first DLC character for SNK Heroines","Dota 2 adds new hero, Grimstroke, playable now.","Short interview with Ace Combat 7 producer Kazutoki Kono at Gamescom 2018","Million Arthur: Arcana Blood is coming to PlayStation 4, SNK’s Iori Yagami among announced guest characters","SoulCalibur VI Could Be the Last SoulCalibur if the Game Isn't Successful","Marvel Strike Force’s microtransactions go beyond the mobile standard","Epic's first Fortnite Installer allowed hackers to download and install anything on your Android phone silently","Sonic Chaos Fan Remake Announcement Trailer","Spyro twitter reveals Elora design for Reignited Trilogy","Just Survive (formerly H1Z1:Just Survive) shutting down","Interview provides some clarity about how special weapons and customization will work in Ace Combat 7, and that Ace Combat 3 is officially considered canon again.","Persona Q2 Naoto Trailer","How Happy Lucky Lottery in Paper Mario: The Thousand Year Door works.","The Last Remnant will be delisted from PC storefronts on September 4th","The Story Behind DOOM's Cheat Codes - Codex","The Fastest Doom - GBA (The Speedrun Documentary)","Warbringers: Azshara","How video games can help with PTSD, social anxiety, self-harm and general anxiety","God of War Development Diary: Building a Better Boat","Steam Link Android app adds touch controls (requires opting into Steam beta client)","Breast Physics Are Back in Dead or Alive 6, But They Will Be Realistic","Anno 1800 - Expeditions, Blueprints &amp; A New World","Nintendo Labo: Vehicle Kit announced for Mario Kart 8 Deluxe","How Fist Of The North Star Lost Paradise Is Changed In English","Xenoblade Chronicles 2: Torna ~ The Golden Country - Story Trailer - Nintendo Switch","IN student charged for posting video game of shooting zombies in high school hallways","Overcooked 2 New Game+ update now live","Why Perfect Difficulty Is Impossible","1 Hour Of UNSEEN Mount and Blade II SINGLEPLAY Gameplay - Part 1 -","Wario Land 4: Breaking Convention / GAMESD","What was your online gaming history like? And what do you think of it now?","Super Mario Party On Switch Won't Include Pro Controller Support","We're 2 indies and a community who worked the last years on a free VR sandbox universe, here's our new video. VR not needed, you can explore with WASD. Hope you like it.","Xenoblade Chronicles 2: Expansion Pass - Elma Trailer - Nintendo Switch","Drone Swarm Teaser Trailer","Dota 2's New Heroes: Mars &amp; Grimstroke","Multithreading - The Future of PA and Titans","Where The Hell Did 'Mighty No. 9' For Vita and 3DS Go?","Assassin's Creed Odyssey: Ep. 4 - Ancient Greece | Behind the Odyssey | Ubisoft [NA]","Forza Horizon 4's Minimum Specs Are Lower Than Forza Horizon 3 on PC.","Strange Brigade - Launch Trailer | PC, PS4, Xbox One","ACE COMBAT 7 PSVR | How Big Is VR Mode? Answered!","DualShockers’ Gamescom 2018 Awards — Ace Combat 7 and Devil May Cry 5 Fly High","Sonic Mania Retrospective - KingK","Ace Combat 7 - Gamescom 2018 Trailer Analysis","Cyberpunk 2077 is now playable start to finish","SNK Heroines Tag Team Frenzy Character Customization [Japanese]","F1 2018 - Launch Trailer","5 Reasons We're Hyped for Red Dead Redemption 2 (and 5 Reasons We're Not)","Welcome to Sikanda! A Lush Action RPG Inspired by the Likes of Zelda and Terranigma, Developed Exclusively for Switch!","Dungeons &amp; Dragons Birthright Gorgon's Aliance Review - St1ka's Retro Corner (PC / MS-Dos)","[Spoiler Discussion] What did everyone think of Guacamelee 2?","Dark Souls + Diablo 3 on Switch: First Look at Handheld Gameplay","EarthBound HD; More Ideas for New EarthBound Games — Mystery House | Gamnesia","RIDE 3 - First Official Gameplay Trailer","What Happened? - Final Fight Streetwise","Analysing Player Behaviour in Tomb Raider: Underworld | AI and Games","[GAMESCOM 2018] Call of Cthulhu 2018 – Gameplay Trailer","Hollow Knight: Godmaster free update out now on Steam","theHunter: Call of the Wild - Vurhonga Savanna Trailer","Pizza Connection 3 - Steam Free Weekend Trailer","Need to Know - Release Trailer - The Mass Surveillance Thriller Game","For Honor has Gone from 5k to 210k Concurrent Players After Becoming Free-to-Own on Steam","Devil May Cry 5 hands-on preview and interview – ‘we wanna make a game that has a real hard focus on action’","Super Mario Creator, Shigeru Miyamoto, Warns Gaming Industry: Don't Be Too Greedy","Hitman 2 Builds &amp; Expands on the Previous Game in Every Way","One possible huge impact RTX will have on future games, mirrors","13 Minutes of Metro Exodus Gameplay - Gamescom 2018","Division 2: Extra Stash Space is Locked Behind The Ultimate Edition","Yakuza Kiwami 2 - Review Thread","29 Minutes of Dragon Quest XI: Echoes of an Elusive Age Gameplay - Gamescom 2018","Destiny 2: Forsaken – Last Stand of the Gunslinger","NARUTO TO BORUTO: SHINOBI STRIKER - Co-Op Missions","Senran Kagura Reflexions launches September 13 in North America","World War 3 - 26 Minutes of Attack &amp; Defend Gameplay | Gamescom 2018","Dauntless: 3 Months Later","'Frozen Synapse 2' Melds Strategy and Tactics in a Political Cyberpunk City | Waypoint","Monster Hunter World patch 1.01 is now live, tackling various network connectivity issues.","Sword Art Online Fatal Bullet - PS4, XB1, PC - Collapse of Balance (DLC#3)","30 mins of Daemon X Machina gameplay from Gamescom (Nintendo Switch)","First look at Sekiro: Shadows Die Twice gameplay | VaatiVidya","Nintendo Labo: Vehicle Kit + Mario Kart 8 Deluxe","Nindies Showcase Summer 2018 - August 28th @ 9am PT (Nintendo Switch)","Insurgency: Sandstorm – Gamescom Trailer","Reigns: Game of Thrones coming this October","IGN Re-Review of Path of Exile (2018)","Official Call of Duty®: Black Ops 4 – PC Trailer","Bandai Namco’s revealed “Bless Unleashed”, a brand new MMORPG coming “first” to Xbox One next year","Uventa admitted on Steam with Windows PC launch","Why Microsoft bought Ninja Theory","Destiny 2: Forsaken – Gambit Free Trial","Gamescom2018 - SHOWCASE AceCombat 7","A Dead Space 2 Analysis. Taking a Closer Look at One of the Best Survival Horror Games Ever Made","A Plague Tale: Innocence Gameplay - Gamescom 2018","Where Have All The Demos Gone? - PortsCenter #58 w/ Ben Paddon","The big Cyberpunk 2077 interview [Eurogamer]","Dead By Daylight 3 Reasons To Play - PS Plus","Redeemer: Enhanced Edition - Gamescom 2018 Gameplay Trailer | PS4","Metal Wolf Chaos XD- From Software Interview","Creator of Fallen London and Cultist Simulator talks about lore dumps in games.","Final Fantasy Brave Exvius &amp; Deus Ex Mankind Divided collaboration : Adam Jensen arrives","9 Monkeys of Shaolin - Gamescom 2018 Gameplay Trailer","New game announced for Nintendo Wii (yes, Wii) - Nintendo Enthusiast","Making Games Better for Gamers with Colourblindness &amp; Low Vision | Designing for Disability (Mark Brown)","What It Was Like To Work On Final Fantasy XIV During The Launch Catastrophe","Windows Central: 'Xbox All Access' looks like a new subscription service with Xbox Live, Game Pass, and a console","Top 10 Towns - Easy Allies","Automachef - Teaser 2","Ubisoft: No New Assassin's Creed Coming In 2019","How Dead By Daylight proved analysts wrong and became one of the biggest games on Steam","Dead by Daylight | First Cut","Desperados 3 Gameplay Showcase - Gamescom 2018¡¡","What does that high score cost you? Why one in five gamers falls victim to fraud","VentureVerse: Legend of Ulora - Launch Trailer","Kingdom Come: Deliverance’s new DLC includes a lovesick fool and a cheating knight (10-15 hours, one DLC free)","Response from A Hat in Time dev about DLC","IGN: Yakuza Kiwami 2 Review","6 Minutes of Mount &amp; Blade 2: Bannerlord Campaign Gameplay | IGN","A look at new Officially Licensed Sega Genesis and Saturn controllers by Retro-Bit","Party Up Map Access feature for CoD: WWII announced","Star Citizen Gamescom Free Fly has begun - Try out the game until the 27th of August","Returning to No Man's Sky... Again (NEXT Update) - Writing on Games","Super Mario Party - River Survival Mode - Nintendo Switch","PUBG Training Mode Announced","Battletech - Flashpoint Expansion Announced!","Spacelords Out Now!","World War 3 raw gameplay - Levelcap","Overwatch Animated Short | “Shooting Star”","Takashi Mochizuki: \"Switch OS UI Session: in cutting player's wait time as much as possible, Switch's home menu design resources have less than 200KB. Amazing.\"","Nvidia reveals GeForce RTX 2080 performance numbers","Gabe Newell Announcer Pack - DotA 2","Darksiders III - Gamescom 2018 Trailer","Call of Cthulhu Developer Gameplay Showcase - Gamescom 2018","Rocket League: Progression Update Incoming on August 29","July 2018 NPD: Octopath Traveler and Grand Theft Auto V own the charts","Cyberpunk 2077 - Setting and Gameplay Info From Gamescom [VIDEO]","How the Tomb Raider games have worn me down and broken me.","Sekiro Shadows Die Twice - Closed Door Demo footage with Epicnamebro","Resident Evil 2 Remake – EXCLUSIVE PC Gameplay REVEAL 4K 60fps","Sean Murray On the Present, Past and Future of No Man's Sky","Spyro Reignited Trilogy - All Three Games Hands-On!","Bioware reveals the composer and the main theme for Anthem","A History of Cancelled Halo Games And Concepts - GVMERS","Torchlight Frontiers Gameplay Trailer","Cyberpunk 2077 Preview (Gamescom 2018 Demo Walkthrough)","Dark Souls Trilogy only available in the US and Asia according to Bandai Namco UK's Twitter account","[COMING SOON] Busan | New Control Map | Overwatch","10 Minutes of New Twin Mirror Gameplay (A new game from Dontnod)","[gamescom 2018] The Surge 2 - Gameplay First Look","Zero Punctuation: We Happy Few","Mutant Year Zero Gameplay Showcase - Gamescom 2018","Square-Enix’s Left Alive Is Still Alive; Five New Screenshots and Details","JUMP Force - Gameplay Mashup","9 Minutes of The Dark Pictures: Man of Medan Gameplay - Gamescom 2018","Analysis of Famitsu’s Article on Ace Combat 7: Skies Unknown","Official Call of Duty®: WWII - Shadow War DLC 4 Trailer","Blizzard Press Center - \" BATTLE FOR AZEROTH ™ BECOMES FASTEST-SELLING WORLD OF WARCRAFT ® EXPANSION EVER\"","SoulCalibur VI Locks Mainstay Fighter Behind DLC Paywall","Steam for Linux: Introducing a new version of Steam Play","SNK 40th Anniversary Collection - Psycho Soldier &amp; Athena (Nintendo Switch)","First Look at River Survival, new game mode for Super Mario Party","[GAMESCOM 2018] A Plague Tale: Innocence - Uncut Gameplay Trailer","Resident Evil 2 4-minute Gamescom 2018 Claire Gameplay","DF Videocast: GeForce RTX - Is Ray Tracing The Next Level In Graphics?","Age of Wonders: Planetfall - Dev Diary #10: The NPC Factions and PvE Diplomacy","After Stopping Pirates, Denuvo Plans to Catch Cheaters Too","The King's Bird Launch Trailer","Grand Theft Auto IV: A Criticism of Criticism","SSX Tricky vs SSX 3: Which Game is Better? [PART 2: Characters]","Shadow of the Tomb Raider – Smart and Resourceful","20 minutes of Diablo III: Eternal Collection gameplay (Nintendo Switch)","Cyberpunk 2077 quests similar to The Witcher 3 'in terms of playtime and complexity'","GOG launches the FCK DRM initiative","Xbox teases \"new reveal\"","Stealth Gameplay in Sekiro: Shadows Die Twice","Shigeru Miyamoto Delivers Keynote Speech For Computer Entertainment Developers Conference","Sekiro Shadows Die Twice - Gamescom 2018 Gameplay","DARK SOULS TRILOGY - Announcement Trailer | PS4, X1","Gamasutra - 2K tweaks loot boxes in NBA 2K to comply with new Belgian gambling laws","Langrisser I &amp; II full remakes announced for PS4, Switch","Halo MCC coming to Xbox Game Pass September 1","Devil May Cry 5 releases on March 8, 2019","New Releases for the week of August 21, 2018","Guacamelee! 2 - Review Thread","Ary and the Secret of Seasons - Announcement Trailer","MapleStory 2 release date set for October, battle royale mode coming this week","New screenshots from #Cyberpunk2077 are here! [Screenshot]","For Honor Starter Edition will be free (to keep forever) on Steam from tomorrow until the 27th","It’s time… Welcome, all 7 Billion Humans!","Devil May Cry 5: disposable exploding robot arms and frustrating camera controls","Devil May Cry 5 Release Date Trailer - Gamescom 2018","Re-Legion - Official Gamescom 2018 Trailer [Gameplay]","Shenmue 1 &amp; 2 - Review Thread","CREED: Rise to Glory - Announcement Teaser | PS VR","Halo: The Master Chief Collection | Xbox One X Enhanced Trailer | YouTube 4K | September 1, 2018","Shenmue 3 is officially launching August 27, 2019","The Fans Who Never Let Shenmue Die","Humble Monthly Review August 2018","Luigi’s Mansion remake launches October 19","Saints Row: The Third announced for Switch","One Piece World Seeker PS4 Gameplay Demo","Westie: \"...there is no livestream/gameplay reveal of Rotterdam for #BattlefieldV happening at Gamescom. EA has chosen not to have a keynote this year. I'm allowed to release footage on 31st August of the new map.\"","15 Minutes of Devil May Cry 5 Gameplay on Xbox One X - Gamescom 2018","Slime Rancher - Official PlayStation 4 Launch Trailer","Biomutant Gamescom 2018 Demo Gameplay Trailer","Neon Sword - Cause &amp; Effect Trailer","League of Legends - IT'S ON Gameplay Trailer","Ace Combat 7: Skies Unknown - Gamescom 2018 Trailer","Battlefield 5 - Official 'The Company' Trailer","Tom Clancy's The Division 2: Gamescom 2018 Official Gameplay Trailer","Humble Spooky Horror Bundle 2018","DESPERADOS III - Announcement Trailer","Until Dawn dev Supermassive goes multiplatform with the Dark Pictures Anthology","The Fall of Rockstar Games","\"First Look at the Waylanders, a Time Travel RPG Inspired by Dragon Age: Origins\"","BATTLETECH: Flashpoint - Announcement Trailer","\"The Settlers\": new The Settlers game launching late 2019","Super Smash Bros. Ultimate – Dark Samus and Chrom gameplay (2 on 2, Stage Morph)[Official]","An Oral History of ‘GoldenEye 007’ on the N64","Black Desert Online now available - Remastered Trailer","Fresh batch of Cyberpunk2077 concept arts revealed","Guacamelee 2 - Easy Allies Review","15 minutes of Devil May Cry 5 gameplay","Ace Combat 7 Desert Assault gameplay (Gamescom 2018)","Ori and the Will of the Wisps - Spirit Trials","SoulCalibur VI: Libra of Soul Trailer (X1/PS4/PC)","Life is Strange 2 - Official Gameplay - Seattle [PEGI]","Shenmue III - The Prophecy Trailer (August 27, 2019)","Guacamelee! 2: Quick Look","9 Minutes of Rage 2 Gameplay","New World: Amazon Stuidio's new sandbox MMORPG (New information from Gamescon)","Sekiro: Shadows Die Twice is dated for March 22nd","24 Minutes Of Assassin's Creed Odyssey Gameplay (No Commentary)","The Grand Tour Game Announce Trailer.","Darksiders III - Gamescom 2018 Gameplay","Overkill's The Walking Dead delayed to February 2019 for PS4, Xbox One - Gematsu","Hunt: Showdown coming to Xbox One","Amazon Ending Prime 20% off Discount - Offering $10 Credit on Select Pre-Orders","DAEMON X MACHINA - gamescom 2018 teaser (Nintendo Switch)","GamesAid Charity Bundle by Green Man Gaming | 50 dollars/pounds/euros for fifty games, 100% of profits going to charity","Desperados III - Gamescom 2018 Gameplay","Assassin's Creed Odyssey might have the best combat of the entire series","Fallout 76 – 'A NEW AMERICAN DREAM' Official Trailer | Gamescom 2018","SOULCALIBUR VI - Tira (DLC Character announcement trailer)","Monster Boy Gamescom 2018 Trailer, coming Nov.6!","THQ Nordic bringing ReCore: Definitive Edition, Super Lucky’s Tale, and other Microsoft titles to Steam","Blacksad: Under the Skin - #1 Teaser","Darksburg : Reveal Trailer - PC, 2019","Digital Foundry - 'Shenmue 1+2 HD Remaster: The Ultimate Version - PS4 Pro/Xbox One X/PC and Dreamcast Tested!'","Lucah: Born of a Dream (Launch Trailer)","The Dark Pictures: Man of Medan | Announcement Trailer | PS4","Shenmue I &amp; II Launch Trailer","A Hat in Time coming to Switch","Labyrinth of Refrain: Coven of Dusk - Puppet Show Trailer (Switch, PS4, Steam)","Analyst predicts EA's 'Battlefield V' will be a 'serious disappointment,' says preorders lag 'Call of Duty' by more than 85%","「The MISSING: J.J. Macfield and the Island of Memories」Official Launch Trailer - New game by Swery","Assassin's Creed Odyssey: Gamescom 2018 - Alexios Cinematic Trailer","Mutant Year Zero: Road to Eden - Release Date Announcement (December 4)","The story behind Late Goodbye, the song that defined Max Payne 2","Atomic Heart: Official GeForce RTX Video","Call of Duty: Black Ops 4 - Arsenal Gameplay Video","Life is Strange 2 - Official Trailer","LEGO DC Super-Villains Story Trailer","Ace Combat 7: Skies Unknown launches January 18, 2019 for PS4 and Xbox One, February 1 for PC","Unreleased Games on the Sega 32X | Cancelled 32X Games part 4","The Settlers: 25 Years Anniversary Trailer","Atomic Heart RTX Trailer NVIDIA 4k","NVIDIA GeForce RTX 20 Series of Graphics Cards (2080 Ti - 1200 USD, 2080 - 800 USD, 2070 - 600 USD)","The Sinking City Commented Gameplay Demo","Close To The Sun - Gamescom Trailer 2018","Mount &amp; Blade II: Bannerlord - Gamescom 2018 Campaign Teaser","Jump Force: Gamescom Trailer","HITMAN2 – World of Assassination Reveal","One Piece World Seeker: Gamescom Trailer","PLANET ALPHA - Discovery Trailer (Steam, Xbox One, PlayStation 4, Nintendo Switch)","Claire returns to Raccoon City in new Resident Evil 2 info from gamescom","Total War: WARHAMMER II - Reinforcement Beta now available","Twin Mirror - Welcome to Sam's Mind","SteamTV has went live!","For Honor: Gamescom 2018 Arcade Gameplay Walkthrough","Team17 - 100th Game Celebration - PLANET ALPHA","Ratchet &amp; Clank: Size Matters, But So Does Quality","HTC Vive Wireless Adapter ships September 14th for $299","Grandia and Grandia II Coming to Switch in HD Remaster","Starlink: Battle for Atlas: Gamescom 2018 The Worlds of Atlas Gameplay Trailer","Cyberpunk 2077 on Twitter about gamescom: \"More info coming soon!\"","World War 3 - Gamescom Gameplay Trailer","God of War (2018) New Game Plus Live Today, new details of additions","Slay the Spire coming to Switch in early 2019","For Honor: Gamescom 2018 Arcade Mode Trailer","CD Projekt is now worth more than Square Enix, acquires mobile game developer","Darksburg - Reveal Trailer","Monster Hunter: World shipments and digital sales top 10 million","Assassin's Creed Odyssey: Gamescom 2018 - Kassandra Cinematic Trailer","The Design of French Bread Fighting Games","Trials Rising: Closed Beta and Launch Announcement Gamescom 2018 Gameplay Trailer","Bloodstained: Ritual of the Night - 2019 Delay &amp; Vita Cancellation Announcement","Farming Simulator 19 – Gamescom Trailer","Windjammers 2 - Announcement Trailer","BRAWLHALLA - Gamescom Trailer","Baldur's Gate: Enhanced Edition gets hundreds of fixes and features","Just Cause 4 Official Tornado Gameplay Trailer","World of Warcraft: Battle for Azeroth has been out for 1 week now. What are your first impressions?","Marvel's Spider-Man (PS4) Trailer - Just the Facts: Combat","A Hat in Time - Seal the Deal Announcement (Gamescom 2018)","Spider-Man PS4 Review Embargo will lift on September 4th","Transference: Gamescom 2018 Gameplay Walkthrough Trailer","Torchlight Frontiers Gameplay Reveal Trailer","Battlefield V Open Beta begins on September 6th","Hollow Knight’ and ‘Death’s Gambit’ Get Physical Editions","Forza Horizon 4's Halo In-Game Event Is Real, Amazing","STORMDIVERS Official Trailer (new Housemarque game)","Morphies Law - Nintendo Switch Launch Trailer","Desperados 3 leaked/announced for PS4/XB1 and PC. Developed by Mimimi Games (Shadow Tactics)","Black Desert Online - Remastered Trailer","Slay the Spire - Announcement Trailer - Nintendo Switch","The International 2018 Prizepool has now surpassed The International 2017's ($24,787,916), making it the largest esports prizepool in history","Man of Medan Gameplay Video - Impressed or Not?","Metal Wolf Chaos XD delayed to mid 2019","NeonCode Gameplay Preview - Free Sci-fi Adventure from One Man Developer","Stellaris: Console Edition - Announcement trailer (PEGI)","The Sinking City – Death May Die Trailer","What will quantum computer games be like?","People Keep Trying To Scam Their Way Into Free Video Games - Kotaku","The Crew 2: Gator Rush’s New Hovercraft Discipline - Gameplay Preview","Gabe Newell announces Artifact Beta at The International 8","CCP Stages Public Executions for Botters in Eve Online","METRO EXODUS New Trailer (Gamescom 2018)","Metro Exodus - 4K Gamescom 2018 Trailer","Indie Highlights - 20.08.2018 (Nintendo Switch)","Shadow of the Tomb Raider – PC Technology Trailer","Guacamelee! 2 - Launch Trailer (PS4, Steam)","The Waylanders: first look at this RPG inspired by Dragon Age: Origins","Vanguard: Normandy 1944 – Official Announcement Trailer","Sea of Thieves Forsaken Shores Release Date Revealed | September 19th","PlayerUnknown’s Battlegrounds Graduating from Xbox Game Preview; Full Product Release Coming September 4 - Xbox Wire","ANNO 1800 Gamescom 2018 Trailer","The International with New Steam Broadcasting","Gator Rush is coming to The Crew 2 on September 26th","Anno 1800: Official Gamescom 2018 Trailer | Ubisoft [NA]","Death of a Game: The EverQuest Franchise","Valkyria Chronicles 4 - New Features","World War Z - The Horde Trailer","Breach - Official Announce Trailer","Breach is an ambitious action-RPG from ex-BioWare devs, first trailer revealed","Cyberpunk 2077's World Is All About Freedom","OPENAI will play 3 showmatches at Dotas The International 8","Life is Strange 2 Details Revealed","Heroes of the Storm: Mephisto Spotlight","Control - Nvidia RTX Demo Showcase - PEGI","Hearthstone - \"Access Granted to the Puzzle Lab!\"","Anno 1800, a Real-Time City Builder will be released on the 26th of February 2019","Battlefield V NVIDIA RTX trailer","Dying Light: Bad Blood releases into Early Access next month for $19.99US with the Founder's Pack. Beta will run through 25-26th August for selected users, and another one on 1st-2nd September for everyone who signs up!","Torchlight Frontiers: Exclusive First Hands-On","The Surprising Story of French Break Studio, creators of few fighting games, including Under Night In-Birth and Melty Blood","Underworld Ascendant Gamescom Trailer","Aeon Must Die! Trailer","NBA 2K19: The Way Back","Submerged: VR Escape the Room - Launch Trailer - A Water-filling Escape the Room Game","Bad North — Launch Trailer","The Grand Tour Game Announcement Trailer","Shadow of the Tomb Raider - Gamescom Demo Part 1 (PC)","RPG Maker MV - My Dream RPG (Nintendo Switch, PS4, XBOX ONE)","Prey's Director On The Polarizing Final Act: 'There Was Definitely Too Much' - Kotaku","Space Hulk: Tactics - \"Choose Your Side\" Gamescom Trailer","Guacamelee 2 - Gameplay Demo | PS Underground","Do you sometimes get more excitement by reading about games than actually playing them?","Shenmue's World Is Full Of Wonderful Junk","My Hero One's Justice Character Roster Gameplay Trailer","Star Trek’s Patrick Stewart to narrate Holocaust video game","The Gardens Between - Arriving September 20th","DEAD OR ALIVE 6 - T'ai Chi Ch'uan Prodigy and The Fist Of Innocence","Just Cause 4: Tornado Extended Gameplay Reveal","Call of Duty's Core Gameplay Is Fine - In Defense Of COD","DragonBall FighterZ - Creating a More Accessible Fighter [11:16]","Gibbous: A Cthulhu Adventure Official Trailer","DayZ - coming to Xbox Game Preview on August 29 - Announcement Teaser Trailer","Tekken 7 Season 2 starts 6th of September - Adds Lei, Anna and new mechanics","How Are Video Game Trailers Made? An Interview with Trailer Editor M. Joshua Cauller","Ever feel like games with eSports affiliation are more interesting to the participants than the viewers?","The critics of Metacritic - who the hell are they?","Battle for Azeroth builds the best ‘World’ of Warcraft yet","Rainbow Six Siege: Grim Sky Operators Gameplay and Gadget Starter Tips","FuturLab: No publisher will sign Velocity 2X sequel, despite millions of downloads","Naruto to Boruto: Shinobi Striker - Barrier Battle","F1 2018 Art &amp; Audio Developer Diary 4","Solace Crafting :: Version 0.3 is live!","Bridge Constructor Portal reaches 500,000 sales","If Pokemon was created Today, would it have been as well received as it was before?","11-11: Memories Retold - PS4 / Xbox1/ PC - Story Trailer","Gamasutra: Victor Sanchez's Blog - What are we talking about when we talk about systemic narrative.","Bloody Spell《嗜血印》- Gameplay Teaser Trailer ChinaJoy 2018 (New Third-person ARPG)","The next 'Rainbow Six: Siege' update shakes up a familiar formula","Fear The Wolves - Release Date Trailer","How well does Assassin's Creed IV: Black Flag hold up?","Greedfall gameplay","Risk vs Reward - Majora's Mask's Time Limit","Transference: The Walter Test Case Demo Trailer","Gaming-Value and Culture-Value: Understanding how Players Account for Videogame Purchases","Chiki-Chiki Boxy Racers Launch Trailer (NSWITCH)","Facebook announces facebook gaming, including the Level Up livestreamer program for emerging creators!","BLACK COMMAND - Trailer","Activision Beats Expectations While Brushing Off Competition","Call of Cthulhu: Dark Corners of the Earth is back on GOG","The 50 Best New Board Games","The successfulness of Return to Castle Wolfenstein? And the games that follows?","The Story of The International","Burnout Paradise Remastered launches on PC next week","Antstream app aiming to become the 'Netflix of retro video games'","Dead or Alive 6 Hitomi and Leifang screenshots leaked - Gematsu","State of Mind Review: Real Househusbands of Cyber-Berlin","Burden of Command is a tactical RPG that aims to capture the personal experiences of war","Meet Rainbow 6 Siege’s next characters and map","Heroes of the Storm: Hanamura Temple Update"]