["[Moderator Update] A New Direction for AMA Requests","HELLO! I am Michael Mando, Nacho from Better Call Saul. AMA!","I went from farming sweet potatoes in Dunn, North Carolina to constructing military bases, shelters, and hospitals around the world for America’s Navy. AMA.","IAMA Bankruptcy Attorney in Los Angeles Practicing Since 1991. AMA!","IamA Adult Film Star Tana Lea AMA!","I’m Justin Maxwell. I co-founded an AI-receptionist company, and have designed for Apple, Google, Mint/Intuit, and...Theranos. AMA!","I’m Ed Killer, USA TODAY Florida Network outdoors columnist, covering the Toxic Algae Tsunami in Florida’s waterways. AMA!","We are reporters from Quartz and the Texas Observer. Ask Us Anything about the politics of water shared by Texas and Mexico and conflict and cooperation over border water. Ask Us Anything!","We're Ruckus Composites - We've repaired 3000+ Carbon Fiber Bicycles - Ask Us Anything!","[crosspost] Jason Goldstein, Founder and Head Brewer of Icarus Brewing Co, is Conducting an AMA on /r/njbeer","I'm a music producer/singer, and I'd love your feedback!","I am the Executive Director of lowernine.org - a nonprofit that is still rebuilding hurricane-damaged homes in the Lower Ninth Ward of New Orleans. Today is the 13th anniversary of Katrina, AMA!","I am Sam Park, Representative of Georgia House District 101 AMA!","Hello, I am Dr. Otilia Gudana. I am representing as Community Manager SwissBorg -a fin-tech company powered by Blockchain. We are developing an app. Ask us anything !","IamA Harvard-trained Addiction Psychiatrist with a focus on video game addiction, here to answer questions about gaming &amp; mental health. AMA!","[AskHistorians X-Post] AMA with Dr Hannah Newton from the University of Reading's Department of History and the author of two books, The Sick Child in Early Modern England, 1580-1720 and Misery to Mirth: Recovery from Illness in Early Modern England.","I am Brendan Weinstein, 27 yr old wingsuit pilot that loves flying long terrain lines in the mountains. My most recent project was flying on my back a little bit above the ground as I mirror'd my friend Greg's body movements above me for navigation. AMA!","[crosspost] The Director of Photography for Marvel's Cloak and Dagger, \"Cliff Charles\" is doing an AMA on /r/Marvelstudios","[Crosspost] Jonathan Ying, lead designer of Power Rangers: Heroes of the Grid is doing a AMA on /r/powerrangers !","We are Danny Moses and Ira Judelson and we do a Podcast on Bail Reform. Ask Us Anything!","I am an America’s Got Talent finalist who competed at age 12 and completed high school as a touring musician. Ask me anything!","I am an Adventurer and just completed the Brooks Traverse, crossing northern Alaska from Canada to the Western Coast. During the 1200 mile trip I came across just two isolated villages, crossed only one road and met 21 grizzly bears. AMA!","I am a 30 year old grassroots, progressive activist: I work at an economic justice non-profit and sit on the board for 2 others, I train and speak on anti-oppression and have been a keynote speaker at dozens of events, I ran for office (transportation) in 2016 and I am running again for 2020. AMA!","[CROSSPOST] Alex Van Dyke, Democrat running for Kansas State House, AMA r/littleapple until 9PM CDT 8/27","I'm a parliamentary assistant in the European Parliament and the elections are next year, AMA !","AMA: I am a Patent Attorney - Ask Me Anything! 9 am Eastern Time","I am Professor David Bates, head of the new Centre for Cancer Sciences at Nottingham University. We are training the next generation of cancer researchers with the world's first bespoke undergraduate (BSc and MSci) degrees in Cancer Sciences. Ask me anything!","We are the youngest people to cycle across the Silk Road, covering 4033 kms(2505 miles) and crossing 9 countries from Turkey to China in 80 days. Ask us anything!","I'm Ray Comfort, AKA “Banana Man.” Ask Me Anything.","We are firefighters and net neutrality experts. Verizon was caught throttling the Santa Clara Fire Department's unlimited Internet connection during one of California’s biggest wildfires. We're here to answer your questions about it, or net neutrality in general, so ask us anything!","I'm Szilard Matusik, director of Moleman 4 - Longplay, a videogame docu screened at GDC and Gamescom and promoted by Steam. It's on stories behind the Iron Curtain like outfoxed Nintendo, tricked Sega, surprised Commodore and more. AMA!","[Crosspost - /r/dreamsofhalflife3] We are the Project Borealis development team - Ask Us (Almost) Anything!","We are Gladius: A cybersecurity startup that lets you sell your unused bandwidth to protect websites against DDoS attacks. Ask us anything!","I’m Ryan Nakashima, Technology Writer for The Associated Press, and I’ve been breaking news about how Google tracks your location on Android devices and iPhones -- sometimes even when you tell it not to. Ask me anything.","We are Ashley Clements and Brendan Bradley, the stars of Geek and Sundry's new sci-fi drama SONA. Ask us anything!","AMA: Homeless Vet Walked America Three Times Raised $60,000 for Charities","I am a Female Porn Director, Producer &amp; Writer in both VR &amp; 2D, with my most recent credit being the 2018 Pornhub Games. AMA!","I am USA TODAY’s Justice Department correspondent covering the Paul Manafort trial. AMA!","We are U.S. Reps. Martin Frost (D-TX) and Jim Gerlach (R-PA), members of FMC, an Association of Former Members of Congress! Ask us anything!","IAmA specialist in helping people overcome perfectionism. Ask Me Anything!","We are card game developers, celebrating the release of our new expansion for our martial arts card game, Uncaged: World Fighters. Ask us anything regarding game design, digital or tabletop!","Aileen Schultz from Global Legal Hackathon is here, AMA! [x-post r/legaladvice]","A bunch of people told me to do an AMA since I'm deaf and I just got bilateral Cochlear Implants. So go ahead!","I am a high school principal with eight years experience, ask me anything about schools/education","We are Cambridge University scientists investigating fat tissue. We think that fat tissue plays a central role in most health disorders in modern societies. We have just published a paper suggesting that a functional test of fat tissue could predict a future risk for diabetes. Ask us anything!","IamA cold water survival expert. Ask me anything!","[crosspost] 91 year old author Martin Myers is doing an AMA today in r/books! His first book in 40 years has just been released.","I'm a Call Center Representative, AMA.","Revealing Tech’s Inconvenient Truths – How a 20th Century law threatens this year’s Defcon, Black Hat, B-Sides and other security talks","I'm Zach Barth, the creative director of the game studio Zachtronics. Games we've made include Infiniminer, SpaceChem, Ironclad Tactics, Infinifactory, TIS-100, SHENZHEN I/O, Opus Magnum, and the recently released EXAPUNKS. AMA!","[CROSSPOST] Law school starts for many 1L students this week and I’m Don Macaulay, President &amp; Founder of BARBRI Law Preview – Ask Me Anything","I’m Adam Segal, expert on Chinese tech policy at the Council on Foreign Relations. Let’s talk about China’s efforts to remake the internet in its own image. Ask Me Anything!","I'm a reporter who has been covering the grand jury investigation into clergy sex abuse in Pennsylvania. AMA!","I am Sheldon Xia, CEO of a Premier Cryptocurrency Exchange. AMA!","I am a counselor at a suicide hotline...AMA!","I am an Ice Technician (Zamboni Driver) at a well known college hockey arena with two sheets of ice in one building... AMA","We are National Geographic photographers and today is World Photography Day—Ask Us Anything!","Iama prostitute reviewer in Amsterdam. AMA!","[crosspost] Author and playwright Kia Corthron is doing an AMA in r/books!","[crosspost] Tom Costantino from The Orville is doing an AMA in r/TheOrville!","I'm the co-founder at a start-up name amalgam watches/a doctor and multilingual. AMA","IAmA NASA Intern That Worked on Flying Cars. AMA!","IamA Special Ed Teachers Assistant AMA!","I am a Class 1 freight railroad conductor in the Rocky Mountains, AMA!","IAmA saturation diver (aquanaut) who has spent 30 days under 778 feet of water. AMA!","IAmA Chevy Salesman! AMA!","IAmA Wish Granter volunteer for Make a Wish. Ask me anything!","At 10 AM EST, Ajit Pai will appear before a Senate committee to address the FCC's false claims about a “cyber attack”. We're net neutrality experts here to answer your questions about the hearing today, and anything else related to net neutrality. Catch the livestream here, and ask us anything!","IamA CEO of a small Geiger Counter company that listed on Pink Sheets AMA!","Hey Reddit! We are four researchers from a team using artificial intelligence to help lunar rovers know where they are (there is no GPS in space) - plus six other space challenges with NASA’s Ames Research Center, the SETI Institute and leaders in commercial AI and the private space industry. Ask us","IAmA 101-year-old Frenchman. AMA!","IamA former Duty Officer in the White House Situation Room. AMA! (Within reason)","I am Ken Fuchs, director of Shark Tank, The Bachelor, The Bachelorette, Family Feud, Celebrity Family Feud, Love Connection, Deal or No Deal, &amp; more. AMAA!","Howdy! We are REDNEX - the band famous for \"Cotton Eye Joe\". AMA!","I’m Dr. Brian Gastman and I was one of the lead surgeons who performed a full face transplant for the youngest person in the U.S.—AMA","[crosspost] Leah Franqui - author of America for Beginners - is doing an AMA in r/books!","My name is KB. I am a Hip Hop artist and I exist for the glory of God and the good of people.","I am Lee Auman, 25 yr old Democrat running for U.S. Congress in Alabama. AMA!","Hi!! I'm Ana-Marija Stojic - comedian, writer, and creator of ARTIFICIAL THE PODCAST - here with genius Alan Majer of GoodRobot.Com (@GoodRobot) in Toronto 🤖 - he's going to build me a real, functioning, AI Robot to co-host my podcast! Ask Us Anything!","We are the team responsible for leading the update of the ACM’s Code of Ethics for computing professionals. Ask us anything about computer ethics!","We’ve spent the past 9 years developing a new programming language. We’re the core developers of the Julia Programming Language. AuA.","[CROSSPOST r/UCF] IAmA Current College Student and President of Knight’s Blade HEMA Assc.","IAmA palm oil researcher exploring how companies’ commitments to ‘zero deforestation’ can be carried out better. AMA!","I AM a leather maker from an Amish family, carrying on my families tradition with the help of the \"evil internet\". Ask Me Anything!","Hio I'm Sam. I'm the guy with the sign trying to get a kidney. A.M.A.","Our research shows how Reddit may be providing specialized support for males contemplating suicide","[crosspost] The volunteer \"Chief Sniffer\" for NASA is doing an AMA in r/space - he smells objects before they go up to crewed space missions to keep stinky things off of flights.","[xpost] AMA Session with David Yakira- Head of Research at Orbs!","I am the author of *Double Lives*, a book about secret, serial criminals hiding in plain sight and terrorizing their hometowns. AMA!","I’m Tyson Leavitt, CEO of Charmed Playhouses. I build the world’s best children’s playhouses, have had my own TV show (Playhouse Masters), built a company in 3 years, and have built playhouses for/met many celebrities (Like Steph Curry, Jason Day, and more). Ask me anything!","I’m a stripper and former escort. Ask me anything!","We are Mark Isham, Cindy O'Connor and Michael D. Simon, composers of ABC's \"Once Upon a Time\" - Ask Us Anything!","I charted, analyzed and dissected more than 5,000 lines of lyrics of 99 Taylor Swift songs over 3 years. AMA","IAMA mall cop in a bad neighborhood who’s allowed to go hands on, AMA!","I’m Dr. Joyce Poole, an elephant researcher, and today’s World Elephant Day! AMA","[X-Post from AskHistorians] I'm Keagan Brewer, here to talk about medieval European wonders, legends, and supernatural beliefs. Ask me anything!","IAmA caretaker for illegal immigrant children. Ask me anything about life in a shelter for unaccompanied minors in the USA!","IAmA low-level functionary of Chinese Communist Party and college teacher in China. AMA.","IamA PhD student in Climate Science at MIT (who also streams Fortnite), AMA!","I am an Internet Entrepreneur and Saving/Investing Blogger. Ask me anything!","IAmA 21 year old Canadian who was recently diagnosed with type 1 diabetes...while in Ukraine. AMA!","IamA 22 year old woman who went through an excessive amount of electroconvulsive (shock) therapy. AMA!","IAmA Scientist at U of G. We just co-authored a study that found there isn’t enough land to provide the food required for USDA dietary guidelines. AMA.","I am Charlotte Seager, a debut novelist who has been a section editor for two national newspapers, age 26. Ask me anything!","IAmA brain tumor patient who has had 2 craniotomies, radiation and chemo, ask me anything","IamAn Environmental Scientist in Atlanta, GA. The city has announced a goal to have 100% clean energy by 2035. AMA","My name is Mladen Milovanović,self taught artist from Serbia","IamA Biomedical Engineering PhD Student AMA!","IAmA person with severe, uncontrollable Dyshidrotic Eczema who has been on the new biologic injection Dupixent for 8 months!","I am a certified construction flagger and Traffic control manager in New York city Yell at me all you want and AMA","IamA 23 Year Old Male with a rare condition called Spinal Muscular Atrophy and I survived 6 minutes of CPR without intubation!...and my life is really weird. AMA!","I'm Ryan North, the writer of Dinosaur Comics, Squirrel Girl, Shakespeare Chooseable-Path Adventures, and now a time travel survival guide! AMA","I am middle school teacher and the co-founder of an edtech company, Otus - AMA about education, technology, or how we can build a better classroom.","IAmA CEO of a $48+ Million Online Auto Parts Store &amp; 5x Inc. 5000 Awardee - AMA","5Ys ago my husband proposed to me on reddit. We then quit our jobs, created two startups, failed, went into VC, raised funds to find+acquire+run a company, and lived on four continents. Lets catch up! AUA!","I am the creator of a bulletproof crypto safe named BANKEX Crypto Custody. AMA!","I'm Dennis Collins, a Highway Accident Investigator at the National Transportation Safety Board--AMA!","Let’s talk about bees! I’m a beekeeper in New Orleans. AMA!","IamA garbage man in Norway, AMA!","IAMA Homeowner who just got put under mandatory evacuation due to the Holy Fire burning in Riverside County. AMA!","We build the platform that allows to sell and buy the computing power without buying a hardware. We are the team behind SONM project. AMA!","IamA Novelist just completing her 2nd novel. AMA!","[CROSSPOST] I'm Emma Best, covering FOIA releases and declassified documents. I occasionally leak things, including the 11,000 messages from one of WikiLeaks' private chat - Ask Me Anything! r/worldnews","Crosspost AMA on r/SandersForPresident: Hello I’m Paul Walker running for Congress for Kentucky’s 1st district and ready to answer your questions. AMA","AMA with Stefan Soesanto, former Cybersecurity &amp; Defence Fellow at the European Council on Foreign Relations (ECFR) expert on cyber defence &amp; security policies + offensive and diplomatic response to incidents in cyberspace. [x-post /r/europe]","IAMA diver who was 22 metres underwater in Bali when the 7.0 earthquake struck nearby","I build the Apollo Reddit app, an alternative Reddit client for iOS with some snazzy features! I'm donating 100% of the proceeds today to our local animal shelter that's low on food due to a ton of kittens! AMA!","I am a Corporate Executive Chef for a world Fortune 500 company.","I am an “Operating Engineer,” AMA","I’m Brooke Alpert, mom, Registered Dietitian Nutritionist and founder of B Nutritious, a nutrition counseling practice based in NYC. I'm here to talk about ways to turn on your parenting superpowers and tackle that lunch crunch! AMA!","IamA Social Media Representative for Avis Budget Group - AMA!","I am an orchestral Bassist, Ask me anything!","I wrote about a farm baron building a water and energy empire in the California desert. Ask me anything.","IAmA First person in my family to have Crohns disease, Ask me Anything!","I am a manager in my family's chain of restaurants in Germany, ask me anything!","[crosspost] Dr. Randi Hutter Epstein, author of AROUSED: The History of Hormones and How They Control Just About Everything, is doing an AMA in r/books!","Crosspost AMA with Levi Sanders for Congress (NH 1st) @ r/SandersForPresident","I am a leading expert on edible/toxic wild (European) fungi. Ask me anything.","[crosspost] Tides of Man is doing an AMA in r/postrock!","We’re going to be the first U.S. astronauts to launch from America since 2011. Ask us anything!","IamA musician on one of the world's largest cruise ships. AMA!","I own and work in a Escape Room. Ask me Anything!","I get paid to operate gigantic dump trucks... AMA!","I am a Nurse in the operating room. Ask me anything.","Hey Reddit, my name is Bo Burnham and I wrote and directed the film EIGHTH GRADE which is now in theaters NATIONWIDE. AMA.","I’m Dr. Janine Krippner and I am a volcanologist interested in explosive volcanic eruption processes. AMA!","Hey Reddit, I am an intern in a congressional office this summer here to answer questions about how your government works, politics, and anything else you might like to know. AMA!","IamA McDonald's UK Crew Member AMA!","I'm Joi Ito, Director of the MIT Media Lab. I'm leading the selection committee for the Media Lab's Disobedience Award. Ask me anything!","IAm the Bug Whisperer. AMA!","I am a FORMER AT&amp;T Brand Ambassador!","We're Former Members of Congress, ask us anything!","I am Jay Michaelson, legal affairs columnist at the Daily Beast. AMA about SCOTUS, religious liberty, and LGBT issues!","I am a Flint Mi Artist who's moved out to California for the opportunity... Ask Me Anything!","I am the pickle guy at my local Renaissance Faire. AMA!","I am Jonathan Salk. My father was Jonas Salk, and we have just published a book that is a message of hope for humanity's future. Ask me anything (August 20 12-1 PDT/3-4 EDT)","I am DJ Shadow (DJ, producer, podcaster)… Ask Me Anything!","We are the Innocence Project, AMA [x-post r/legaladvice]","I'm the science editor at Axios who specializes in covering the role climate change plays in extreme weather events. AMA!","I am Holly Hardman, director/producer of the documentary-in-production, As Prescribed, about iatrogenic benzodiazepine injury. Iatrogenic? AMA!","I’m Samina Kalloo, mom, Registered Dietitian Nutritionist, and proud member of the KIND Nutrition Collective. I’m here to share my tips and hacks for creating back to school lunches that are kid friendly and parent approved. AMA!","I'm Zephyr Teachout, and IAmA candidate for New York State Attorney General. AMA!","I'm Jeff Maysh, crime journalist. AMA about my story about how an ex-cop rigged the McDonald's Monopoly game","IAmA host at my local Cracker Barrel. AMA","I am Bill Haas, a St. Louis School Board member and candidate for Congress in Missouri's 2nd District - AMA! [Crosspost /r/MissouriPolitics]","IamA (Jeremy Finley, investigative reporter and author of the Darkest Time of Night) AMA!","[crosspost] Robert Jackson Bennett, author of CITY OF STAIRS, is doing an AMA in r/books for the r/books book club!","I am a Technology Blogger and Internet Entrepreneur. Ask me anything!","I'm Chelsey, singer of the band Fairy Bones, AMA!","IamA stand up comedian, street performer, and author, Jack Reichert, AMA!","IamA Adult Entertainment Actress Bridgette B AMA!","IAmA paid on-call firefighter with a small city department, AMA.","We're an investigative reporter and the founding Director of the UMass Center for Employment Equity. We just produced the clearest picture ever of diversity in Silicon Valley. Ask us anything.","Hi I’m award-winning producer, director and writer Julliet Pan – AMA!","I Am the Chief Eating Officer of an indie gaming company which I started from scratch 6 years ago. We just shipped a Major Game Production with based on a Robert Kirkman’s comic book. AMA!","[xpost] Shark Angel's that dive on a regular basis and are involved with conservation and research in South Africa are now answering your questions in r/natureismetal!","IamA Robot who helped a bear make a music video - AMA!","IamA 17-year-old Australian esports commentator moving to Europe to pursue commentating as a career!","IamA professional country songwriter in Nashville, Tennessee! AMA!","We are a group of hepatitis C and harm reduction experts from organizations in Thunder Bay, Canada here to answer your questions! Ask us anything!","I’m Alex McInturf and I’m a shark biologist—AMA!","Hi! I’m Omar Epps author of From Fatherless To Fatherhood. Come join me to discuss my new book, movies, TV and much more! AMA","[crosspost] I am Lori Goldston (of Nirvana Unplugged, etc.) here to answer your questions...AMA","[crosspost] Jack Bender, Breeda Wool, and Holland Taylor of Mr. Mercedes are doing an AMA in r/television!","IAmA researcher working hard to raise the profile of women in science. AMA!","Ask us anything about becoming a NASA intern!","My wife and I are the owners of the worlds largest social network for nudists. We've met tons of nudists and sponsored lots of fun nude adventures. AUsA!","I wrote a book about how to find a job and move to Japan! Ask Me Anything!","I'm A 6 Year Successful Affiliate Marketer (Internet Marketer) AMA!","I’m Priya Bapodra, veterinarian at the Columbus Zoo and Aquarium — AMA!","Last week we (Nerd Monkeys) launched the game Detective Case and Clown Bot in: The Express Killer, please ask us anything.","I'm the author of Inhuman Resources, a HuffPost Highline article about a big bank, sexual harassment, and what it’s like to be a whistleblower. AMA.","I’m Jim Breslo, civil rights attorney and host of the Hidden Truth: Transgender Movementpodcast. AMA!","We are Ed and Stephen the co-creators of The Wise Millennials! Ask us anything!","We are data scientists at IBM. Ask us anything about machine learning and AI!","I'm Lisa Grossman, astronomy writer for Science News. NASA's about to launch the Parker Solar Probe, the first ever mission to 'touch' the sun, and I'm all over it. AMA!","[crosspost] Tim Wardle, director of the documentary Three Identical Strangers - the story of identical triplets separated at birth for a study, is doing an AMA in r/movies","I am Kay White and I am a Candidate for Governor of Tennessee, AMA! [Crosspost /r/TennesseePolitics]","We are timber specialists and architects from Arup – here to talk about building with mass timber - ask us anything!","IamA Allan Ungar, director and writer of the UNCHARTED Fillion film. AMA!","Hey, I'm Mike Oliver, a veteran investigative reporter/editor in healthcare and politics, and I have Lewy Body Dementia, a life-shortening disease that Robin Williams had which has no known cause or cure. I love music and I’m writing about living with LBD and counting down my vinyl collection. AMA!","I'm an independent journalist and filmmaker who reports on war, crime and politics from places like Syria, Iraq, and the C.A.R. My latest piece is on born again members of MS-13 for the Guardian. AMA","David Ubben of The Athletic is here to answer your questions. [x-post from /r/ockytop]","I am Gregory De Jans and I live and breathe Maps APIs. Head of dev rels for TomTom. AMA!","We are a group of dentists who created an app (Dental Republik) aiming to increase dental access, reduce anxiety and prevent overselling of treatment. Ask us Anything","IAmA. Hello friends, I'm a Resident of Anesthesiology and Recovery in Costa Rica working for the Social Security at one of the biggest hospitals in San Jose.","IamA Urban Indian aka “Native American” who grew up in the city. Here to answer your questions and dispel myths, AMA!","I run a company that helps students in their homeworks and essays.","Hi! I’m the child of two American diplomats who grew up moving internationally ever few years starting from the age of 2. AMA.","IAmA Double Above the Knee Amputee (&amp; Gay) - AMA","Canine Confidential -- Why dogs do what they do","I am the real Mr. Glass! I have brittle bone disorder, Osteogenesis Imperfecta, and have fractured around 250 times in my life. AMA","I'm Elgin Charles from VH1's Beverly Hills Fabulous, ex-husband to Jackee Harry &amp; author of By The Way. AMA.","I am a real life Vagabonder. At 48 years old my wife and I sold everything and left the US on a one way ticket to Southeast Asia with only our backpacks. We have been on the road for 5 months now and have no plan of returning or stopping Ask me anything!","I had an elective surgical castration, AMA","I am Perran Ross, a biologist at the University of Melbourne. I voluntarily feed mosquitoes for research… on my own blood! Ask me anything","I am a medevac/EMS helicopter pilot in the mountains of Northern California. AMA.","Hello! I am Formula 1 driver Robert Kubica. Please join me for an AMA [x-post /r/Formula1]","I AM A 21 y/o amateur adult film producer. 4.5 days in, 500 Subscribers, 100k+ Views, $100 dollars. AMA","I’m Meg Myers and my new record Take Me To The Disco is out today. AMA.","I Am A Prosecutor (District or State Attorney) - Crimes, Plea Deals, Cops and Robbers! AMA","Hello. I am a Reports Analyst for a big Contact Center. AMA","I am Kylie Hansen, college counselor at AdmitStack and student admitted into Harvard, Stanford, MIT, and Caltech. Ask me anything!","We're two college kids who built a drinking game app. Ask us anything!","We are ex-truckers, now traveling health technicians. And our company is hiring! AMA","I’m Beth Harpaz, travel editor for The Associated Press and host of the travel podcast “Get Outta Here!” I’ve been to all 50 states and I’m here to answer questions about summer travel, my own travels or our podcast. Ask me anything!","I’m Nathan Farnor, progressive democrat running for State House in Tennessee's District 7! Ask me anything! [x-post from /r/BlueMidterm2018]","I’m Symphani Soto — R&amp;B singer/songwriter and fashion/beauty digital creator. Let’s talk about my new EP! AMA!!","I'm Josh Jordan. I run a custom software dev agency. Ask me anything! [x-post from r/Entrepreneur]","IAmAn assistant database manager for the Gazetteer of Planetary Nomenclature — I help name the features of outer space. AMA!","IAmA 22yo convicted sex offender","I’m Michael Finkel and I wrote Nat Geo’s cover story about the science of sleep (and how most of us are not getting enough of it) AMA!","I Am Economist Scott Sumner, Ask Me Anything! [Xpost from /r/neoliberal]","Ellie Sherrard-Smith and Andrew Blagborough – Malaria AMA","I am Grigory Yakushev, the Head of Community and Bounty Service Product Owner at BANKEX (Top 50 fintech startups in the world). AMA.","IamA Dollar Tree Employee AMA!","I am 23 year old aspiring musician currently recording my first rock/alt rock album! AMA!","I am a baby names expert and founder of BabyNames.com AMA!","I am the 26 yr old founder of a Real Estate Marketing company, AMA!","We’re Steve Jenkins and Derek Walter, owners of Esther the Wonder Pig and we have a new book! AMA","We are RAINN (Rape, Abuse &amp; Incest National Network), AMA! [x-post r/legaladvice]","IAmA Student Paramedic studying in the UK, ask me anything!","[Crosspost] I am Maria Yuan, founder of IssueVoter.org, here to talk about civic engagement, civic tech, being nonpartisan, sending &gt;250k opinions to Congress, &amp; anything else. AMA!","I’m the president of a student group that sparked national controversy for inviting provocative speakers to campus, an author, and an Assistant Editor at The Atlantic. I just graduated college. AMA!","I’m a physical therapist who followed my dreams of creating a graphic novel… currently in San Diego setting up for Comic Con (booth #835)! Ask me anything about comic book writing, physical therapy or my weird obsession with clean cars!","I am Mark Tippetts, Libertarian Candidate for Governor of Texas. Let's stop the war on drugs! AMA!","IAmA reporter for CNBC where I write about how technology is changing health care, with a focus on how the big tech companies including Apple, Amazon and Alphabet. Ask Me Anything!","I'm Zachary Quinto, host of the new HISTORY show In Search Of, Ask Me Anything.","My job is finding hotel deals for travel hacking websites. AMA!","IamA Jeremy Burge and I run Emojipedia. I also started World Emoji Day, which is today. AMA! 📅📅📅📅","IAmA Female Entrepreneur and the Founder of IssueVoter, a non-partisan civic engagement platform. I am highly knowledgeable about startups, contacting congress, and the most effective activism. Ask Me Anything!","Ben Cohen of Ben &amp; Jerry's. He endorsed Bernie (would do so again) and he's stamping money out of politics, you should too. AMA! [xpost] r/SandersForPresident","My Name is Anna Eskamani and I am running for the Florida House to represent district 47. AMA! [x-post from /r/BlueMidterm2018]","IamA 30 year old woman who had an extremely rare, adrenaline producing tumor removed from my right adrenal gland - incidence is 2 in 1 mil. AMA!","I left the Amish 13 years ago, today I am a self-published author with over 150,000 ebooks sold and a nursing student. Since my last IAMA Barcroft TV made a mini-documentary about me and my memoir was picked up by a publisher. AMA!","I make robots for a living, AMA!","I have no adrenal glands... AMA","I wrote a book about how anyone can learn to be creative, AMA.","IAmA Self-taught history buff that regularly helps people design and research armour for reenactment and sport, AMA","I have two vaginas and am very pregnant.","IamA (American scuba shop owners in Cozumel, Mexico) AMA!","I just finished walking all 1003km (623 miles) of the Bibbulmun Track in Western Australia. AMA!","I am actress / writer / producer Michal Sinnott (Tracey De Santa in Grand Theft Auto V). My new film 'Born That Way' has 350K+ video views in 3 weeks on our proof of concept. AMA !","We are the World’s Largest Porn and Adult Gaming Platform, Nutaku Games! Ask us anything!","IamA Gratitude Training, LLC Graduate, AMA!","I am a 24yo 3*** front desk office receptionist in the southern of france, whose goal in life is to become a palace concierge and member of Les Clefs D'Or. If you want to know a couple things about hospitality, AmA !","IamA person with sever tourette syndrome AMA","IamA Build-A-Bear Workshop Employee AMA!","I am Mario Gabelli, value investor &amp; CEO of GAMCO Investors, AMA.","We are the first amateur porn community EVER! Xtube official. Ask us Anything!","We are the software company Digidemic and just recently released UnitOf, an open-source measurement and data type conversion library for Java, JavaScript, and C#. AMA!","I was inspired by Ben Wyatt in Parks and Recreation to make a board game. 2 years later, I have now made over $525,000 in revenue for my board game. AMA!","I wrote Red Card, the definitive account of the FIFA corruption scandal including the wild (and true) story of how Russia got the World Cup. AMA!","I’m Sam Beckbessinger, the author of a bestselling book called “How to Manage Your Money Like a Fucking Grownup”. AMA!","I'm a best selling author. AMA!","We’re scientists with the IceCube Neutrino Observatory, which just announced new evidence for a source of high-energy neutrinos and cosmic rays. Ask Us Anything!","We spent 9 months reporting on the effect violence is having on children in one of New Orleans’ most dangerous neighborhoods. Ask us anything!","IamA journalist and author who covers Silicon Valley and technology AMA!","We’re James “Murr” Murray from Impractical Jokers and veteran sci-fi author Darren Wearmouth, authors of the new bestselling thriller AWAKENED—Ask Us Anything!","IAmA Physical Education Teacher in Pennsylvania!","SEND ME YOUR DIRT! IAmA Dr. Robert Cichewicz, director of the University of Oklahoma's Citizen Science Soil Collection Program and subject of the 4/6/18 Endless Thread Reddit NPR Podcast. AMA!","I run a Renaissance Festival...AMA","IamA reporter in South Florida who worked on a year-long project following how Florida ignited the heroin epidemic in the U.S. AMA","I’m David Bishop, I’ve worked as a producer or designer on games like Bombuzal, Dune, The 7th Guest, Disney’s Aladdin, Jungle Book, Cool Spot and the mobile versions of Plants vs. Zombies, Peggle, etc. AMA!","I m a counselor at a luxury substance abuse center AMA!!!","We work at PicsArt, the leading mobile photo editing app! Ask us anything.","I'm Geoffrey Cantor, best known as Mitchell Ellison in Netflix's Daredevil and The Punisher. Ask Me Anything!","I am a writer who let their anxiety and fears cost them a publishing contract a few years ago. Today I celebrate the release of my novel.","I am Justin Lehmiller, a Research Fellow at The Kinsey Institute who conducted the largest survey of sexual fantasies in America and just wrote a book about it. AMA!","I’m Arturo Massol-Deya, Associate Director of a Puerto Rican Natural Resource Conservation Organization that Helped Hurricane Maria Recovery Efforts. Ask me anything!","I am Director X, director of music videos, films, television, and creator of MISTER TACHYON, premiering tonight at 11pm on VICELAND. AMA.","I'm Andrew Gounardes and I'm a Democrat running for NY's Senate District 22 to unseat Brooklyn's only Trump-loving, NRA-loving, anti-women's choice Republican Senator. A win for us means flipping the NY Senate blue. AMA!","Six years ago, I quit my safe cybersecurity job to make the Megaman X-inspired game of my dreams. Today, it comes home to the consoles it belongs on. I am Chris King, developer of 20XX. AMA!","I Am Tom! I Founded Visit North Korea, An Agency That Specialises In Travel To North Korea With An Emphasis On Travel, Human Engagement And Education. Please Feel Free To Ask Me Anything!","IamA I almost died from the swine flu in 2016 - 2 year update AMA!","IamA indy board game designer and publisher AMA!","IamA veteran beer writer who covers the beer scene for The Atlanta-Journal Constitution. AMA!","I’m Dominic Wheatley, founder of Domark Software (later changed name to Eidos plc). I set up Eidos US office in San Mateo. Launched Tomb Raider at E3 in LA in ’96 when CEO of Eidos Interactive. AMA!","We just got into our 53rd international film festival and picked up a 2018 American Movie Award! AMA","Hi! we're Charleene Closshey and Jeremy Culver here to talk about No Postage Necessary, independent film, blockchain, making music, and our love of cats - AMA","Owner of the Music label Entendre Records, and Co-host of a new podcast","IAmA 3rd Shift Waffle House Master Grill Op. I am the one feeding y'all after a night of drinking. AMA!!","Hi, I hand build original Guitar Pedals.","I am a Mongolian Handbalancer AMA","IamA Person with a Primary Immune Deficiency AMA!","I'm the local fixer at the Thai cave who helped Tesla out last night, ama!","I used to work at HEB, AMA","Hey Reddit! I am a former Crime Scene Cleaner who traveled the U.S cleaning up Homicides, Hoarders and Diseases, AMA.","I manufacture and sell slime for a living. AMA","We're NatGeo engineers designing all kinds of cameras—even ones that can attach to sharks and penguins. Ask us anything!","IAmA Showcase Winner on The Price is Right, winning a total of $39,889 in cash and prizes AMA!!!","I have albinism—AmA","I dress up as a knight and teach kids some history - AMA","We are 16 year old producers/actors in our own YouTube show. Ask us anything!","I analyzed the speech of Parkinson's disease patients using i-vectors for my Masters in Engineering - AMA","IAmA ex professional princess. AMA!","I was born and raised in a NY Hasidic community, completely isolated from Secular society. AMA","I spent 9 years, 8 months in State prison (OR &amp; MD) I just completed my probation and life is pretty great now. AMA!","IAm the author of \"Stay Awhile and Listen: Book II,\" which recounts the making of StarCraft and Diablo 2. AMA!","Choose Your Own Adventure Game AMA with Z-Man Games and Prospero Hall. Ask us anything!","I’m a guy who just finished working on the Fourth of July at one of those pop-up fireworks stores. AMA!","I’m a rocket scientist and BBQ pit master who’s hosting PBS’s newest food show “Nourish”. AMA!","IAmA respiratory infection researcher specialising in finding ways to develop better treatments and vaccines. AMA!","I'm a teenager living with one of the rarest diseases in the world. AMA!","Our failing drinking water systems are endangering our health: How can we fix it? AMA!","Kaniela Ing, Democratic Socialist, is running for Congress in Hawaii on one of America's most progressive platforms. Just like Alexandria Ocasio-Cortez, they are standing up to the entire corporate Democratic machine. Election is 8/11, and he needs our help. AMA! • [xpost] r/SandersForPresident","I’m Chris Taylor, lead designer of games like Total Annihilation, Dungeon Siege, Supreme Commander, founder of Gas Powered Games and former general manager of Wargaming Seattle. AMA!","IamA API inspector, contracted to major oil companies all over the US, AMA!","IamA former aerospace engineer turned full time musician thanks to modern streaming services like Spotify and Apple Music. AMA!","I am a watch repair tech and salesperson! Ask me anything!","[crosspost] In forty years, Earth's population will reach ten billion. Can our world support that? Charles C. Mann, author of 1491 and The Wizard and the Prophet is doing an AMA in r/books!","IamA British Caver AMA!","IamA 21 year old woman living with Ehlers-Danlos Syndrome &amp; autism AMA!","[crosspost] Musa Okwonga who is an author of two football books and a New York Times Opinion Contributor is currently doing an AMA on /r/worldcup.","Ask Me Anything with Ken Druker, Executive Producer on John Coltrane’s “The Lost Album: Both Directions At Once”","I'm a 17 year old boy with multiple chronic illnesses and disabilities. AMA!","I have been officially diagnosed with Hyper-insomnia. Ask me Anything!","I'm Ed the Sock, Canadian icon &amp; TV legend. I generally say what you're thinking, but out loud. I went away for a while and the world went to Hell. Now I'm back to bring sense to the senselessness with my online channel FUN - The FU_Network. AMA - just don't be an idiot!","IamA 19 year old male that hasn't gone through puberty.","IAmA college student working at a drive in movie theater for the summer AMA","I am a former employee of Toys R Us AMA","I used to work for SIS, Amazon's Corporate Security contractors. Ask me anything!","IAmA Rubik's Cube speedsolver, AMA!","IamA guy who runs his own XXX clip store selling amateur porn. I also work at a sex shop full time. It'll probably be NSFW. AMA!","IamA 92 year old former educator with 4 AMA's behind me, and I'm back for one more AMA!","IamA Atlanta-based transportation reporter covering Georgia’s new distracted driving law, which takes effect July 1. AMA!","IamA a 22 Year-Old Male Who Hit Puberty Last Year After Receiving Hormone Therapy and Doesn't Have a Sense of Smell. AMA!","IAmA white, undocumented DACA recipient. Ask me anything!","Edmund McMillen here! known for The Binding of Isaac, Super Meat Boy and being featured in Indie Game: The Movie ( im the fat, brown, hairy one ). Im designing my first physical card game, The Binding of Isaac. AMA!","I am Christian Picciolini, a former white supremacist leader turned peace advocate, hate breaker, and author. Is America succumbing to hate again? Here, unfiltered, to answer your questions. AMA!","Hey there. I’m Jacob Soboroff, a correspondent for NBC News and MSNBC. I just spent a week on the US-Mexico border reporting on migrant families. AMA!","I am Evan Thomas, Sr Product Manager at eBay talking about ebay’s personalization strategy: a balance of human curation, and machine algorithm. Ask me anything!","We are the Developers of Space Engineers Multiplayer: Ask us Anything","I'm Lee Adams, the Host and Producer of Minority Reports, a brand new VICE series profiling minority communities in unexpected places. I've hung out with a white student at a historically black college, black pro bull riders in Texas and a mostly American white male Kpop band in South Korea. AMA!","We are Solar Disco Force, an intergalactic future-funk band that just released our first EP. Ask us Anything!","We're NASA scientists, asteroid and comet experts. Ask us anything about 'Oumuamua, our solar system’s first known interstellar object","Hey, this is Timothy Granaderos and I play Monty on 13 Reasons Why AMA","I work at Lujniki Stadium in Moscow, Russia. The stadium will host some World Cup matches, including the final one! Ask Me Anything!","I'm Lizzie O’Leary, host of Marketplace Weekend. AMA!","Beach House- Ask us Anything","Hey! I'm Allen Maldonado, actor and writer on the hit show, The Last OG. I collect hoodies and have the coolest cat in the world! Ask me anything!","Hi Reddit! We are an advocacy organization that has been fighting for more and better trails in America for the last 30 years. We have worked on everything from trail funding, trail building, trail benefits, volunteer pushes, and more, AMA!","We are Anna Duell and David Peyton, scientists at Portland State University in Portland, Oregon. We study the chemistry of \"vaping.\" This research contributes to the body of knowledge surrounding the implications for health associated with vaping e-cigarettes. Ask us Anything!","We are organizers from the #OccupyICEPDX movement. Ask Us Anything! [x-post /r/Politics]","We are leading academics in European Union Copyright Law: Professors Lionel Bently (Cambridge), Martin Husovec (Tilburg), Martin Senftleben (VU Amsterdam), Martin Kretschmer (Glasgow), Christina Angelopoulos (Cambridge) here to discuss EU Copyright Reform. AMA! [x-post /r/europe]","I am Bassem Youssef, the \"Jon Stewart of the Middle East!\" and I host a podcast called \"Remade in America\", presented by CAFE which is available for download now. Ask me anything!","I am Jesus and iam one of the few citizens of Cuba with internet access.","I am a professional male companion for women. A Gigolo. Ask me Anything...","We are the host and lead producer of The Gateway podcast. The series follows Gizmodo's year-long investigation into internet spiritual guru Teal Swan, and the deaths of some of her followers. AMA","Hi, my name is McKing and I'm a hypnotist","IamA former lobbyist who started a crowdfunding platform that lets everyday people hire lobbyists... AMA!"]