["Any form of threatening, harassing, or violence / physical harm towards anyone will result in a ban","Got a tech question or want to discuss tech? Weekly /r/Technology Tech Support / General Discussion Thread","California becomes second US state to commit to clean energy","Big Telecom Resorts To Lying To Senior Citizens To Scuttle Net Neutrality In California","Indiana Appeals Court Says Forcing Someone To Unlock Their Phone Violates The 5th Amendment","IP Address is Not Enough to Identify Pirate, US Court of Appeals Rules","FCC can define markets with only one ISP as “competitive,” court rules","CERN’s pioneering mini-accelerator passes first test","Wind energy prices drop to 2 cents per kilowatt hours","Logged off: meet the teens who refuse to use social media. Generation Z has grown up online – so why are a surprising number suddenly turning their backs on Instagram, Facebook and Snapchat?","California Net neutrality bill close to passage; bill would create enforcement to deter throttling data","Major Open Source Project Revokes Access to Companies That Work with ICE","Air Canada app data breach involves passport numbers. Experts warn that the theft of passport details could be \"severe\" for those affected.","Google fires back at Trump: You're wrong, our search results have zero bias","The World's biggest ocean clean up project is getting ready to launch in 10 days","Implantable brain device could stop epileptic seizures in their tracks","President Trump claims Google is rigging search results to make him look bad.","Comcast/Xfinity is injecting 594 lines of code into every non-HTTPS pages I request online to show me a popup","Telecom-backed group defends anti-net neutrality robocalls to seniors","Elon Musk doubles down on 'pedo' claims against UK cave diver","Private power utilities in Africa, Asia and Latin America developing more than 550 mini-grids","130 million hotel IDs breached in China. A Chinese hotel group's database may have been accidentally uploaded to the internet.","Cracking the passwords of some WPA2 Wi-Fi networks just got easier","Elon Musk on Twitter is now a labor issue","Hacker sentenced to prison for role in Jennifer Lawrence nude photo theft","Yandex Has Less Than 48 Hours to Tackle Piracy or Get Blocked","When ISPs Tell Seniors Net Neutrality Laws Will Increase Their Bills, They’re Lying and Losing","Yahoo, Bucking Industry, Scans Emails for Data to Sell Advertisers","A Link Tax Won't Bring Back Journalists; It Will Do Even More Harm To Them","Hackers sell data of 130 million Chinese hotel guests for 8 Bitcoin","Germany, seeking independence from US, pushes cyber security research","WhatsApp chats backed up to Google Drive lose encryption","Former Cornell University Director for Information Technology Policy running for Congress","The world's oldest weather station, based in Austria, uploads 100,000 datasets to the cloud every minute","Trump’s economic adviser: ‘We’re taking a look’ at whether Google searches should be regulated","New Texas supercomputer to push the frontiers of science","Ohio man is latest to be sentenced for millions in biofuel credit fraud","Android Devices Can Be Exploited With Decades Old-Telephone Tech","Editor's Corner—5G is operators’ chance to correct their ‘unlimited’ mistake","'I hate them': Locals reportedly frustrated with Alphabet's self-driving cars","Trump blames China for hacking of Clinton emails, offers no evidence.","For First Time in 3 Years, NASA Is Shopping For New Spacecraft","\"23andME ME Me\" Article about DNA accessibility, utility, privacy, ownership and malignant corporate DNA.","FeCo-selenide — next-generation material in energy storage devices?","NVIDIA Looks to Gag Journalists with Multi-Year Blanket NDAs","Columbia Pictures Nukes \"Holmes and Watson\" Posters Off The Internet","“They're liquidating us”: AT&amp;T continues layoffs and outsourcing despite profits. The communications giant is expecting a windfall of $20bn in savings from Trump’s tax reforms, but has closed 44 call centers since 2011.","Non-Google search engine launches a news module based on “diverse, quality sources”","Tim Cook cashes in $121 million worth of stock weeks after Apple becomes a trillion-dollar company","Russia Secretly Ran News Websites In Eastern Europe","Loki Bot: On a hunt for corporate passwords .","Trump warns Google, Facebook, Twitter: 'Better be careful' about political bias","This 3D-printed wearable is giving you an extra hand ... literally","Nuclear Safety Board Slams Energy Department Plan to Weaken Oversight — ProPublica","NYC Mesh – community-owned network to replace your current internet connection","Elon Musk reignites Twitter slur controversy. The Tesla chief asks why he has not been sued by a British man he had defamed and apologised to.","NVIDIA Controls AIB Launch and Driver Distribution","Tydrolyte LLC introduces less toxic replacement for sulphuric acid in lead batteries; potential to increase battery life, battery efficiency and charge acceptance","Amazon is reportedly building a free streaming video service for Fire TV owners","Vernā Myers joins Netflix in new VP role focused on inclusion","Why the Future of Data Storage is (Still) Magnetic Tape","New research dives into the engineering behind the world’s lightest graphene watch","Big Telecom Is Using Robocalls to Fight a Net Neutrality Bill in California","The WeChat story: how Tencent's super-app changed China","Micro-robots: Bigger than they seem","This Robot Will Hunt Lionfish to Save Coral Reefs","Toyota invests $500 million in Uber","FCC Clears Ajit Pai of Wrongdoing in Sinclair's Failed Takeover of Local News","New Google Go feature reads out website content in 28 Indian languages","An alternative to propping up coal power plants: Retrain workers for solar","Dozens at Facebook Unite to Challenge Its ‘Intolerant’ Liberal Culture","Global Thirst for Lithium is Fueling a Water War in Chile","Microsoft obliquely acknowledges Windows 0-day bug published on Twitter","Germany creates DARPA-like cybersecurity agency - The German government has announced the creation of a federal agency tasked with creating cutting-edge defense technology. But some lawmakers are worried that it may develop state-of-the-art offensive capabilities.","Ajit Pai killed net neutrality but still wants you to love the FCC","Verizon throttling could trigger FTC investigation of deceptive practices","Newly developed rapid imaging technique may boost care and cut costs","Poll: Facebook at Risk of Losing 32% of Conservative Users","Sen. Wyden Confirms Cell-Site Simulators Disrupt Emergency Calls","A Carbon-Free California Requires a Lot More Cheap Batteries","US Renewable Energy Sources Surpass Nuclear In First Half Of 2018","Tesla wins case against Ontario government over electric vehicle rebates.","Video: New technology designed to keep ambulances safer","Researchers 3D print prototype for ‘bionic eye’","Dell tempts Pixelbook lovers with premium, $599 Inspiron Chromebook 14","Conservative Facebook Employees Rail Against 'Intolerant' Culture","Exam result details now obtainable for free under GDPR. The new rights cover this summer's exams but could cause \"problems\" for exam bodies, one expert says.","After court order, 3D-printed gun pioneer starts selling CAD files","Steve Jobs' widow pushes back on her stepdaughter's memoir","Apple CEO Tim Cook Sells $57.8M in Apple Stock","Windows 10 Zero-Day Vulnerability Exposed On Twitter","Acer launches detachable OJO 500 Windows Mixed Reality headset with built-in speakers, ships November from $399","Mea culpa?: Facebook covers its tracks in Myanmar","How The EU May Be About To Kill The Public Domain: Copyright Filters Takedown Beethoven","Yahoo Mail is still scanning your emails for data to sell to advertisers","Windows 0-day pops up out of Twitter","Germany reaches 100K home battery storage installations","Philippines channels India with ID system","Canada's homegrown tech firms say they've been shut out of a multimillion-dollar project to consolidate the federal government's data operations, with American giants such as IBM and Microsoft getting the inside track.","Steam for Linux adds 1000 perfectly playable Windows games in under a week","Twitter suspends more accounts for “engaging in coordinated manipulation”","The ruthless pursuit of online ‘likes’ gives you nothing","Problems with the Common Vulnerabilities and Exposures (CVE) system caused by \"diminishing DHS funding\" and \"Lack of oversight\"","Iran-based political influence operation - bigger, persistent, global","How Google Earth led a team of scientists to discover a rainforest on Mount Lico","Instagram says users can now evaluate authenticity of accounts","Facebook Watch video service launches worldwide. The on-demand video service will compete with YouTube and Netflix.","Don't Hold Your Breath Waiting For The FCC, FTC To Punish Verizon For Screwing Firefighters","US and Mexico Modernize Copyright Protection in New Trade Deal","Groups backed by Facebook, Alphabet, Amazon push for return of net neutrality rules - This comes after 22 states and the District of Columbia filed a similar brief last week.","Tesla Gigafactory To Be Powered 100% By “Tesla Solar” By End Of 2019","Trust Us, We’re Secretly Working for a Foreign Government: How Australia’s Proposed Surveillance Laws Will Break The Trust Tech Depends On","Why Chattanooga Has the Fastest Internet in the US - Tech.Co","The Datacenter Impact Of The GlobalFoundries 7 Nanometer Spike","Tumblr is explicitly banning hate speech, posts that celebrate school shootings, and revenge porn","How to protect your privacy in Windows 10","Facebook's War on Bullshit Is Not Going Well—We Talked to the Fact Checkers on the Front Lines","Live Streaming Gains Popularity in U.S. as Shortform Video Viewing Stalls","It's a net neutrality whodunnit: Boffins devise way to detect who's throttling transit: Simple, really – follow the congested links","California passes bill to coordinate EV charger planning","How the world is experimenting with blockchain","Linux Journal: 3D-Printed Firearms Are Blowing Up","Back to School Essentials for Security","Let’s be Transparent","Now is not the best time to buy Nvidia's pricey new GeForce RTX graphics cards","5G hype is coming. Don’t fall for it.","Major AMD chip supplier will no longer make next-gen chips","Operation Darkness Falls Results in Arrest of One of the Most Prolific Dark Net Fentanyl Vendors in the World","GlobalFoundries Stops All 7nm Development: Opts To Focus on Specialized Processes","AMD's next wave of 7nm CPUs and GPUs will be manufactured by TSMC","A new dimension to marine restoration: 3D printing coral reefs","Puls Technologies raises $50 million to do tech support in your home","Fruit-picking robot designed to replace seasonal migrant workers on British farms will be ‘ready by Brexit’","AK-47 maker Kalashnikov to produce electric cars to rival Tesla","Tumps new US-Mexico trade deal includes TPP-style digital rights restrictions and extends IP","Unpicking the cyber-crime economy","The memoir by Steve Jobs' daughter makes clear he was a truly rotten person whose bad behavior was repeatedly enabled by those around him","Why Facebook is powerless to stop its own descent: People are engaging far less on the world's largest social network, and trust in the company has plummeted.","Leading journalists join call for EU copyright reform","Google helps veterans find civilian jobs that match their skills","Smallest medical robot for the Guinness World Records - \"Nanorobots to tackle drug delivery for cancer treatment\"","Guide to Quantum Computing","What Happens When Bomb Defusing Robots Become Weapons - The Atlantic","Scotland’s floating turbine smashes tidal renewable energy records","We won’t save democracy by cannibalizing the internet","New Campaign Aims to \"Save Music\" Ahead of EU Copyright Filter Vote","US Trade Rep Appears To Misreport Its Own Trade Agreement To Include Copyright Extension","Internet groups urge U.S. court to reinstate 'net neutrality' rules","How to Print an Electric Motor","How Google search results work","You can now apply to be verified in Instagram","Toyota is set to invest $500 million in Uber at a valuation of $72B: WSJ","As porn site pounds hard on piracy laws, Cox pulls out prematurely","Gmail for Android v8.8 to Remove Reply Reminders and Quick Responses","Smart Tags Add Touch Controls to Ordinary Objects","Uber Plans Shift to E-Bikes, Scooters for Inner-City Rides","Amazon hired an army of employees to say nice things about it on Twitter, and it shows how big its reputation problem has gotten","Japan, China join forces to standardize EV quick chargers","Cholera cases in Yemen have been slashed by a new system that predicts where outbreaks will occur.","The Verge: Samsung’s popular 860 Evo 1TB solid state drive is $70 off.","Ballmer: I may have called Linux a cancer but now I love it. Former Microsoft chief Steve Ballmer once considered Linux users a bunch of communist thieves and saw open source itself as a cancer on Microsoft's intellectual property. But no more.","Solar now makes up more than 10% of electricity in five states","A wind turbine in Japan got blown over by the wind","Google responds to Trump: Denies favoring ideologies in search results","Does anyone else find the creeping trend of big tech companies to 'hide' their customer support/help channels to be horrifically authoritarian","Internet giants urge court to overturn net neutrality repeal","Debunking Donald Trump's latest conspiracy theory on Google","Toyota invests $500 million into Uber","Youtube now tells you how much time you spend watching videos","First Apple Computer Goes Up For Auction, Expected to Fetch More Than $300,000","Dear Venmo: Update Your Privacy Settings","Tumblr bans non-consensual creepshots and deepfake porn","New wearable can repel mosquitos by bringing a “thunderstorm” to wrists","Electric cars exceed 1m in Europe as sales soar by more than 40%","Self-driving taxi with paying passengers tested in Tokyo in world first","Chap asks Facebook for data on his web activity, Facebook says no, now watchdog's on the case","100% Renewables Requires Less Land Footprint Than Reliance On Fossil Fuels In California","Electric scooters’ sudden invasion of American cities, explained","Facebook bans military accounts in Myanmar as UN accuses leaders of coordinating genocide","The flow of data is yet another Brexit headache for the UK","UK summer 'wind drought' puts green revolution into reverse - Britain’s long heatwave threw the country’s green energy revolution into reverse and pushed up carbon emissions this summer, leading experts to stress the need for a diverse energy mix.","Verizon, instead of apologizing, we have a better idea --stop throttling","In 2017, four US states generated more than 30% of their electricity from wind - The cost of wind power contracts has fallen to $20 per megawatt-hour since 2009.","Judge blocks distribution of 3D-printed gun blueprints until case is resolved","Inside the United Nations effort to regulate autonomous killer robots","The adventures of lab ED011—“Nobody would be able to duplicate what happened there”","Intellectual Property Focus of Preliminary U.S.-Mexico Trade Deal (1)","How Coca-Cola World Cup sales were boosted by shelf tech","Elegant Schematics Show Subway Stations are Places, Too","Tech Industry Pursues a Federal Privacy Law, on Its Own Terms","AutoX is using its self-driving vehicles to deliver groceries","Small-Town Ingenuity Is Making Gigabit Broadband a Reality","Little benefit from switching to Google's AMP: Claim","New Campaign Aims to “Save Music” Ahead of EU Copyright Filter Vote","Giving Privacy Badger a Jump Start .","Google Pixel 3 will reportedly be announced on October 9th in New York City","Volkswagen’s Effort to Stop Scandals Needs More Work, Report Says","AMD prevails in patent fight with Vizio over TV graphics","The Father Of The Internet Sees His Invention Reflected Back Through A 'Black Mirror'","What kind of technology can we not live without in around 30 years onwards?","TorrentFreak is Blocked as a Pirate Site and Hacking Resource","Mercedes's iconic Silver Arrow racer gets an electric makeover for Monterey","Newly developed device can harvest energy from low-frequency vibrations","That's the way the cookies crumble: Consent banners up 16% since GDPR","AI-altered video makes it look like you can dance","Apple and Amazon Have the Most Annoying Ongoing Feud in Tech","Microsoft is about to announce Xbox All Access subscription","Artificial Intelligence Is Now a Pentagon Priority. Will Silicon Valley Help? - New York Times","Thousands of Uber drivers set to get $75, before lawyers’ fees, in settlement - Dulberg v. Uber, filed in 2017, argued that drivers weren't paid properly.","As China expands digital surveillance, Facebook and Google risk legitimizing regime","World’s first digital teacher created by New Zealand","Facebook is being eclipsed by its youthful rival Snapchat - Social media giant struggles to stay relevant to a younger generation","Cox Pays Substantial Settlement to End ‘Repeat Infringer’ Piracy Lawsuit","This video game knows when you're scared — and it wants to use that against you","Android Messages Update With Dark Mode, Material Theme Elements Is Rolling Out Again","WireGuard VPN review: A new type of VPN offers serious advantages","MIT Media Lab Researchers Develop Wireless Underwater to Air Communications","What Will Quantum Computer Games Be Like?","RHA announces in-ear planar magnetic earphones with wireless option","Researchers reveal Android devices communicating with Google servers almost 90 times per hour","The virtual land selling for millions","China’s first ‘fully homegrown’ web browser found to be Google Chrome clone","Supersonic without the boom","It’s 2018 and we’re talking about exploits in AT modem commands.","Tech Titans Made Serious Mistakes, and More Censorship Won’t Right the Ship","Solving Spectre and Meltdown may ultimately require an entirely new type of processor","China Built the World's Largest Telescope. Then the Tourists Came. | Can you build a prosperous astronomy town next to a telescope where smartphones are off-limits? (Wired)","Verizon will finally offer a true unlimited plan with no speed caps","Microsoft Bug Testers Unionized. Then They Were Dismissed","Forbes: Apple's iPhone Price Increase Suddenly 'Confirmed'.","Facebook is rating the trustworthiness of its users on a scale from zero to 1","Wearable Two-Factor Authentication using Speech Signals Resilient to Near-Far Attacks","Deepfakes for dancing: you can now use AI to fake those dance moves you always wanted","Meet Mr. Steven, SpaceX's Rocket Nose-Cone-Catching Boat","Intel 'Petitioned Microsoft Heavily' Not To Choose ARM For Surface Go, Report Says - Slashdot","Fad Or The Future? Robot-Made Burgers Wow The Crowds In San Francisco : The Salt : NPR","India’s Biometric Database Is Creating A Perfect Surveillance State — And U.S. Tech Companies Are On Board","After Trump announces new rules to save coal, TVA ponders shutting 2 coal units","Verizon couldn't have restricted Santa Clara County's internet service during the fires under net neutrality","Tesla Semi made it ‘across the country alone’ with only Supercharger network and an extension cord, says Elon Musk","Google, Apple, IBM Many Other Companies No Longer Require Employees To Have A Degree","YouTube expands non-skippable ads to more creators","Phone Numbers Were Never Meant as ID. Now We’re All At Risk","NASA Chief Wants to Send Humans to the Moon — 'To Stay'","Energy Department teams up with Bill Gates to move mini-nuclear plants to market","Some Techies Are Shunning Silicon Valley for the Japanese Dream","Airmail 3 Exploit Instantly Steals Info from Apple Users .","No, a Teen Did Not Hack a State Election","The Supreme Court Should Say No to Patents that Take Old Ideas away from the Public","Will Reddit’s /r/Piracy Sub-Reddit Get Shut Down?","Stop Using WhatsApp If You Care About Your Privacy","Functioning Apple computer built in 1970s up for auction","Japan aims high to have flying cars hit the skies in the 2020s","Research Paper Shows Militarized SWAT Teams Don't Make Cops - Or The Public - Any Safer","Sebastian Thrun: ‘The costs of the air taxi system could be less than an Uber’","Asteroid Billiards: This Wild Idea to Protect Earth Just Might Work","Thousands of Amazon workers receive food stamps. Now Bernie Sanders wants Amazon to pay up.","One of America's oldest companies is getting into fixed wireless","Airbnb sues New York over 'government overreach'","You Could Be Kicked Offline For Piracy If This Music Industry Lawsuit Succeeds","By 2023, the World Will Have 1 Trillion Watts of Installed Solar PV Capacity","T-Mobile, AT&amp;amp;T customer account PINs were exposed by website flaws","Verizon tries to douse criticism, touts “priority access” for first responders - Firefighters don't like their mobile hotspots slowed to a \"dial-up modem from 1995.\"","Autonomous underwater robot hunts and harvests massively invasive lionfish","Volunteers found Iran's propaganda effort on Reddit — but their warnings were ignored. More than a year before the announcement from Facebook and Twitter, a group of moderators on Reddit noticed a peculiar pattern of submissions.","How to install solar power strong enough for a hurricane","Members of Congress demand FTC investigation into Verizon’s throttling of firefighters’ data connections","Finally, Scientists Have Figured Out How to Send Messages From Submarines to Planes","Google is giving you more storage for your money with its Google One","Reddit co-founder: Why I’m betting on bitcoin despite its volatility","If It Doesn't Have Paper Backups and Automatic Audits, It's Not an Election Security Bill","Japan teams up with Uber, Boeing, and Airbus to deploy flying cars within a decade","California State Assembly plans hearing on Verizon throttling of firefighters’ data","After Verizon Throttling During Wildfire, California Firefighters Endorse Bill to Defend Net Neutrality","New facial recognition technology caught 'imposter' using someone else's passport, US officials say","5G is the 'largest existential threat to broadband providers,' and Verizon and T-Mobile could be about to win big","Study ties Facebook engagement to attacks on refugees","Study shows smartphone application can help screen for atrial fibrillation","Sydney airport seizure of phone and laptop 'alarming', say privacy groups - Border Force detain British-Australian software developer Nathan Hague, apparently at random, for 90 minutes","Just how rigged is America's broadband world? A deep dive into one US city reveals all - TL;DR? It sucks","Linux Turns 27","Fashion Retailer Forever 21 Adds AI Visual Search To Online Shopping","The simple but ingenious system Taiwan uses to crowdsource its laws","Verizon and AT&amp;T have a last ditch plan to kill the California net neutrality bill","The demise of US nuclear power in 4 chart","'Amazon effect' could have impact on inflation dynamics - paper","Elon Musk Says Tesla Will Remain a Public Company","Copyright Trolls Killed Off in Denmark After Supreme Court Hearing Denied","Microsoft says it has delivered on its plan to bring Skype for Business features to Teams","How Do We Stop Technology Addiction? – Member Feature Stories – Medium","FYI this AMA right now: \"We are firefighters and net neutrality experts. Verizon was caught throttling the Santa Clara Fire Department's unlimited Internet connection during one of California’s biggest wildfires...\"","North Korea to host international blockchain conference in October: Report","It will take Intel years to fix its chipmaking process and AMD stands to benefit, analyst says","After California firefighter throttling flap, Verizon lifts first responder speed caps","Department of Justice Reveals ‘Glitch’ Shielded Officials From Public Scrutiny","Procter &amp; Gamble bids to trademark common online acronyms such as LOL, WTF, and FML","Lyft will offer discounted rides to voters during US midterm elections. Voters in underserved communities will get free rides.","More people watched the Logan Paul vs KSI fight on Twitch than on YouTube","Amazon warehouse staff defend retailer on Twitter - A small group of American Amazon employees is being paid to defend and promote the company on Twitter.","Google France shuts down its Google+ page, asks users to follow it on Twitter and Facebook instead","Millions of Texas voter records exposed online - Over 14 million detailed voter records were found on an unprotected server","Twitter Beats Censorship Lawsuit by Banned White Nationalist","Fire Department Joins Net Neutrality Suit After Verizon Cuts Data During Wildfire","Tesla to stay publicly traded, as Elon Musk says shareholders believe company is 'better off'","Google tried to change China, but China may change it","Intel Hyper-Threading Accused of Being a Security Threat","NordVPN, ProtonVPN and HolaVPN's Connections to Data-Mining Giant, Tesonet - an Organizational Chart with Links (PDF)","Recognizing It Had No Chance, Cox Settles BMG Copyright Trolling Case","What We Now Know About Iran's Global Propaganda Campaign","Verizon's Throttling of Fire Fighters Could Go Unpunished Because the FCC Repealed the Open Internet Order","T-Mobile breach may have impacted 2 million customers","New facial recognition technology catches first impostor at D.C. airport","LoveROMS Owner Hopes to Settle Nintendo’s Copyright Lawsuit","You can’t turn off Bixby on the Note 9 .","Inside Google’s plan to launch a censored search engine in China.","Amazon's 'ambassador' workers assure Twitter: we can go to the toilet any time - Army of fulfillment center employees jump to company’s defense online when it faces a barrage of bad press","Infowars’ return to Twitter proves once again Jack Dorsey doesn’t get it","Twitter CEO to testify before House committee on September 5th","Uber and Airbus Enlist in Japan’s Flying-Car Plan","First real photos of the Red Hydrogen smartphone. The Red Hydrogen is one of the most ambitious phones in years, with a holographic screen, modular upgrades, scalloped edges and the promise of a cinema-grade camera in the future.","FireEye: Tech firms’ secret weapon against disinformation","Locast Launching in Houston: Free TV station streaming service rolling out in third top market","UK phone giant EE hit by another security snafu","23andMe will no longer let app developers read your DNA data","Fugitive who tried to defraud Zuckerberg out of half of Facebook captured in Ecuador","Assistive surgical devices shine in DEBUT biomedical engineering design competition","Europe to ban halogen lightbulbs - After nearly 60 years of lighting homes halogens will be replaced with more energy efficient LEDs","What is this weird Twitter army of Amazon drones cheerfully defending warehouse work?","Crypto Wars 2.0: Amazon Pulls Book Containing 3D Printed Gun Code","Net neutrality activists prepare billboards targeting California legislators who are rumored to be planning to ambush SB 822","The NSA Continues to Violate Americans' Internet Privacy Rights","Future iPhones May Adopt New Power-Saving Backplane Technology to Extend Battery Life","Wild! Tracking animals from space could predict earthquakes on the ground","The Michigan Democratic Party tried to hack the DNC but forgot to warn them first","The Impossible Job: Inside Facebook’s Struggle to Moderate Two Billion People","Just Because The Internet Didn't Implode The Day After Repeal Doesn't Mean Killing Net Neutrality Was A Good Idea","Intel Allegedly StrongARMed Microsoft Into Using Its Chips For Surface Go Tablet","Don’t Shoot Messenger- Electronic Frontier Foundation .","Research Finds Bots and Russian Trolls Influenced Vaccine Discussion on Twitter - New Study Discovers Tactics Similar to Those Used During 2016 US Election","Intel says no more benchmarks on Linux in new terms of microcode update; Debian calls out Intel for being abusive.","Despite Twitter’s Protests, The Stifling of Conservative Speech On The Platform Is Real","A portrait created by A.I. is being auctioned for the first time at Christie's — here's how much it's worth","Google took down 39 YouTube channels linked to Iranian influence campaign","Fire dep’t rejects Verizon’s “customer support mistake” excuse for throttling","Tesla insiders say ‘it’s a s–t show’ under beleaguered Elon Musk","How a hacker network turned stolen press releases into $100 million - The Verge","Reality Winner sentenced to more than 5 years for leaking info about Russia hacking attempts","Sangoma to Acquire Digium (Asterisk) for $28M","New electrolyte recipe keeps lithium-ion batteries from catching fire","California’s strict net neutrality bill is close to final passage","P&amp;G Files to Trademark Some Millennial Phrases","Woman: My iPhone was seized at border, then imaged—feds must now delete data","How the New Suspected NSA Leaker Reality Winner Was Caught","Spyware Company Leaves ‘Terabytes’ of Selfies, Text Messages, and Location Data Exposed Online","Huawei lashes out at Australia’s ‘politically motivated’ ban on 5G products","Intel Publishes Microcode Security Patches, No Benchmarking Or Comparison Allowed!","Facebook escalates censorship of left-wing, anti-war organizations","Coffee delivery drone patented by IBM","Apple is hiring scores of ex-Tesla employees, and not just for its car project","Norway's plan for a fleet of electric planes - By 2040, Norway has promised all of its short-haul flights will be on electric aircraft. It could revolutionise the airline industry.","Texas ISP slams music biz for trying to turn it into a 'copyright cop'","Samsung announces its first Android Go phone .","Team of researchers achieve multifunctional solid-state quantum memory","Forget About Social Media Content Moderation; Get Ready For Internet Infrastructure Content Moderation","Tesla now producing over 6,000 Model 3s per week","Blackberry Patent War Mostly Survives Attack by Facebook, Snap","That Facebook Will Turn to Censoring the Left Isn’t a Worry—It’s a Reality","Take a trip down memory lane with the Windows 95 desktop app","Europe's new data law upends global online advertising","$1.1M is Lost to Cybercrime Every Minute of Every Day .","Bangladesh ramps up efforts to monitor social media after months of student-led agitations","The Untold Story of NotPetya, the Most Devastating Cyberattack in History","Idle Android Devices Send Data to Google Nearly 10 Times More Often Than iOS Devices do to Apple, Research Finds","The four ways that ex-internet idealists explain where it all went wrong","White House Uses Russian Technology to Communicate With Kremlin, Rostec Says","Texas is going green: 86% of future capacity solar or wind, zero coal: ERCOT’s pipeline of projects has ballooned to almost 80 GW. 12 GW of this is gas and the rest is wind and solar power plants, as well as 522 MW of energy storage","MIT finally figures out how to get planes and submarines to communicate - a feat that's never been done before","Big Changes For Mainstream Chip Architectures","Your Android phone pings Google a lot more then you might think","Personal-data privacy has been eroding for decades. Then came Google and Facebook, and now it’s too late to stop them","Banks Are Becoming Obsolete in China—Could the U.S. Be Next?","California's 'gold standard' net neutrality bill clears key hurdle","Data dump: China sees surge in personal information up for sale","If you shopped at these 16 stores in the last year, your data might have been stolen. Not cool.","Smartphones May Be Used to Better Predict the Weather","DC Airport First In Nation to Catch Suspected Imposter Using Facial Biometrics","Hack attempt on DNC voter database was a false alarm, the national committee says","Australia bans Huawei and ZTE from supplying technology for its 5G network","Just Buy It: Why Nvidia RTX GPUs Are Worth the Money","Nikon unveils its own mirrorless camera","Comcast/Charter lobby asks FTC to preempt state broadband regulations","New study demonstrates imaging technique that allows watching neurons in action","Driverless-Car Legislation Is Unsafe at This Speed","Netflix Disables Signup via Apple’s App Store in Broad iOS App Test","Facebook Informs 4 Million Users About Yet Another Data Leak","Verizon throttled fire department’s “unlimited” data during Calif. wildfire","IRC turns 30 years old today","University of Alberta engineering group creates satellite to help fight wildfires","Steady as she goes: Scientists tame damaging plasma instabilities and pave the way for efficient fusion on Earth","Reddit has released more details about the upcoming micro-transaction economy for Reddit Gold","Valve’s “Steam Play” uses Vulkan to bring more Windows games to Linux","These are the top reasons users switch from Android to iOS, according to a new survey","Crowdsourcing the hunt for software bugs is a booming business—and a risky one","Facebook bans quiz app that gained data from 4 million users","The New York Public Library is Turning Classics Into Instagram Stories","Virginia Tech researchers develop novel process to 3D print one of the strongest materials on Earth","Despite being shunned in America, Huawei is flourishing in Europe","Big oil asks government to protect it from climate change","Volkswagen announces launch of all-electric car sharing in Berlin","Researchers created organ on a chip that studies effects of drugs and diseases","Update: Fire Chief to Court: Verizon Throttling Was Safety Threat - Verizon says it was customer service mistake","DNC calls FBI after detecting attempt to hack its voter database","China Is Going to Outrageous Lengths to Surveil Its Own Citizens","L.A. County gets state approval of new vote-counting system using open source software","Sony’s adorable new Aibo (robotic dog) comes to the US in Sept, priced at $2,899","Microsoft hopes to protect candidates without skirting laws","The Next Generation of Wireless Technology and Why It Matters","Leaker of secret report on Russian hacking faces sentencing","Apples removes Facebook's Onavo security app from the App Store","Kalashnikov Unveils Walking Robot Concept","Hackers Discover Chinese Music Hidden in US Voting Machine Software","Piracy is the Internet’s Canary in the Coal Mine, MPAA Chief Says","Mike Pence’s Outer-Space Gospel","Driverless Startup Zoox Suddenly Removes CEO","Colorado Prepares to Install “Smart Road” Product by Integrated Roadways","Europe's GDPR is Killing Email Marketing, to the Disappointment of No One"]