["OFFICIAL: Season 4 of Mr Robot will be its last","Sam Esmail on Season 4 being the final Season","Final season :(","Mr. Robot on Instagram: “Every consequence. Every key stroke. Everything has lead to this. The final season of #MrRobot arrives in 2019.”","2019 will be a time of sad times my friends [oc btw ;)))]","I guess it's official .... I'm crazy","TIL when Rami Malek films a scene where he is snorting a drug, the prop he uses is crushed up Vitamin-B pills. He also uses a hidden vacuum in his sleeve for the illusion of snorting them.","Mr. Robot season 4 to now start production in January","The Beginning Of The End...","Am I the only one feeling a little depressed over the news?","The final season of #MrRobot arrives in 2019","Just finished binging this show over two days. (Spoilers)","I think it's official","Thoughts on s2","Season 4 to the be the last one [Unconfirmed]","mac quayle","Duckman to robot","Fun post to ease the long gap between seasons...name your TOP 5 songs you'd like to hear in S4 and why","If you need a quick hit while we wait for Season 4...","Price and power","Just started the show...","Red Wheelbarrow Sauce","SPOILERS [S3E10] Question about occurrences of WATCHES on Mr. Robot","When a friend sits along as I'm watching a certain Mr Robot scene","Alters (SPOILERS?)","I don't really understand it","Watched all 3 seasons for the first time. Some complaints","Where does Mr. Robot rank among your favorite series?","Whiterose’s Personalities","Just realized the source of Sam Esmail's inspiration for casting BD Wong","Something that makes me sad about Elliot...","I know it's been 3 months since I posted during this downtime, but I just read a book that can possibly shine some insight into Whiterose..","Elliot is _________ (Massive Spoilers)(OC)","Opinions on Whiterose’s plan","I can't be the only one.","Any interest in chatroom for subreddit?","Searching an ost from S01 EP02","Randomly stumbled across this the other night...","\"Mr.robot could get a 5th season\" Rami Malek","(question)","Irving's accent?","OST for season 3 is out!","Anyone wish they were Elliot or feel like they are Elliot just without the girl?","i found the reason why season 4 got delayed... (btw are you gonna check this out on nov 2nd?)","Opposing Views on Mr Robot","What if vera didn't actually killed shayla?","I only thought the first season was good.","[SPOILER]Question about S3E05","Who died?(spoilers)","Mr. Robot will at the least end in 4 seasons and at the most end at 5 seasons.","Why didn't MrRobot season 3 win any major awards?","Hope this makes it into a Hack Report for Season 4: “A Monitor’s Ultrasonic Sounds Can Reveal What’s on the Screen”","Elliot's nightmare in season 4","What's the music playing at the end of the sitcom sequence in 2.06?","Unusual to be THIS SIZE","I've figured out White Rose","I’m rewatching from the beginning","Mr Robot vs Capitalism","Mr Robot as Carrie characters","What is going to happen in terms of villains in Season 4?","How i think the show will end","Someone asked what it looked like now","Do you think time travel will be in season 4?","How was Mr Robot's revolution was bought and paid for?","Rami Malek cinematography style with Mr Robot &amp; Buster's Mal Heart","[Spoiler S03E10] Did Price want Angela to follow-up or drop her lawsuit?","A season 4 ending is the right call for Mr. Robot","Comic Book?","Rami Malek on the Mr robot ending rumors","My new friend QWERTY","Leon's Advice","Why does the episode list jump 3.8 to season 3 episode 10?","THR’s Full Drama Actor Roundtable With Rami Malek, Cuba Gooding Jr. and Moore vendettas","(website link) although we have zero real confirmation season 4 may be the last so get riled up and click this link so we get ad revenue","What's the piano music that plays during Elliot's lucid dream scene?","Question about Vol. 5 of the OST.","Shift Hacker Quest With Cryptocurrency Prize For The Winner","SPOILERS [S3E10] Just noticed how odd it was that the only line that Dom spoke to _ _ _ _ _ _ was...","Is Edward Alderson the original T.D.?","What are some of the best quotes from MrRobot?","Anyone else get their grandmother to watch this show?","CHRISTIAN SLATER MADE A SIMPLE MINDED GUESS ON THE SHOW AND YOU’RE ALL LOSING YOUR SHIT, HE SAID HE T H I N K S, NOTHING IS FACT PLEASE CALM DOWN AND LETS BE RATIONAL ABOUT THIS OK THANKYOU SEE YOU ALL IN SEASON 4 HAVE A WONDERFUL DAY","The Invisible Hand","I Found The Ambient Music from White Rose's Meeting Scene So Relaxing, I Made a 10-Minute Version","I just realised that when you spell ‘Whiterose’ rapidly, it sounds like “Waitrose”. Coincidence, maybe?","Happy Birthday Christian Slater!","Don’t cry just yet... season 4 being the end isn’t a sure thing...","Do you prefer obsessing over the characters or the actors of this show/any show?","Mind awake, body asleep","One of the scenes that is difficult to watch (from episode 3 season 3)","Mr.Robot loves being called God OC Parcelinc","Is Gideon sexist? (About his first scene with Angela in episode 1 of s1)","Decided to fix my walls","Irving’s book - Epilogue","Spoilers:Weird new dad had a security camera in his backyard","SPOILERS [S3E10] Possible pre-existing histories that were hinted at but not yet disclosed between characters like Vera &amp; _ _ _ _ _ _ and Dom &amp; _ _ _ _ _ _","Check out the movie Upgrade.","I owe a ton to this show","Any more news about Mr Robot prequel comic book?","Link to Mr. Robot Vol. 5 Soundtrack in Apple Music","Hustling A Stack CDs...","Score shitpost question","S03E05 Look it's Mr. Robot","Would be cool to see the show try and add more neon lights in the show.","Christian Slater: \"Yeah, Season 4, and I believe that will be the last season.\"","Promotion: Mr. Robot","Season 4?","Why is this shot not symmetrical?","Season 3 Soundtrack is now available on Spotify","If you're interested in the hidden alternate reality game in Mr. Robot, join ARGSociety - the largest Mr. Robot Discord server","Art I found wish I knew OC","What do you think a version of mr robot without the f society storyline would look like?","Hopefully this makes the next season come","[No Spoilers] homescreen.exe","Books recommendation?","Anyone else think that keygen/chiptune music would be a perfect fit for the show?","fish tank scene question (spoliers of course)","Mr. Robot Trailer // \"Immigrant Song\" (FIXED LINK)","Favorite Use of Music In the Show?","Elliot and possible resources (spoilers)","My brain is bleeding","Hey guys I am going to change my room and I want some Mr. Robot posters, does anyone have good images? Thank you!!","Finished watching.","Season 3 episode 4 question.","Remember back in season one when Ollie said he didnt like Elliot?","Rare deleted scene (from 0:47 until 0:53)","Would the views in Mr Robot be in line with Communism and/or Marxism?","In episode 01, how did eliot hack that guys social network account so quickly?","I wouldn't doubt these have sold a shit ton faster since the cameo","The thing that I like about Elliot (based on my tumblr article):","My Mr Robot fanart/poster :-)","Just wanted to show you all the patch my boyfriend got me for our 6month :)","Made this for you guys! // Mr. Robot Trailer: \"Immigrant Song\" // Hope it eases the wait for S4 :)","TIL over half of all the world's cobalt comes from the Congo, much of it mined by children and slaves, and is a crucial ingredient in all lithium-ion batteries, especially electric car batteries and clean energy storage, and is often classified as a conflict mineral. : todayilearned","Hello /r/MrRobot! I have recently heard about this show and I was wondering, is there a way/webiste for me to start watching from season 1, presumably free?","Mr. Robot Lanyard","What cameo from an actor/musician/anything really would you enjoy seeing on the show? And what kind of role would they play?","my face all the time because I can’t WAIT ANYMORE","S01E02 What did Vera meanin ones-and-zer0es.mpeg?","How to watch Mr. Robot season 1 and 2 for free on Amazon Prime?","This photo got my feels. 💔💔","Nooooooo!","Oh no! 2.0","No emmy nomination","A rare photo of my gallery 2 years ago.","I wanted a minimalist wallpaper, so I made one.","This one is the best dialogue of Elliot Alderson.","Oh no!","Since everyone else is posting quote wallpapers, here mine.","This monologue still gives me goosebumps.","What would you like to happen in S4 and what you wouldn't like to happen?","Mr Robot in NYT Crossword","What Theme Is Used in This Screenshot?","Saw this at a restroom today at Ameland, the Netherlands","\"I've always found doors fascinating inventions. They hold the entry to unlimited imagination. Before you open any door, a world filled with possibilities sits right behind it. And it isn't until you open it they are realized.”","Proofs and indications that Mohammed isn't real","At this point, which character do you pity the most? (SPOILERS UP TO S3!)","When you realize your former boss was actually the president of the United States","Mr. Robot soundtrack Volume 5","It is rare that I feel identified with this shot?","Shelia's Bug","Season 4","Bwahahaha too funny!","My unlock screen for 2 years now","On what streaming Platform is Mr.Robot available","Spoiler s01 Definition of...","Depressed","SPOILERS [S3E10] How much information and how many organizations does Elliot own by the end of S3?","Starting an exam without studying...","How will their relationship be in s4?","Random Character Question From Season 2","Ghost image","My favorite quote of the show","Season 3 was amazing!","Discussion - What now Season 4 ?","Ecorp Start date","Lag in s3 episode 1?","Any news about Season Four?","Mr. Robot Mask + Glitched Camera","Have you guys noticed that Dark army chinese guy eating a burger ALWAYS and EVERYWHERE?","Love the details in this show! (just another example)","Can I just say I LOVE how active this sub is even though it feels as though S3 ended a lifetime ago. You all are amazing! Bring on S4!","Steel Mountain","A hard thing to do","I have never been more attached to a show","Jumanji","Another hint from s1 about...","Stream S3 for free?","Painting behind Tyrell","Aphex Twin's new video shares so many thematic elements with Mr. Robot.","[Spoilers] Possible quote from the show","An extreme theory related to Vera and s4","Look who arrived today!","My attempt at a 4k Mr. Robot desktop wallpaper (credit to u/brocknapton for the idea)","Just watched episode 8 of season 3","SPOILERS [S3E10] A few thoughts on the chemistry between WR and Dom","(shitty) Life imitates Art (x-posted from r/JusticeServed)","Angela theory","Dark Army Theory","“I jumped, I wasn’t pushed”: The uniquely millennial anxiety of Mr. Robot - A really brilliant article","A very very minimalist wallpaper of my favourite quote","Who knows that Minister Zhang is actually Whiterose ?","Tyrelliot Discord","[SPOILERS] ELI5 the consequence of the Five/Nine hack","SPOILERS [S3E10]: Window/Movie Theater theory","Hidden Mr. Robot themed bar/club in Prague?","SPOILERS [S3E10] Let's discuss Elliot getting locked in the Infosec _ _ _ _ _ _ _ _ _ _ like he told Darlene/us in S2E4 and his therapy","The Angela alter theory","So, just what IS the Dark Army? (spoilers all)","Perhaps this has come up before","I was watching the new Netflix show, Explained. The episode on crypto currency is narrated by Christian Slater.","How can I thank Sam Esmail?","How could one even become Whiterose?","Is Romero killed by Vera?","SPOILERS [S3E10] Thought on the whole \"holy trinity\" idea and Mr. Robot talking about his \"father\" in the pilot.....was MR actually referencing...","Can anyone explain the description for the S1 finale? (Spoilers from all seasons ahead)","I’m late to the show and just discovered that Seasons 1 and 2 are not available on the USA Network app. Are there any ways I could watch the pilot episode for free or do I have to pay? And if so, how and where do I sign up?","What are your favorite details or funny moments in the show?","Spoilers the driver","Indian news publications think that \"Elliot Anderson\" is a real life \"French\" security experts","So BD Wong..","[S2 SPOILERS] Why does Whiterose smoke?","Christian Slater interview with Mr Porter || Season 4 comes later this year??!!","Mr.Robot eps1.91_redwheelbarr0w.txt","The beginning of the end of Shell Gas union Groningen - Mac Quayle","[Question] Other TV Shows for Mr. Robot fans?","Mind awake Body asleep gif","Chatroom","So, a season 4 trailer this year is unlikely, right?","To everyone who still considers season two as \"tedious\" or \"not their cup of tea\", how many of you have rewatched the season ?","How do I download Mr robot through Amazon Prime Video (IPhone)?","Our fight has not gone unnoticed. #MrRobot ep3.5_kill-process.inc made the @ringer list of the 100 TV episodes of all time.","\"Remember the cause.\"","\"EPS3.5_KILL-PR0CESS.INC\" (the one after the single-shot-episode) makes #57 on The Ringer's 100 Best TV Episodes of the Century.","any news about season 4 so far?","How does Elliot hack/crack people?","I decoded the meaning behind \"The Red Wheelbarrow\"","Superposition Theory of Everything","SPOILERS [S3E10] Why did we NEVER hear anything about Elliot/Darlene/Mrs. Alderson's participation in Angela's 2015 ecorp _ _ _ _ _ _ _ resurgence? And if no, why didn't they sign on?","ID on the painting?","SPOILERS [S3E10] Revisiting Tyrell's mention of Elliot's \"dirty little secret\"and his initiation of the dad discussion/R.W. poem to Elliot.....did Tyrell learn much more about Elliot than we have been shown yet?","Spoilers Elliots Memory Loss","{question}","Well Damn! Elliot is hacking into our version of Social Security. Was there an Indian phase planned?","[spoilers] Why did Mr. Robot show up to Elliot now (s01e01)? What triggered his appearance? and why hasn’t it happen before?","Shot this last weekend. Can't believe such dark music comes from someone who is so funny.","Both Kendrick and Joey on Mr. Robot would be my dream come true","This parody deserves so many more views","S2 spoilers--Phone call","Someone knows the name of the song played in the credits of Season 3 Episode 2. eps3.1_undo.gz?","Season 3 not playing in Canada","[spoiler] does Angela's Father know?","Rami needs a new passport and someone just got fired","My worries about Season 4","Conflict between Elliot and Angela","I created a webseries about a corporate takeover of the US government using design and journalism [OC]","Sharon Knowles and Terry Colby making an appearance on Orange is the New Black 🍊","Because of Whiterose, Did Angela began to hate Elliot ?","WhiteRose GIF","Does anyone else with this show didn't advance through the plot so fast?","Baseball bats (SPOILERS)","Does White Rose have a weakness?","Are Mr.Robot songs good?","Does anyone think that the portrayal of Trump in Season 3 has been very unnecessary and stupid?","A little re-enactment from season 1 on location","[Discussion] What do you think about Dom ?","[All spoilers] Elliot's childhood memories","Did anyone notice that when Eliot first shows Tyrell the arcade it plays the instrumental from the song at the end of fight club ( this parallels the 5/9 with the attacks at the end of fight club, as well as pays homage to the movie)","[SPOILERS] Half way into Season 1.. :(","Who is the best Mr. Robot character","Season 1 Episode 8 and 9","[No Spoilers] During the S2E05 sitcom title sequence, you can see Angela mourning her mother, 'Jane Moss'. However many other times throughout the series, it's clear the mother's name was Emily. Just something interesting I noticed.","Has anyone watched Comet? It's a movie starring Justin Long and Emmy Rossum directed by Sam Esmail.","what are they trying to accomplish in season 2?","I can't watch season 3 :(","Facebook launches Watch Party for streaming videos with friends - MrRobot virtual watch party!","Favorite cold open?","Mr Robot || Crest (Tribute Video)","Amazon Prime and 4K for Mr. Robot?","Promises/potential character return in s04.","Is this Mr. Sutherland in an ICE recruitment ad?","Season 4 soundtrack idea","Who has tried movie theatre popcorn with M&amp;Ms after seeing it on the show?","Songs for the season 4 premiere","List of E-coin Perks","[Spoilers] What I love about Dom","Underlying themes of Mr.Robot","Anyone have a Red Wheelbarrow job application form from SDCC last year?","On Tyrell Wellick and his job","Where's the Leon flair?","When Your Story Stalls - Part 1 (dedicated to all who feel stuck or unhappy)","Mr. Robot location and my favorite scene.","I too visited a familiar location!","(Spoilers) Regarding Angela and Deputy Director Phelps in 2.7_init_5.fve (Season 2 Episode 9)","So I was browsing youtube today when..... Seems familiar ?","[Spoilers] Nobody recognized my Mr. Robot cosplay at San Diego Comic Con - figured I’d post it here to see what you guys thought!","Cosplay of me and my brother a few years back. What do you guys think?","visited a familiar building!","I visited a familiar building too!","Teaser for Homecoming (Directed by Mr. Robot Creator Sam Esmail)","Plot detail question","Mr robot is going to end like vanilla sky","Vague post (spoilers inside) - question about dark web prison sub plot","Fender Jazz Bass enters the Revolution","Anyone a fan of Ash Vs Evil Dead, Mr. Robot, and POPS?","Re-watching Season 1 is a pretty depressing experience (S1 spoilers)","Mr. Robot has life lessons.","My favorite Mr. Robot scene to date, whats yours?","Episode 11 season 2 : isn't there an easter egg with the musics ?","What's your unpopular opinion about this show?","Mr robot watchmen reference","3.1_4-h4cked (Ringtone, eCoin perk) - Does anyone have it?","Halt and Catch Fire vs Mr. Robot Character Similarities","Holy shit I just had an epiphany (Mild Spoilers for season 3)","Used this study in my research proposal, had to share: White Rose Research - The Presentation of Self in the Online World","Favorite song from score?","may be somewhat irrelevant now but still true","Couldn’t help but think of Mr Robot...Whiterose was that you? 👀","Was it worth it? Spoilers S01E03","Mr. Robot - What's wrong?","Insight into this quote by Tyrell","Elliot Alderson - Being apart of something","is season 2 and 3 worth watching?","Any other women on here?","Did we ever find out what happened with that sd card that elliots dog ate?","The one detail that made me laugh","\"Mr. Robot Prequel Comic Coming Fall 2018\" Vulture Reports","Really cool Mr Robot video sums up the feeling of the whole show","Will there be any Mr. Robot presence at Comic-Con this year? I’m going to wear my “Red wheelbarrow bbq” shirt anyways...","The Overlooked Point of Mr.Robot S02E06's sitcom dream sequence","Help me find this episode Red Wheelbarrow","A Mr Robot Supercut","The Plot Doesn't Matter: Why You Should Watch MR. ROBOT (No Spoilers!!)","SPOILERS [S3E10] Mr. Robot seems to have a simple code/math formula for when it airs info-heavy \"dream\" episodes (last season's \"dream\" ep number + 2) and how an ICE CREAM TRUCK was the odd key to spotting that pattern","What's the biggest unanswered question for you from the entire show so far?","I'm tired of recommending this show to my peers","What part of the show sealed the deal for you?","Are we ever going to get the soundtrack for S3?","Elliot's Mother?","[S2E09] I made a replica of Dominique DiPierro's card from Season Two Episode 9.","Rewatching the first season and","S2 Vincent In The Hospital","Anyone ever attempt to get Rami’s haircut? What’d you tell the barber? Turn out okay?","The movie Sorry To Bother You has interesting similarities to the show and I would recommend seeing it","What are your professions?","We really need a huge Mr Robot ARG before season 4","How did Tyrell become so infatuated with Elliot and fsociety?","Trippy Theory- Overall spoilers S1,2+3","Whiterose’s phone call from San Diego Comic-Con 2017","Reminds me the Evil Corp this trailer in an ETS2 mod :D","DVD or BluRay that includes download for Season 3?","This subreddit when we saw the Emmy nominations.","The title of the series finale","Next season trailer on comic con ?","Why didn't Elliot just buy his Morphine and withdrawal meds off of the dark web markets?","When you can’t wait for season 4 and you see Mr. Robot references everywhere.","Why is the plot/ premise of mr robot so similar to fight club??","If Elliot had a tinder (created using Microsoft paint)","[Spoilers] The juxtaposition between Elliot and Dom in 3x10","Evil corp is real :o","Just started watching and got to the first few episodes of season 2 not sure I like it anymore, season 1 was awesome. Should I keep watching?","My reaction to Season 3 not being nominated for the Emmy for Outstanding Drama Series","Frustrated with S3 (I'm a big fan of S1 and S2 so please hear me out)","Why not being nominated is insignificant...","Me trying to be a productive fan in the off season","Any news on Mr. Robot Season 4?","Control is an Illusion","[S3E10] thoughts","Felt that image got the vibe of the show","[Spoilers S01E01] Do you all agree with Elliot's rant about society?","s02e11","How will Elliot interact with ________________ ?","That Wellick baby needs a good beating","A buzzed Rami Malek signing autographs","I'm new to Pixelart and tried recreating fsociety symbol","Theory\\Idea - Season 0","[S2E07] Just finished, should I read Red Wheelbarrow now or just finish Season Two Altogether?","spoilers. A tiny little detail I noticed","Did Tyrell and Elliot Meet Before Episode 1?","S3E8: Don't Delete Me theory *possible spoilers*","Spoilers: \"Dont forget I know about your dirty little secret, there are people close to you who wouldnt be happy if they know what I know\"","[Spoilers S03E01] Regarding the OnStar trick, wouldn't the FBI...","Any update if MRRobot is doing a SDCC marketing like last year?","Soundtrack Question","Elliots apartment, visited today","Closest replica to Elliot's hoodie I could find","[NO SPOILERS] Thought this image had the vibe of the show.","Mr. Robot at San Diego Comic Con 2018","[NO SPOILERS] Mr Robot wallpaper I made, hope you like it","So I was playing the \"End game\" on the Mr. Robot website and this thing appeared","[Spoilers S02E03] Something about this bugs me. This could be part of something bigger in later seasons.","[SPOILERS] Cinematography in S3:E10","[Spoilers] Think about this: Perhaps, Elliot \"wanted to ____ the world.\"","Anyone wish we would have seen an American Psycho Tyrell as CEO?","[SPOILERS] Who likes Tyrell more when he goes \"crazy\"?","what is your favorite character?","Full Elliot getup?","Red Wheelbarrow Home Page","Urgent help needed!!!","[Spoilers] I love how confident/cocky Elliot is in some scenes!","MRW Friday night I watch s1, Saturday night I watch s2, and then Sunday discover Amazon wants me to pay $25 to watch s3","[Spoilers S2E11] Question About Soundtrack in Mr. Robot","When is the season 4 premiere? Or is not announced yet?","[Spoilers] Season 3 Episode 5 is brilliant. Was it all done in one long-shot?","I went to the fsociety arcade the other day","RE: Elliot working for the FBI","[question]","I found this to be amazingly accurate","Spoilers what if mr robot has been working for the fbi","The Definition of Irony: Swordfish(2001) 00:00 to 00:30","My little tribute to Mr Robot :)","The Careful Massacre of the Bourgeoisie cassette","SPOILERS [ALL SEASONS of Mr. Robot and WestWorld]: The STAGGERING amount of information/theme/show crossovers between Mr. Robot and WestWorld blew my mind, and might just blow yours!","Fuck you gnome&gt;kde","Trenton's little brother, Mohammed, stars in the USA show The Sinner's 2 season.","White Rose is a revolutionary in Nechayev's sense","Soundtrack","Confused about the Tor scene.","Happy 4th Of July from all of your friends at Red Wheelbarrow BBQ!","Anyone else felt that?","Thanks Mr. Robot!","Didn't notice this reference the first time","What (if any) is your all time favorite episode so far? (Possible spoilers)","American Radical, Sam Esmail and Rami Malek are doing a movie","[Spoilers] Gaslighting","Mr Robot on Subreddit Simulator","Can someone explain what drives Tyrell Wellick","[S2-S3 Spoilers] Does anyone think ... will return?","DOOD","SPOILERS [S3E10] The Dad?","Dont overthink it","On being alone, being sick and doing nothing","Help me finding this scene!","Does anyone else cry...","Shouldn't It Be Worse?","What does this say? Found it on https://www.whoismrrobot.com/","[spoilers] I just binged the 3 seasons and just had to sub. A lot of thoughts but one thing about season 2...","Question about a scene in Season 3 Episode 10","[S1 spoilers] It's true","Leon will be stoked!","Mr. Robot Website Hacked","Evil Corp - European editon","BD Wong profiled in GQ","[Spoilers] S3E8 “I Liked It”","Terry Colby is a CIA Operative?","Mr robot - Countries that aren't US or China info?","SPOILERS [S3E10] Let's talk about Magda and her smoking...are we being misled by what we've been told/shown about her?","Esmail Corp Instagram Account? Mr. Robot related?","The Third Man - a clue we are missing","Irving's MmHmm, UhHuh, Yep, Alright compilation","Somebody lay it out for me, seriously","I got a great suggestion for the anybody here who would suggest it too? upvote as vote","Soo.. Elliot's apartment got an upgrade :(","S03E01 @ 24:25 - Darlene [SPOILER]","What does Darlene do for a living?","SPOILERS [S3E10] We will *probably* meet a BALD, dark stranger.....","[Spoilers] S03E01 Elliot’s monologue","Kali linux n00b question","We are finally awake (source:Pinterest)","SPOILERS [S3E10] Oh BROTHER Where Art Thou??? Are we going to meet a character who is the BROTHER of Edward Alderson (or maybe even Elliot)?","Coincidence? I think NOT","[S3E1] Hackerspace - Any real places similar?","Luke Cage/Mr. Robot Apartment","Red Button Theory: Season 4/Possible Ending prediction (Long post + Do not read this at all if you haven't seen season 3)","[No Spoilers] I actually laughed when I saw him playing Watch Dogs","Hack Like Mr. Robot IRL - Bad USB Attack","Spoilers from season 3 - how a main charachter will die in the upcoming seasons. Dont read further unless your up to date and missed","My Wife Watched The Gag Reel","While re-watching season one after watching season 3, I can't help but to notice one thing about Angela...","Elliott’s personality disorder may play a role in learning the fundamental nature of reality","MR. ROBOT - Season 3 Gag Reel [HD+CC]","People walk around acting like they know what hate means. Nah. No one does until you hate yourself... I mean, truly hate yourself. That's power.","What has been the funniest moment on the show.","Do people say \"Evil Corp\" instead of \"E Corp\" when Elliot's not in the scene?","Mr.Robot Uncut/Uncensored vs. Live Episodes","[Luke Cage S2 Spoilers] Did anyone notice the similarities between Mr Robot and Luke Cage S2?","My Birthday is 5/9","How elliot gets info about people?","Westworld Car Pool / S2 Car Ride","2 songs for Mr Robot","I am not very smart....","SPOILERS I noticed something odd about the end of season 3","Mr. Robot Low Poly Art - In wait of Season 4","Mr Robot Season 2 [spoilers]","Edward Alderson is alive and working for whiterose","Company Motto...","Kubrick, Spielberg A.I. Impact on Mr. Robot","[Spoilers S3] Is it bad that I want Mr. Robot to beat Elliot?","Interesting Line","power","I see where \"Mr. Robot\" came from (pockets)","You can only know what hate means when you , truly hate yourself","Things that you like about Elliot.","Where can i get Leon's tracksuit?","Three iterations of my drawing of Eliott","Does Netflix stream mr robot?","[S02E03] **SPOILERS** Whiterose and Dom","Where do you stand on the political compass?","[SPOILERS] I decoded the cypher code seen in S3E10","MR Robot discord","Just started the show..","[SPOILERS] I had a theory based on the S3E10 and S3E8","SPOILER FOR MR.ROBOT","Net neutrality is dead, baby-boomers are thrilled. I guess this is how it starts.","I started watching Mr. Robot with my dad aaand...","Just finished the show a couple weeks ago. made this. :)","In season 2 what circular thing develops in Elliot's eye?","Something I drew from that S3E08 scene","[Spoilers S?#?] Trying To Find A Scene From Mr. Robot","S2ep1 for a split second, Elliot flips through his journal and we see this sketched QR code. Turns out, it’s a link to “Confictura Industries on the World Wide Web” thoughts? (http://www.conficturaindustries.com/)","[Spoilers] This is HUGE. Elliot is in fact...","''The man who sold the world'' from David Bowie would fits perfectly in Mr.Robot, don't you think?","After watching season 3, i’m convinced Sam Esmail needs to direct a live-action Death Note.","SPOILERS [S3E10] Just for fun post in off-season...what were the top 3 surprises of S3 for you and 1 thing you thought might happen that did?","I'm okay with this","Happy Father’s Day Mr. Robot fans. I’m not creator of this but I like it is set to Angela’s singing. It only has 6 views on YouTube. Maybe we can boost it.","Mr. Robot discord server?","Just started S01. Plot holes and suspension of disbelief?","The Mr. Robot writers are writing season 4 RIGHT NOW","Question about the Dark Army.","This has a very Mr. Robot vibe @ 13 seconds it looks like counter guy is wearing an FSociety mask.","The show's use of opening actor credits is simply phenomenal.","This ad at the mall always reminds me of Darlene","[s03e06] In the 'in previous episodes' part, Leon meets Mobley and Trenton. What episode was this?","Took a trip to Coney Island so I could see where it all started.","PROVIDENCE Cigarettes: Brisk and Fresh Like the Ocean Breeze","I am Mac Quayle, Emmy-winning composer for Mr. Robot, American Horror Story: Cult, &amp; The Assassination of Gianni Versace: American Crime Story. AMA!","Graduating today and my friend did a thing.","Just a thing I did for my graphic design class, I know it’s not great but I like it","People in corporate life S3E5","Starting Up!","I Have Never Despised A Character So Much (S03E07 Spoiler)","Was surprised this wasn't made yet, so I whipped up this Phone wallpaper in photoshop. Sorry for low quality, the picture of Mr. Robot was low quality in the first place","Any thoughts on this mash-up design?! Excited for Rami to play Freddie!","[Spoiler S01E07] How come Tyrell is...","S03E10 21:27 Life imitating art ?","Fuck (video from @whoismrrobot Instagram)","When does new season return?","[Spoilers S2E12]How does Angela know...","Was Price responsible for...","What's all this about?","'Explained' is a weekly show on Netflix. The episode featuring bitcoin &amp; digital currency is narrated by none other than our man Mr Robot.","Season 2","Hi, which episode is the \"hackerman\" meme from ?","Queen of spades","FBI board insights/season 4 predictions","Season 4 and entire series foreshadowing - Spoilers!","Fsociety showing up on Kroger's corporate security training video!!","After credits scene for S3. Two characters may be linked.","[X-Post] Hello friends, I am Mac Quayle, composer Mr. Robot, doing a reddit AMA now in /r/iama - come join me!","did u guys ever notice how sad kristas tinder bio is?","SPOILERS [S3E10] Hmmm, has Elliot been busy in the off-season? :)","[Spoilers S01] so i just rewatched the first episode and got confused","Threw my E-coin power bank on eBay if any hardcore fans are interested","It's truly amazing how much you can miss when you're not looking for it","More Robot Thievery - a whole ad campaign based on a Scott Knowles line..","[SPOILERS] Are there any good fanfics where Elliot and Mr Robot actually work together?","Does 212 804 6003 still work?","Theory: Esmail is atoning for Kubrick’s A.I.","Does anyone know what Dom's approximate salary would be?","Question about S3:E6","Any other films or tv shows","Where i can find a explanation for what's going on in this show","New mr. Robot Instagram post....easter egg?","OMG, my love","Active Discord Server?","fsociety Tattoo","The best 'Mr. Robot' episodes, ranked","[Spoiler] Consequences for Darlene","Time Jump?","My Mr. Robot Funko collection. I blame Ecoin for my new addiction.","Who else, along with me, wanted to see Darlene and Dom get into an actual romantic relationship?","A different thing to have theories about","After Mr. Robot ends, Sam Esmail should do an anthology set in the same universe (no spoilers)","What the fuck happened to Angela?","(SPOILER) Mr.Robot season 3","How did Carla know this about Elliot? A theory (spoilers all)","What are some of the better hacking scenes in later seasons?","Predestination (Spoilers)","Looking to get Mr. Robot's jacket","Subreddit on Easter eggs hunting?","Just Finished Season Two - Did Not Know About After Credit Scene","Elliot seemingly being fine and running around and doing stuff after being dealt with physical damage throughout the show","MR Robot and its leaning towards the left/liberal politics","i hack time Mr alderson and you....","Could There Be Any Significance To One Of The Things In The Final Moments of Season 2 Episode 10?","Why does Tyrell tell Elliot “bonsoir” when it’s not evening? Thoughts?","isn't it ironic that the crew of mr robot are living the same naive life they are ridiculing in the show","Mr.Robot_wh3res-my-m1nd.mpeg (w/MinimalistVideos) -- this video is amazing and beautiful","At this rate","///:Low3ff0r7$h!7p0$7!.exc","Mr.robot Season Two Episode Ten --Some doubts(Spoilers)","Im sure thid has been said before, but could elliot be dead and edward survived?","Portia's father, Frank Doubleday died.","This dude from The Crew 2 somewhat reminds me of Rami Malek","How mortals can become gods...","Dropped my evilcorp water bottle in a lake","Back to the Future 2 Reference Explained","What happened to Elliots social anxiety?","Russia and Red Rose","When does Season 4 come out?","Airplane","Romero","I just noticed something ive never noticed before","Where to watch in Canada","\"And now I own Bryan Colangelo\"","S3E5 (12:52)","Scary Ending To The Show","Guy from s03e10","It's over... No more Mr. Robot to watch...","What does “I” refer to","theory (spoilers all)","(Spoilers) MR. ROBOT THEORY","Question about a small scene in episode 1 that seems odd","Elliot income and his life style","How I spent one day in New York","[Spoiler]Darlene's motivation","how can you relate mr robot with the cold war?","S1 Ep1.3 Finish this sentence, “You’re not Elliot, you’re th.......”","alternate universe","E Corp - finally saw it! I get why it was used on the show now","The supermarket I've visited in Bosnia and Herzegovina","Finished S01E09","Just started watching. Just watched S2E10. what the big deal with the guy with the red hat at the end of the episode??","(Spoiler) A question about Agent Santiago","New York building?","Elliot's M O","People hate in Angela but damn that girl has pulled off the most clutch operations in the show.","I was wondering if some fans of the show may know of good sources for merchandise.","From the best scene in the show imho","Whiterose took Flava Flaves gimmick","Thought you guys would appreciate my tattoo!","That moment when...","Screenshot redraw/fanart","Mac Quayle just posted few score tracks from season 3 on YouTube","I'am watching the show again, but this time with my mom!","Lockpicking","Mr. Robot huge theory","Mr Robot Main Theme sounds a lot like UnREAL Main Theme","Mr. Robot has made security sexy","What is your favourite scene in the show?","Where can I find a complete recap of season 3?","Is Elliot a stereotypical hacker/security expert?","Cyberpunk and Mr Robot","Elliot Starter Pack","Question","Adderall Elliot fanart","Saw a Truck from this company, shortly thought E Corp really exists.","Another fan art I did in my spare time!","A reminder to look into realtime 60fps interpolation when you watch MrRobot. Here's a little sample, looks pretty good","Couldn't help but think of a big moment from Season 3 when I saw this Reddit thread. (Season 3 spoilers)","Found this dirong East European Comic Con this weekend","How realistic is it to destroy computers with a cremation furnace?","How can I convince someone to watch Mr.Robot","Sonic Youth Angela","Noticed Sal from Impractical Jokers wearing this. S6:E24","My White Rose / Washington Township Plant Theory.","Season 3 Blu-Ray Price Drop","Does Elliot have a Pseudonym?","Ray's and his Wife's Backstory [spoilers S02E07]","Significance of Qwerty.","Renting a movie for the kids when suddenly","What does E Corp really stand for because I’m pretty sure that the media calling it evil Corp is just Elliot’s perception what does it really stand for or is it just E Corp this has bothered me for quite a while now no company would name themselves Evil Corp.","Perhaps there is more to the Dark Army and suicide","I randomly walked into a Joey Bada$$ concert in Denver today","Can someone explain this scene from season 2? (spoilers)","Created an Instagram account for Mr. Robot Rants","Is Irving based of The Wolf from Pulp Fiction ?","I made a Mr. Robot themed Steam profile, it's not finished yet but I thought I'd show it off anyway","This sounds strangely familiar... [spoilers all]","Mozilla Survey Referenced Mr Robot","What was the most realistic portrayal of hacking in a TV-Series or Movie before Mr. Robot came along?","Fan Theory (Spoilers)","Where can I get the clock beep sound effect of whiterose?","anyone have any info as to when season 3 will be on amazon prime video?","Is Terry Colby based of Bernie Madoff?","Eating Popcorn with M&amp;Ms!","So how about that Rami Malek's acting ability","Season 4 opening scene idea","Eliot in an alternate universe","Please tell me you're hearing this too","Please tell me there are no 71 red roses in this frame","Found a reference in Brooklyn 99","Bob's Burgers referenced the show in the latest episode!","Can anyone make a youtube clip of Joanna eating while Tyrell is destroying their kitchen in the background? [S1]","Elliot Alderson looks too impeccable","Irving's Choice of Weapon","5-9 could be a reference to IT availability 99.999% uptime","Question about S03E08","Is there a text free version of this still?","Can't wait to see him in Bohemian Rhapsody!!","So, heading to the Sacramento Zoo today, got SO MUCH cigarette ash on my jeans trying to get a steady shot 😂😂","Mother’s Day","Why does fsociety use VHS tapes?","ANGELA’s POTENTIAL PLOTLINE:","do y'all see rami as white? I'm so confused.","Happy Birthday, Rami!","Need a show to fill this Mr Robot sized hole in my heart","Question about Elliot and Mr. Robot's interactions","Finally found the track that plays when Angela breaks up with Ollie","Another layer to the 71 Bombings...","TIL that Grace Gummer (Dom DiPierro) was born on the 9th of May","Astrologers talks about MR. ROBOT","So I was watching Night at the Museum when suddenly I notice this boy. It was so surreal seeing him in such a silly setting lmao","I write a musical diary (\"Flying Diary\") with my piano on YT. This diary entry is about Mr. Robot. I hope you like it!","Touch, sweet touch (Spoilers S03E01)","I got bored at uni today","How did Tyrell hack Anwar's phone in s01e03?","Concerning the FBI, I think... (Spoilers S03E10)","Portia Doubleday brilliant acting","So about half a year ago, I started working at a Monitoring Station.","What does Comet Electric have to do with the plot?","Google doodles for Mr. Robot anniversaries! (chrome extension)","Mr. Robut","(Spoilers) Runtime Error plot thread question","Remember 5/9","5/9 anniversary","Flag?","The Mr Robot team is amazing, sent me a 5/9 flag today!","5/9 also happens to be Grace Gummers Birthday - Cheers, DiPierro!","Got some new markers so thought I'd practise on some old pieces","5/9 was only the beginning; the revolution has just begun","Elliot Phone","Saw something familiar at work today...","hello friends. 3 years since the 5/9 attack. never forget. how are you?","Some 5/9 Mr. Robot Fanart. Made an instagram to share. Peace, friends","RememberFiveNine Sweepstakes. Win a 5/9 painting created by Carly Chaikin: http://www.usanetwork.com/mrrobot/remember-fivenine-sweepstakes","Happy 5/9 my friends","Had to use code to watch Mr Robot on my computer","Not my pic but it look dope af tho!!","The I work night shift 5/9 reference post.","Whoelse wanna die with me?","Looking for an image...","Anyone have a good screen grab of the suspect board from S2 (the one they show Darlene?)","Happy 5/9","Update Anyone?","I love the meetings with whiterose and how they're filmed","Synchronicity with reality[SPOILER]","[The MR hat with the sewn on patch] $11 cheaper SALE than the last one i listed. Amazn","does anyone else feel like elliot uses a mouse too much?","Susan Jacob's loft is the same as another one found in Person of Interest","Suggest me some similar shows/movies like MrRobot","Rami","Mr. Robot is a 21st Century Western","Tracking For New Item(s) From Mr. Robot","Mememalik","This reminds me of the Wood Between the Worlds in Narnia","Here is Waldo...I mean Sam","What’s the deal with the Nancy Grace and Obama cameos?","How do people upload Mr. Robot scenes to youtube?","Let's build a neural network to make predictions!","(Spoilers) I hate Dominique DiPierro","Elliot: black hoodie, qwerty: black fish, flipper: back dog","Why did Elliot not use...","Help me find this scene please","A note for producers.","Just some Photoshop stuff.","Am I the only one who noticed this? (Spoiler?)","Fanart: Mr. Robot, Elliot and Darlene","I wish Elliot s1 personality lasted longer","We interviewed Martin Wallström (Tyrell) on Mr. Rewatch, the podcast from a comedian and a hacker. Check it out!","Now everyone will know my favorite show.","In season 3 episode 6, how did Dom and Co. intercept this Signal call, if it is end-to-end encrypted???","I finally watched ep. 1 of Mr. Robot. It was like a mirror","Just finished watching 9 Episodes (S1) in one sitting.","Fan art I did in my spare time!","My mileage this morning","My Fan Art","Saw this in my office and couldn’t resist.","[Shitpost] How the Dark Army recruits people off season.","new post about parallel worlds and the timeline from ypsifactj48","What E corp sticker looks best?","Elliot and Angela’s parents","My theory about \"bonsoir\" (spoilers all)","What I am hoping in season 4 ?","Just noticed this brilliant piece of telegraphing while rewatching S1E1","Mr Robot Pilgrimage","When I heard this song I fell in love with this TV series","Remember Five/Nine - Fan Art Contest","Organising the dream sequence into themes (season 1 episode 4)","[Spoilers] Question about the recap on season 2 episode 12","Where can I watch Season 3?","I think the only way the show could’ve been better is if Elliot’s progressive madness centered around Mr Roboto by Styx playing uncontrollably in his head throughout the series.","Was there a Trump ref in every episode?","Mr.Robot is famous (skin in Mindnight) with perfect description &lt;3","My favorite version of what's basically Mr. Robot's theme song","New Fan Here and I'm Loving It (Season 1 Thought)","Need help finding the name to a song from Season 3, Episode 2.","This has probably been said here a lot, but I really appreciate the way technology and hacking is handled","Elliot in Mr. Robot Season 4","The Cure - Disintegration","I'm torn..","Womp womp. November start on production confirmed.","Mr Robot S02E04 Init 1","Can anyone help out?","Is Ecorp a real company?","Still not sure what happened during the trippy scene in Season 1 Episode 4....","IRL Vera Jailbreak Nets Hacker 7 Years in Prison","In your opinion : will Joanna ever appear on the show again ?","c0ping_mechan1sms.root","Joey Badass Car Scene - Art","Even domains are real in Mr.Robot S03 (https://sandbox.vflsruxm.net/plans.rar)","THE KING CRIMSON CODE","Thomas Middleditch and Rami Malek!","re watch while update","What do you think is the most unrealistic thing about the show?","Can anybody ID Joey's trousers from S03E07?","Scene in 109 with Angela's father foreshadows 310.","This band = Mr. Robot fans, mask looks like the one from the Careful Massacre VHS.","Morse Code in Paint By Numbers Red Wheelbarrow Menu??","What is the episode where Philip Price talks to Tyrrell in his office about consequences of his choices, or something similar to that?","So, about last episode...","\"...what is Mr. Robot?\"","I learned python and batch code after watching Mr. Robot. I can't be the only one.","Why did Elliot tell Darlene to [spoiler]","Can't select English ans audio on last S3 epsiode","I think the show will end with...","Red Rose","Romero’s withdrawal medicine fix isn’t as unrealistic as everyone says...","(Off Topic) What music makes you think of the show?","Kali linux version","We've got a special guest star on Mr. Rewatch, the podcast from a comedian and hacker. Guess who to enter our giveaway!","Making different accounts so you can keep the free trial.","Mr Robot is in a computer simulation","Rewatching Jurassic Park and look who i found..","Car slowdown","Dexter + Fightclub ?","I think my neighbors might be fans of the Show","am i the only one who was incredibly offended when ralphthemoviemaker called whiterose a man in his recent mr robot review","Mr. Robot is Overrated.","Did I miss something with Angela?","Is Evil Corp really the name of the company? (no spoilers)","Ending Theory (The Man in the High Castle)","That Theory","Hello friend...","The most unrealistic thing about this show.","This Mr Robot hat is the SHIT! just $23. Need 2!!","Rewatching makes you pick up on a lot. [SPOILERS]","Illusion?","Rami Malek drunk signing autographs","How can i take off a mask when it's stops being a mask, when it's as much a part of me as I am?","(off topic) preparing for cosplay event here in brazil, high af","Found it as a $1 pick up at thrift store.","(Spoilers) What role does Ray really play in Elliot’s life?","Still looking for a soundtrack from S1","What did Tyrell mean by \"Revenge, just like the waiter\" in the Black Mountain episode?","The score and music choices.","New J. Cole music video has a familiar character","Casting Mr.Robot: look who else was there \"Tom Hanks\" (Larry Crowne 2011)","What is ever confirmed that Whiterose is actually transgender?","Drawing fsociety Logo (10min)","In the alternate reality of Morning Glory, Colby shows up as a NBC hiring manager.","Why does Elliot's dad Talk to him in \"Ghosted\"?","Mr. Robot Pixel Art","What I hate about Mr. Robot","Whiterose is also suffering from some mental illness","My favorite scene of any television show or movie. Ever.","Does Elliot like Leon?","A theory about Elliot's split personalities","Okay, I just watched eps2.5h4ndshake.sme...","Why the monopoly mask in Mr Robot?","Where do I download MrRobot animated pics like the DP of this sub?","Finished season 3. I'm glad they acknowledged what occurred in the final scene.","Vote Mr. Robot For The 2018 Webby Awards via USA Network","USA Network Today is the final day to vote for #MrRobot's double Webby nomination. Vote, share, and break the system:","Mr.Robot season 3 deleted scenes??","Why isn't riseup in Mr.Robot?","Which scene should I use to argue that Mr. Robot should be considered \"high art\"?","How many times have you rewatched the show until now?","Your Life is a Lie.","Any reason why season 3 Blu Ray didn’t have a digital HD downlod?","You Know Her From ‘Mr. Robot.’ Did You Know She Could Paint?","This sticker I've got from Etsy","[Spoilers Season 3] How did Darlene do this?","[SPOILERS] Elliot's childhood friend","The only people I know that don't love the show","Request - List of Elliot's discography","Found a site called wish.mv which seems to be related to mr robot","MR. ROBOT - Ralphthemoviemaker","The scene in the mosque was great","Why did Tyrell take his pulse after having sex with that guy?","Looking for the massacre","Any idea what scene BD Wong could be talking about where he was unable to perform it?","Had to buy one! Gotta support my favorite show.","Hello friends! Do any of you know any place that I could watch this show","Re-reading the fake subreddits (season 3)","Elliots first interaction with Tyrell Wellick","Almost done with the 3rd.","I'm really confused. Does Ray wasn't a bad person and doesn't know what was actually going on in the site?","My favorite scene from Mr. Robot: The Adderall Scene. A great representation of how self-medicating usually turns out for someone who is mentally ill.","This scene really touches me. Elliot wants everyone to be happy but he just can't do it and this get me really sad.","How do u learn to \"code\"/hack like in Mr Robot?","[1x09 Spoilers] Isn't this the best Mr. Robot scene?","What does the e in e corp stand for?","Just got my own place, and decided to have a bit of fun with the wifi name","Is 5/9 realistic?","Least favorite plot thread?","Favorite scene from 3x08","MR. ROBOT - Season 3 Gag Reel [HD + CC]","Gotta love Christian Slater","Will do anything for product placement.!!! Mr. Robot.","Does E-Corp really means evil corp or was it just in Elliot's head?","Does anyone have Mr. Robot season 2 gag reel?","Hero's Journey","Flash Sale: Mr. Robot Vinyl Collection","A collage of my favorite scenes from S03E08","Does anyone know what front this is?","Mr. Robot and Lolita (epic post)","Do you think the recent Facebook scandal will affect Season 4?","when you realize (front bottoms video)","Christian Slater Reveals When Work Starts On Mr. Robot S4 And Teases What's To Come","Shayla and I have the same taste in art! This piece is one of my faves from my good pal and photog, Brian Leighton.","Go watch \"Who Am I\" now!","Steel mountain decided to rebrand after all the embarrassment","[No Spoilers] Can anyone recognize the brand of cigarettes Darlene is offering?","What is your favorite Mr. Robot quote?","I swung by F. Society yesterday. The top is my photo, the other two are screen caps from the show.","Season 3 Gag Reel!","Please identify Elliot's yellow multitool he was using at Steel Mountain(S01E05)","Never forget","A simple, yet effective shot (of many) in S03E05","Thoughts on Anticapitalism?","Re-watch season 1 first?","Who’s the little girl in season 2 episode 11 in the dark room?","Constant EXIT signs always in frame.","Whiterose's house","Another reason to love S3E8","Meet Felicity, my blind cat who is also a Mr. Robot fan","Say what you will about season 2, that’s the season where this subreddit blew up like fucking crazy, everyone was picking every minutia detail and over analysing everything even in the off season, you cannot deny season 2 didn’t bring discussion among us.","Any Thoughts on Elliot and Darlene's Conversation about the day he went out the window?","Show recommendations","Whiterose and Vera will become the main puppetmasters of Season 4","Are we any closer to total understanding of the S01E04 withdrawal dream sequence?","TV Personality","Are there any characters that will be extemporaneous come season 4?","fsciet.y","My Mr. robot admiration lol","Mr Robot and Arthur Miller’s ‘The Crucible’","4. does anyone know when the season is coming?","I am searching for a specific monologue of Elliot talking about not selling you values, its about growing up","Related non-video suggestions","This would be the perfect Series Finale ending song. We already know Sam loves him some M83!","Theory on how the show will end","Has anyone else thought about how the name Evil Corp. is just a little too on the nose?","Was in Cambodia and spotted this. Maybe China annexed them instead?","Dumb theory #1: Vera is another personality of Elliot.","Does anyone know how long Season 3 was in production for ?","SPOILERS S3E10: What type of story/genre has Mr. Robot NOT yet included or hinted at, and is one purpose of the show to become...","Thoughts on Vera","Darlene fan art","What would Mr. Robot's Utopian society look like?","What's You're Unpopular Opinion of Mr Robot","White Rose Has a Project","ProtonMail's blog post introducing encrypted contacts on iOS and Android shows off our guy!","Star Wars and Mr. Robot (SPOILERS)","infty","Do you think the show will turn fully sci-fi?","Going to attend a lecture by BD Wong soon near me and hopefully meet him. What should we ask him ?","Rami Malek interviews Joey Bada$$ for April issue of Interview Magazine","Hi Mr. Wong ! as discussed, moderators list is on your right side bar, you can message them to schedule a AMA request. Thank you for your talk, hope WE all can continue it someday :) ----MODERATORS , CAN WE STICKY THIS FOR A WHILE?","Season 4 ideas?","Suggestions like Mr. Robot","Mr. Robot Season 4: Release Date, Cast Details, and News","Season 4 to start production November 5th","S4 Confrontation","Joey Bada$$ turned out to be a great actor","Amazing foreshadowing from Tr3nton: What will we do after The End Of The World party? [S1E9]","Mr. Robot season 3 on Blu-ray has finally arrived","Sally Yates in episode 2.7?","Elloit grime art","Seen in NC","PW","Super-creative BetterCallSaul fan uses MrRobot episode title in April Fools Joke ;)","If Elliot was a female protagonist ?","Handing out crazy theories like they're free drugs, who's keen?","Was looking for a way to use my phone as a PC mic, then this happened","I'm here. (E-Corp Building)","Finding Episodes","ITT: TV reviews, Leon style","A question about a scene in so1?","The Mr. Robot Starterpack","Saw this at my local Aldi. Is this some kind of bizarre viral marketing for the show?","3rd personality","Happy Birthday Carly Chaikin","A Windows inspired E-Corp wallpaper I made for a university project","[no spoilers] just wanted to make sure y'all jealous! (Once again)","In my opinion, season 2 had the best cinematography out of the 3 seasons.","Mr. Robot: Why \"Back to the Future **ll**\"? Sequels are never the better movie, esp this one. Whats the significance?","One of my best friends got me this as a early birthday gift. So cool!","how many of you have ever used Kali-linux?","MrRobot most quotable show of all time?"]