["Beyer On IG Revelations Of Trump’s Involvement In FBI Headquarters Decision: “This Looks Like A Cover-Up”","FBI contradicts Trump's claim about Hillary Clinton's emails being hacked by China","No, 96% of Google news stories on Trump aren't from left-wing outlets","The FBI and Citibank are reportedly investigating a suspiciously large 2016 payment from the Russian embassy to their ambassador to the US","Leaked Emails Reveal Another Trump Staffer With Ties to White Nationalism","After weeks of uncertainty, Papadopoulos decides to accept plea deal with Mueller","Trump Mocked For Calling Anonymous Sources 'Fiction' Hours After Sharing Story With Anonymous Sources","McGahn ‘Surprised’ By Trump Announcement Of His Departure: ‘Of Course It Happened This Way’","Michael Cohen is resigned to going to prison to protect his family","DeSantis warns Floridians not to \"monkey this up\" by electing Gillum","Florida's Republican Candidate For Governor Just Said A Vote For His Black Rival Would \"Monkey\" Up The State","Trump’s marijuana task force ordered to ignore data that shows positive impacts: report","Hey, GOP, there’s already more evidence to impeach than the last time you did it","2018 midterms: millennials prefer Democrats, but only half plan to vote","Arizona’s Voters Have Spoken and Rendered Joe Arpaio Irrelevant","Andrew Gillum: Progressive Values Give Voters Something to 'Vote for, Not Just Against'","5 Percent of Trump Voters Would've Changed Their Vote if Stormy Daniels Allegations Surfaced Week Before Election, Poll Finds","San Juan mayor says the Trump administration killed thousands through neglect during Hurricane Maria","Mueller fights Russian firm's attempt to 'intervene' in Roger Stone aide's appeal","Dictionary.com posts definition of 'dog whistle' in response to DeSantis's 'monkey' comment","Avenatti asks court for expedited deposition of President Trump","Ivanka Trump Was More Than Complicit In Obama Equal Pay Rollback—She Had A Hand In It, Watchdog Alleges","FBI: No evidence Clinton server hacked despite Trump tweet","Trump says White House counsel Don McGahn will leave in the fall","Gillum: ‘I’m Not Going To Get Down In The Gutter With DeSantis And Trump’","Trump lawyer Giuliani got paid to lobby Romanian president","Japan and North Korea held secret meeting as Shinzo Abe 'loses trust' in Donald Trump","The Trump Administration Has Secretly Launched an Anti-Weed Committee","Sources: Second Trump Org employee discussed immunity deal","Debate crowd laughs after GOP lawmaker says he’s been ‘accessible'","GOP uncovers humiliating evidence suggesting nation might be interested in dating Beto O’Rourke","Fox News denounces DeSantis's 'monkey' remark on Dem rival","Trump Says He Did A “Fantastic Job” In Puerto Rico — The Day After It Was Revealed Nearly 3,000 People Died","Massachusetts Democrat calls for Clarence Thomas impeachment","Gillum after upset win in Florida: ‘We can run wholly on our values’","John McCain Picks Anti-Putin Russian Poisoned, Almost Killed as Pallbearer in Apparent Dig Against Trump","Trump Was Forced To Unblock His Twitter Critics. Now They're Getting Sweet Revenge.","\"Suspicious\" Transactions At Russian Embassy Sparked Deeper Bank Probe Than Previously Known","Texas Republican Party Accidentally Creates Killer Campaign Ad for Beto O'Rourke","In Unprecedented Move, The US Postal Service Released A Former CIA Officer’s Security Application to Republican Group","The White House Is Gearing Up for a Secret War on Legal Weed","Gillum consultant: DeSantis 'monkey this up' comment 'blatantly racist'","Mueller wants to review emails between Manafort, former lawyer","Texas GOP Succeeds in Making Beto O’Rourke Look Extremely Cool","DeSantis Moderates Hate-Filled Facebook Group That Attacks African-Americans, Parkland Survivors and Muslims","Accused Russian agent Maria Butina was talking to FBI in South Dakota","Goodbye, Joe Arpaio: Last in the Senate Race, First in 'Blood, Slime, and Misery'","Trump tells Christian leaders he changed key tax law (but he didn’t)","Democrats Are Going To Get Trump’s Tax Returns If They Win The House","FBI rebuts Trump tweet about China hacking Hillary Clinton's email","Republicans can’t even agree to take a segregationist’s name off a building","Yes, it’s possible to indict a sitting U.S. president. Here’s why.","Roger Stone Associate Randy Credico Talks to Feds","Trump, without evidence, blames China for hacking Clinton emails","Russian Intelligence Is Co-opting Angry Young Men","U.S. probing whether laundered funds used to pay Chris Christie, Trump lawyer","Texas GOP Slammed For Trying To Make Beto O’Rourke’s Former Punk Band An Issue","David Hogg: Gillum’s message connected to 'young people' in Florida","Don McGahn reportedly blindsided by Trump tweet on his departure","Democratic nominee Andrew Gillum: Florida wants a governor who's 'not misogynist, not racist'","Mueller asks for more time to decide whether to retry ex-Trump campaign chief Paul Manafort on deadlocked criminal counts","The Mayor Of San Juan Asked If Trump Was Proud That 2,975 Died In Hurricane Maria","Manafort to Learn If Feds Will Add Third Trial to Deepening Woes","Here’s the photo of a very white summer intern class the White House didn’t release","California Might Make Conversion Therapy Consumer Fraud","Letter from House Oversight Senators Connolly and Cummings Requesting Investigation into Leaked SF-86 Security Clearance Application","FCC can define markets with only one ISP as “competitive,” court rules","Gillum: ‘Let Me Be Articulate And Clear: We’re Better Than This In Florida’","Parkland Parent Lori Alhadeff Wins Election to School Board in Florida","Donald Trump Using ‘Tyrant’s Playbook’ With Talk Of Violence If Republicans Lose House, Says Democratic Congressman","Federal Judge demands Sec. of State Kemp explain why Ga. can't switch to paper ballots","Jeffrey Toobin: Trump’s Election Warning Is Really About ‘Scary Black People’","Trump incorrectly says \"Fake CNN\" used non-existent anonymous source","CNN: Cohen accepts 'he's going to go to jail for some time'","New poll: Only 17 percent would approve of Trump pardoning Manafort","Trump personally lobbying GOP senators to flip on Sessions","Don't forget Donald Trump Jr. and his Trump Tower meeting. He broke the law, too.","Hispanic citizens are being denied passports because Trump administration thinks they were born in Mexico","Why Is the Most Powerful Man in Hollywood Hiding the Other Trump Tapes?","San Juan mayor: Trump is 'incapable of feeling solidarity and empathy'","An attorney for a crack dealer tried to use Trump's attacks on 'flipping' in his closing argument in a court case","Google fires back at Trump: You're wrong, our search results have zero bias","N.C. Republicans warn of ‘unmitigated chaos’ after judges strike down House district maps","Washington Capitals player won't attend White House visit","Ex-CIA officer running for Congress says GOP obtained her unredacted personnel file with sensitive information","Donald Trump was forced to unblock Twitter critics after court ruled he was violating constitution","If Anyone Had Bothered Talking To Black Voters, They Would Have Known Andrew Gillum Was Going To Win","Inside The Trump Administration’s Secret War On Weed","Trump says White House Counsel Donald McGahn will leave his job in the fall","Migrant mother plans multiple lawsuits after toddler detained at ICE dies weeks later","Southerners Tore Down Silent Sam. Now Northerners Need to Tear Down Confederate Flags.","Mueller probing suspicious transactions made by Russian embassy around the election and inauguration","Government Watchdog Raises Questions About Trump's Decision Not To Move FBI","Trump Lawyer’s Wife Busted In The Back Seat Of Her Maserati With An Inmate: A Metaphor For America","Tabloid that kept Trump secrets faces losses, legal trouble","Puerto Rico Raises Official Death Toll in Hurricane Maria From 64 to 2,975","Puerto Rico's new Hurricane Maria death toll demands an inquiry into why the truth is only coming out now","Sen. Elizabeth Warren says she voted for Massachusetts marijuana legalization in 2016","Poll: Nearly two-thirds say Trump should voluntarily talk to Mueller","Republicans can’t shake their preoccupation with Clinton, emails","Liz Crokin Blames Her Surfing Injury On A Spell Cast By Hillary Clinton","NATO considering naming its HQ building in honor of McCain","Don McGahn’s Exit Signals an Explosive New Phase in the Russia Probe","U.S. is denying passports to Americans along the border, throwing their citizenship into question","Trump Says ‘We Did a Fantastic Job in Puerto Rico,’ Where Storm Killed Almost 3,000","Florida's GOP gubernatorial nominee says a vote for his black opponent would 'monkey this up'","Poll: Michael Cohen's guilty plea raises serious questions about Donald Trump's behavior","She oversaw the push to shrink two Utah national monuments. Now, she’s going to work for one of the world’s largest oil and gas companies.","Sanders-backed Andrew Gillum wins major upset in Florida Dem gov primary","Even Republicans don't want Trump to pardon Paul Manafort, poll shows","'Incapable of Feeling Empathy,' Says San Juan Mayor After Trump Brags of His 'Fantastic Job' in Puerto Rico","Trump firing Jeff Sessions looks more likely than ever. Here’s the storm that awaits.","Gillum ties DeSantis 'monkey' comment to Trump rhetoric","Who, Exactly, at the Texas GOP Thought This Was a Good Idea?","A Post-McCain Mystery: Why Does the GOP Put Up With Trump’s Graceless Vulgarity?","Everyone’s Watching To See What Robert Mueller Does By Next Friday","Trump-backed candidate's 'monkey' comment draws fire in Florida race","Surprise, Turns Out the Left Is Still Alive: Andrew Gillum’s victory in Florida shows that the progressive left is thriving","Trump: We did a fantastic job in Puerto Rico","White House lawyer who may have incriminated Trump in extensive Mueller interviews may leave admin","Ron DeSantis on Fox News warns Florida not to 'monkey this up' by electing Andrew Gillum","Dem House candidate says she'll file Clarence Thomas impeachment resolution if elected","Qatar Attempted to Lobby Huckabee, Dershowitz to Influence Trump","After Jacksonville shooting, NRA’s panoply of lies gets even weirder","On Google Maps, it's already the McCain Senate Office Building","Former Texas cop who shot and killed a black teen leaving a party found guilty of murder","Kavanaugh Will Try to Hide His Views on Abortion. Here’s How to Not Be Fooled","Trump posts 1 am tweet saying China hacked Hillary Clinton's email, while providing no evidence","DeSantis under fire for saying Florida shouldn't 'monkey this up' by electing Gillum, who is black","Data from states shows thousands of Amazon employees are on food stamps","Beto O’Rourke calls on Texas to decriminalize pot, stop arresting so many students","Record 2.3 million new STD cases in America as federal funding cuts hinder prevention projects","Giuliani Criticizes an Anticorruption Crackdown in Romania","Gillum Vows To Suspend, Review Death Penalty In Florida","Free Tennessee community college for adults program shatters expectations in its first year","Paul Manafort wants to move his D.C. trial to Roanoke, saying Washington jurors are biased","Rep. Bill Pascrell calls Trump's 'violence' remarks 'fascism in the flesh'","San Juan mayor blasts White House for saying it's ‘proud’ of Hurricane Maria response","Trump’s authoritarian musings are getting normalized, part 973","Ex-CIA House candidate accuses GOP super PAC of obtaining her security application","Why Are U.S. Bombs Killing Civilians in Yemen?","GOP eyes another shot at ObamaCare repeal after McCain’s death","Rep. Called Constituent In Effort To Bury First Allegation Of Signature Forgery","Arizona has a historic all-female Senate race","Texas Republicans are trying to use Beto’s punk rock days against him","“It Seems Like Iowa in 2007”: Is Beto O’Rourke the Left’s Obama-Like Answer to Trump in 2020?","California Becomes First State To Pass Law Ending All Use Of Money Bail","Beto O’Rourke yard signs are everywhere. Where are Ted Cruz’s?","Russia Secretly Ran News Websites In Eastern Europe","U.S. Citizens Targeted by ICE","Bernie Sanders fires back against Amazon, calling subsidy reliance ‘absurd’","How McCain Arranged His Funeral To Be The Ultimate Middle Finger To Trump","“He Can Find a Way to Release Those Taxes”: How Andrew Cuomo and the Empire State Could Terrorize Trump","Yes, Don McGahn leaving the White House is a very big deal","NASA administrator says he always thought humans caused climate change","There are thirteen cases in the pipeline right now that Brett Kavanaugh can use to kill Roe v. Wade","Ag Secretary Perdue on Trump's $6 billion farmer bailout: 'Everybody wants trade, not aid'","Trump Claims Google Didn't Promote His State Of The Union. Google And This Screenshot Say Otherwise.","Andrew Gillum proposes corporate tax hike for more education funding","If 9/11 Attacks Can Spark Trillions in War Spending, Asks Ocasio-Cortez, Why Can't US Find Funding for Puerto Rico 'Marshall Plan'?","70% of Americans now support Medicare-for-all","Google Maps Puts McCain’s Name on Senate Building Named After Racist","California Gov. Jerry Brown signs overhaul of bail system, saying now 'rich and poor alike are treated fairly'","Ron DeSantis to Florida: Don’t ‘Monkey This Up’ by Electing Andrew Gillum","California sets goal of 100 percent clean energy by 2045","Trump blames China for hacking of Clinton emails, offers no evidence","Senator requests documents on Michael Cohen’s ‘pay to play’ work for nuclear developer","DeSantis says Florida voters would ‘monkey this up’ if they elect Gillum as governor","West Virginia’s high court denies bid by former coal CEO Don Blankenship to get onto ballot in U.S. Senate race","DOJ Investigating Whether Fugitive Paid Trump Lawyer, Chris Christie with Dirty Money","Dem lawmakers slams Trump for warning of violence if Dems win House: 'Fascism in the flesh'","'These are violent people': Trump reportedly told Christian leaders there will be 'violence' if the GOP loses in midterms","LA City Council votes to rename road after Obama","On National Security, Kavanaugh Has a History of Extreme Deference to the President","Trump warns of violence if GOP loses midterms","Federal judge rules Boston officials can deny request to fly Christian flag at City Hall Plaza","Papadopoulos sticking with plea deal with Mueller, wife says","The Latest: Mom of school massacre victim wins board seat","Giuliani says firm defending corrupt Romanian-American is paying him","Racism Quickly Becomes an Issue in Florida Governor's Race","NYT: Trump Asked Porter ‘Several Times’ To Replace McGahn As WH Counsel Last Year","What Is Trump Getting for Sucking up to Saudi Arabia?","1,000 First Responders Urge Congress to Restore Net Neutrality After Verizon Throttles California Firefighters During Wildfires. \"It is unconscionable for corporations to endanger public safety for the sake of profit.\"","Getting Dem Friends to Vote: There's an App for That","Ivanka Trump Smiles with Pastor Who Said Same-Sex Marriage Is Satan's Work","Election Hacking: Security Upgrades Are Too Little, Too Late For 2018 Midterms And Race Is Already On For 2020, Experts Say","Poll: Scott Walker trails Democratic challenger by 2 points","Trump touts Puerto Rico response as 'fantastic' despite nearly 3,000 dead","New York Assembly to hold hearings on legalizing marijuana","McCain's choice of Russian dissident as pallbearer is final dig at Putin, Trump","Trump, without citing evidence, says China hacked Hillary Clinton’s emails","Scoop: Don McGahn's coming White House exit","Devin Nunes’s Secret Field Trip to London Ends in Failure","Andrew Gillum wins Florida Democratic primary in bid to become state's first black governor","International Trade Commission overturns Trump tariffs on Canadian newsprint","Mueller team seeks more time to decide if they'll retry Manafort on deadlocked charges","Los Angeles voted to name a street after Obama where he first visited the city as a presidential candidate in 2007","Trump says government 'did a fantastic job' with Puerto Rico hurricane response","Trump keeps threatening tech companies, but he’s terrible at following through","The Flynn Tapes: A New Tell","Trump asks 'how the hell' Bruce Ohr still works at the Justice Department","Low Wages And No Stability: How Amazon’s Use of Perma-Temps Is Hurting Workers","Trump’s Tariffs on Canadian Newsprint Are Overturned","Trump announces White House Lawyer Don McGahn's Resignation","Study finds extreme CEO-worker pay disparity at taxpayer-supported companies","CIA Analyst Turned Candidate Fears She’ll Get Doxxed Next","Bernie Sanders's Response to Amazon Statement on Working Conditions","Kushner Companies Fined $210,000 for Filing False Documents: 'It’s Bare-faced Greed'","A judge ordered immigrant children removed from troubled Texas facility. They’re still there.","We have a new reason not to trust ICE","Fox News Host Rips Donald Trump Over Claims Google is ‘Rigged’: ‘What He Doesn’t Like Is the News’","Democrat Andrew Gillum wins Florida Primary, could become state’s first black governor","Trump: We did a “fantastic job” handling the Puerto Rico hurricane that killed 3,000","Trump, Without Evidence, Blames China for Hacking Clinton Emails","Mexico denies it will pay for border wall after Trump repeats claim","Trump slams Florida primary winner Gillum as 'failed socialist mayor'","Trump reportedly promised Kim Jong Un he'd sign a declaration ending the Korean War — he didn't, and now North Korea is furious","America is one of 6 countries that make up more than half of gun deaths worldwide","Trump Googled Himself This Morning and Got Sad. Now the White House Is Looking Into Regulating the Search Engine","Don’t ‘monkey this up’ and elect Andrew Gillum, Ron DeSantis says","Brett Kavanaugh: Senate Democrats call for postponement of hearing","Hurricane Maria Now the Most Devastating Storm to Hit the U.S. | Velshi &amp; Ruhle | MSNBC","It’s Official: Hurricane Maria Led to as Many Deaths as 9/11","Rush Limbaugh falsely claims Jacksonville shooter part of Trump ‘Resistance’","She’s the Dems best shot at taking the Senate. She’d also be the nation’s first bisexual Senator.","Betsy Devos Is Moving Forward With Her Plan to Protect Students Accused of Sexual Assault","In Tacit Rebuke, U.S. Embassy in South Africa Rejects Trump Tweet","How the black vote carried Andrew Gillum to victory","DeSantis Warns Florida Not to ‘Monkey This Up,’ and Many Hear a Racist Dog Whistle","Trump Asked Rob Porter Last Year If He Would Take Over for McGahn","Hothouse Earth Is Merely the Beginning of the End","Brett Kavanaugh Sure Does Love Giant Corporations","Eric Trump Mocked For His 'Most Beautiful Building' In The World Boast","Devin Nunes Went to London to Get Dirt on Christopher Steele. Britain’s Spies Wouldn’t Meet With Him.","Tammy Baldwin: Protect preexisting conditions by banning short-term plans","The ACLU’s Decision to Defend the NRA Has Led to an Internal Clash That Could Transform the Group","Don McGahn: White House Counsel Reported to Exit This Fall","China denies Trump's claim it hacked Clinton's emails","ACLU claims ICE still detaining some asylum-seekers for no reason despite court order","The agency created to protect elections is broken","Trump unblocks more Twitter users after court order","Obama releases video of visit to high school on Chicago's Southwest side","Chris Collins turned down plea deal from feds before indictment","Blumenthal To Challenge Kavanaugh Over Net Neutrality","Donald Trump Needs to Be Impeached to Stop Pardons of Criminals: New Impeachment Ad","Parkland students have already affected change at the polls","FBI pushes back against Trump’s latest anti-Clinton theory","The Forest Service Is Silencing Women","Mayor lambasts Trump's hurricane 'shame'","As the School Year Begins, More Teachers Across the Country Could Soon Strike","Trump's North Korea policy is in chaos","Stormy Daniels says Trump lasted 'maybe' two minutes in bed: 'I'm being generous'","Trump says 'no reason' for military exercises with South Korea despite stalled nuke talks with North","California becomes second US state to commit to clean energy","The Myth that Won't Die: Undocumented Aliens are Criminals","Bail bondsmen ask voters to kill California law that puts them out of business","Trump’s continued indolent response to Hurricane Maria is our worst fears about him come true","GOP Candidate Criticized After Saying Black Opponent Would 'Monkey This Up'","This Arizona Republican thought his sexual harassment scandal could help him win. It didn’t.","Feds probe whether fugitive financier paid Chris Christie with laundered funds","West Virginia Supreme Court blocks Blankenship from Senate ballot","Oklahomans Oust GOP Lawmakers Opposed to Teacher Raises With Tax Hikes","'We did a fantastic job in Puerto Rico': Trump defends response despite spike in deaths after Hurricane Maria","US government failing to provide recovery plans for some endangered species","John McCain episode shows Donald Trump will never miss a chance to debase himself","Kavanaugh's ties to disgraced mentor loom over confirmation","Well, at Least Sheriff Joe Isn't Going to Congress","How Puerto Rico's death toll climbed from 64 to 2,975 in Hurricane Maria","Newspaper: Florida state lawmaker called 911 on reporter for asking her questions","Trump announces White House counsel McGahn to leave this fall","Amazon, in a rare political response, calls Bernie Sanders' claims of poor worker conditions 'inaccurate and misleading'","Sen. Grassley Implores Trump Not To Let McGahn Go","Opinion | Can Trump find a sufficiently devoted lickspittle to replace Don McGahn?","Beto O’Rourke, John McCain, and Respecting Fellow-Americans","Donald Trump’s take-it-or-leave-it NAFTA threat against Canada has experts questioning legality","Mike Pence Could Offer Donald Trump a Pardon to End His Presidency Now, Says Professor","New U.S. Sexual Misconduct Rules Bolster Rights of Accused, Protect Colleges","A Jolt To The Jugular! You’re Insured But Still Owe $109K For Your Heart Attack","With a Russian dissident as pallbearer, McCain takes a tacit swipe at Putin","DeSantis says Floridians can't 'monkey this up' by electing African-American Democrat as governor","Trump is railing against anonymous sources. But a few years ago, he was one.","Manafort defense appears overwhelmed by challenge of second trial","Arizona avoids a 'Roy Moore situation' with McSally","Indicted Rep. Duncan Hunter Threw His Wife Under the Bus. Now He Says ‘Leave My Wife Out of It.’","Trump's tweet on WH counsel leaving surprises some in GOP","Russian company latches on to 'witch hunt' accusations against Mueller","Morning Consult editor: Americans are more likely to support 'Medicare for all' than 'Health-care for all'","News media hesitate to use ‘lie’ for Trump’s misstatements","‘My life is threatened.’ Listen to Sen. Daphne Campbell call 911 on a Herald reporter","Shep Smith: ‘Fake news’ seems good for Trump, real news is ‘unpleasant’","Trump privately revived the idea of firing Sessions this month, according to people familiar with the discussions","Thousands endure blazing Arizona heat to view Senator John McCain's casket","Kavanaugh confirmation is not inevitable","Trump unblocks more Twitter users after court ruling","Fla. Shooting Suspect Legally Bought Guns Despite Mental Illness","Ted Cruz says Beto O’Rourke voted against Harvey tax breaks. O’Rourke says there’s more to the story.","My Fellow Republicans Need To Get Over Hillary Clinton And Take Trump's Corruption Seriously","Who Will Replace Don McGahn? Trump Is Considering Veteran Impeachment Lawyer Emmet Flood","Immigrant Mother Whose Child Died in ICE Custody Plans Suit","Former DHS official had ties to white nationalist groups","Ex-Police Officer Convicted of Murdering Unarmed Black Teen","Andrew Gillum’s Stunning Victory Sets Up an Epic Governor’s Race in Florida","Grassley derides those who spend all their money 'on booze or women or movies' - maybe the single dumbest political quote in the last 12 months","California Just Became The First US State To Condemn Surgeries On Intersex Children","Trump decries anonymous sources while lauding pro-Trump stories with anonymous sources","Meet Crystal Mason, the Black Texas Mother Facing 5+ Years in Prison for Voting in the 2016 Election","U.S. Trade Deficit in Goods Widened to $72.2 Billion in July","McConnell slows efforts to rename Senate building for McCain","FBI Finally Responds to Trump’s China-Hillary Clinton Hacking Conspiracy","Duncan Hunter Says ‘Leave My Wife Out Of It’ After Implicating Her In Campaign Fund Misuse","White House drops plan to cut foreign aid","Giuliani: If Trump Decides To Fire Sessions, He Will Wait Until ‘After The Investigation’ Is Over","US-Mexico deal means very little without Canada","Mock hearings and staged protests: Inside the White House's 'intense' preparations for Brett Kavanaugh's confirmation","Amazon accuses Sen. Bernie Sanders of misrepresenting worker pay, tells workers to send him positive stories","Ron DeSantis, GOP nominee, warns Florida not to 'monkey this up' by electing Andrew Gillum as governor","Andrew Gillum Wins Florida Primary in a Coup for Progressives","Zurawik: Let's just assume Trump is always lying and fact check him backward","U.S. Probing Whether Malaysian Fugitive Laundered Funds to Pay Chris Christie and Trump Lawyer","Trump Privately Urges Pastors to Help Him From the Pulpit in Midterms","U.S. International Trade Commission overturns duties on Canadian newsprint","Trump Slammed as Racist for Telling Evangelicals if Democrats Win Violence Will Break Out","'What the Political Revolution Is All About': Historic Upset by Progressive Andrew Gillum in Florida","Trump says joint military exercises are still off the table","Cindy McCain lays her head on her husband's casket in heartbreaking photos from John McCain's memorial in Arizona","Sprint, T-Mobile merger will end 28,000 jobs, union claims","Becoming a U.S. citizen taking longer than before, immigrant advocates say","Hunter Now Says ‘Leave My Wife Out of It’","Republicans rejected McCain and embraced Trump. What does that say about them?","Police officers are almost never convicted of murder. Body cameras may have made the difference in this Texas case.","Grassley tweets Trump on McGahn departure: \"U can't let that happen\"","Mueller team asks for more time on remaining counts in first Manafort trial","Don McGahn Is Leaving the White House","The North Carolina gerrymandering chaos that could upend the midterms, explained","Republican Candidate for Governor Says Florida Voters Shouldn’t “Monkey This Up” by Voting for the Black Democrat","Representatives in hiding: campaigning as a Republican incumbent in upstate New York","New York governor reportedly halted Weinstein probe after donation from Weinstein lawyers","NATO considers naming headquarters after McCain","Trump unblocks more Twitter users after court ruling... but not Rosie","Manafort’s Defense Hints at Major Strategy Change for Second Trial","Mattis: U.S. Will Restart Military Exercises With South Korea","The Courts Are Saving Democracy in North Carolina","AT&amp;T-backed robocalls tell seniors net neutrality raises phone bills by $30","A new tax bill will target Amazon and Walmart","California passes trio of gun control bills, including lifetime ban on domestic violence convicts","Trump’s economic adviser: ‘We’re taking a look’ at whether Google searches should be regulated","Republicans Who Oppose Teacher Protests Are Losing Their Primaries, Even in Red States","Trump told Kim Jong Un in Singapore he'd declare end to Korean War","Canada stunned and worried about Trump trade threats","How many norms can Trump and evangelical leaders break in one meeting?","Impeachment not enough: Donald Trump's presidency 'should be annulled,' says former Clinton official","Senate Democrats plan to grill Brett Kavanaugh about his support for surveilling Americans","A New Book Details the Damage Done by the Right-Wing Media in 2016","Joe Arpaio is in last place in polls ahead of Arizona’s Senate primary, a sign of how the state is changing.","Trump Aide Kelly Sadler Joked About McCain Dying—and Was Offered a New Job","Stormy Daniels Quips Donald Trump 'Maybe' Lasted 2 Minutes In Bed","Rudy Giuliani attacks Romania for 'excessive' crackdown on corruption","California Lawmakers Just Voted to Make All Its Electricity Emissions-Free by 2045","Beto O’Rourke appearing on 'Ellen' next week","A new way to slay Trumpism? The shocking Florida outcome sets up a big test.","Facebook and Twitter executives to testify to Congress next week","U.S. Probes Whether 1MDB Malaysian Fugitive Laundered Funds to Pay Chris Christie","Trump Warns Clergy Democrats Will Bring Back Johnson Amendment, Which Was Never Repealed","The government must do more to protect our food supply","Russia's 'unprecedented' military drills shows they are preparing for war: Australian expert","Former Police Officer Guilty Of Murder In Texas Teen's Death","California Becomes First State To End Cash Bail After 40-Year Fight","Trump signals he may not seek to regulate Google search results","Republican attacks on DoJ Russia experts a boon to Russian mafia","The Pentagon is downplaying serious problems with the F-35, watchdog says","Arizona voting problems: Polls will not stay open later after malfunctions","DeSantis says Florida shouldn’t ‘monkey this up’ by electing Andrew Gillum","I was deluded. You can't beat fake news with science communication - Jenny Rohn","Tallahassee Mayor Andrew Gillum shocks Democratic rivals, wins nomination for governor","Multnomah County District Attorneys Walked Out of a Conference Presentation Because of Ferguson Prosecutor’s “Offensive and Unprofessional” Comments","Trump administration seeks to ease tensions with Moscow as new sanctions loom","Toddler dies after ICE detainment, lawyer alleges substandard care","Trump sees no need for U.S.-South Korea war games at this time","Trump often unwelcome and unwilling to perform basic rituals of the office","Twitter Users Torch Trump Over Bizarre 'I Remember Pearl Harbor' Comments","DeSantis: Florida voters shouldn’t ‘monkey this up’ by voting for Gillum","Google responds to Trump, says no political motive in search results","Opinion | Could this be the next Trump scandal?","A loaded word: News media hesitate to call Trump’s misstatements ‘lies’","A “Social Wealth Fund” Could be the Next Big Idea","Trump’s Student Debt Policies Are Mind-bogglingly Corrupt","A Malaysian fugitive might have paid Chris Christie and a Trump lawyer with laundered funds","Beto O'Rourke could pull off a huge upset against Ted Cruz in Texas, latest polls suggest","Former Harry Reid staffer hits Schumer for deal fast-tracking judicial confirmations","Ohio, New Jersey Pension Funds Invested $625 Million in National Enquirer Parent","Trump unblocks more Twitter users after U.S. court ruling","WH Can’t Even Follow Through On Trolling, Insists Brennan Clearance Revoked Despite Paperwork Delay","EPA prepping changes to Obama-era coal rule","Giuliani’s telling admission: All that matters is that Mueller is undermined","In Sudden About-Face, Rep. Duncan Hunter Is Now On His Wife’s Side","Poll: Democrats hold 6-point lead on generic ballot","Trump voters will never flip but that means great news for Democrats","Google gives Trump a look at reality. Trump doesn’t like it.","Thanks to Manafort, we now know why Bob Dole joined the board of a crooked bank in Central Asia","Vietnamese residents pay respects to McCain","Big Telecom Resorts To Lying To Senior Citizens To Scuttle Net Neutrality In California","White House Counsel Don McGahn Will Soon Leave His Job, Trump Tweets","Beto O'Rourke Is the Type of Politician Ted Cruz Always Wished He Could Be","Time Is Running Out, So Why Aren't Democrats Yelling About Climate Change?","Don McGahn Leaves Trump’s Side With His Mission Accomplished","Manafort wants second trial to move to Roanoke, Virginia","An Ex-CIA Officer Running For Congress Says A GOP PAC Has Her Security Clearance App","Reporters fire back at Trump for ripping ‘anonymous sources’","Ron DeSantis Tells Florida Not To 'Monkey This Up' By Electing Andrew Gillum","Trump Says China Is Making North Korea Talks ‘More Difficult’","Former President Jimmy Carter: Trump \"is very careless with the truth\"","Ex-Trump campaign chief Paul Manafort asks judge to move next trial on Mueller charges out of Washington because of publicity","A good-news story for Donald Trump when he Googles himself","Jerry Brown signs bill eliminating money bail in California","Andrew Gillum scores stunning victory in Democratic nomination for Florida governor","How Special Interests Hide the True Costs of Tariffs","U.K. Spy Agencies Refused to Meet Devin Nunes for Christopher Steele Dossier Query, suspecting he may have been \"trying to stir up controversy\"","Graham: ‘A lot of people have been burned by being in Trump’s orbit’","Floridians have climate change on the brain this election year","Toobin calls Trump's bluff: Let's be clear ... - CNN Video","President tweets Andrew Gillum is a 'failed Socialist;' mayor says Trump talk not helpful","'Fake meat' is at the center of food fight in Missouri","Flake fires back at Trump: I never endorsed McSally, but I did endorse Doug Jones","Trump starts a feud with an algorithm after Googling his own name","White House counsel Don McGahn to depart in the fall, Trump announces","Trump spars with Andrew Gillum, the surprise Democratic nominee in Florida’s governor’s race","Billionaire Peter Thiel gives first six-figure donation of the midterm campaign cycle to the RNC","Forward Brett Connolly says he won’t attend Capitals’ White House visit","Republicans don’t want Democrats to rename a building to honor John McCain.","Trump is rage-googling himself, and he doesn't like what he's found","The New Lobbying: Qatar Targeted 250 Trump ‘Influencers’ to Change U.S. Policy","President non grata: Trump often unwelcome, and unwilling, to perform basic rituals of office","Unless it’s about him, Trump doesn’t give a darn","California signed a law to to finally treat poor and rich the same when it comes to crime.","DoD: Afghanistan operations could hit 22 years ― but don’t call it a permanent presence","What is the Congressional Leadership Fund?","It’s not a deal, it’s not that big, and it’s not replacing NAFTA","Deepwater Horizon Oil Spill Wasn't So Bad, Says Former Florida Official","Lawsuit Threatens Affordable Care Act Preexisting Condition Protections But Impact Will Depend on Where You Live","Hurricane Maria caused an estimated 2,975 deaths in Puerto Rico, new study finds","When ISPs Tell Seniors Net Neutrality Laws Will Increase Their Bills, They’re Lying and Losing","Critics say LePage’s support for case challenging protections for LGBT workers puts Maine in a bad light","Joe Biden Endorses Andrew Cuomo Ahead Of Cynthia Nixon Debate Tonight","Despite strong economy, many Americans are struggling to get by","McConnell's Senate Continues to Rapidly Confirm Trump's Judges","Trump's Views on 'Flippers' Not Welcome at Trial, Judge Rules","This Surprise Court Ruling Could Give Democrats a Boost in the Midterms","GOP strategist: 'Apocalyptic' rhetoric is popular with some of Trump's base","Beto O'Rourke accepts invitation to appear on 'The Ellen DeGeneres Show'","Avlon breaks down unconstitutional redistricting","Inside Stephen Miller’s hostile takeover of immigration policy","Donald Trump Told Japan's Shinzo Abe He 'Remembered Pearl Harbor' and Then Ripped the Prime Minister Over Trade Deals: Report","Lindsey Graham says any new attorney general must let Mueller finish his job","Koch group pours nearly $5M into ads to boost three GOP Senate candidates","President Non Grata: Trump often unwelcome and unwilling to perform basic rituals of the office","Gov. Cuomo, Nixon Gear Up For Primary Debate On CBS2","Trump news: President claims Google is rigging search results to make him look bad","Trump White House is what a real culture of corruption looks like","McCain behaved like a hero. Trump is behaving like a vengeful brat.","‘Can You Stop Interrupting?’ ‘Can You Stop Lying?’ Cuomo and Nixon Spar in Debate","Andrew Gillum, Ron DeSantis and higher-than-expected voter turnout in Florida primary","Americans Are Making Less Money Despite Trump’s Promises","Andrew Gillum’s Surprise Win in Florida Is a Huge Deal","Biographer: Mike Pence Believes God Wants Him to Be President","The GOP claims its proposal would protect people with preexisting conditions. That's a lie","Nevada Senate race between Heller, Rosen rated as a tossup","Cindy McCain kisses husband's casket at Arizona service, daughter Meghan weeps","Trump supporters whose Russia shirts went viral: 'We're not traitors'","'Just watch me,' Couillard says of protecting Quebec dairy industry | CBC News","Trump doesn't seem to realize his new trade deal isn't a trade deal","White House Counsel Don McGahn To Depart This Fall","Trump talks tough about the military, but he hasn't visited a war zone where US troops are fighting — unlike his predecessors","Democrats need to start taking voting rights seriously","Experts: Trump's allegations of tech bias may actually reduce the odds of industry regulation","Manafort asks for D.C. trial to be moved to Roanoke, Va.","California Lawmakers Pass Historic Bill Mandating 100 Percent Carbon-Free Power By 2045","Historian: Trump comparisons aren't fair to Nixon","Alleged drug dealer’s lawyer thinks Trump’s anti-‘flipping’ comments help case","Sen. Feinstein: President Trump ‘Can't Get Over’ Jeff Sessions Recusal | Andrea Mitchell | MSNBC","The Supreme Court Is In Danger Of Losing A Generation Of Voters","The Florida governor’s race is the epitome of politics in the Trump era","The Political Uses of Murder","Is the U.S. government wasting millions on trips abroad?","Maria Butina: Private Messages Reveal Accused Russian Spy’s True Ties to D.C. Wise Man","Public employees in Ohio and New Jersey may suffer if National Enquirer’s legal troubles continue","White House counsel Don McGahn to resign, Trump confirms","Bernie Sanders asks Amazon employees to detail their working conditions","Trump Claims Without Evidence That China Hacked Clinton Email Server","Progressive underdog Andrew Gillum secures Democratic gubernatorial nomination in Florida upset","Progressive Andrew Gillum Wins Florida Democratic Gubernatorial Primary in Upset","Weak economic recovery was down to flawed policies, not secular stagnation","Trump Has Changed How Teens View the News","Trump claims he’s losing social media followers because of Google, Facebook, and Twitter censorship","Trump’s new coal policy is dangerous","The President Is a White-Nationalist Mob Boss—and His Base Doesn’t Care","Beto O’Rourke in statistical dead heat with Ted Cruz","What would a new congressional map look like in NC? Here’s one possibility.","Kentucky's technology director now the highest-paid employee with a $215,000 raise","Axios: McGahn Leaving White House After Kavanaugh Confirmed Or After Midterms","Governor makes California first state to eliminate bail","Trump’s Coal Plan Will Kill People, but at Least It’ll Create Jobs, Right? Wrong.","White House and Google: Trump adviser defends possible regulation","Progressives Will Lead Democrats In Some Of 2018’s Biggest Contests","Mollie Tibbetts’s father decries vitriol against Hispanics, saying they’re ‘Iowans with better food’","Chris Cuomo: Trump looked like a loser - CNN Video","Fair elections just won a victory in the courts. Now the Republican assault begins.","Trump slams Andrew Gillum as a 'failed Socialist Mayor' after upset win in gubernatorial primary","California assembly passes bill mandating 100 percent clean electricity","Fmr. Prosecutor who deposed Trump: He won’t 'serve out a full term'","Mueller prosecutors ask to admit evidence of alleged past ‘bad acts’ by Paul Manafort in D.C. trial","Privacy groups ask senators to confirm US surveillance oversight nominees","Officials knew of problems starting machines at polling places day before Arizona primary; over 100 calls report issues","Puerto Rico Raises Official Death Toll to Nearly 3,000 as First Anniv. of Hurricane Maria Approaches","Four in 10 U.S. Workers Think They Are Underpaid","Andrew Gillum wins Florida governor primary in upset victory for the left","Judge to kick press out during jury selection for Manafort's next trial","Texas lawmakers press NASA to base lunar lander program in Houston","What impeachment is for: We talk about the tool incorrectly - NY Daily News","Mysterious ‘key figure’ in Russia probe sought Trump team contacts","“They're liquidating us”: AT&amp;T continues layoffs and outsourcing despite profits. The communications giant is expecting a windfall of $20bn in savings from Trump’s tax reforms, but has closed 44 call centers since 2011.","Poll: Americans believe Cohen, 44% want impeachment","Rand Paul’s Bizarre Mission to Moscow","Books, Not Magazines: Outcry Grows over DeVos Plan to Divert Federal Funds and Put Guns in Schools","Officer convicted in killing of 15-year-old Jordan Edwards — a rare outcome in police shootings","Devin Nunes’s Curious Trip To London","Manafort Wants His D.C. Trial Moved To Roanoke, Virginia","Beijing rejects Trump's claims that China is behind fentanyl crisis","Better Be Careful.' President Trump Warns Tech Companies After Google Tweets","Trump Will Have to Answer for the Real Puerto Rican Death Toll","Key Paul Manafort banker robbed in mysterious overnight break-in at his NYC penthouse: NBC New York","Sanders-backed Gillum notches Florida primary stunner","‘These Are Violent People’: Trump Warns Evangelicals Dems Will ‘Overturn Everything’","Reports: Trump warned evangelical leaders of ‘violence’ from the left if Republicans lose the midterms","McConnell: Sessions should stay as attorney general","The Department of Justice is Totally Wrong About Supervised Injection Sites","‘We never rank search results to manipulate political sentiment': Google responds to Trump's claim that the company is 'suppressing the voices of conservatives and hiding information'","The U.S. Has Blood on Its Hands in Yemen, and Can’t Wash It Off","Trump warns of ‘violence’ if GOP loses midterms in private talk with clergy – report","Trump renews attack against technology companies","Arizona primaries: David Garcia wins Democratic nomination for governor","Founder of Donald Trump's Favorite Poll Predicts Democrats Win House But Republicans Could Add Senate Seat","President Trump claims without evidence that China, not Russia, hacked Hillary Clinton's email","Florida braces for a clash of ideologies as conservative DeSantis faces liberal Gillum","Trump: 'No reason' for Korea war games right now","Politfact hits Limbaugh for claim Jacksonville shooter was part of Trump 'resistance'","Trump Claims Without Evidence That Google Is Rigging Search Results Against Him","Trump lawyer says Stormy Daniels wants to suppress Trump's right to free speech","Without Evidence, Trump Blames China For Hacking Hillary Clinton’s Emails","Trump is right. His trade war with China is causing a huge problem with North Korea","McCain was flawed, but he was a man of integrity. Trump should take note, but won’t.","Melania Trump Body Double Conspiracy Theory Resurfaces After Cohen Plea, Manafort Verdict","Mattis rebuffs idea of privatizing forces in Afghanistan","August 28th primary results: In most cases, leading fundraisers also lead the vote count","California Just Abolished Cash Bail","Puerto Rico raises official Hurricane Maria death toll from 64 to 2,975","Florida Republican Tells Voters Not to “Monkey This Up” by Voting for African American Opponent","Democrats Say Brett Kavanaugh Would ‘Cripple’ Net Neutrality ‘for Decades to Come’","Texas man is selling 3D gun blueprints online despite court orders","The GOP Is Scared of Putting John McCain’s Name on a Building Currently Named After a Segregationist","There’s a new global ranking of gun deaths. Here’s where the U.S. stands","Unfortunately for Trump, his allies aren’t any smarter than he is","There's one simple explanation for the wage stagnation 'puzzle' confounding top Fed officials","Don’t Pretend Facebook and Twitter’s CEOs Can’t Fix This Mess","'They're liquidating us': AT&amp;T continues layoffs and outsourcing despite profits","John McCain viewing live stream: Arizona senator remembered","Trudeau Touts NAFTA ‘Progress’ While Trump Threatens Auto Tariffs","Private armored guard prompts alert of gunman on UC Berkeley campus","White House Counsel Don McGahn will resign this fall, Trump says","Tallahassee Mayor Andrew Gillum wins crowded Florida Democratic primary, could become state's first black governor","The Military Community Might Actually Be Souring on Trump","Trump says White House counsel McGahn to leave in the fall","Trump administration to pay New York, Minnesota for lost health-care funds","McMaster warns SC Republicans that Democrats are 'like dogs' and 'they're dangerous'","Democracy is dying in Europe, and it can happen here","Mueller Asked Witnesses About Cohen Involvement in Trump Campaign","Our constitutional system was designed to prevent the rise of fantastically ambitious individuals, to limit them through a system of checks and balances. That’s the test we’re up against right now","Donald Trump’s trade deal with Mexico is a farce – and a lesson for Brexit","White House counsel to leave position this fall","Trudeau: NAFTA deal possible by Friday, but only if good for Canada","Ariz. candidate loses primary after suggesting harassment allegations against him would appeal to voters","Plan to power California with all renewable energy clears major hurdle","Judges Rule North Carolina Unconstitutionally Gerrymandered in Favor of GOP","Andrew Gillum, a Black Progressive, and Ron DeSantis, a Trump Acolyte, Win Florida Governor Primaries","Virginia lawmakers will start redrawing districts this week. What comes next and why it matters.","Gillum, blasted by President Trump on Twitter, says @ me next time","Manafort tries to move second trial out of DC","Trump Harps On ‘Fiction’ News: When You See ‘Anonymous Source,’ Move Along","David Pecker Resigns From Boards Of Canadian Media Company","Trump's bet on Kim Jong Un is looking increasingly shaky","Gov. Ducey Wants Cindy McCain To Approve Of Her Husband’s Replacement","Some Arizona polling places down, frustrating primary voters","Amazon blasts Bernie Sanders for 'inaccurate and misleading' claims about how it treats workers","Donald Trump warns of violence if Republicans lose midterm elections","New York Governor Cuomo to debate Democratic rival Cynthia Nixon","Media Continues Writing Premature Obituaries for the Democratic Left","Bernie Sanders-backed Democrat Gillum to take on Trump-endorsed Republican DeSantis in Florida gov race, NBC News projects","Interior official involved in shrinking national monuments quits to join oil giant BP","Don McGahn Will Leave His Job in the Fall","The Constitution Is for White People: Why White Bullets Are Worth More Than Black Lives","Honig: Trump has ‘signaled’ that he intends to pardon Manafort","Trump: The People Protesting at Trump Tower Looked Like ‘Ants’","California Abolishes Cash Bail Despite Criticism From Left and Right","Don McGahn: Trump says White House counsel to depart","Cuomo Received $25,000 From Weinstein Lawyer’s Firm as He Suspended Probe","The U.S. Hits Record STD Numbers—and Prevention Budgets Continue to Fall","Trump’s Mexico Trade Deal Looks Like a Lemon","The North Korea Peace Process Is All in Trump’s Head","John McCain Tried to Save the Republican Party From Itself, and Was Crushed","Trump: White House counsel Don McGahn to depart in the fall","Trump: White House Counsel Don McGahn Is Leaving in the Fall","Trump claims Google has been ‘rigged’ to show only bad news about him","British Intel Agencies Brushed Off Nunes Attempt to Investigate Steele Dossier","Lawmakers urge Trump administration to sanction China over Muslim crackdown","C.I.A. Officer-Turned-Candidate Says PAC Obtained Her Security Application","Polling locations across Maricopa County plagued by computer issues","Net neutrality is the Houston way [Opinion]","Mattis on Afghan war: 'Privatizing it is probably not a wise idea'","Republicans Are Ditching Trump. But What Will It Take for the Floodgates to Truly Open?","Dem pollster: It would take a perfect storm for O'Rourke to unseat Cruz","Conservatives: Stop Crying Wolf On Tech Bias Or No One Will Ever Take You Seriously","DC judge and Manafort team already clashing in court","Trump’s Secret Order on Pulling the Cyber Trigger","Overnight Energy: EPA asks justices not to take up case on Obama rule | Wheeler says new coal plan will 'level the playing field' | Pentagon warns against proposal on science transparency","Manafort asks to move upcoming trial, cites DC publicity","The real scandal isn't collusion with Russia, it is everything about Donald Trump","Last Night, Arizona Primary Voters Backed Two Competing Visions for the Democratic Party","Arizona's largest county wants polls open later amid Election Day snafu","Discussion Megathread: 8/28/18 Primaries: AZ, FL, OK Runoff Election","Why is the DOJ trying to stop cities from saving lives?","Trump ‘made a mistake’ by not honoring John McCain’s service, Jimmy Carter says","Federal court trolls Clarence Thomas in opinion striking Republican gerrymander","Revenge of the “flipper”: Cooperating with the feds can offer a chance at redemption","Collusion Isn’t a Crime, But Aiding and Abetting Is","Former Paul Manafort banker reports robbery of his New York apartment","Mattis rejects plan to privatize military effort in Afghanistan","As Bezos Forces Thousands to Rely on Food Stamps for Survival, Sanders Invites Struggling Amazon Workers to Share Their Stories","Winners and losers from the Arizona and Florida primaries","White House Counsel Donald McGahn Will Leave This Fall, Trump Announces on Twitter","Impeachment Is the Cure for Our Constitutional Crisis","California Assembly advances 100% clean energy bill","White House Counsel Don McGahn Will Leave in the Fall","A secretive pledge is dividing S.D. Republicans and keeping politics behind closed doors","Trump Won't Consider Palestinian 'Right Of Return' In Peace Deal: Haley","Matt Bevin awards employee $215,000 raise","Political correctness: why it sparks so many fights in US politics and culture","Inside McCain's surprise eulogy invitation to Obama","Report: Nearly 3,000 deaths in Puerto Rico linked to Maria","Arizona Gov. Ducey to face Democratic educator in November","Trump's threat of a bilateral deal with Mexico may be empty. Here's why","Republicans claimed Medicaid made the opioid epidemic worse. A new study proves them wrong.","Citing free speech, Trump seeks dismissal of Stormy Daniels defamation case","Lab-grown meat is not meat, Missouri state rules","Why liars lie: what science tells us about deception","Judges’ Ruling on Election Map Plunges North Carolina Politics Into Disarray","Democrats Claim Confirming Kavanaugh Would Doom Net Neutrality","Trump Would Still Like to Fire Sessions, Can’t Find the Right Time","Trump privately warned Christian leaders 'violence' will erupt if GOP loses in midterms, falsely said he repealed a law","Republicans Balk at Replacing a Segregationist Democrat's Name With McCain's on Federal Building","Don McGahn to leave job as White House counsel, Trump says","Andrew Gillum, McSally: 5 Takeaways From The Florida And Arizona Primaries : NPR","Trump’s Defenders Can’t Stop Comparing Him to Al Capone","USDA to buy $1.2B in goods from farmers hurt by trade war","Gov. Brown Signs Landmark Bill Ending Bail for Defendants Awaiting Trial in California.","Cuomo directs state AG's office to suspend review of Manhattan DA's handling of Harvey Weinstein case for 6 months","Ex-CIA Officer and Candidate Says PAC Got Her Security Clearance Application","Report: Devin Nunes flew to London to get info on ex-spy who wrote Donald Trump dossier","Hypocrisy With 'Autocratic' Flair: After Trump Whines About Negative Search Results, Kudlow Suggests Regulating Google","Opinion | Want to honor McCain, GOP? Grow a spine.","Cindy McCain wields quiet influence over Senate replacement","Almost Half of Americans Can't Pay for Their Basic Needs","New poll says Duncan Hunter’s indictment doesn’t matter to voters","WH Counsel Don McGahn To Leave Trump Administration In The Fall | Hallie Jackson | MSNBC","Enquirer's David Pecker leaves board of Canadian media company","4 ways Trump could go after Google","No, Trump Is Far from Finished","A Green Light for Banks to Start ‘Redlining’ Again","Trump plays to the base with attack on 'rigged' Google searches","Young: Of course President Donald Trump should be impeached","Texas GOP shares arrest mug shot to attack Beto O'Rourke for skipping debate with Cruz","Google responds to Trump: Denies favoring ideologies in search results","Trump warns evangelicals of 'violence' if GOP loses in the midterms","Canada voices optimism as it rejoins negotiations","Former cop convicted of killing unarmed teen leaving party","California eliminates cash bail in sweeping reform","America’s Best Colleges for Student Voting","What Don McGahn And Jeff Sessions' Departures Could Mean For Donald Trump | Velshi &amp; Ruhle | MSNBC","‘A baby cannot provide ... consent’: Calif. lawmakers denounce infant intersex surgeries","Florida governor’s race shocker sets up Trump-fueled showdown","Trump rage-googles himself, and reveals a frightening truth about the midterms","Trump doubles down on slamming Google, saying it's 'taking advantage of a lot of people' — and warns Google, Facebook, and Twitter to 'be careful'","Michigan legislator apologizes for racial slurs against Asian American opponent","Republican congressman uses climate change as excuse for possible campaign violation","Mueller's team kept asking witnesses about Cohen's Trump campaign involvement, even after FBI raid","In Arizona Senate race, Republican's embrace of Trump carries risks","Trump’s new trade deal with Mexico gives workers more rights than NAFTA, with a catch","Two Years Into His Presidency and Donald Trump Still Doesn’t Use Computers","The incredible transformation of the Democratic Party","ICE raids Texas business and detains more than 100 people","Emails Link Ex-DHS Policy Analyst To White Nationalists","Russia Sends Largest Force to Syria as U.S. Prepares for Attack, Reports Say","No, the United States isn't the cleanest country","Trump says 'socialist' candidate who could be Florida's first black governor will lose badly","‘The race has tightened’: Cruz allies sound alarm about Texas Senate race","Death toll from Hurricane Maria nearly 3,000 in Puerto Rico: Study","Don McGahn, White House Lawyer Who Helped Reshape Federal Judiciary, To Step Down","\"Restore Our Values\" A right wing PAC supporting and enabling Republicans, Donald Trump and now seeking to help elect the pox faced John Cox (Republican) as Governor of California","Google denies Trump charge it rigs \"Trump News\" searches","Trump channels Richard Nixon on the Fed","Ajit Pai killed net neutrality but still wants you to love the FCC","Jimmy Carter is baffled by Trump's lies","What Trump will have to do next in his quest to 'terminate' NAFTA — and how his plan might fail | CBC News","Trump administration moves to open 1.6 million acres to fracking, drilling in California","The Russia probe: A timeline from Moscow to Mueller","Trump plan endangers Chesapeake Bay blue crabs","Rolling back energy regulations will not work any wonders for America","‘Abolish ICE’ and the Future of the Immigration Agency","Elizabeth Warren Has Bold Ideas About How to Drain the Swamp","US officials get far more cash for foreign travel expenses than EU, UN or UK","Trump's lawyers are citing free speech as the reason why Stormy Daniels' defamation suit should be tossed","Schumer, Flake urge support for renaming Senate building after McCain","Emerson College poll: Statistical tie between Cruz, O'Rourke in U.S. Senate race","South African farmers play chicken with Trump tariffs","Hard-right columnists with no mass audience cause enough turmoil to ruin leaders","Trump warns of 'left-wing violence' if Democrats win mid-term elections","John McCain’s Death Brought Out the Worst in the Trump Administration","Florida Governor; Rick Scott and Ann Scott’s financial trail leads to Cayman Islands tax haven","John McCain’s 2000 Campaign and the Republican Road Not Taken","US midterms: North Carolina’s gerrymandered congressional map unconstitutional and must be redrawn, judges rule","Bonuses, prizes given under former Atlanta Mayor Reed broke law, new report finds","Kudlow: Trump administration \"taking a look\" at regulating Google","Paul Manafort tried to flip and make a deal with federal prosecutors: report","Stormy Daniels told us to stop speaking for Melania Trump, and she's right","Morgan Stanley is urging its super-rich clients to pull out of one of the market's hottest corners, and it's a warning shot to the US economy","Donald Trump, constitutional scholar","McSally fends off challenges to win GOP Senate nomination in Arizona","How Warren Beatty Became a Pallbearer at John McCain’s Funeral","Elizabeth Warren has bold ideas about how to drain the swamp","Trump claims Google is suppressing positive news about him and ‘will be addressed’","Trump Warns Christian Leaders of Violence if GOP Loses","Navajos pick 2 seasoned politicians to vie for presidency","Wake-up Call: Trump vs. Google","Trump Might Regulate Google For Bias Against Conservatives Based On A \"Not Scientific\" Web Post That Used \"Two Different Computers\"","GOP Supporting Super PAC Ad Attacks Candidate's Marine Tattoos, Labels Him 'Liberal Jared Golden'","Joe Arpaio won’t say if John McCain is a “hero” because Donald Trump is his only hero","Can the ‘strong’ U.S. economy survive until 2020?","US will lack fiscal space to respond when next recession comes","Donald Trump’s Response to John McCain’s Death Reminds Us Just How Petty He Is","Kushner Cos. Fined $210,000 For Falsifying Construction Permits","Trump Announces Don McGahn Will Leave White House In The Fall","Puerto Rico ups Maria death toll to 2,975","How Trump's television diet has become a to-do list for aides","The 22-Year-Old Who Wrote Barack Obama’s Letters","Robert Jeffress, Dallas megachurch pastor, explains Evangelical support for Donald Trump on NPR interview after White House dinner.","America Can Blame Its Sky-High STD Rates On A Crumbling Health System","Poll: More than half of Americans can't name a single Supreme Court justice","Trump target in Russia probe questioned by Republicans","Giuliani's telling admission: All that matters is that Mueller is undermined","California Lawmakers Set Goal for Carbon-Free Energy by 2045","Add This Horror Story of Teacher Charged $109K After Heart Attack to Long List of Reasons US Badly Needs Medicare for All","The Latest: Voter: 'done with Republicans,' supports Dems","America has gonorrhea","Accused Spy Maria Butina Once Recorded A Disney Love Song With Paul Erickson","Trump told Christian leaders he got rid of a law. He didn't.","Fire marshal shuts down Landing business, site of mass shooting","Legal Weed Is a Reality in America, but Congress Refuses to Admit It","4 Takeaways from Tuesday’s Primaries","Town Hall At Vizcaya Focuses On Climate Gentrification In South Florida","Trump Threatens Google Over ‘Rigged’ News Search Results","Primary Takeaways: Establishment Loses, Diversity Grows","'As far as I'm concerned, they're Iowans with better food': The father of Mollie Tibbetts pushes back on anti-immigrant rhetoric surrounding her death","Bernie Sanders’ problem with Amazon","Some Republicans Urge Attorney General to Remain in Job as Elections Loom","Reports: Nunes Traveled To London, Tried To Ask Intel Chiefs About Christopher Steele","North Carolina Republicans’ long track record of unconstitutional laws","California to become first state to eliminate bail for suspects awaiting trial","Chemerinsky: What’s at stake if Kavanaugh is on the Supreme Court","Roger Stone Says He's On 'Crooked Special Prosecutor's Hit List,' Asks For Donations","Senators Blast White House Over Handling of McCain's Death: 'Shows What Type of Man Donald Trump Is'","Congressman Nunes sought meeting with UK spy chiefs in London","After progress on trade, Trump reignites tensions by declaring border wall will be ‘paid for by Mexico’","Robert Mueller Team Probing Michael Cohen's Links To Donald Trump | The Beat With Ari Melber | MSNBC","Google: Search is not used to set a political agenda","Florida, Arizona primaries set up fierce fall showdowns","Left knocks Schumer over deal on judges ahead of Supreme Court battle","Rep. Martha McSally fends off right-wing challengers in Arizona GOP Senate race, CNN projects","Generous Giving Or Phony Philanthropy? A Critique Of Well-Meaning 'Winners'","Trump's Twitter tantrum: Google may be controlling, but it's not partisan","Donald Trump aide defends response to Puerto Rico's Hurricane Maria","Tennessee fighting employment protection for transgender people","Roger Stone: 'Robert Mueller Is Coming For Me' To 'Pressure Me To Testify Against' Donald Trump","Court orders ban of top-selling pesticide, says EPA violated law, ignored scientific studies","The Anti-Dollar Awakening Could Be Ruder and Sooner Than Most Economists Predict","Trump’s Trade Deal With Mexico Is Both Totally Fake and Extremely Important","DHS condemns 'violent extremism' after emails link former official to white nationalists","Trump Says Google Results Are 'Rigged' Against Him but Here's What Happens When You Search for Hillary Clinton","Nothing new, China says about Trump accusation of Clinton email hack","'Political correctness is like a cancer': Arizona Republican defends controversial social media posts","Dems press DeVos against arming teachers","Governor hikes Puerto Rico storm toll to 2,975","Unfortunately for Trump, his allies aren't any smarter than he is","Senate Democrats want the government to say if GDP growth is helping the middle class","Republican senators wary of renaming Russell Building for McCain","Judges say N.C. congressional districts unconstitutionally gerrymandered to help GOP; new districts may be required before November","Top Student Loan Official Resigns in Protest of “Misguided” Trump Administration","Don't Hold Your Breath Waiting For The FCC, FTC To Punish Verizon For Screwing Firefighters","Democrats strip superdelegates of power in primary process","Trump says he revoked Brennan’s security clearance — but Brennan says he may still have it","Trump Takes Battle Over Media Coverage to `Rigged' News","The Trump administration’s latest plan to prop up coal","Trump says he thinks U.S. is doing well with North Korea","Newest US Sanctions Against Russia Hit an Economic Nerve","Sanders Applauds 'Courageous' Workers for Standing Up to Disney World and Winning $15 Minimum Wage","McConnell cuts deal with Democrats to confirm judge nominees","Duckworth's background check claim checks out","Steve Gaynor defeats incumbent Michele Reagan for Secretary of State nomination","Trump To Japanese Prime Minister For Some Reason: 'I Remember Pearl Harbor'","Gillum wins stunner and other takeaways from Arizona, Florida","Texas Company Will Send 3D-Printable Gun Files Directly To Customers","Debunking Donald Trump's latest conspiracy theory on Google","New Wisconsin poll shows Tammy Baldwin in better re-election shape than Scott Walker","Vermont Democratic Party endorses weed taxation and regulation","A Little-Known Windfall for Some Hospitals, Now Facing Big Cuts","All Financial Information about Donald J Trump and his Companies spanning DECADES.","Federal Court Strikes Down North Carolina Congressional Map Again","Florida Governor candidate may have broken law by tweeting photo of his ballot","Trump Calls Google Results ‘RIGGED’","Congressman Duncan Hunter on indictment: \"Leave my wife out of it\"","Pentagon warns against EPA’s science proposal","GOP Sen. Inhofe: McCain ‘Partially to Blame’ for Flag Ordeal Because He Was Mean to Trump","Kushner Companies and Michael Cohen Accused of Falsifying Building Permits to Push Out Tenants","LBJ Foundation CEO: Book on Trump would be called 'Unpresidented'","Mexico's foreign affairs secretary pushes back against Trump: \"We will never pay for a wall\"","Manafort Banker's Home Burgled Amidst Reports Manafort Might Plea | The Beat With Ari Melber | MSNBC","Trump's farmer bailout begins. USDA spends $1.2 billion to buy surplus food","Trump: Diplomatic snake-oil salesman","Hurricane Maria's official death count raised to 2,975 after study","U.S. trade deficit widens in July to highest in five months","Far-right conspiracy theorists harass Voodoo Doughnut, other small businesses","China studies 'White Trash' to understand Trump","Stormy Daniels Isn’t Backing Down","Michigan Democrat leaders: Don’t bet on ‘blue wave,’ build it","McCain Services To Include Past Presidents, But Not Trump","House Democrats push Betsy DeVos to reject funding for guns in schools","ICE wants to hit the delete key","An alternative to propping up coal power plants: Retrain workers for solar","White House Counsel Don McGahn Will Leave Post in the Fall","Australia may ban Chelsea Manning from entering country","Judiciary Committee Democrats Protest Withholding of Kavanaugh Documents","The health care surge: Why it's rising as a midterms issue","Manafort Sought Deal in Next Trial, but Talks Broke Down","Embattled Republicans Rely On Astroturf Group To Shore Up Social Security Bona Fides","Japan Denies Report Trump Brought Up Pearl Harbor in Trade Talks","Establishment Candidates Teamed Up Against Zephyr Teachout in New York Attorney General Debate","No plans to suspend more major exercises on Korean peninsula, says US","Sasse: McCain affectionally called me 'stupid bastard' on a 'regular basis'","LePage joins court brief calling for firing people based on sexual orientation to be legal","16 states want to be able to fire employees for being transgender","Momentum Slows For Renaming Senate Building For McCain","Florida’s algae crisis is going to follow candidates into the general election","President Trump is so eager to pardon Paul Manafort he's reportedly considering hiring a new White House counsel","Trump biographer calls Mike Pence a 'shadow president'","Veteran groups tell Trump to lower flag to half-staff to honor McCain","Sen. John McCain's 'no ma'am' moment showed his true character","Judge deals partial win to prosecution ahead of Manafort's second trial","Proposal to rename Senate office building after McCain stirs backlash","Many Americans struggling to get by despite strong economy","Trump Accuses Google of Rigging Search Results Against Him","How The Trump Administration Went Easy On Small-Town Police Abuses","Sen. Wyden Confirms Cell-Site Simulators Disrupt Emergency Calls","ICE Is Sending Detained Kids to Adult Jails the Second They Turn 18","Revealed: Notorious Pro-Trump Misinformation Site True Pundit Is Run By An Ex-Journalist With A Grudge Against The FBI","Top interior staffer who backed shrinking national monuments to join BP","How Trump relies on his cable news Cabinet as much as the real one","Hurricane Maria Caused 2,975 Deaths In Puerto Rico, Independent Study Estimates","Top Canadian official touts progress in NAFTA trade talks","Outside Money; More than two thirds of individual contributions to 2018 House candidates came from donors outside of the candidates' districts","Fox News’ Tucker Carlson: Why Would Trump Honor McCain, Someone He ‘Despised’?","White House re-lowers flag to half staff","DOJ official targeted by Trump faces House grilling","The Latest: Some Arizona polling places down during primary","Teacher Revolts Are Giving Democrats Hope In Red State Governor’s Races","Trump's farmer bailout will cost $4.7 billion","Sacha Baron Cohen brought his show to SF to teach Trump supporters how to 'smell like a liberal'","Kanye West finally apologizes for saying slavery was a choice","Sleazy Political Figures Are Getting a Second Act on the Nation's Airwaves","Florida Primary Election Results","Lindsey Graham is very confused","Veterans group furious with White House over ‘disrespect’ following John McCain’s death","Court throws out N.C. congressional map before election","Jimmy Carter: Trump 'very careless with the truth'","States ask Supreme Court to limit LGBTQ workplace protections","Kushner Cos. fined $210K by New York for false documents","Gwen Graham, Andrew Gillum in close race for Democratic governor nomination","What if Trump did actually shoot someone on Fifth Avenue?","The Latest: McConnell has 'total confidence' in Sessions","Trump slams Google search as 'rigged' — but it's not","Republicans Are Terrified of What Democrats Will Uncover If They Take Back the House","Judge condemns ICE arrest inside courtroom, says judges should control courtroom, ‘not ICE’","Go deeper: Tracing Trump's Google censorship tweet","Issues Of Race Could Decide Closest Midterm Contests, Says New NAACP Poll","Trump tweets conspiracy theory on Google: What are the facts?","New study on Hurricane Maria death toll raises questions about Trump administration's response","Sanders to introduce ‘Bezos Bill’ next month","For Many Women, a World Without Abortion Access Is Already Here","Ivanka Trump sparks anger with Jacksonville mass shooting tweet","Trump's U.S.-Mexico trade deal meets bipartisan skeptics in Congress","Manafort's onetime banker robbed overnight","U.S. government to pay $4.7 billion in tariff-related aid to farmers"]