["/r/Gifs rules: Please read before submitting or commenting","Cat takes a dip","King of close calls.","Helicopter tail","Let me just dive through this cop car real fast","Hey! We DO NOT eat our friends, Greg! Stop!!","I had a front page post about my toaster, but got flamed because nobody believed that it shoots toast out at mach 5.","Aquarium Staff","Hide and Seek","Keanu playing rock-paper-scissors with his kung fu trainer on the set of The Matrix","Since she got here, it's been always clean under the couch","Friends for life","Tap here to power up!","Wave and Catch","should buff out quite easily","Cooking &amp; tricks.","Why pay more for the same?","The kid just knows the way to love the rain!","Did I ask you to stop, SLAVE!?","East Dock Jurassic Park","Posted this on r/pics yesterday and got a lot of comments saying it was shopped. Here’s the Live Photo.","Moment from the film 'Loving Vincent' in which each frame consists of an individual oil painting. 65,000 frames were made","Young baseball player doesn't let anything hold him back","How surprising!.","Ah yes a fellow Hoosier","Now those are some moves","Adorable idiot","Tab and hide prank","Me after one day at the gym.","Is this a trebuchet?","What happens when the flight is empty?","Never a happier homecoming...","The Moon has had it with your crap","Yer a slinky wizard, Hairy","Don't mess with Dad.","Octopus sliding into a bottle","Having a blast at a party while still young","Alpine ibex standing on a chimney in France.","Damnit! You can’t eat our friend.","Zooming into a butterfly wing with a scanning electron microscope","Little Caesars marketing","A Gang of Bad Boys","Coloured smoke bombs wall","This Halloween, give the gift of rank fear.","Why? Have we not learned anything, people?!","Cleaning solar panels","Monkey pulling dog's tail and swings back for round two","Is this human even trying?","Nissan Morph","A cure for cellphone addiction","Dave Grohl hires a stuntman to reenact the broken leg incident at the same stadium where it happened.","Ball Pit","WTF even is this?","Fun with a bubble?","This is a good penalty shoot !","No one is dying in a plane crash with this flight attendant on board","Dirt biker gets good lean angle","This monkey looks like a Kung-fu master","Eye contact","This will raise your spirits!","Bees in Times Square swarm to a hot dog stand. Bee keeper with a vacuum was the hero.","Firefigther using his body as a shield until the shooting stopped","Reminds me of when Khaleesi got her dragons","Perfect timing.","Rainy Tokyo","I call it \"The Sphincter\"","Moscow City Time Lapse.","WW2 Gun cam footage.","Slicing into a chocolate cake.","Nazaré","I'll take that .","Double fun","This Dog has a seal in him","What do you mean? He's protecting me!","Breaking eye contact with a Tiger","My daughter went quiet and I found out this","A special fish that loves to get pet at","Jurassic Parking","A guy was surfing in a drainage canal after the hurricane in Hawaii","Magic Wigglee","Captain America Fail","Scariest parts of my childhood.","Spa day","And you thought bowling splits was hard","Oil change becomes easy with her moves","little gentleman","Romantic Coincidence","Remember to get the door locked","She's also partially blind","Not sure what I made, but it’s cute","Give a man a watermelon and you will feed him for a day; teach a man to watermelon and you will feed him for a lifetime.","clever rat","Han Solo drying Chewbacca's hair with a blow dryer","Breaking out the dance moves","May have eaten a little too much lasagne","Clint Dempsey retired today but this GIF will last forever.","Does it bend?","Limboooo Boss","Trident - horsin' around with his toy","This punishment is interesting.","Just out for a stroll thru town in Holland"]