["To combat a new massive spamming effort, we are temporarily banning photos of shirts.","John McCain Megathread [1936-2018]","Someone watches Bob Ross.","This is a statue located in Berlin, entitled \"Politicians Discussing Global Warming.\"","Marine Corps Vietnam War veterans recreate photo after being apart for 50 years .","I miss the days that political opponents respected each other","Empty Road in Hawaii","Fit in the cupholders","Dwight Schrute cosplay","Porn Convention on same day as Star Wars Expo. Friends were made.","On the freeways in Phoenix today","Black Widow cosplay","Beach Glass","Charging a phone when the cord does not reach the floor","Breakfast of Champions","Long exposure / airplane lights","Hela cosplay","Amazing Cloud That Look Like Bird","A single egg of the Silkhenge spider","I previously posted about uncovering Victorian tile under a faux (and poorly built) fireplace in my 1880 home. Here’s what we found after completely removing the bottom portion - hoping to find the same along the wall when the rest is removed","Yup, it works, thanks! This is a really cool trick!!!","Chu Chu","Cleaning out old digital photos and look what I found from October 15, 2008 in NYC.","Two online best friends that played gta together everynight met up to have lunch and take a few pictures","I took a picture of the sunrise perfectly aligning through a lighthouse. Definitely one of my favorite photos ever captured.","Samurai Vader","My body in Jan 16’ after losing 350 pounds. My body in Aug 18’ after phase one plastic surgery. HW 500 | CW 150","This perfectly timed pic my gf took during a storm.","A deep sea fisherman decided to start taking pictures of his unusual catches and what came out is a gallery of freaking weirdness","This morning reflection from the front door","Vancouver Washington Schools on strike...go Sheldon!!","A clear bathtub","Reception desk made from an engine cowl","A Shipwreck under the Milky Way by Mikko Lagerstedt","Sunrise in the icy waters of Greenland","A Stonehenge of whales?","Profile picture versus tagged photo","Skull kitty","Impressive metalworking skills","Roger Waters concert","130lb weight loss over 1.75 years.","Monument Valley, Arizona, United States","Landshark!","Moon in the jar","I love it when I see people out and enjoying their cars and not just keeping them in the garage.","#1 Hasselblad Master 2018 - @BeJamin","There's nothing particularly remarkable about this sunset, except it has been captured by a robot working on Mars","The entrance to Converse HQ in Boston","My husband started 17th grade (his masters program) on the same day my daughter started 5th grade. They’re both ecstatic about back to school.","Joker cosplay","It may of taken 4 years. Blood, sweat, broken bones and a lot of tears. But I am officially a resident of the 🇺🇸","Winter in Norway","Pencil Art from ChaleWoteFest2018 in Jamestown - Ghana","Bearded Dragons","Worlds most photogenic raccoon, Linda! Post-vaccination to boot!","130lb weight loss 5'7/26/f","When you and your squad have the same OCD.","Empty road in Hawaii","Highway signs in Arizona today.","This is the cutest cosplay in the world","Coworkers Hammer exploded on impact","On second thought, I’ll use the drive-thru.","Is that who I think it is?","Captain insano shows no mercy","I miss the days that political opponents shot and killed each other in duels.","Dunno why I took this but I like it","I lost my car so I've been walking back home from the grocery store five or six times with different groceries each time and a manager saw me leaving with a heavy box and offered to let me take a cart so I could fill it up and do it in one trip(its 87 degrees out) Faith in humanity restored","Snapped this a couple days ago at Sunset Cliffs, SD","Family owned...","My skilled grandfather built this. Took 124 logs.","The Absolutely Stunning Mt. Roirama, you might recognize it from the movie 'Up', by Pixar.","An opossum fell out of a tree while I walked pass","Michael Jackson &amp; Freddie Mercury. (1980)","kashmir valley","Me and my mom just helped my autistic brother move to a place of his own today! So glad for you Sammy!","Down 130lb, up a fabulous haircut.","Forest in Poland","Found this coin while cleaning out my apartment today","Salt mines in peru","What a dickhead!","Jeff Bridges and his Father, Lloyd Bridges.","San Francisco City Hall","Road in Hunan, China","Supergirl cosplay by Enji","Managed to lose 180 lbs over my first two years of law school.","Overhead view or my local carnival. Filters were smacked on and it turned out like this. I think its beautiful.","We found her stranded in the North Pole, just wanting to give her kisses as presents. 17 years later, she can finally rest knowing she did a damn good job.","He didn't really post that, did he?","Stairwell leading down to a 300km wide salt mine near Kraków, Poland.","Limited palette watercolor","A shot from the storm over Iowa yesterday.","This little piggy went for a paddle","Amazing photo of totality in Oregon by photographer Jasmin Lion Mander","An anonymous question from one of my ninth grade students during Sex Ed. It’s gonna be a long two weeks. (This was one of two students who asked the same question today)","Black sand beach - Iceland","A Journey Guided By The Elements By Benjamin Everett","Gaming for 3 years together.. then we all meet for this first time","The Desolation Islands- One of the most remote places on Earth.","This little bar in Charlotte,NC stuck it to the man and made a condo build around them.","Sunset in Maui","[NSFL] I am a veterinarian and this little stray came into our practice today very alert and happy (That's his skull showing through). We plan on surgically repairing everything this Friday if you want updates. We lovingly named him Skully.","The amount of mess and rubbish left at leeds fest this weekend is insane","Mono Lake, California - Noel Casaje","Breakfast in Bruges","Early hair dryer, 1920s.","Hedgehog with babies.","The side of Taj Mahal you never saw","Viruses injecting their DNA into a Bacterium","San Francisco City Hall, California","Baklava - sweet-tasting but also art in detail","On our chalkboard at work. It’s going to be hot today.","Found this in my grandpa's shed. \"Scientific Fire Extinguisher\"","“The Worlds’ End”, The Westcoast of Portugal","My neighbors pulled this guy out of the mud after some extreme flooding in the area. He rested for awhile and made his way back into the woods.","Living in the land of hobbits","Caught a fish today. Too bad something quite a bit bigger took a bite out of it before I could reel it in...","Long exposure of airplane lights","Stirling , Scotland","Halloween is coming.","Barracuda ate my tuna","Today is the 30th anniversary of The Onion. Here's the very first publication.","When those infinity stones start to kick in","Did anyone say road trip","Up close look at a Horned Puffin 🐦","Saw Bald Eagle fly in, crawled under some trees to sneak up and get this picture!","The Cat Daddy.","A sea desert","Best Handwriting in the World (2017) from grade 8 student from Nepal 🇳🇵","I took this photo of a lightning with my phone","Concept art of Cassini spacecraft’s “Grand Finale” view of Saturn","Surrealistic Reality by Benjamin Everett","Just had reconstructive knee surgery 30/m and Reddit is the only thing keeping me from dying of boredom.","Once a year we rollerblade around town stopping at the different breweries- the theme this year was denim. This is my friend Dusty- he always brings his A game","-_-","Glendalough, Ireland after an hour of intense rain","The view that makes the hike worth it","2 years, 11 months and 20 days of braces. Worth every second","Dad and his 47 Knucklehead","My friend is modeling jewelry. Apparently this is worth $2.5 million. I think it’s time to perform a heist.","I took a picture worthy of framing of my son in a bucket. The only iPhone picture I ever printed. Black and white on a 100 degree day today in New Hampshire.","Batman: Arkham Knight Batgirl cosplay","Nature finds a way","my cat in her new harness, out on our first walk together.","Beautiful double rainbow view from my backyard","Passion and Craftsmanship","A View Of San Francisco From Lombard Street","Action Pants.","Caught the back end of the Dom cathedral in Cologne, Germany, on a good day.","After months of attempts, Louis was finally accepted by the flock...","Just learned that a piece of Minnesota history was suddenly demolished this morning with no salvage efforts. The Pillsbury Mansion is gone.","Sunrise in the Great Smoky Mountains National Park in Tennessee","War Ration Book from Brooklyn, 1943","I flew a drone above a French village","Pop Art Dougie","hedgehog with bubble","Girl Vs Lightning. Nearly invisible faraday cage protects her from almost 1 million volts of electricity.","Got so excited when i saw him! Montreal comic con 2018","A great start to your day...","Spilt some coffee on the side. Accidentally created the world!","1955 Bentley Sultan Rebodied Roadster","My new to me car.","A doggo and a beautiful sunset","Skull Kid colored pencil drawing!","Zurich, Switzerland, in the morning hours","This reptile that looks like it just crawled out of the sea","My friend won a local concert to DJ at a festival. He had the choice for some visuals for winning..","Boop","Sunrise on the Beach","Princess Leia and Chewbacca share a romantic moment on the Star Wars set, 1977","My brother lives in Naples, Florida. He sent me this photo from the skate park today.","Sunflower growing in my front yard","One of my most recent photos - A Dragonfly.","Darth McDuck, Scrooge Vader Color pencil 8\"x7\" From an idea by u/thatclaywoman","Took a garden stake to the eye this summer, and now my iris has a divot in it. Pretty glad I can still see with both eyes! A near miss.","Not as amazing as the others, but my best/favorite photo taken on my phone","This picture holds a special place in my heart.. This sunrise marked the opening of my wedding day. I was so nervous that I couldn't sleep so I went for a walk down to the beach. I sent this picture to my wife with the caption \"our day\". As you can see it was the start of a unforgettable day!","Helped a gentleman get his photos redone at my work and his wife made me this beautiful single serve cake, thanks ben.","Custom Built Rat Rod, spotted while out to eat","Definitely something wrong with my Fiancée's cat","Xanthic (orange) smallmouth bass caught in MI","Fizzy at a party, tolerating the intolerable humans","Crocs work on dogs","Florida really is how it's portrayed","8 week old Doggo Violet","Smoking Area at a Cemetery in the Philippines","Black Beach.","Torre Scola Fort, Italy","Three sisters Mountain in the Scottish Highlands!","Smoking By Benjamin Everett","Picture is a little dark but my not so small kitten always cuddles with me at night after attacking me all day.","Badunka Pumpkin","Hi Buddy!","Keywest","Light to Dark","Under the Golden Gate Bridge","[OC] A Walk in the Highlands","Koko Head Botanical Garden (Oahu, Hawaii)","Soup du jour","Painted a Pelican. I think it looks neat. Maybe even neat-o.","8 years ago I took the trip of a lifetime with my mum to Iceland. Here is one of my favourite photos, taken in Arnarfjörður.","Flooding in Kaohsiung","A different kind of progress pic - 22 vs 26","Really?","And so it begins. 🍁","Not sure if this is the right place but, I got this laminated 4 leaf clover from a couple of very nice young ladies after I turned in a wallet I found at a store in my home town. I’ll be keeping this in my wallet from now on to get my own good luck!!","Taking it all in","This is how my wife told me she was pregnant.","Molly looks like she played with bleach","Got a lucky picture of a Thunderstorm a few years ago.","A homeless person's sign","My blind dog posing for a portrait","I make weird vending machines for my store.","My son’s new school backpack...","Kakashi Hatake","My family &amp; I did a thing this weekend. 12 bushels = 155 one liter jars","Elle lion","Hiked up to see the sunrise, got disappointed because it was cloudy...and then this happened","A little portrait with some Half Dome thrown in :)","Eiffel Tower. Paris, France.","The main hall of the National Museum of Scotland, Edinburgh","Going for a walk in Copenhagen","Sunset light shining through a glass of Coke onto a wooden table. Nifty effect. My own repost but thought you might like it.","I saw this at my local art museum","Scarlet Witch cosplay","Does anyone know what this little gadget is?","Looks like they fell like dominoes!","Animal crossing dice bag made by me","Can't argue with that","Ice Sculpture depicting the First Nations at a winterlude.","Two Legendary Shinobi Teams","Washington teachers are going on strike, so I made a sign for the picket line.","When you spend two hours brushing a Burnese","The difference of a year and roughly 2 940 000","Gulf of Mexico sunset","A sunset at Ramla Bay","My immaculate Honda City Turbo II!","Me meeting the side of my SO's family that she hasn't seen since she was 3.","I’m pretty proud of this shot I caught yesterday in Chicago","The sky","The Ron Swanson of cats. He was surly and aloof to all except his humans. To his humans he was fiercely loyal and let us give him pets. Miss you Bear.","Scotland","Nesso: The Most Charming Little Village in Italy.","Pineapple Ganesh! India","Now this is just cruel...","Doggo knows his place","Another great light painting photo by Michael bosanko","My (Second) Attempt as string art!","Seealpsee, Switzerland","when sun rising","After a weeks worth of work on my drive, I have now decided I can no longer live in this monstrosity of a property","This gal's been out for a wander today","Blue and gold macaw coming in to land ...","Take it slowly, George","That’s what happened when you drove a truck on pkwy (no truck on pkwy in Long Island)","A picture of political opponents shaking hands, doesn't mean anything","Bentley has already perfected the sploot","Totally not misleading branding.","Praia da Arrifana, Portugal","When nature turns into art","By suggestion of U/REPOST_STRANGLER I made some better string art!","Mount Yoshino in Japan","Flowers in the street","A bunch of stars attend the Paramount Pictures 75th anniversary party in 1987","A 3 spotted hawk moth I hatched about a month ago 😊","Target fixation","This is a photo I took of my watch tan as of 28 August 2018. It’s been a little over 4 years (at the time of writing this post) that i’ve consistently worn a watch every day.","A cool shady spot in the park.","No one can use my scissors","Wengen","Neo tokyo","Looking up in New York","This sign at the local coffee shop","Spring Is Just Around the Corner","Vampires","I found Bob Ross' doppelganger in Geneva.","Ghent last summer 😍","My mother in law was excited about the “two moons” that would appear this week. When I told her it was an online hoax my niece made her a second moon to hang in the window so she could see 2 anyway.","Typical sunset in Phoenix, AZ","Eruption","Sunrise in Cappadocia, Turkey","My kid’s AT-ST broke so I made it a lamp","Mount Rainier on a cloudless day","What’s up dog?","Chagall ceiling at the Opéra Garnier","This picture of a lighter I took with my phone","Lazy kitty.","Cherry Blossom In Japan -- I want to get married here","Language.","Physicist Clemens C. J. Roothaan, a prisoner of war during WW II, a member of the Dutch resistance, and who made pioneering contributions to molecular and atomic theory, turned 100 today","Got your nose!","Just taking my pet llama for a walk...","Zoinks","St Johns River in Jacksonville, FL","Haarlem Canal Ducks","After 3 years of long distance relationship and 5 months living together, we're engaged! We're beyond happy 😍","The View from The Grotto at Rayavadee Restaurant, Krabi, Thailand","ITAP of a sunset","Sunsets like these","Caught this lil dude having a bite to eat","The sun trying to get through.","Fire 416 burning near my hometown in Southwestern Colorado this summer.","Halloween Came Early for me, am loving these","Wired sunset","Off line","Thank you for flying Southwest we appreciate ur bizness gimme ur leftover peanuts plz ❤️","Clear water and sun rays at Dos Ojos cave in Mexico","Melbourne fire this morning","Aretha Franklin's Cadillac hearse which also carried her dad and Rosa Parks","My sister in Florida....","Looking for an entomologists to identify this bug! Also, maybe the coolest picture I've taken of this plant.","She's back!","Cosmic donut","Sun through the trees","Time-lapse Sequence of Jupiter’s North","This guy earned hate for his non-social behavior.","Sitting on the edge of Lumangwe Falls, Northern Zambia","Had an hour to spare in Dubai","Broad-winged Hawk","Good morning from the Pacific Northwest","Go home Call Box, you’re drunk.","Arkansas, such a beautiful state","Somebody spray painted the “centerpiece” of my university today","View of Madonna della Corona Sanctuary (Spiazzi, Monte Baldo, Verona, Veneto, Italy).","Pussy cats: Black &amp; White &lt;pkm latest version&gt; :)))","Thoughtful building art downtown Chicago","I had a photoshoot with my dogs...this is the result.","First time seeing both sides of a rainbow!","Fushimi Inari-taisha creek, Kyoto Japan","My steering wheel looks like a Sloth's face, and now it's all I can see","A shop full of Turkish lights. I couldn't afford to buy one, but they graciously let me photograph them.","My wife has been teaching herself how to crochet for the last month and surprised me with this guy today!!!!","The preserved vascular system of a shark.","Beatles!","At this point I was too panicked to focus correctly. Hornet close up [5129x3419]","Made my own wedding bouquet. Welded copper and brass with old buttons for the flower centers.","Huge Arapaima caught from a flooded locality in India after the opening of a Dam","Yosemite from my phone!","My First Hotel photograph at The Negresco Hotel of Nice","Blood Red Sunset","That was an amazing sunset! 😍","Hong Kong Metro","Dog running","Birth of an okra!","Not really sure how to feel about this 🤔","This guy is definitely genius.","2018: Harry Potter juuling with a young Shawn White","Incredibles 2 Violet cosplay","This packaging doesn't make sense","Through the grapevine... grapevine. [OC][6000x4000]","reddit, help me find the artist who drew this masterpiece","Stunning rainbow lorikeet let me get real close!","An amazing sunset, Sifnos, Greece","Loved this sign at a café in Edinburgh","Michael Jackson moonwalk crossing sign street art by TOM BOB","This is my project with no name - I had a plan but the first try did not work.","This little bug wanted a free ride in NM, hung around for about half an hour on my uniform.","TRU still kicking in Paris","Tried taking a good picture in Lake Atitlan but I couldn't find my balance","It’s been almost two years since I could even afford to get out of the city. It’s been ten since I could make the trek to any Rendezvous... it was time. (Photo taken just south of Utah/Wyoming border)","Remembering Michael Jackson, who was born on this day in 1958.","Find inner peace.","19th century Neuswanstein Castle, Germany","We painted a Watercolor Puppy Portrait for Our cute Papillon friend!","Took this on my trip to Nova Scotia","I found him","The view outside a “hotel” in Mumbai","Does AAA have AAA?","Those Arms!","This A dramatic photo of a thick lightning bolt illuminating the night sky as it seemingly touches Lake Michigan, has been taken by Jack Brandenburg on August 28, 2018","Clever girl.","A man on a horse lassoed a guy that tried to steal a bike from an elderly woman","Used metal flowerbeds to reflect windows at Canary Wharf [OC]","Ducks Dodge.","The evolution of Richard Nixon's signature from 1968 - 1974","Finland night stars by @JuusoHD","Commuting to work when this gentleman got in front of me","Funniest church sign I have seen in person","Double rainbow","Santa Ponca, Mallorca","A California Sunrise","Sunset over the bay","A heavy downpour makes beautiful photos","Aftermath of Belfast City Center fire, in the listed \"Bank Buildings\" built 1787","Sunset over the Royal Naval Dockyard, Bermuda - 8/16/18","My almost 16 year old can't see so well anymore so we play fetch with a deflated soccer ball these days.","Churches 2018","A sign at this bar in Alameda, CA","Snapped this a couple days ago at Sunset Cliffs","The Rockies","Reddit, meet Robin May. Robin May, meet the Pacific Ocean. Annnnd we’re dead.","The daggers of Toetanchamon. One made from gold and the other one of meteorite","A cheetah mother laughs at her cubs joke","Chips-Propaganda: \"NO RING ... NO THING!\"","Banaan Pancake breakfast [I Ate]","A Longhorn.","Free Wifi","The way the light is almost purrfectly in line with his neck","What could they have possibly meant when they got the translation for \"Prehistorical visual feast\" when describing a clock?","If only cotton candy grew on trees.","Happy 60th birthday to the king himself","Pocket Galaxy, Flameworked Borosilicate glass, 1.5\" 2018","I took a knotty photo in the forest.","Isn't she a beauty","The clouds rolling off this Montana Mountain makes me imagine white walkers from GOT. Anyone else get that vibe?","Recycling robot","Challenge Gravity can you do it?","Pic I snapped on my honeymoon in Paris","The \"Old Croghan Man\" Preserved torso of a man found in an Irish bog from 2000+ years ago","Birthday card I gave my little sister, had to add a caption","The aftermath of a toxic sludge spill in Hungary","Boat Ride in Japan?","Ketchakan, Alaska.","Fremont Street is a sight to behold.","when sun lies on a sea ,at cox\"s bazar","I made a box castle for my boys.","Lily Collins for Shape","After I got home from vacation all 5 took over my bed","Sunday @Ghent","Water droplets on the trampoline formed to look like a cut gem.","Sunset from my trip to Porto, Portugal","Gimli, Manitoba. Lake Winnipeg. No edits, Galaxy S8. [OC] [4032x1960]","Magical moment","Do your research.","The most amazing photo of all time. Some will say it’s not real.","The sunrise this morning from my balcony.","I just took a trip to Bogarbyggo, iceland and got this on my iPhone. The water was coming out of the volcanic rocks to form this wide waterfall","Unusual Photograph for a well-known place [OC] Budir, Iceland","View from the top of the Dorset Lookout Tower. Muskoka, ON. [4804x3203][OC]","This hurt my brain.","Tea Time - Turkish tea is traditionally offered in small tulip-shaped glasses.","So my son drew this at kindergarten today.","This looks like someone’s evil lair in Chicago","Weymouth, UK now sowing wild flowers on roundabouts. Beautiful and bee friendly! (4032x3024) (OC)","A drawing that I made about the dual cultural identity that many (including me) have from being a young immigrant.","lightning boye","A temporary road sign of the Popemobile","Shadow of the TV Tower Stuttgart","Caught this beaut in La Rue, Texas.","He is, Batmaaan!","Found this one eye'd kitty online the other day and thought I would share it here.","In New Delhi, India, sour cream and onion chips are appropriately named.","This is San Vicente de La Barquera yesterday, a small town in Cantabria province of northern spain","Forte de São Filipe @ Setúbal, Portugal","Alyson Tabbitha vs Cate Blanchett","I took this picture today for a biology assignment. We had to find signs that there was water and so I thought I'd go above and beyond ;)","While I was in New Zealand, I had the opportunity to visit Mt. Cook. One of our first stops on the tour was at a farm, that had a guy producing these Hand carved works of art.","Romsdalsfjord, Norway","Brooding sky over London today. The view fron the top of St Paul's...","\"Natural\" rock towers in Vingart - Slovenjia","Found this mat in a popular furniture retailer","My ideal work day.","I made this tombstone for my company's rebranding campaign. There's no more \"and partners\"","My FIL took a picture","From 268 down to 210 after a year and a half","When you decide to go hike on a whim, this is what makes it worth it.","Blueberry haze amaze","200T Iron Ladle being deslagged","The earth is actually a donut and the reason why the sky is blue is because you see the ocean above you","You cannot call yourself an artist if you don’t recognize this masterful piece of work!","Runners throw colored powder into the air at the beginning of a 5-kilometer race at Marine Corps Base Hawaii, Aug. 18, 2018. Marine Corps photo by Sgt. Jesus Sepulveda Torres","Summer evening in Dinant, Belgium","Freight liner on Lake Michigan","I just like this picture","Al Capone’s Philly prison cell.","I know this cant compare to all the beautiful pics here, but this drunk pic ambling along the Chicago riverwalk is pretty.","A Tiny Moon Beneath A Huge Double Rainbow","The Swiss sure are proud of their flags.","Oh hay","Urban London","Simpler life hacks by simple people of North Pakistan","Salute","So this is happening","Sprinklers + streetlight reflection at night","A photo that I took of the sun over an football field, in Brazil","Seeing things eye to eye","Best friends Bucket and Colton","Wait...what?","Happy Birthday to my one year old piggies!❤️","Colorful star trails","A ripped mushroom from my front yard","Chicago at dusk as seen from Lake Michigan.","My cousins knee after a fall.","Haha och ja","Sydney Weather on Sea view","Saw the most beautiful butterflies at the conservatory near Niagara Falls (Canada) today!","My dream body after 6 months of intensive workout","Life... ahhhh... finds a way.","An important list","Cinderella shoes","Candid pics of my wife and new son yesterday, I couldn't possibly be happier!","Upside down rainbow on a beautiful, clear evening....","For that coworker you hear clipping their nails from the other side of the office. Patent Pending","Swedish Photography Agency","A very happy doggo with a beautiful smile","The cherry on the top of a bad day.","Death Valley National Park shot on an IPhone","The view at Malia's Palace","My dad's parakeet that he calls \"pretty boy\" just laid an egg","Shot this in the Cathedral of Milan","Welcome to the Cool Zone","The Ambulunch is here","For my birthday, my girlfriend hired my artist friend to draw the last picture I ever had with my dog who died a few months ago. She framed it and I’ve never cried harder.","Just how long is that tongue?!","A shooting star captured on my phone.","Look at this adorable fellow I fried up tonight. Makes it too hard to eat him.","The smokey skies sucked, but it made for some incredible soft light.","This may look like the ocean, but its the cloudy sky against the backdrop of a sunset","Argentinian photographer waited 2 years to get this picture (Seba Borsero)","The beard wax man at our local farmers market.","The Chihuly Garden and Glass, Seattle WA","A Hint of Comic Book Flair!","Derp Calzone","Somewhere in Saskatchewan [OC]","i like deserts. i like my car. here are pics of both.","The sun this morning","The Siberian Tiger is the largest of the tiger subspecies (human for scale)","A jug with altered colors","A modern day \"Scream\"","His phone captured a shooting star","Dog on a skateboard","Quick Snap","Living that VR life on your morning commute","Water sure is persistent. Watkins Glen State Park, NY","Zazie Beetz. Day Of The Dead Painting","North Ossetia, Russia","Hoping I get really lucky today!","Sculpture in Paris","Nepal is like a dream landscape","Heavy rains completely hide all the buildings in Bangalore's skyline","At Puerto Vallarta with a Mango on a Stick","Found a suitably edgy beach today","Age 30 230+lbs to Age 38 160lbs","In the middle of packing for university, i srumbled across my old Lego Bionicle collection and felt like I needed to share","Hey lil guy","My Grandad turned hoarding his medicine boxes into this!","My friend took some burst shots! and I combined them in Photoshop!","On rare occasions, geese can be civilized.","Photo I took backstage at the school theatre. I like the contrasting colours!","During the Vietnam war the VFW gave out aluminum bracelets engraved with the names of American POWs and the date of their capture as a way to show support. This is the one my mother received.","Insane BC Canada wildfires obscure the sun","After weeks of smoke, western Washington finally got to see some sky again.","Paraiso City by Pablo Palomeque","The Aurora Borealis in a ring","Little dude dropped in through my window to say hello.","picture of a rainbow this morning","Babe cooling off in LA traffic","A bunch of truckers helped stop a man from jumping onto the highway in Orlando today","Rialto Beach, WA","New York city tower","Snapped this at a local restaraunt","Amazing view with my best mate.","Hawaii is such a beautiful place","White car party","A jeep in Zion national park","I’m onboard the train","I try to make people smile daily","Mr. Stark i don't feel so good.","My dog practices yoga when she sleeps","Get a German Shepherd they said, it’ll be fun they said","Hello all these two don’t have names just yet but myself and several others just pulled the whole family from a neglectful owner. Most of the others in the family are in shelters and being cared for. (More info in the comments)","Colors 🎨🎨🎨🎨","I spy with my little eye...","From April 30, 1789 to November 22, 1963","Tonight we say goodbye to a very dear friend; kidney disease sucks. Fair winds and following seas, buddy; hope to see you on the other side.","Coasters at Sunset.","My cat looks like an old man taking a selfie","Sunset over Lac Bolduc, QC, Canada. Picture taken with my iPhone!","My trip to Brazil 🇧🇷❤️","My mom and her parents and brother on a hunting trip with their black lab (max) and golden retriever (Cody) for his first smell of pheasant.","A small fire near my school melted this street light.","Took this on Vacation in Florida last Winter.","The colours from oxidation in this stainless steel tig weld","A group of African guys try to break open the back doors of a French truck to try stow away on a truck about to board a ferry for England, just metres away from French police. Unsuccessful, they proceeded to smash the lights of the truck.","Stacked turtles.","Some beautiful clouds near Westervoort, The Netherlands","[Fan Art] Pennywise the dancing clown color pencol drawing.","When you hire someone to make you a Ganesha statue but he knows only one unit of length.","The coast, Carlsbad, CA","Bear Lake. Rocky Mountain National Park. Sunset.","Meanwhile, in Oklahoma..","Ziggy derping for the camera","Sunflowers","Kansas @ Nutty Brown Amphitheatre, Austin TX 08/24/2018","Uncle Patrick and his nephew","Don’t tell me what to do!","The Result Of Taking A Panorama Picture While Rolling Down a Hill","This is Beaux Tox. He's a little different from the other dogs, but he's still one handsome pupper. 🐶","The curl of this wood shaving","*crunch*","Hope it stays this beautiful","They put emojis on anything these days","Baby born at 22 weeks leaves the NICU after 5 months","This is my new puppy. He will be two months old tommrow.","Santas cabin..","just random couple","moonlit wooden cross near Burgos, Spain.","Found this Italian prescription at the health store...","Happy 80th Birthday to Elliott Gould","Unity in the jungle channel","Human tower by Moixiganguers","Love my city"]