["Hearthstone Global Games 2018 - Week 5","This Week's Tavern Brawl is \"Double Deathrattler Battler - Standard\" (August 29, 2018)","I feel like we're missing out on some great BM by not having this as an emote for Dr Boom, Mad Genius.","17 Boomsday cards translated from English to Romanian, Indonesian, Zulu, Norwegian and back to English","I think I did something wrong..","Just a thankyou for the fact that shudderyogg is a thing","HSReplay.net - The top 5 most played cards in WILD are from Druid [ranks 5 to Legend]","I-I didnt even know this was a possibility!","My Ava Cosplay from Hearthstone I wore during gamescom!","Is it just me?","Hearthstone's 2-drop problem","Speak out against bullying.","Friendly reminder for F2Pers that it's time to begin storing gold for the next expac.","Is it theoreticallly possibe to win on turn 1?","Explain me this Gloop/Vanish interaction please.","Next years standard rotation is the perfect time to add a core set","What is the most played card in the history of Hearthstone? (not counting the coin ofc)","Golden Card Animation Art","Gee thanks spellstone.","HSReplay.net - A Look At The Popularity Of Each Card Set In Standard [Aug/28]","Don't you hate it when Rogue plays Keleseth on two?","It'd be great to see cards from newer expansions show up in Dungeon Run.","Infinite value!","This poor guy had to face this at 0-0","Neptulon flashbacks","Was jamming out and playing HS yesterday when this beautiful sync moment happened","Bad order: Tap first edition","Shifting Scroll now procs Mage Quest","My discovered Piñatas gave me Togwaggle and Azalina and my Rogue opponent reduced their cost with Bring it On from Academic Espionage","4 mana 7/7s are overrated anyways.","Bamboozling vs getting Bamboozled (HS Global Games Edition)","Sometimes Unstable Evolution is less unstable","Hearthstone: What are you paying for?","Hard to see because I only had a split second to snap. He played volcana with lifesteal and it only hit my lightwarden once.","Another reason to craft golden Whizbang","No Fireside Gatherings on Tatooine then","Found a way to win vs 6 espionage","A Silverhand Recruit‘s (rhyming) tale of a friendly game of Hearthstone!","HysteriA's Mythbusters 62","It must be getting pretty hard to come up with brand-new Tavern Brawls...","What are some legendaries that are okay by themselves, but would be broken if they were epic?","BlizzPro Ladder Optimizer (BPLO) #32 (Meta-Meta Report)","Loatheb Rendition [OC]","Lich King beaten on Turn 5 as Ragnaros","It's finally over","None of the free boomsday projects packs are showing up.","BustaJ gets bodied by Mecha'thun Warrior on legend ladder","Alternative payment for Android Hearthstone.","New Hearthstone Podcast: Richard is back! Zac Talks about a stunning run with TempoMage and we look at HSReplay as a resource for determining what deck to play in the current meta.","Times have changed","Looks like I won’t be playing hearthstone.","New brawl in a nutshell","Love the new Tavern Brawl :)","New Bug You can't counter spell demon project unless you wanna crash LOL","You have to enjoy the little things... (post about a fun win.)","Best of Electra Synergies","Exodia Mage decks with Stargazer Luna and/or Luna's Pocket Galaxy should be called Majora's Mage.","Does anyone know how to use Apple Pay on hearthstone?","It's what's on the inside that counts...","What a fun brawl...","Questionable play from BestUdyrEU (Bulgaria vs Spain)","Can someone help me win this thing im so over it","What are the odds?","I hope i remember these values.","Coming back to Hearthstone","Unstoppable Druid.","Hearthstone needs a \"Grounded\" mechanic","Rank 1 Legend Insights: Norwis on Zoo Warlock!","When you're playing your GF in a friendly game of HS and the RNG gets out of hand.","I get it when this kind of thing happens when you lose, but I really don't get the mentality when someone wins. Do you have to justify it somehow?","[Belarus vs Indonesia Spoilers] - I think in this case we're allowed to say \"He needed exactly that card\"?","Value","I would love to be a new player in moments like this. Had this bug for the hole match.","Created by what?","Board Clear Puzzle","So those two minions worked out for me. Infinite boardclearing ftw!","Pure Skill Arena","What should I do next to progress","“We are aware you have to tap OK TWENTY times to play puzzle mode so here is one more” -Blizzard probably","How to fix my deck to be better?","Tips for returning arena player?","1 minute (30 min) of infinite Azalina","2x in a Reno Deck","The longest fricking game I ever had... 34 minutes","Anyone know what happened to these datamined KFT related quests? There's even a tavern brawl for it. Really want that Happy Ghoul..","Fireside Brawl tonight - not sure if it's Wild or Standard - \"Top 3\" What's the best 3 card deck? (10 copies of each)","What is the better druid deck: Malygos, Malywaggle or just togwaggle?","Top Decks Week 3 (Standard and Wild)","Jaraxxception Disco","Has anyone heard of any HS streamers looking for youtube video editors?","Looking for a good replacement of Aluneth in this deck.","Sharing how noob I was when I first started playing 3 years ago.","Interview with Reynad, owner of TempoStorm by Invenspotlight","Blink Fox got my back","Hunters secret take too much time to trigger.","Hmmmmmmm...","Does anyone have a Burgle Rogue list for Wild?","Why is the shop closed?","What happened to the Tournament Beta?","My first 12 win arena run, 3 years in the making. My proudest Hearthstone moment yet!","Is Hearthstone's golden age on Twitch over?","ok...","Just some Defile things (forgot to add flair)","Blizzard, can we please un-nerf Illidan so we have some decent combo disruption in the Classic set?","Good tournament manager software for hearthstone?","Why is this Brawl Standard","40 HP, 8/8 Taunt and yet you are dead.","Czech Federation? Rly Blizzard???","WELCOME TO GADGETZAN!!","I'm definitely not the only one who realises that the mobile client is a steaming turd RN?","Ah, okay thanks blizzard","I can finally play the decks I like!!! (Excited for finally having all 9 golden heroes :p )","I just beat quest rogue with value","Returning to game","Boomsday Deathrattle Hunter In-Depth Guide","NOW YOU FEEL PAIN","To the guy with Lambo in his name playing Togwaggle Druid on NA ranked, thank you","First time using taunt Druid, I had a fun time. (Original post got deleted)","How many arugals is too many?","Remove gems from token cards on the wiki","Feels good man... also 3rd Golden priest i meet in a row","What cards would be worse if they were buffed?","Golden Boommaster Flark","Using a non golden bomb toss on a golden hero summons a golden bomb","Overwatch loot boxes are now banned in Belgium. You think Hearthstone will follow?","So, there are two classes that don't have an currently available way to get an alternate hero. Why is this?","[BUG] Instead of Shadowreaper, Anduin turned into Medivh","20 turns later, my opponent died to fatigue.","Mind Control Tech Full Board Interaction","Savjz ropes and Kangor gets played for the first time","My birthday cake!","Top Deck is not real...","Daily Card Discussion Thread #834 - Ghostly Charger | August 29th, 2018","I was just beaten by an OTK priest and I wasn't sure what the final card was. Could someone help?","Nerfs?","He must've been so smug with that Spreading Plague, little did he know he'd be conceding right after my next turn mwahahaha...","Cult Master is great in Deathrattle Rogue","Dungeon Run: Cannoneer --&gt; which is your choice?","Started in KnC. First time 12 wins. Warrior feels good!","luna's pocket galaxy devolve bug","Is it just me or is whizbang unbearably bad?","Only my second game with burgle rogue and i got a fan response!","(Probably) The Highest Stated Kingsbane to Ever Exist (22 Greenskin)","During the next reveal season, Blizzard should reveal cards translated from English to Romanian, Indonesian, Zulu, Norwegian and back to English.","To whoever printed Juicy Psycmellon, what did you expect to happen in Wild?","What are the motivations of each of the classic heroes when they gain control of the frozen throne?","Didn’t know misdirection could do this, the Thug attacked me then misdirected towards their hero, but then suddenly the rogue uses its 6/3 weapon and slaps it taking damage and killing the Thug at the same time. Since when did attacking a character with a weapon kill the minion.","Hearthstone's performance is, and has been, inexcusable for ages. When will this be fixed?","Game keeps crashing on iOS even after recent uodate","HSReplay.net - The LEAST Played Cards From Boomsday [Aug/27]","Ladies and Gentlemen, I present to you, Spell Damage Shaman","I think I‘m doing this with all the classes now. For science! And awesomeness!","Amazing Value","I drafted hoarding dragon in arena","You alright there Malfurion?","Hearthstone Digital Comic #3 - Dr. Boom: Your Own Worst Enemy","Druids are for summer","Hearthstone Short(est) Stories: How Dr. Doom feels right before you press the concede button.","How does Wizzbang work against the Lich King?","The Quest Rogue completed his quest for me and then some","Healing Rain vs 2 clerics = turn 6 fatigue kill","Quit during a puzzle or monster hunt and now every time I open the game this shows up and doesnt go away. Help?!?!","Quests bugged","Hot take on OTK mage","Why I’m excited for Artifact/How it's existence will help hearthstone","I've fallen in love with Steal Rogue","Defeated a Mecha'Thun Priest yesterday with 2 Bananas","Odd warrior.","Not bad for not having Kelesth","Best strat amirite or amirite","Pls help me to create a good deck","[GUIDE] How to calculate Fatigue damage quickly","Mecha'thun Making arena opponent cry :D","Insane RNG at HGG Belarus vs Indonesia","Here's what should actually be written on Soulfire","[Brawl Idea] Pick a class and access all other class cards (Wild)","Last scroll of wonder into demonic project. I love this game.","Frozen Match?","Is there a plugin that keeps track of stolen cards for Tess Greymane decks?","Summary of Iksar’s chat with Thijs on stream: Gamescom 2018","Deathwing Value?","Warsong Commander bug?","This gym equipment kinda has the hearthstone logo on it","Hearthstone Classic Legendaries Sporcle Quiz!!!","Boomsday or Witchwood?","Astral Rift -&gt; Black Knight -&gt; Profit","TIL playing either Bolvar against TLK will get an interaction","My game just crashed and I'm not sure why, didn't count as a loss?","Upcoming bundles?","Closest match i've played as a Renounce Warlock main.","After a lot of tears and an annoying Shaman fight, finally ended the LK","I am literally the worst player and I need some serious tips.","Google Engineers, PhD students and child geniuses: Meet the new breed of Hearthstone pros","Weird artwork glitch with Floop, florist, and giggling.","Won’t know what hit him","Never forget about the armor","Hey look a buried chest!","Healock Gameplay: vs Odd Rogue, Elemental Mage","My biggest stroke of luck in a while","I think one of my cards is getting bullied","Discovered a disgustingly degenerate deck build (41:1 in ladder)","Gamescom 2018 Goodies","DK Rexxar is too op?","Way more fun than it should be","Active players per region?","Mossy Horror Scavenging Hyena bug?","Please give a little more support for mechs next expansion!","One Big Spooder","108 Health on a Flametongue Totem","Sludge Belcher, Tar Creeper and Giggling Inventor - defensive tools that are too good in offense","When grinding quests I think it's best to work on the harder ones first","I think at rotation of Whizbang to wild, he should become Classic.","My luck in hearthstone...","Taunt Theorycrafting","At least you tried","iOS load experience still slow and annoying","I call this piece \"The Annoy-O-Nuke\"","Will the Whizbang Decks change with every expansion?","After all this time, I finally completed my final run (plus, it was with this deadly kelthuzad/wax rager combo!!)","Do people still hate this game?","What packs to buy?","New HS iOS update","Gave my opponent some bananas thanks to Zombie Mukla ;)","Tournament Mode Beta?","crafting priority","Kingsbane's polarizing matchups","Omae wa mou shindeiru","Odd shaman wins it again baby","Sorry, not sorry.","Newbie Tuesdays Weekly Discussion","What happened to Taunt druid?","Disguised Toast Exodia Mage (Infinite Fireball) Boomsday Hearthstone Gameplay","Closest game i've experienced as a Renounce Warlock player.","HSReplay.net - Class Power Rankings and Popularity [Aug/27]","What are the basics of the game","Shudderbombs","dungeon run is pretty cool","Card Deflation/Inflation","Supercollider interaction with enrage minions is BS","I wasn't aware that I was playing Taunt Druid until Astromancer told me to.","The Absolute Best Feeling from Gnomeferatu","I have never been more furious at this game","Nostalgia thread - Show pictures from the good ol' days of Hearthstone and let the nostalgia flow","Insane 12-1 Shudderwock arena deck","2100 dust","Lich king or luna","Deck from “Value” post ;)","Power creep","Made a Reddit account just so I could share this","Questions regarding APM Priest.","So I created a custom tempo rogue deck and went 4-1 on ladder and managed to grow a shoe in the process.","New Card idea that fits the game","Kills Himself!","The best way to beat Druid","Thoughts from someone who's spent over $1,200 on this game","Quest Rogue Salt?","Infinite Tess","A fun little Priest deck I made, with only one legendary!","Please fix wild matchmaking","Oof","Priest in Arena... which one do I take? (First Pick)","Mobile(android) users, there are clipboard apps available on the play store","2 Legendaries to Craft - Help me decide","Made a friend at rank 25 in Wild","I love Keening Banshee in my Mecha'thun Warlock","*Screams internally*","Can we take a moment to appreciate Glow-Trons buttery smooth voice.","Your dose of hopeless Druid","First pick, holy hell!","Do any fellow Control Priests wish that Baku will someday be viable?","First time Legend. Want to share it with hearthstone community","Okay Blizzard... i will play Warrior!","Anyone else just collect the unopened packs? How many you at?","Hearthstone 101 - An Introduction to Druid. (Yes im using golden whizbang)","Anyone remember the Solo Adventure Nightmare Amalgam interaction?","Since shaman and warlock already got silly heroes with Morgl, Nemsy and Mecha-Jaraxxus I thought warrior should get one too.","Many of my friends say Hearthstone is a Pay to Win game. I disagree. To prove them wrong I’ve started a weekly challenge to observe my progression in Standard ranked with but the base cards. This week here are the introductory levels show my beginnings. Welcome to ‘Grab a Seat by the Hearthstone’","Crafting advice for a returning player (with many classic legendaries/epics)","Whizbang has the most uplifting entrance sound.","Hearthstone main Theme with different instruments! This girl is awesome!","Fatigue? What’s that?","I have been creating 4 new decks each week for over a year. Here's a preview for this week: Murloc Surge Shaman, Fire Plume's Boom Warrior, Deck Gone Rogue, Loaded 9 Hunter","Is now safe to say that Supercollider is the \"0star\" card in this expansion now?","So this is what it's like to be stuck in an infinite loop.","I climbed 5 ranks with odd rogue. (Firsts real meta deck) and I'm starting to fall again feel a bit out of my depth. Any help?","A bargain forged in tears and mill (yes, i am using golden whizbang)","Crossover between r/Hearthstone and r/UNITINU","Returning warrior player curious about expansion.","Just a little rant from someone who just went from rank 1-5 stars to rank 4. No salt, just rant.","What is the possibility of getting only murloc tinyfins from megafin?","Interaction Question - If you use Zilliax on Explosive Sheep, should the deathrattle heal?","Thoughts on this change to the Caverns Below reward? (Quest Rogue)","How to assert dominance in hearthstone","“Maybe I won’t end the game to see what memes I get out of Yip”","Got Zilliax' effect when magnetizing 2 other mechs","My buddy decided to use two Healing Rain cards.","Ahh...perfection","What deck to craft?","Dog says what's his favorite dragon in Hearthstone is","If your deck works !!","Grom invasion! Thanks Tess!","Reno priest is fun","Is it OK for a class to be super bad in a card game?","I'm confused, a lower cost deck has a higher win rate?","TIL: Kangor's Endless Army retains the Val'anyr buff.","I think the game is trying to tell me something...","Presenting (Wild) Odd Shudderwock Evolve Shaman - enormously fun rank 25 deck","How to check yourself before you wreck yourself in Hearthstone - Latest episode of The Happy Hearthstone podcast!","Killed my mechanical whelp with Supercollider and it bugged my game.","It's the small things that bother me","I dont think i will pick rummaging kobold...","Hey Blizzard, can we please Order 66 Quest Rogue","Made it to wild legend as a F2P player!!!!!!!! I feel great","I'm new and need advice for ranked please","As someone trying to learn the game Giggling Inventor makes me want to quit every 2nd game","Luckiest game of my life. Hallucinated a Rexar, blink fox-ed a Shaw!","Thijs combo priest lethal","Kingsbane is pretty fun on standard","Winning isn't everything?","You can never have to many sindragosas in arena (i played them all)","Saved by the Cleric","Rip","What a Wild game","B&amp;W Drawings - Loose Specimen(s)","Pogo hopper","Why is there no Kingsbane counterplay?","Please stop letting dumpster legend players match up vs. rank 1 players","Replaced Dr.Boom with golden kobold and this happened.","Can someone help?","Should there be some kind of filter that stops netdecks in casual mode?","Best of Shadow/Potion of Madness","Defending Dreamgrove (A Dramatized Hearthstone Match)","Interesting interaction: transforming an annoy-o-tron into a bolvar fireblood gives bolvar +2 attack as if the annoy-o-tron lost his divine shield","Warlock sudoku 101","Please Team 5, stop creating invisible boundaries for Hunter.","Meteored my own minions, was up against a board of Pogo's, and narrowly won. I love the way this game makes me think.","Help with Legendary RNG deck","Did something change?","Not enough space on your device to install","Which of these can I safely disenchant?","The Currently Appalling State of the Games Two-Drops","Deathrattle Rogue or Secret Hunter","Interesting Boomsday Synergies (that probably won't see play)","So i broke an old brawl","That relatable moment when, you play keleseth on two as odd shaman and your mage opponent says right back at ya.","Silverware Golem is nigh-impossible. (Heroic tho)","The man, the myth","Whizbang doubt","Looking for a good Face Hunter Deck","Prism Power! - Mid-range Paladin [deck]","Golden Whizbang has made the game fun again.","First Time Legend since Beta – Decklist","TOPDECK IS REAL - Anduin found his road","I'm trying, Ringo. I'm trying real hard to play Evolve Shaman.","Blink Fox let me try something new","(Legend) Spider Bomb Torture","Ticking Abomination is now the highest win% card in hearthstone, when played","Please dont nerf Giggling Inventor. Tempo Shudderwock Shaman will just cease to exist.","-STRONGEST TURN-1 IN THE GAME- It finally happened😭😭!!! To my opponent, I’m so sorry. Your concession was the correct play😅","Where do I keep going wrong when playing arena?","Is Tempo Mage Bad Or Am I Just Trash?","Some Tess stuff hehe such a fun deck to play!!!","About quest rogue","A tournament mode would be nice.","F2P Pack Prioritization","Why are quests always garbage?","Stealth buff to Elise, Trailblazer?","Should've played around double Dragon Slayer","Myra-&gt;Sherazi+Cheat Death=Concede","Stuff I found","What's your rank and how much did you suffer to get there?","The best means to create a strong board presence against Wild Druid.","Me and the enemy priest had quite a match going until I pulled my netherspire historian and got deathwing XD","Fun Tournament Idea","Is it possible to play Odd Warrior without spending over 10k dust?","I don't know if this has been posted here before, but I liked this little detail!","I wish hearthstone had more options for budget players to keep up with each expansion","Met the Legend today... and some other guy","Been away for 1+ year, best website for netdecking?","When they don’t know that you’re playing spell hunter","Legend Deathrattle Hunter: Deathwing is my boy!","Uhh... why would u do that","I would be Tilted too if i got vanish double sapped","Looking for advice to get into Hearthstone","Blizzard freezes the minion that security rover produces???","Nice Un'goro Pack","The Waters of the Netherstorm have broken into Dr Boom's Puzzle Labs and have reached lethal levels!","Interesting Mech Control Paladin deck that shows a good winrate","That bug","When you forget you played vs your friend with meme decks earlier.","I was doing a dungeon run then the boss (who evolves his minions into one that costs 1 more) evolved one of their minions into a Mindbreaker but we were both still able to use our Hero Powers, why is this?","Help in boomsday, survival glowtron puzzle 3[spoiler]","Typical 10-2 arena game","Golden Battery Pack doesn't have an animation","Interesting Interaction: Faceless Manipulator on an opponent's buffed Zerek won't revive until you cast a spell.","Power Creep Dust","How to lose in arena 101","An interesting Firebat game that the editor said should be on Reddit so that he gets attention","Came up with nice combo in Dungeon run","Welp... There goes my arena run...","Why?","[Week 167] Tavern Brawl end-of-week discussion (with Strawpoll!)","He got him from Prince Liam","[BUG] Duskfallen Aviana broken interaction","Full Northshire","What makes Odd Warrior so good ?","Deathwing is my Angel (Legend Standard Play)","Gifting Content to Someone Abroad","Non-Odd Control Warrior deck that got me to rank 5. Just sharing.","Need help with Togwaggle Druid","When will there be a new event?","im not really sure if i play this game correctly...","Competitive HS Articles","Sign up error","Started playing last november and finally hit Dad Legend!!!!","Any chance we could see Hearthstone over on the Nintendo Switch?","No whizbang reward?","How bypass firewalls to play (android)","Missed opportunity and negative space in the Boomsday Project","Made it to Trollden today","The best combo ™","Easiest win you could ever achieve.","Spreading plague is fair and balanced!","Feeling frustrated with Hearthstone but don't want to give it up.","Whizbang mechanics","The most insane lethal from a lucky Storm Bringer.","What are the odds? Played burgle rouge against odd paladin and got 4 Spikeridged Steed out of 4 Hallucinations.","What Is The Best Deck For Prince Keleseth? Healock!","Those results were unexpectedly good while playing spell damage mage","Playing your C’thun just gave me next turn lethal. (Please don’t bully me for being Rank 20)","Playing fans on stream is a great way to introduce them to Hearthstone","After reading Iskar's remarks, here's my guess at the next set of nerfs.","Even Shaman bots are running rampant on the Wild ladder. How is this still a thing?","So I’ve been thinking about collectible cards used in puzzles","I know people will say i'm bad and other things but i feel proud of it after 2 expansion i did it","Love it","Most accurate quest name, sry for bad editing","New player, what best card packs to buy?","nice","Dumb questions about ranked play card back","Hmmmm. r/customhearthstone much original.","I found \"The Witchwood\" in WoW.. (Quests in Highmountain, Broken Isles","A weird idea for Spreading Plague","Hearthstone Froze Because I Cued My Attacks Before Myra's Animation Was Finished","A weird idea to Quest Rogue","Got a lethal puzzle for ya","What is more Important to People who watch Hearthstone Videos?","Hey, maybe Myra will give me something good...","When the game is telling you not to play Odd Rogue!","So it just supposed to be impossible to beat Monster Hunt with the Houndmaster?","I n v i n c i b l e B o a r d","Can I only create more than one custom deck after unlocking all 9 heroes?","Is this a sign? Is my death near?","I'm surprised I'm not seeing discussion about how expensive this set has been and I wish more people would talk about it.","Man, I didn't know hs tournaments were this hard..","So, uhm, why can't we see what opponent overdrew after casting Myra's Unstable Element?","Myra's Unstable Element Bug","If all combo decks were gone. Do you guys think hearthstone would be a lot more fun?","Times up let's do this","When Spiteful Summoner gives you the best value...","What I learned playing poker and why Druid is unfair","When you play the control warrior mirror just right!","Sometimes Lucky","I made an art","Although it doesn’t affect many people, I’d love to see this change!","A few weeks ago i posted a mage vs mage arena mage when the guy got luna's pocket galaxy from deck of wonders. This aint much better... Yea.. Thats my luck.","Togwaggle meta is back","Turn 4, 8-7 and 8-1. Seems good","Is this what happens when the game wants you to lose?","Oh the irony...","So if flanking strike hits a gold target, the wolf is gold?","Is any thought actually put into making these cards or like nah?","Can someone help me find a good Mage deck with these 3 cards","Whizbang the Wonderful wild decks","Have I lost my account?","I almost forgot how joyful it is to play against a priest. (:","Can we expect more Treant support? Can we expect them to gain their own tribe tag?","I cant Even fathom the Odds of this.","Control Warlock Legendaries","Ultra rare glitch","This may not be much, but it's my first time having a fun viable standard deck for each hero, and I really am enjoying seeing 9 different faces! (And not 9 Gul'dans)","Y'know, I know it will never happen, but I'd love to see this tavern brawl idea.","Odd shaman is not a thing they said. It will never be viable they said.","Question on boomsday?","This is how i reached legend for the first time","My Prince Valanar forgot how to get Taunt while playing Odd Warrior","I thought drawing one Patches was bad enough...","Bug with magnetic minions and psychic scream?",".5 sec before disaster","What happened to the animated hero background? Pretty sure my warrior had a flaming background, Mage and priest also had animated backgrounds? Did I miss an update that removed them or did I imagine it all?","I don't think this is Amazon.com","What’s ixilid good for?","Well that was easy...","What's the better option for a Pogo deck?","Looking for a cheap and good deck for my brother :)","Hearthstone Deck Cosplay at Gamescom 2018","WILD/STANDARD CARDS","Anyone have any idea how to fix this? Had this same issue for the last 5 days.","How to get Hearth Bot ?","Since Boomsday, first time we can make a deck with no minions and no spells","Im New, and I Need Help.","Top Cards of the Week from r/CustomHearthstone (08/25/2018)","I have a feeling cobalts and catacombs was a little broken.","How it feels staring lethal vs druid (puzzle labs lethal bug)","LF Hearthstone Players","HSReplay.net - Arena Class Popularity and Power Rankings","TIL: When you play a Bomb Toss on a Golden minion, it spawns a Golden Bomb.","Why you shouldn't be mad if giggling inventor won't get nerfed.","Boomsday Update For Dungeon Run &amp; Monster Hunt?","How to properly use The Rod of Roasting","Just a friendly whizbang match, but i still wanted to share my turn 2 highroll 14/14 Edwin that could even have been a 16/16 if i wasent so fast to play him.","Back again.... any help?","Try help me how to improve my Deathrattle Rogue deck? Miss cards like Preperation or Necrium Veil, soo I try to experiment with stuffs I have. Think it's decent now but can always be improved.","Are spells reusable","While I think Puzzle Labs was a great addition to the game, there’s one thing I would change about it...","I dare you to play brawl motherfucka, I dare you, I double dog dare you!!","What legendary should I add to my mage deck?","This is why I LOVE Toki sometimes","Solarium Bug?","Looking at getting into competing","I Like Violet Haze.","I’m new to Hearthstone and I was wondering what the best class is?","When all is dim and dark, when despair and hopelessness start to settle in -- Turn to RNGesus.","Back after a while, need some advices ! (left when witchwood came out)","major bug in lethal puzzles","You're probably wondering how I got here, also thanks for the help with mage","Anyone else not being able to update HS on Windows?","Hearthstone is crashing since i upgraded to 1440p","Been back for a week, Aviana needs to just stop","Which of the Mecha Thun decks would you recommend?","Don't you love it when you get Azari as Tess Rogue?","Quick Rant","What can a Spider bomb do?!?!?! - Mech hunter chronicles","Streamer Sundays Weekly Discussion","a casual 3-0 arena match","My new Card )) Support me :)) 😊💜","I thought Monster Hunt was updated for a second there","Card text consistencies","Warriors of this sub.","Boomsday Puzzles Eye Tracking","Kobold apprentice shoots 4 bolts but only deal 3 damage? Literally unplauable","I want to craft Cube Hunter. How much better is the version with Kathrena and Krush vs Zilliax?","Hearthstone’s Problem With Sustain","It seems weird that silences don't work on QuestRogue'd minions, yet if you gain control of them they're still buffed.","Healock is pretty good","New player","Is odd control warrior any good?","Deck help","When you haven't opened hearthstone on mobile for at least 27 minutes","Shutterwock is stupid","In Japan, Hunter mains get special accommodation.","Dear Zoolocks and Odd Paladins","When the game really doesn't want you to win","Is it still possible to obtain Lunara","Finally after 4 years got 12 wins","Why does a reduced cost Floop go back to full cost once you play another minion?","Kripparrian - This Is Why I Get Salty","Blizzard should reverse the Priest Hero nerf","TIL DisguisedToast was a Businessman Before HS","N’Zoth’s battlecry, explained in WoW’s new Warbringers cinematic","Any hope for a raise in level cap?","Hunterace just reached Rank1 legend on EU and Rank2 on Asia with Quest Rogue.","9000 iq play","I knew that Zoo is strong, but damn","How good is even warlock right now?","New to hearthstone","Does Ixlid, the Fungal Lord work with The Darkness?","Ahaha u idiot a taunt wont stop my lethal... oh.","I think i'm starting to like my whizbang deck!","Random crashes on Fire hd 10","Why has the meta game remained so similar to pre-expansion?","Why doesn't Archbishop Benedictus, King Togwaggle, and cards that shuffle copies into your deck keep the card back they start with?","Mobile bug won a game and lost","Wtf happens?","Well that was easier than I expected","Leporiphobia","Why is it possible to lifesteal more than a minions health?","Is this mage deck viable?","Returning to the game what deck to craft","Never Gets Old","Does anyone else honor quests in tavern brawl?","What a ride that was. He also got 2 chameleoses from two ravencallers","I need to watch a friend win in spectator mode but I'm all out of friends.","Spell hunter","Still bitter over Hearthstone killing its Elders. Getting ready to move when this came back into my life. I think its bugged though, the golds dont have any animations.","Can you nerf druids now please?","Rode Deathwing: 19-Legend!","TIL You can get negative attack","Benedictus Time Limit?","New Player - Bought Packs - Want to build deck - What cards to disenchant safely? (more info inside)","I am sad that priest got no new viable decks this expansion","Playing hunter Arena, already have king crush, what should I pick?","Starting point for building a deck","Whizbang IS Wonderful","Replacement for Zilliax and Kangor's Endless Army in Boomsday Odd Paladin?","Calm down Woecleaver, The game is over.","Tavern Brawl Idea: 30 Legendary Deck","What would you do with these Legendaries?","Magnetic mech deck?","How exactly are you supposed to beat Mech Warrior?","Why Animal Companion is literally unplayable.","NEW to the game tips needed thank you","Got whizbang while playing whizbang","I guess im playing Priest right now","Your Opponent Left.","Good minions for Diamond Spellstone?","Academic Espionage + Tess = Broken","Did Fiery War Axe deserve to be nerfed?","All I wanted was some face damage...","Zerek appreciation thread.","I found lethal turn 1","Date night at this subs favorite restaurant","How to defeat DR BOOM","What's the BM that triggers you the most?","Newish player here with Frost Lich Jaina. Need help making a deck.","Which cards to buy...?","Soulcaller Togwaggle","TIL You can use different Fonts to name your decks. Just copy paste whatever you like into HS","TiL : Golden Whizbang gives everything golden","So I wanted to see if my Mecha'thun deck can beat Lord Marrowgar..","Why isn't my \"3 Mana: Summon Hadronox\" card not working?!","First ever 12-0, woo!","Arena Triple Spider Bomb Triggered","I wish Blizzard would add \"shuffle mode\" to cardbacks","What could be the next big thing that Hearthstone introduces to keep game fresh?","This makes no sense!","Does Naga Sea Witch &amp; Giants deck still see play after the nerf?","I was playing some arena, and my opponent was playing constructed.","Good beginner deck?","Tyrande...","[Miracle Priest] Not (yet) brave enough to play this on laddr, but boy can this be fun and also powerful. Lorewalker Cho is just hilarious.","Turn 1 Mal’Ganis?!","Well then... Guess I'm a Druid. (new account, got malfurion from the koft prologue, floop as a free legendary and his gloop from the 6 free packs from Boomsday, I'll see if I'll get cenarius from the welcome bundle)","Hearthstones most exploitable feature","When Blink Fox is on point.","Hearthstone Biggest Issue! (Personal opionon)","Sex is great and all, but have you ever tried...","Turn 5 16/16","So deep fatique in arena (maybe most deep).","What is the fastest way to farm dust?","UNCOLLECTABLE CARDS Tavern Brawl Suggestion!","Where are my fellow GENIUS's at?? To you which puzzles were the hardest to complete?","N'zoth's big reveal in WoW has a throwback to Hearthstone.","I like Astral Rift.","Finally got legend after playing casually since LOE! Thanks Blizzard for the season reset changes!","Blizzard should try to have a community based card expansion.","This is why I love umbra in cubelock! Not only it outvalues control decks, it can make you a druid against aggro decks just in time.","Uprooted Ancient of War for lethal at 1hp","When playing with waifus in only one card game isn’t enough (x-post from /r/shadowverse)","Wich heartstone pack should i buy","How did this get past QA?","This is the reason I play academic espionage rouge","Beware the shudderwock","3 Easy steps on how to beat control mage!","When you know the game just isn't going your way.","VERRY FUNNY Plastic-Bag-Wearing Weirdo Playing Mage","Just received 256 damage from a mega buffed Stonetusk Boar. Sorry for the potato quality.","How stupid I feel that in three years of playing arena I literally avoided Warlock until now, and am on my best start ever.","Legend!","I love this deck so much","Which one is better? (Zilliax is better than jaraxxus?) First card btw","What are all of your favorite meme cards.","[Spoiler] Can't figure out the last board clear dr boom puzzle?","Juicy Psychmelon and Aviana Kun combo (Star Aligner OTK)","Ettin is hungry for a win","Floop Taunt Druid?","PuzzleLab For Absolute Beginners?! (Radio Recommendation)","If you are like me, take a break.","When life gives you nothing but nightmares...","Tips on improving the deck?","The worst thing I've ever done","Frozen game i couldnt even concede thx blizzard","\"1 star\" Trump say confidently, \"Try killing your opponent instead\"","Blizzard, what about adding community created puzzles","Kangor's Endless Army Deck Discussion","Is there any way to see which cards am I missing from a pack?","What’s up with this card Blizzard?!","HSReplay.net - Top Minions Discounted By Dreampetal Florist","You guys ever think they’ll re-release old keywords? Why aren’t all keywords full time gigs like discover and lifesteal regardless of the set?","If you have the dust or the cards, I'd highly suggest Wild Bomb Warrior","What is the laboratory that each class works for / stands for with current Boomsday expansion?","I decided my decks should have a theme","We always knew that there was something wrong with edwin's text. FINALLY SOLVED","Does anyone know who astromancer arwyn’s voice actor is?","Pogo Pogo Pogo Poo Pogo","Here was my final battle for 500 warrior wins!","Dean Ayala interview @gamescom","At least I have chicken","Just came across this. Found it funny and thought I'd share","What I learned playing Fortnite and why Warlock is unfair","Is This Game Worth Getting Into?","‘This Will Be The End Of Quest Rogue,’ Says Increasingly Nervous Balance Designer Before Third Nerf","Golden heroes should have a golden coin!","Everyone complains about how Toki was the hardest to win a run with, and here I do it on the first try. Bring in the salt!","He was a mech, and she was a bot...","Good Hearthstone discords for Standard discussion?","Mecha'thun, meta-commenter","Whizbang is wonderful but weird","I thought Spiteful Druid was bad enough, and now this...","I'm nnew to HS and i already hear so much about ZooLock, so I decided to try it. It's fcking disgusting","Just healing 48 hp to beat a burn mage","Literally left nothing for the opponent","Poor Shaman","How does the card expansion rotations work?","Was coaching a friend and the greatest blood knight of all happened","Whizbang in the long run thinking about it ...","Whizbang the wonderful - Recipe?","Does Whizzbang in Wild give decks from previous expansions?","Why is Shudderwock allowed to exist","An unexpected or unfortunate result?","30 Epics Control Mage","30 FPS cap?","[Spoiler] The Spud M.E. acts a little weird if the other side of the board is filled.","[IDEA] our own labs","Thijs cheats and he knows it!","If you play on the Boomsday board on a ridiculous resolution you can see the items from the cloning machine floating off screen","All the game's problems can be traced back to (spins wheel) ABUNDANT AND CHEAP SINGLE TARGET REMOVAL","Finally completed my Priest Dungeon Run - and still have to complete Warrior (send help pls)","Alleria Windrunner cosplay by Danielle Beaulieu","How legend ranks work ?","Triggered Mathematically","Reno offically recruited to join the Boomsday Project.","Remember how this sub was furious about how good Druid was going to be this expansion?","If you ever feel bad about sucking at HS remember this","where can I find coaching for this game?","What are the chances of this?","Would anyone be interested in some amateur coaching?","Play Dead + Terrorscale Stalker = board clear and Reno Jackson","I just lost a game directly because of Nozdormu","So I heard direct damage is good in arena...","The results were unexpected","Finally got my Shaman to level 40 - Can't wait to use my golden Truesilver Champion! ...wait...","Book of Value","Alternate Hero Options","[Question] Question about old adventures.","It would be amazing if solo adventures were available offline","Anyone else just play one class all the time?","Wanted to share my greatest achievement in hearthstone as a f2p player,hitting legend in both wild and standard in the same month!","Spiteful Druid deck help","Glory of the Sin'dorei!!","I'm conflicted about the Boomsday Puzzle Lab (no spoilers)","Kings bane Rogue","FINALLY!!! someone notices","[Spoiler] Survival Puzzles are a missed opportunity","Ask Reddit Survey Results!","Lack of combo disruption is the biggest problem currently plaguing this game","Help me play this game!","Clear the board is legitimately super hard","Ultra low graphics option for HS mobile app?","Beginner Legendary Disenchant Help?","vS Data Reaper Report #102","Best Arena Meta Yet? (Lightforge Tier List Updated)","Looking for a little help with some of the whizbang decks.","Just hit Legend with a deck that have been hit with 2 nerf.From rank 5 to legend in 4 days. This quest is a total nightmare against control deck.","TIL any deck can go infinite with Baleful Banker and Augmented Elekk","Anyone know anything about these cards?","Hearthstone Global Games 2018 End of week 4 - Current Standings","Hearthstone Doom Meta: Stable?","YouTube’s auto-play subtitling delivers a sick burn 🔥","Odd rogue - Edwin","Tavern brawl looks good.","If you stretch out your screen resolution you get a ghost boot and 2 veg!","Legend at 68% winrate with Fatigue Warrior (Not Baku)","Never lucky","Soul Infusion has no animation","HSReplay.net - Class Stats From This Week's Tavern Brawl \"A Scientific Recipe\"!","You have the power to move one card to any class that you want for 24 hours. What is your go-to OP combo?","Returning(Noob) player. Rate my control priest, and any advice/tips would be very welcome! Can spend lots of dust","Haven't played since Frozen throne expansion... Anyone got a list of \"must craft\" cards?","My brawl run last week ended quite.. unexpected","What to play?","Is the starter pack worth it?","After I win a tavern brawl, I start and immediately concede three battles in a row","Looking for friends to play with.","When the hell are blizzard going to patch this?","Artists talking about science and pretending to know anything about it.","Help me with the Shudderwock Deck","Kripp is such a beast!!","Kripp gets unlucky","pogo hopper: 1 star card","We are smartasses :}","Buddy gets 5 secrets from Subject 9, so I just win the game without attacking","The stormbringer comeback against BM","C'thun question.","Exodia priest style","Can someone explain this interaction to me?","Weird interaction! Where did the life-steal on the mech come from??","Well...","Can we appreciate how nice the Puzzle Bosses are?","Hearthstone kinda freezes during my turn","How to play Togwaggle Druid vs Demonic Project","Returning old player, new account or go with old account?","Cards to craft on a budget?","hearthstone on a microsoft surface go?","Your opinion?","It's time to address counterqueueing.","Love/Hate Relationship with the Puzzle Labs","How do you unironically put sprint into a deck?","Spot the Lethal","I need friends","Why does he have 30 health? Is there a bug with this stage of the lethal? (8/9) No Spoilers","Zoolock Improvment","Why can't I copy immune minions of my opponent with Taldaram, but am able to copy my own ones?","Why Won't Quest Rogue Die?","Bewitch before battlecry","Trump is a savage","Does it bother anyone else that the top 4 best decks in the game are pure aggro?","Be honest, how many people played celestial emissary coin fireball in the lethal puzzle?","In Depth Analysis of Thijs' #3 Legend Deck - Big Druid","Magnetic Bug/inconsistency","Oh Boom, how you tease me so...","this would be a better puzzle if there is only one defile","Adventures in miracle priest.","Quest Rogue is making a comeback","I'm playing against a guy who is roping me every turn right now.","Returning Player, new to Ranked. How to Get Better?","Hey Hearthstone Players I Got News For You","I guess it really is a System Error","Pulling off a Topsy Turvy combo is so damn satisfying","Better late than never - Gotham Arcade plays Hearthstone for the first time!","Kripp Thinks He’s a Priest","Im a new player is this deck any good?","Crafting Skaterbot (Rant)","TIL: Casting a normal Earthen Might on a golden elemental will add a golden (instead of normal) elemental to your hand","Please help me with my thesis' survey about Hearthstone communication!:)","Finished! :D","Glinda Crowskin -&gt; Tanglefur Mystic -&gt; Pogo Hopper in arena. Whilst pooping on the toilet on mobile. Talk about dirty.","Skulking Geist doesn't trigger against spells created by Academic Espionage","Dr. Reno??","Should I snipe kripp?","How to counter your opponent's entire turn with 1 mana of value","The Brazilian hearthstone channel has made a speclal series of Beakman World videos explaining magnetism!","ODD WARRIOR","DAE stop playing after a particularly satisfying game?","Is quest rogue a safe craft?","Small Improvements to some of the Boomsday puzzles [Spoilers obviously]","Google's got us covered","Why does my Dr. Boom have 30 armour?","Does the game match you against similar decks ?","Quest Rogue?","I'm an idiot. I made the puzzle with Glinda way more complicated than it had to be","Any way to turn off seeing what my opponent is mousing over?","The best opening hand I've ever had","Mal'ganised","Geesh - its getting almost impossible to get a \"reasonable\" matchup in Wild mode...","Legend player looking to help people reach legend for free on EU.","When the rabbit hole gets too deep.","Midrange elemental mage","Anybody else find Hunter and Deathstalker Rexxar way more obnoxious than Druid?","Rank 18 is an exiting place","Possibly my best dungeon run... ever","Full Puzzle Lab Guide including hints, solutions and spoiler prevention.","Thank you boomsday puzzles","The Boomsday Arena Report: Minions, minions everywhere.","Issues updating mobile app after Puzzle Lab release.","I just wanted to be polite so I greeted this girl and she insta assumed I'm flirting with her","Awww, I think he was lonely!","Why playing against druid feels terrible","Juicy Phychmelon is op","Is there any reason for emotes besides annoying your opponent?","Odd Warrior is the best performing deck at all levels of play at the moment","Hearthstone's cost problem - An analysis + possible solution","Unlocking FPS cap at Low and Medium Graphics Quality","i do not get arena deck power levels anymore","Really cool idea for custom card.","HCT Buenos Aires - Lii defeats Monsanto in a thrilling best of five series.","Starring... Dr. ‘Thun and the Gloop Bots!!","Which was your favorite? Dungeon run/hunt or puzzle mode?","The reason I quit","Spent 15 minutes staring at a Board Clear puzzle. Learned a mechanic had been changed at Un'Goro expansion(?) [Spoiler]","Literally unplayable... Blizz pls","So happy","Gamerfest, Galway Ireland!","Any tips for farming gold?","What would be a good idea to have more puzzles in the future?","Just beat LK with paladin and Uther transformed into Medivh. Anyone seen this before?","Now that we are +- 3 weeks into Boomsday, what are some good cards to craft?","Which puzzle forced you to Google? Or did you actually get them all? (Be honest!!)","Something I noticed about Crystalsmith Kangor puzzle 4 that probably wasn't intended.","Are you ok Myra?","Issue with Hearthstone Deck Tracker","If you have the ability to make Secrets for another class, which would it be?","Best neutral legendaries to craft across all sets.","Well then","Wild Renounce Darkness Zoo deck tech","My fastest win ever. Screenshot right on deathblow.","Floop vs. the Beast (X-Men)","An example of the new, unique cards made just for the new puzzle levels","Tavern brawl priest deck","[0:52] Mighty Morphin Power Ragers","Test subject and Unidentified elixir","Challenge a Friend Trade","Lunara Reveals Her True Identity","Impossible Puzzle","I don't know what to play","Getting back after K&amp;C","Pack from the next expansion leaked","I just wanna compliment blizzard on the new puzzles","Mage is trash","Help for Standard :)","Thank you for making Whizbang the Wonderful!","Tavern Brawl this week is: \"A Scientific Recipe\" (Aug. 21, 2018)","Help?","Whats a good iPad or Android tablet for hearthstone on a budget? I'm clueless","Boomsday easter egg","Most insane lethal ever spotted vs MechaThun Priest!","A list of who all of the Boomsday legendary characters are going to go on a date with:","Uhhh...","Am I crazy or is this a thing?","Mecha'thun vs Lich King","Auctioneer into Astral Communion Bug?","12 Minions on the Board (?)","Is it just me, or is the \"Great Job!\" sign not centered?","Who Needs Quest????","My craziest game ever playing Control Warrior against a Benedictus Priest at the cusp of Legend","Question","I don't think this was the intended solution to Lethal - Dr Boom 2/4","HSReplay.net - Legendaries With The Most Increase In Popularity","Steal Lich King &gt; get Frostmourne &gt; kill 3 x Ragnaros &gt; GG"]