["Mission: Impossible - Fallout Megathread [Spoilers]","Introducing r/Scenes, Because sometimes a single scene needs its own post.","When Spidey first hears Quills voice without his helmet he realises he’s human and his eyes show less concern than before the mask is removed. After Quill said he’s from Missouri Spidey removes his mask completely","In Shrek 2, Fiona has a mock Led Zeppelin poster","Jack Reacher uses the salt shaker from the diner to break through the tempered glass window of his stalkers","In Avengers: Infinity War, Tony and Pepper's planned wedding date is Robert Downey Jr.'s real-life wedding anniversary","In The Emoji Movie(2017), when the emojis learn about Alex's appointment to erase the phone, you can see the poop emoji hitting a fan in the background. Signifying 'Shit hitting the fan'.","The Joker’s introduction on the original TV series and Nolan’s Dark Knight","In Fight Club, Tyler appears 4 times before he is properly introduced by flash frames lasting only fractions of a second. Later in the film, Tyler is seen doing this exact same thing whilst working in the movie theatre, splicing frames of penis images into children's movies.","In Law Abiding Citizen, Clyde is a tactician who thinks of every possible scenario. So when the warden gives him a plastic spork instead of metal silverware from the catering, he uses the bone from his steak to kill his cellie","In Pirates of the Caribbean: Dead Man’s Chest, Davy Jones’ theme has percussions throughout the song that represent his heartbeat.","In Silence of the Lambs (1991), Buffalo Bill abducts a woman by pretending to be handicapped, wearing a cast on his arm and struggling to move a heavy object to his car. This tactic was copied from real life serial killer Ted Bundy, who attracted some of his victims in the same way","Avengers: Infinity War. When Dr. Strange asks Thanos \"and then what?\". Thanos replies by saying: \"I finally rest\". The background music when Thanos replies is the same one when he actually rests.","In Crouching Tiger, Hidden Dragon, henchman brings an abacus to a sword fight and is unsurprisingly defeated.","In Lawrence of Arabia: Lawrence is writing an IOU to Auda Abu-Tayeh from right to left, meaning to show that he is fluent and able to write in Arabic.","In South Park: Bigger, Longer &amp; Uncut, during I Can Change, Saddam blames society for being evil then blows smoke out of his hookah which turns into an American flag.","In Lincoln (2012) the recording of the ticking of an original pocket watch owned by the President was used to add to the authenticity of the film.","In Scott Pilgrim VS the World: When Lucas Lee fights Scott he is wearing a belt buckle with 2 Xs on it because he is the second evil ex in the line up.","In \"An American Tail\" - the Irish mouse sings about a Calico cat who kills his love. The Calico is a sly reference to the Black and Tan constables, who were known for their brutality during the Irish War of Independence","In The Fast and the Furious Jesses car has no brake calipers. Which is why he didn't stop at the end of the race.","In Captain America: Civil War you can see Spider-Man’s first (unless I missed something) use of his spidey sense before Infinity War, as he reacts to the thrown object way before it gets close to him.","In this scene from CASINO,the hitman in the hat is former mobster frank cullotta.He was lieutenant to mob boss tony spilotro,who joe pesci's character is based on.","In \"From Dusk Till Dawn\" you can see blood on Richie's sleeve, alluding to the murder of the hostage that is about to be revealed.","In Hot Shots! Part Deux (1993), Richard Crenna plays Colonel Denton Walters, spoofing his own role as Colonel Trautman of the Rambo film series. Crenna found fame decades earlier in the 1948 radio series Our Miss Brooks, where he played a nasal-voiced teen named Walter Denton","In \"Indiana Jones and the Last Crusade\" (1989), Sean Connery plays Harrison Ford's father, in spite of being only 12 years older than Ford. This casting choice was in reverence to the James Bond franchise, as Spielberg had always aspired to direct a Bond picture","In JL, Superman dodges a shot from Cyborg because Batman shot him with Kryptonite grenades in BvS","As a nod to the 1990 Total Recall, there is an overweight red-haired woman in yellow going through customs in 2012 Total Recall. She even delivers the same line \"Two Weeks\". However, unlike 1990 version, she subversively is not actually Quaid in disguise, Quaid is seen in the background.","In Heat (1995), in Al Pacino's \"GREAT ASS!\" scene, Hank Azaria's surprise is genuine. According to Azaria, Michael Mann \"shoots like a million takes, I think Pacino got bored and yelled GREAT ASS out of frustration, which scared the hell out of me. Not acting at all, he just actually terrified me\"","Invasion of the Body Snatchers (1978): A priest is seen on a swing-set with small children, he is a new pod person and is mimicking the human childrens' play","In the movie Rampage (2018), you can see the original game in the background.","In \"Evan Almighty\", when Morgan Freeman, playing the role of God, appears as a waiter in cafeteria, his name card says: \"Al Mighty\".","In 2001: A Space Odyssey, HAL tries to extract personal secrets from Dave using nearly identical language as is used by the Russian scientist trying to extract secrets from Floyd earlier in the film.","In the STAR TREK II: THE WRATH OF KHAN script, it was Bones' line to tell Kirk \"He's dead, already\". But Deforest Kelley suggested Scotty say it instead because \"He's dead, Jim\" had become an amusing catch-phrase and it would've hurt the emotional impact of the scene","I just realized Miss Honey's doll was named after Liccy Dahl, Roald Dahl's first wife, who produced Matilda.","In Charlie and The Chocolate Factory (2005), Charlie puts wrappers of all the Wonka bars he has ever had on his bedroom wall","In the opening scene of Liar Liar (1997), Jim Carrey is greeted by a fellow lawyer entering the courthouse. The man is Christopher Darden, who in real life was the co-prosecutor in the infamous O.J. Simpson trial.","This shot in Rango (2011)","At the beginning of Anchorman, Will Farrell was unable to understand Baxter because he was speaking Spanish. Later in the movie whilst Will Farrell and Christina Applegate were making love, Christina started to speak in Spanish. Baxter understood her and barked back, assumably in Spanish.","In Star Trek VI: The Undiscovered Country, this is the moment that Spock plants the Viridium patch on Kirk, before he boards the Klingon Chancellor's ship.","Rampage: B2 Spirit set to bomb Chicago is the Spirit of Illinois","In the 2010 Australian WW1 film \"Beneath Hill 60\" it is revealed that much of the tunnels are now being propped up with oak from bombed out Ypres Cathedral. Later on in the film when a tunneler is killed, his grave is marked with this same wood, not the standard white cross.","In \"Once Upon a Time in the West\" (1968), the slow camera pan to reveal Frank's face after he massacres the McBain family was intentionally designed by Sergio Leone to shock the audience. Up until that point, audiences had never seen clean-cut good-guy actor Henry Fonda play a sadistic murderer","In The Terminator (1984), the toy truck which the Terminator runs over when he arrives at the wrong Sarah Connor's house is a replica of the truck used in the chase scene at the film's climax","In IT (2017) the structure that Ben recreated for his class project and drops when he meets Beverly is the same building on the postcard that he writes his secret love poem on.","In The Incredibles (2004), in the jungle scene, Violet protects Dash from gunfire with a forcefield. She looks surprised when she creates it - and, when Dash asks her how she's producing the forcefield, Vi replies \"I don't know!\" Her intention was to take the bullet for Dash.","In Glengary Glen Ross (1992), Al Pacino's character Ricky Roma subtly appeals to James Lingk's latent homosexuality in order to make the land sale. The body language says it all. Later when Lingk wishes to renege on the deal, he is still visibly confused by his feelings towards Roma","Lex Luthor's prison number was a nod to Star Wars A New Hope.","In Godzilla (2014) the opening credits feature several phrases that are then redacted. This is one.","In Predators(2010): when Isabelle explains how she recognized the thing on the totem, this was a reference to the events of Predator(1987)","In \"Pee-Wee's Big Adventure\", the sign for Mario's Magic Shop is backwards.","Elon Musk at the AI conference in the beginning of Transcendence(2014).","In Wreck-It Ralph, when we first meet King Candy, he is giving a speech from a red podium with white stripes. King Candy is later revealed to be the racer \"Turbo\", who drove a red car with white stripes in his original game.","In The Hunchback of Notre Dame (1996), the gargoyles are named Laverne, Victor and Hugo. This is a reference to LaVerne Andrews, of close harmony singing group The Andrews Sisters who had previously worked for Disney, and of Victor Hugo, the original author of the novel.","Revenge of the Sith (2005) and Return of the Jedi (1983) have parallel scenes when played at the same time. It’s like poetry, it rhymes.","In Snatch (2000), Vinny tells Bullet tooth Tony to make his last words a prayer as he holds him up. Later, Tony’s last words are “Thank God for that.”","In Upgrade (2018), when Eron was trying to shut down Stem remotely, the command he typed \"sudo shutdown -h now\" is a real command line to shutdown computer with Linux/macOS/*nix OS.","In ROTJ, after Luke kicks Vader down the stairs, giving Luke the higher ground, Vader says “Obi Wan has taught you well.”","In Star Trek: Generations (1994) when Picard is in the NEXUS, one of his kids is playing with a toy (EVAC Fighter) from the \"Aliens\" franchise.","Shrek 2 (2004) When sitting at the bar (The Poison Apple), Puss says, \"I hate Mondays\" - a little reference to Garfield comics","In Planes: Fire and Rescue (2014) during the bar scene at Honkers each table has a bowl of nuts.","The Wolf of Wall Street: After Jordan offers Agent Denham a bribe, Denham nods at his partner who is standing several feet away. Denham asks Jordan to repeat his offer exactly, and when Jordan looks up the partner is standing right next to him. The partner is wearing a recording device.","In Mrs. Doubtfire (1993), when Robin Williams is trying different nanny costumes, he tries a Jewish grandmother. He says \"I should never buy gribenes from a mohel. It's so chewy!\" Gribenes is a skin crackling and Mohel is someone who does circumcisions. He was joking about eating fried penis skins.","In Vegas Vacation (1997) while the Griswolds are arriving in Vegas, Rusty sees a sign saying that a Casino is giving away 4 cars in 5 days and that YOU could win. Foreshadowing when he wins all 4 of those cars later in the movie.","This scene in Devil (2010) gave a clue of who of the five people in the elevator is the devil.","In Jurassic Park during the dinner scene. You can see a upcoming attractions slideshow. Included in this is a riverboat ride. The River Ride is a major part of the book excluded from the movie.","The antagonist in Spy Kids 2, Donnagon Giggles(played by Mike Judge) was one of the Agents that was captured and mutated by Fegan Floop(Alan Cumming) in the first Spy Kids","In Logan (2017), during the opening fight scene, Logan intentionally steps in front of a gang member's bullets to protect his rental car, knowing damage to his car would be a more costly setback than damage to his body (which would normally heal from gunshots)","Step Brothers: Dale tells Brennan that his house was built in 1825 by General Custer. Custer was actually born in 1839.","In Beauty and the Beast (1991), when Belle's father Maurice is lost in the woods he briefly comes across a faded wooden signpost. The word \"Anaheim\" can faintly be made out on one of the signs. Disneyland is located in Anaheim, California","In Stephen King’s “Maximum Overdrive,” [1986] balloons are seen hanging by a storm drain. [sorry for potato photo]","During the Blackjack Scene in The Hangover(2009), the Greek letters \"Phi Alpha\" are displayed prominently. \"Phi Alpha\" is the secret motto of the college fraternity Sigma Alpha Epsilon.","In Kick-ass (2010) which was sort of a superhero movie, Aaron Taylor-Johnson and Evan Peters both were together, later in their career both played Quicksilver in MCU and X-Men franchise respectively.","Ready Player 1 (2018) - The 4th Of July photo moves around The Overlook Hotel","In Dirty Harry (1971), Harry Callahan makes the same \"Well do ya, punk?\" speech at the beginning and end of the film. In the first instance, he is addressing a wounded bank robber, he has a cheekily wry smirk on his face. In the second, he addresses Scorpio, he spits the words with venom and hate","In Dead Man on Campus (1998), The Townies Were Trying to Get One of The Main Characters to Commit Suicide","In Unbreakable a young Kevin Wendell Crumb can be seen walking past David Dunn and when he brushes past child screams can be heard, this is to show that Kevin was abused by his mother as a child.","In L.A Confidential, the suspects of the Nite Owl killings are specifically described as driving a red Mercury coupe. This is the exact same car as detective Stensland was seen to own earlier in the parking garage.","In Deadpool, as Wade and Weasel talk about the dead pool, you see John had money on Ryan Reynolds dying next. Also celebrities names on the board.","(Spoiler) In Avengers Infinity War, Dr. Strange views 14 million ways that these scenarios play out concluding there is only one way they win...","Every avengers movie ends with thanos smiling.","Don't Breathe (2016) - Photograph of \"illegal immigrant charged with double homicide\" is that of director Fede Alvarez (very recognizable even despite being slightly blurred). Additionally, article states that immigrant is from Montevideo, Urugay (Alvarez's birthplace).","Semi-Pro (2008): When Rob Corddry's character is watching his wife have sex with another man, a portion of his Kentucky jersey is obscured leaving the word \"cuck\" exposed.","In The Witches (1990), One of the Witches is Michael Palin.","Quorra in Tron Legacy has a Light Cycle rod in her left boot. Never used it but pretty handy.","In the animated film Hercules, when Hercules encounters Nessus, and says \"Halt! ... Pardon me, my good, uh... uh... sir!\" Hercules pauses to look between the beasts legs to determine it's gender.","After Chief Brody kills the shark in Jaws it begins to sink. The sound it makes is taken directly from the sound of the vehicle going over the cliff in another one of Speilbergs movies, Duel.","In the original Predator 1987 Long Tall Sally can be heard playing on the helicopter ride into the jungle. In Predators 2010 the same song can be heard in the closing credits. Always something I really enjoyed detail wise.","[Detail] In “Inside Out,” Riley’s clothes represent her emotional balance-more in comments.","Baywatch has a CinemaSins-counter in the bloopers-reel. They knew","A still from A Bug's Life (1998), and its inspiration, Seven Samurai (1954)","In Pixar's Inside Out, the arrangement of the memory shelfs in Riley's mind resembles brain tissue","In Iron Man 2 (2010) the Mark V \"Football\" Suit has two footholds so it can be deployed on either side.","In Unforgiven (1992), during English Bob's tense encounter with Little Bill, Bob's refined English accent falters for a brief moment revealing his actual lower-class cockney accent, foreshadowing the eventual revelation that Bob is a fraud and a liar","Back to the Future - Part 3: Marty still has the lock on his gun during the duel with Buford Tannen","Forrest Gump’s mother is wearing white feather earrings at the school meeting.","In Bruges features a long, unbroken tracking shot of Brendan Gleason moving around his hotel room while talking on the phone with Ralph Fiennes. The TV in his room is showing the opening scene from the Orson Welles movie Touch of Evil, famous for its long, unbroken tracking shot.","Top Gun (1986) just noticed this: \"insure\"","In Deadpool 2, Deadpool asks Cable about the future \"what sharknado are we on?\". In The Last Sharknado, they go to the year 20,013 and ask \"what Deadpool movie are we on?\"","In Kill Bill Vol.1, Hattori Hanzo initially speaks the Okinawan dialect, but switches to the typical Japanese dialect once his name is dropped by the Bride.","In Deadpool 2, as Wade enters the prison, a Suicide Squad-esque Joker is seen doing a Heath Ledger Joker clap","In The Flintstones (1994), Fred gets a job as an executive at the quarry. The statue out front is the Picasso in Daley Plaza, Chicago!","In Ant-Man (2015), the address on Scott Lang's \"halfway house\" (420) is literally half of his family's house (840).","In Moonrise Kingdom, Sam and Suzy almost escape from the militia chasing them in a sailboat during a storm - this is an identical escape to Frederic and Cat's in A Farewell to Arms","In Black Panther, after Killmonger takes the throne, he begins to wear his father's ring on his right hand rather than on the necklace.","In The Core in the scene where the pigeons are going nuts and running into things, one of the pigeons is actually a fish.","In The Dark Knight, we briefly see a Gotham city bus with a “GTA” emblem. It’s a nice wink to the city of Chicago, where the movie was filmed, and their actual Chicago Transit Authority (CTA) bus system (pictured below).","In Bill and Ted's Excellent Adventure (1989), Sigmund Freud holds a (suggestive) corndog while introducing himself to girls in the mall.","In Scooby-Doo 2: Monsters Unleashed (2004) Shaggy drinks a chemical that makes him very buff and throws another chemical in a perfect spiral similar to how a stereotypical 'Jock' would throw a football.","In the first scene of \"The Dark Knight\", the safe cracker has shoes on his hands because the safe is electrified.","In Iron Man, while making test flight modifications, Jarvis recommends strengthening the exoskeleton in case Tony planned on visiting other planets.","In Zoolander, Mugatu wears a trash bag as a scarf and bow tie.","In coco(2017) : Ernesto de la Cruz's petal doesn't light up however Mamà Imelda petal light up as she is Miguel family and de la Cruz's isn't","Cull Obsidian's hand that he loses in the beginning of Infinity War is replaced with a metal claw when he returns in the final battle","In Sherlock Holmes (2009) the costume designer is credited to the only scene where Holmes is naked.","In Spaceballs, the main theme for \"Spaceballs One\", which looks like a shark, is a play on the much more famous Jaws theme.","In Avengers : Infinity war , there’s a foreshadow to the end of the movie when T’challa says “ Thanos will have nothing but dust and blood” Proxima replies by “We have blood to spare” this means that the dust will be spared by the heroes","\"The Mouse \" makes an appearance in Pirates of the Caribbean :At world's end","In Spiderman: Homecoming, whenever Peter uses his suit's X-ray mode, his eyes glow red","In Captain America: Civil War, Peter Parker reveals to Steve Rodgers that Stark told him to go for his legs. This is the essentially the first thing Stark does in the films climax.","In Alien (1979), android Ash creepily refers to the xenomorph as \"Kane's son\", named after the crew member Kane from which the chest-burster erupted","Twilight 2008 - book covered mirrored when catching apple","Take shelter ending","In Kill Bill Vol. 2 Budd purposely plays 'A Satisfied Mind' by Johnny Cash because he already knows B is there to kill him.","In Kill Bill Vol. 1 Beatrix tells all the survivors of her battle to leave with their lives but to leave their limbs because they belong to her. In Kill Bill Vol. 2 Beatrix's master, Pai Mei defeats Beatrix by grabbing her arm and declaring it his.","[SPOILER] In 'Hereditary' when the shock cut transitions from dusk to night, if you look closely you can see the house is completely surrounded.","Bowie in Watchmen","In Batman Begins, one of Carmine Falcone’s thugs on trial actually turns out to be Victor Zsasz, a serial killer known for putting notches in his skin for each victim he kills. You can even see the tally marks on his neck","In Captain America: Winter Soldier you can see hydra targeting Tony at Stark tower.","In Batman: The Killing Joke, when bruce wayne pulls up pictures of the joker there is one paying homage to heath ledgers joker in The dark knight.","In drugstore cowboy,tom the priest is played by william s. Burroughs,famous writer and heroin addict.","In Alien, the ship's name \"Nostromo\", is Italian for Shipmate. The Ship's AI is a crew member.","In Gravity (2013, starring George Clooney) one astronaut asks another \"what's your status?\" and the other answers \"nearly there\". An identical exchange occurs in Ocean's Eleven (2001, starring George Clooney).","In Deadpool 2. A truck's American License plate closely resembles Canadian (B.C.) plates. A nod to the film's shooting location and Reynold's birthplace.","Bad News Bears (1976): Tanner and Jimmy are flipping the bird in the team photo","In Space Jam, Marvin The Martian plays the referee because he is both a tune and an alien, meaning he’s neutral","In the movie Carrie, Brian De Palma pays tribute to Alfred Hitchcock. High school was named after Psycho's Norman Bates.","The 2012 film Dark Shadows digitally removed every instance of a reflection or blinking for Johnny Depps portrayal of a Vampire.","In the original X-Men movie, Wolverine orders 'A Beer' from the bar. He's given a \"Molson Export\" which (1990's) Canadians often referred to as \"Molson Ex\" or just \"X\".","In Imperium, after his undercover operation Nate has a bandaged arm from the removal of his white supremacy tattoo.","In Saving Private Ryan graffiti on the wall of a ruined French village reads 'Pétain est un traître' (Pétain is a traitor). Philippe Pétain served as head of Vichy France and was seen as a Nazi collaborator.","In The Hunger Games: Mockingjay part 1, when Mellark is forced to speak against the revolution, he literally has a blade to his throat.","In Spongebob’s Atlantis Squarepantis, LRH has two different colored eyes, just like his voice actor David Bowie","The scene in TED where he wishes for his bear to be real was the actual sky outside of boston on christmas eve of 1985. Courtesy of Neil deGrasse tyson","In the movie Bolt (2008), Penny and Bolt take the same route to go play in the yard every day. • r/DesirePath","In Twilight Zone: The Movie (1983) during \"It's a Good Life\" you can see several cars with dust on them parked out front of the house. These belong to the fake family who are now trapped in the house.","In Scary Movie during the scene where Gale is trying to get an interview with Sidney, you can see the name of the killer written on the wall.","In The Big Lebowski, The Dude thinks a new Corvette costs a million dollars indicating how out of touch he is with modern times and basic finance.","In The Exorcist (1973) when we first see the director of the movie being shot within the movie, he's being pestered by a producer about a scene being cut. That part is a cameo by Exorcist writer/producer William Peter Blatty, who famously butted heads with the director over cutting various scenes.","In Shark Tale, when Lenny throws up the license plate, it’s the same one that was found in the body of the first shark caught in Jaws.","In 'Death Proof', Lanna Frank Lives.","In Black Panther, when T’Challa strikes the new Panther Habit suit to test its kinetic energy storage, some glowing Wakandan text appears on the torso. If you translate one chunk of this text, it actually says, “I Love You Mom.”","In Shawn of the Dead, when Simon Pegg went to the shop again, the music on the radio interrupted by the announcement in Hindi which translates to - “This is a warning! Dead people are attacking the live ones and they’re doing this to....”","In Deadpool 2, “Black Tom” is seen in the “icebox” when wade arrives. The irony being that, in the comics, Black Tom’s powers only worked when he had wood as a medium for them.","In Annihilation, the moss in Area X is subtly breathing, much like the breathing walls of the tower in the book version.","The Grand Master is in the credits of GotG2","In the movie 'All the boys I've loved before' when Lara's love interest shakes hands with her dad he's wearing a jacket which is missing in the next closeup shot.","In Deadpool 2, the sign behind Deadpool when he is on the rooftop literally says \"pool of dead\"","‪In Shrek 2, the Fairy Godmother enters most of her scenes in bubbles. In the final showdown of Shrek the Third, Prince Charming (her son) enters the stage with bubbles.‬","In Avatar, the biometric scanner for Jake's pod only scans him from head to waist because he's paraplegic","In the Big Lebowski (1998), Walter Sobchak’s dog tag necklace has a wedding band. This is another display of how he is clinging on to his ex-wife other than dog sitting the Pomeranian and staying faithful to Judaism.","In 'Shaun of the Dead' you can see Michael Smiley return as his character from 'Spaced' - Tyres O'Flaherty.","Porco Rosso has a pretty sweet Easter egg. When Porco takes his plane to the engineers to be repaired the name on the engine is Ghibli, the studio who produced it.","At the end of The Wolf of Wall street, when Jordan Belfort (Leo DiCaprio) is giving a motivational seminar. The man who introduces him is the real life Jordan Belfort","In Jack Reacher Robert Duvall is not wearing ear plugs at the shooting range, but is using shells instead","In \"Baby Driver\", when Darling says to Bats \"...when [Buddy] sees red, you'll see nothing but black\", Buddy is looking at Bats who is wearing red and Bats is looking at Buddy who is wearing black.","The Joker talks Dent into becoming Harvey Two-Face (and blows up the hospital) while wearing a Dent for DA sticker.","In Casablanca, Captain Renault throws his drink away because it come from the Vichy Region of france, which was controlled by the Nazis. He is literally throwing away his trust of the Regime in disgust to start a new life.","The clerk in the Cook County Assessor's Office when Jake and Elwood complete their Mission From God for The Blue Brothers [1980]? Stephen Spielberg","In Titan A.E., during the escape pod scene, Korso tells Cale to exhale before kicking out the windshield. This is because having air in your lungs while in a void will cause fatal internal damage.","Toward the end of Shrek, the dragon knocks out the last pane of glass stained window. And all that remains is the dragon at the bottom.","In the movie \"Spotlight\" you can see a Penn State game on the TV in this bar scene and Joe Paterno appears shortly after a victem shares their story","In Iron Man, the Stark Industries logo bears a strong resemblance to the Lockheed Martin logo, a real life arms manufacturer that's caught flak for it's weapons being used overseas recently.","Sicario: Day of the Soldado... The first time we see Josh Brolin his legs are shaved. Special Forces operatives often go undercover overseas and have to grow out body hair (hair,beard,legs,etc.) in order to blend in. Upon returning home many will shave it all off, as depicted below","In Ferris Buellers Day Off John Hughes told Ben Stein, who had a degree in Economics, to present an actual Economics lecture in his scenes. Hence nothing Stein says (aside from the roll call) is scripted.","In Deadpool 2, one of the rednecks talking about toilet paper is actually Matt Damon in four hours worth of prosthetic makeup.","In the opening scene of Gone Girl (2014) Ben Affleck is shown with a Mastermind board game. Foreshadowing the game-like scenario he is about to encounter.","In The Imitation Game you can see Alan Turing padlocks his favorite cup to the radiator something he did in real life.","In Never Been Kissed, once Josie becomes popular, Gibby, Kirsten, and Kristen wear pilot wing pins too","Cable's daughter's teddy bear has an orange eye just like him in Deadpool 2","At the beginning of Liar Liar, a recent client of Fletcher's tries to give Fletcher his jacket back. Fletcher responds \"Nah, I'm sure you'll be needing it again.\" Later, when Greta bails Fletcher out of jail, you can see the same guy is his cell-mate.","In Karate Kid before the dance, Danielsan is lamenting not having a costume while in Miyagi's workshop. The whole time his costume is hanging right behind him.","found stanlee cameo in deadpool2 movieFilm","All of The Wolf Of Wall Street's movie posters are gold and black, the colors of Anarcho-Capitalism.","Clues to the ending/twist in The Prestige","In Back to the Future, Doc explains that he didn't have time to finish the model, even though it looks incredibly detailed. Interestingly, when you look closer, some of it is made out of salt shakers and bottles.","In Hereditary we see P's desktop with Bridget's FB page open before the party, he reaches for the pot and there is a \"windows warning alert\" flashing for a moment. Then he goes to the WINDOWS and blows his smoke out. Where we see someone/thing breathing in the bushes but he dosnt seem to see it.","At the convention in The Witches, only the first few rows of witches are women in bald caps, and the rest are bald men.","In \"5cm/s\", the NTT Building didn't appear in the 1st part set in 1980, but did appear in the 3rd part set in 2008, as the skyscraper was only built in 2000.","The Revenant (2015) Hugh Glass carves into ice \"Fitzgerald killed my son\" the next morning the sun is shown to have melted snow and likely the message meaning that if Glass doesn't survive neither will the knowledge of his sons murder.","In The Lego Batman Movie, when Batman is talking to his parents portrait, the street behind them is “Crime Alley”","Rain Man ends with a video bounce of Cruise (last seconds, after the background person in white disappears).","Deadpool 2, in His Continued Harassment of Logan, Music from Logan is Played at an Opportune Time","Taxi Driver (1976) Travis takes Betsy to lunch when they talk about signs with goofy puns (Organeziezd, Thimk). Later, when Travis asks her on a second date and Betsy pauses to think, a bus pulls past them with the phrase \"Olive It Up\", a sign of encouragement for her to take a chance with Travis.","In “Harry Potter and the Chamber of Secrets” Lockhart still ended up making the front page of the newspapers after Ron and Harry were seen","In \"Tropic Thunder\" (2008) Danny Mcbride's character also got an Oscar in the end. Probably for Best Special Effects","In \"Your Name\" anime, the scene running from the boy's location through twin towers to the girl's lake is geographically authentic","In \"Zootopia\" (2016), during the chase scene in Little Rodentia, they pass by a billboard for \"Thigmo Taxis\". In Biology, thigmotaxis is the movement towards or away from physical stimulus, and has been extensively studied in rodents.","In \"Spider-Man: Homecoming,\" There's a scene in the gym where Liz admits she has a crush on Spider-Man. Seymour makes a point about how she doesn't even know what he looks like by saying, \"Like, what if he's seriously burned?\" That's a subtle jab at another Marvel character, Deadpool.","In Anchorman 2: The Legend Continues when Ron Burgundy and Jack Lime make a bet to see who gets higher ratings Jack Lime says “It’s on like Pong”. Donkey Kong had not been invented til the next year which would’ve been 1981 while Pong was there since the 70s.","[In the Loop, 2009] Judy assumes Toby's name is Dan because minister's new advisors 'are often called \"Dan\"'. During end credits, new replacement advisor's name is Dan, much to her amusement","[12 Angry Men] Despite the bothersome heat that the juror complain about throughout the movie, Juror #4 claims that he doesn't sweat. Later when being \"interrogated\" by another juror, a distinct bead of sweat is seen rolling down his forehead.","In The Departed's (2006) infamous phone scene, Sullivan is sitting in front of a police report that suggests Costigan's uncle was a rat.","In \"The Blues Brothers\" (1980), the band played two songs at Bob's Country Bunker: \"Stand by Your Man\" and \"Rawhide.\" However, a third song was recorded and filmed: Johnny Horton's \"Sink the Bismarck.\"","In Lord of the Rings: The Two Towers, a majority of the Riders of Rohan were women with fake beards in order to pass as men on the horses.","In Coraline, her neighbors (Spink, Forcible and Mr. Bobinsky) repeatedly call her “Caroline” despite being corrected. In the Other Mother’s world, Mr. Bobinsky correctly calls her Coraline because people getting her name wrong is something that bothers her, thus would be fixed in her “dream” life","In \"Upgrade,\" when Stem gives Grey a bunch of code to write down, the last numbers are \"Two Three Dot Nine Seven Six.\" That's the standard frame rate for digital cinema cameras.","In Team Darryl short (Thor: Ragnarok), a sign with 1232/2 on it can be seen in Darryl's apartment. 1232/2 = 616, referring to the primary Universe, Earth-616 in the Marvel Comics.","In Toy Story 2 (1999), after Buzz tries to convince Woody to return home, the conclusion to the Woody's Roundup TV show - where Woody and Bullseye successfully jump the Grand Canyon - is audible. This proves that Stinky Pete lied to Jessie and Woody about the cliffhanger ending so that they'd stay.","In Arrival, when Louise and Ian initially meet in the helicopter Ian quotes one of her writings including that language is the “first weapon drawn in a conflict”. Later in the film the “weapon” that the heptopods gift to humans turns out to be language itself","During an early scene of Hocus Pocus, A painting of Max and Dani Denisons house can be seen in the background.","in Deadpool 2 (2018), Cable's time machine is a Carl F. Bucherer watch. Other Carl F Bucherer watches have appeared in other David Letich films such as John Wick 2 and Atomic Blonde.","The same marble ashtray can be seen In every chapter of CREEPSHOW","In \"Back to the Future\" Marty has a guitar pick mixed in with his coffee payment","constantine (2005) FIXED sorry","The beginning monologue of Cloudy with a Chance of Meatballs states that Flint “stared down defeat”, he then takes down his invention at the end with Spray on Shoes, by starring down (at) da feat.","In Back to the Future, Buford Tannen wants to dual in the morning because he “likes to do his killing before breakfast”. But maybe it’s really because it means his opponent will have the sun in his eyes, giving Buford the unfair advantage.","Dr Zhivago (1966) most of the winter scenes were shot in Spain during summer. Even the famous Ice Palace is not actually ice, but made out of wax.","In Deadpool 2 Cable sees the X-Jet landing at the Essex House as the point of the past he wants to travel to. Later we see the same shot of that happening in current time.","Date of issue of this passport is 3rd May, 2016; Exactly 3 days before the release of Civil War. In the movie, Tony asked Peter if he had a passport and he didn't had one, so Tony must have gotten him a passport through his contacts thus explaining the date of issue.","(HARRY POTTER &amp; THE SORCERER’S STONE) as soon as Harry arrives at platform 9-3/4 you can see a security camera in the upper middle left hand side of the shot.","In “The Big Lebowski” the first time we see The Jesus, a Spanish cover of Hotel California is playing over the PA at the bowling alley. Later in the movie, The Dude is kicked out of a cab for telling the cabbie that he “hate(s) the fucking Eagles, man.”","The Town (2010): When Ben Affleck’s character told the money room worker, “don’t worry old-timer, no one’s going to prison”, he was right. All of the robbers were either killed or escaped.","Romeo + Juliet 1996 - one of the Montague boys is shot by Tybalt Capulet at a gas station &amp; it looks like he killed him. Later, the same Montague boy is shown ok with a bandaged arm.","In Spider-Man: Homecoming, when Ned is asking Peter his questions about being Spider-Man, one of the teachers in the background is teaching about the Sokovia Accords.","In Coco, Miguel's guitar has a golden tooth, just like the skeleton that helps him in the dead's world.","In Raiders of the Lost Ark, when the basket is placed into the back of the truck, we see a man run off screen to the right. If you look closely when Indy is being accosted by beggars, you can see a truck tire come out from behind the first truck. That is the vehicle Marion was in all along.","In The Truman Show (1998) Truman’s escape boat, the Santa Maria, is named after Columbus’s boat he used to find the new world","In the ending of Monsters University the Abominable Snowman tells Mike and Sully how tampering with the mail is a crime, and it is punishable by banishment. We see later in the sequel that he is banished to the Himalayas, probably as a result with tampering with the mail.","In Final Destination 3 the truck that blocks Kevin and Wendy into the drive through is the drink responsibly truck from the second","Spider-Man Homecoming interesting detail","In Transformers: The Last Knight, when Burton is introducing the Witwiccans, they briefly show Sam too","In The Lion King, during \"Be Prepared,\" the hyenas' marching past Scar on the elevated rock was inspired by footage of Nazis marching by Adolf Hitler on a podium.","In The World's End (2013), pub number 10 is called The King's Head and features a portrait closely resembling the main character, Gary King","In Deadpool 2, Dopinder talks about “Interview with the Vampire” and compares themselves to Tom Cruise and Kirsten Dunst. Later on, another actor shows up who was also in “Interview with the Vampire”","In The Truman Show, Truman's ring is oversized with a black gem. It's a camera. (repost with deleted scene proof)","In The Talented Mr. Ripley (1999), Tom denies a Half-truth, a detail showing how his personality works","In The Descent, shortly after they go underground, a cave monster is briefly visible before vanishing. This is the first hint that our explorers aren’t alone…","In 10 Things I Hate About You, the first person quickly rushing through the door at Bogey Lowenstein’s party is in fact Nigel with the brie","In Jay and Silent Bob Strike Back, Justice has has the Scales Of Justice tattooed on her ankle","Scream 4 came out in 2011, so most characters, as usual, have the latest iPhones. But in the opening scene's movie-within-a-movie-within-a-movie, Stab 6, Trudy has a Sidekick 2. That means Stab 6 probably came out in 2008.","In Monsters Inc (2001) when Mike Wazowski sings “She’s Out of Our Hair” it parodies Michael Jackson’s “She’s Out of My Life” music video, barstool and all","Easter egg in the credits of Guardians of the Galaxy","In Upgrade (2018) you can see Jigsaw in graffiti on the computer hacker's lair. Upgrade is directed by Saw writer Leigh Whannell","During the Sorting Hat scene in Harry Potter and the Philosopher's Stone, Quirrel can be seen facing backwards behind Snape. This gives Voldemort a clear view of the ceremony. The next cut is to Harry's scar hurting, due to Harry looking directly into Voldemort's soul.","In \"Zootopia,\" DMV doesn't stand for \"Department of Motor Vehicles,\" but instead \"Department of Mammal Vehicles.\"","In Miami Vice (2006), Tubbs quotes lyrics from the Eagle's song 'Take it to the limit'. A reference to Eagle's founding member Glen Frey's involvement in the 80's series as an actor and contributor to the show's soundtrack.","This Wolverine Easter egg in the opening credits border of The Greatest Showman","In Megamind (2010) when the death ray explodes the observatory, the blast is powerful to expose Minion's skeleton","In Once Upon a Time in America, when Noodle is being taken to prison he waves to his friends. Everybody waves back, except Cockeye (he's not even facing the right direction)","In The Nice Guys (2016), Sid Shattuck ( The porno producer) , is played by Robert Downey Jr. in an uncredited cameo.","In The King of Comedy (1982) restaurant scene, Rita is initially uncomfortable with Rupert but starts smiling when a man in the background begins mimicking Rupert's movements. The same actor played Morrie in Scorsese's GoodFellas 8 years later","In Billy Madison, when Billy is training for the academic decathlon, the phrase that his French teacher says quickly in French translates roughly to “you will never learn French, you are an imbecile, it is not worth the trouble of continuing this conversation.”","Rampage Arcade makes a cameo in Rampage Movie","[Spider-Man 3] You can see Gwens photo on Eddies desk, when Peter confronts him.","In Mad Max: Fury Road, when Max has the vision that will save his life for the first time, a single frame of his future attacker flashes by.","One of the very first scenes in Dark City features a goldfish, goldfishes supposedly have very short memory, foreshadowing the movie's theme of memory loss","In Upgrade, you can see director Leigh Whannell's good friend and frequent collaborator James Wan's name on the apartment directory.","In the movie Polar Express, a model P-38 (a fighter/escort/interceptor used in WWII) is shown. It is revealed that the movie takes place mid to late 50s, around a decade after WWII ended.","In Despicable Me 3 (2017), Steve Carell's character Gru is seen flying past a room full of cartoon versions of The Office characters.","In “Enemy” (2013), Jake Gyllenhaal’s character seeks to find his doppelgänger through his acting agency profile. One of the skills listed is “horseback riding”, which references his role opposite to Heath Ledger in “Brokeback Mountain”.","The Blair Witch Project's wooden stick figures were meant to foreshadow Mike's crucifixion, an alternate ending.","In \"The Wizard of Oz\" (1939), the Wicked Witch of the West tells her flying monkeys, \"I've sent a little insect on ahead to take the fight out of them.\" This refers to a deleted scene featuring the song, \"The Jitterbug.\"","In the infamous Swordfish (2001) topless scene, Halle Berry is reading Stephen Hawking's A Brief History of Time","In Swingers (1996), there's a Reservoir Dogs poster in Sue's apartment. Later in the film when the boys discuss great scenes in gangster films, Sue is the one mentioning (and defending) Reservoir Dogs' opening shot.","In John Wick, you can see that the drivetrain of his new Challenger was removed prior to being wrecked.","The Dark Knight: When the Joker tells his first \"Wanna know how I got these scars\" story to Gambol, Ledger is constantly looking up and to the left (as if he was lying/making it up). When he tells the second to Rachel, he doesn't break eye contact.","Two-Gun Gussie (1918) Possibly inspiration for John Wick poster","In The Lost World: Jurassic Park, right before the \"unlucky bastard\" gets eaten you can see the cameraman getting closer to get the shot on the reflection of the right door.","In Black Panther, Angela Bassett knows Shuri did something offensive behind her because of T'Challa's horrified expression.","During this scene in Mission Impossible: Ghost Protocol, Ethan calls for an evac and uses the rendezvous point \"Alpha 113.\" A113 is a familiar easter egg, referencing the classroom where many famous graphic designers learned their trade. Pixar animators are known to hide it in many of their works.","In Sully (2016), directed by Clint Eastwood, there is an ad for Gran Torino - starring and directed by Eastwood - which was in theaters when the film is set (January 2009)","In “The Prestige” (2006), on the sign on the left, one of the other magicians listed is Harry Dresden, main character of “The Dresden Files”, a modern day fantasy novel series.","In the Army Now (1994) - Brendan Fraser has a cameo as a soldier named Link. A reference to his caveman character from Encino Man in which he stared with Paul Shore two years prior.","The man cleaning the tables of the Leaky Cauldron performed practical effects magic to vanish this bottle. (Harry Potter -prisoner of Azkaban)","In Harry Potter and The Philosopher's Stone, the engraving on the Mirror of Erised- \"Erised stra ehru oyt ube cafru oyt on wohsi\" if rearranged backwards, reads- \"I show not your face but your heart's desire.\"","In the beginning of teahouse act in Hard Boiled, Tequila's partner Benny remarks that he will live and die in Hong Kong, foreshadowing his death minutes later","In Harry Potter and the Philosopher’s Stone, Neville Longbottom receives a Remembrall and says, “the only problem is, I can’t remember what I’ve forgotten.” He is the only one who forgot his cloak in this moment.","After Deadpool complains about how shiny colossus is. They CGI'd the sun's reflection onto the wall behind him. in Deadpool 2.","Age of Ultron - Tony quips over Clint’s manhood prior to both attempting to lift Thor’s hammer...”Clint you had a tough week, we won’t hold it against you if you can’t get it up!”...”Never one to shrink from an honest challenge!”","In Scott Pilgrim vs. the World (2010), Steven Stills scolds Scott on playing one note the entire song, this is true, when you compare music tracks between the scene and soundtrack, the bass hits the same note at the end of the prior scene, while the bass plays the melody in the soundtrack","Chad stumbles in which way to go at the end of high school musical 3. You'd think that by senior year they know their way around school.","In Cowboy Bebop: The Movie (2001), a reoccurring character notes how he is reminded of the sinking on the German Battleship Bismark that he took part in (the sinking took place over 100 years prior), in the scene they are flying a Fairey Swordfish, the torpedo plane that sunk the Bismark","In Age of Ultron, Cap throws his shield into an Ultron Sentry's shoulder and throws it off Sokovia. This same Sentry, with a missing left forearm and shoulder gash, survives the rest of the battle and is killed by Vision at the end of the movie.","In the movie \"Contact (1997)\" The beach scene at the end is a render of the drawing Ellie made as a child","When Colossus says \"You always make it hard\", Deadpool looks at you, the viewer, for a split second in Deadpool 2","In the opening fight of Guardians of the Galaxy Vol. 2, Groot freezes and Drax appears to not see him. Later, in Avengers: Infinity War, he tries to use the same technique.","In Oceans 11 (Brad Pitt's) character Rusty is always eating on the go. In Oceans 12 Rusty tells the gang he invested the heist money in Hotels. Being always on the go and staying at various hotels, it's the only legitimate business Rusty knows of.","In The Iron Giant, when Hogarth’s mother tells the army to call off their attack because her son is with The Giant, everyone looks worried except for Mansley, who wants The Giant destroyed at all costs.","Mad Money (released Jan 18, 2008) references Stark Industries in a TV cameo of CNBC's Mad Money show. The First MCU movie, Iron Man, did not release until May 02, 2008. (spotted by my keen-eyed wife)","Hidden mickey ears in the first Guardians of the Galaxy?","At the conclusion of “The Devil Wears Prada” Andy frees herself of the self-imposed prison of Miranda’s life. She later spots Miranda who looks like a prisoner of her lifestyle while in a limo.","Collateral (2004), directed by Michael Mann -- throughout the movie Vincent (Cruise) sits diagonal to Max (Foxx). But during a sequence where Felix and the FBI are led to believe that Max is Vincent, we can see Vincent sits directly [or hides] behind Max.","In Hercules, Phil mocks Herc for claiming to be the \"only kid of Zeus\", as the movie suggests. In the myths, Zeus was known as a womanizer and had many children by many mothers.","The Blues Brothers: Elwood chooses the \"wrong glass sir\", but his choice means their glasses match their stature. Tall and thin / shorter and rounder.","In Goodfellas when Henry beats up Bruce, the guy that assaulted Henry's girlfriend, you can see Bruce apply blood to his face after the first couple strikes. Later on in the scene when he rolls over you can see the blood stains in his hand","The initials of Peter Pan’s children from Hook (Jack and Maggie) are a nod to the author of Peter Pan, J. M. Barrie","The female protagonist's ship from Star Wars Resistance is a Porsche 917 Gulf with wings.","The romantic bubble scene in Benders Big Score is a reference to the 70s sci-fi film Fantastic Planet.","In Paddington, Mr. Curry suggests Honeypot as a codename for Millicent Clyde. This serves as both a Winnie the Pooh joke and a reference to a term for women who use sex to get what they want.","In \"Song of the Sea\", when the kids are getting on the bus, a girl resembling Aisling from \"The Secret of Kells\" can be seen sitting on the left.","In Infinity War, on Vormir there are other blood stains on the ground, indicating others have tried and failed to aquire the Soul Stone.","In Cast Away (2000) during the holiday dinner scene, the camera pans over a bookshelf with awards showing that Chuck is highly proficient in sailing and other outdoor activities","Hot Fuzz (2007) spoiler and slight nsfw","Thor’s Ultron Vision foreshadows the Dust of Infinty War","Deadpool 2 hiring heroes scene","In Harry Potter and The Prisoner of Azkaban, the wizard seen stirring his tea is Ian Brown, lead singer of The Stone Roses.","Austin Powers: soldier who returns Austin's penis pump in International Man of Mystery is the same who collects \"his\" urine in Goldmember","Cars (2006): during Lightning McQueen's trial there's a patriotic portrait of a factory producing Sarge's model... Are they alluding to a past war?","In Kill Bill Vol. 2 Beatrix Kiddo is buried at the grave of Paula Schultz... who in the Tarantino universe is the wife of Dr. King Schultz (Django Unchained)","In Men in Black (1997), J takes a sip of the lemonade that Beatrice serves him while she tells them the story of her husband's abduction. He spits it out because she'd already used all her sugar in the water she served the alien at the beginning of the movie, making the lemonade bitter.","In The World's End (2013), Andy remarks that perhaps their phones are getting no reception due to the network. It is later revealed that it was, in fact, the Network that was behind it.","In Avengers: Infinity War, Steve grew a beard, Natasha dyed and cut her hair, Wanda's accent disappeared, and Vision disguised himself as a human, in order to avoid recognition as they were now considered fugitives for breaking out of prison in Captain America: Civil War.","In Murder on the Orient Express (2017), when Detective Poirot addresses all the passengers, they are arranged as the Last Supper.","In the Michael Jackson short film/ music video Bad, director Martin Scorsese has a cameo in a police poster: \"Wanted For Sacrilege\".","The lawyer in Flight hands the money to the other guy first so he can't be held legally responsible for paying for drugs","Deadpool 2: Irony when Deadpool hangs from his parachute strings hung over a billboard sign that says “Puppet Show” because Deadpool’s parachute strings make him look like a puppet.","In Dumb and Dumber if Lloyd would have married Mary Swanson her name would have been Mary Christmas.","At the start of the podracing scene in The Phantom Menice, Warwick Davis can be seen. He played a Ewok in Return of the Jedi.","The mirror scene from Spider-Man 3, is a throwback to \"Spider-Man: The Animated Series\"","Captain Whitaker sprays his mouth before boarding the plane to hide the smell of alcohol on his breath from his co-workers in Flight","In Deadpool 2 Wade’s vision of him and Vanessa uses the unplugged version of \"Take On Me\" and mirrors the visuals of the music video. The regular version of the song is barely audible on the radio in their apartment during their anniversary, which must have influenced his vision","In Terminator 2, when the Terminators fight there is no dialog track. Typically in movie sound, you have to cover combat with \"fight vocals\" but since the Terminators don't exert themselves they stay completely silent","In Django Unchained, if you listen carefully to his voice, the guy that is reasoning the raid about dropping the bags is played by Quentin Tarantino.","In “The Belko Experiment” the corn doll that Mike buys at the beginning of the movie is supposed to be good luck, and in the end, Mike is the only one that survives.","In Deer Hunter 1978, Christopher Walken spits on De Niro exactly the same way as he does to Dennis Hopper after he shoots him in the head in True Romance 1993.","Glimpse of the old Avengers tower in infinity war","Spiderman Homecoming, broken laptop","Infinity War: The color of the lamps next to Wanda and Vision in their first scene.","In Fast Times at Ridgemont High, Mr. Hand passes out the class schedule of quizzes. After the paper is passed out, the students put the page up to their noses and deeply inhale. This was a popular school ritual of the 60s,70s and early '80s because the transfer agent for the ink got you high.","Simon Pegg’s character in Hot Fuzz, Nicholas Angel, has the police number 777, known as the number of God. Simon Skinner, played by Timothy Dalton, is the only person to call him by his number. He also played James Bond, code named 007.","In “Captain America: Civil War”, Scott Lang plays the drums while imprisoned","in the movie Storks, the pidgeon's girlfriend picture has a google watermark on it. lmao","In \"The Truman show\" Truman is called Truman because he is the only \"true\" man and everyone else is just an actor","In The Girl with the Dragon Tattoo (2011) the cat, presumably killed by Martin Vanger, appears to be arranged in the shape of a swastika.","In Idiocracy, Joe’s room has money used as wallpaper. This kind of hyperinflation also occurred in post WW1 Germany, weakening the economy and paving the way for the rise of Hitler.","In The Watchmen (2009) opening credits, all the super heroes are arranged as the last supper","In Cats &amp; Dogs: The Revenge of Kitty Galore (2010) the dogs put their cars in “Stay” gear.","In Watchmen (2009), during Dr. Manhattan's monologue, he gives a non-chronological telling of events.","Yukio and Negasonic Teenage Warhead have matching mugs in Deadpool 2","In Cat in the Hat (2003), the shipping company is called “the incredible bulk” and the colour of the box is green.","On Harry Potter and the Philosopher's Stone, Oliver Wood talks about his first time playing Quidditch, and how he got hit by a bludger within two minutes of the match, making him unable to play. Two minutes after Harry's first game starts, Oliver is hit by a bludger and gets knocked out.","[Infinity War] Steve Roger's entrance is a callback to the cover of Captain America #336 where he reemerges sporting a beard after being in hiding for months","Trip McNeely's fraternity in Can't Hardly Wait is Delta Iota Kappa or DIK","The doll given to the orphan in the final scene of Annabelle:Creation resembles the actual doll the story was based on.","In Avengers: Infinity War, you can see Gamora's blood around her head is actually green.","In Austin Powers: The Spy Who Shagged Me, during the moon base scene, Dr. Evil's spacesuit has three knobs on the front labeled: H2O, O2, and P2 for Water, Oxygen and... Peepee.","In Superman the Movie: As Clark, he is slouched over , as S-Man he is stands taller","[Deadpool 2] Posters for \"M-Day\" can be seen in the orphanage. M-Day is an event in the comics that depowered 91% of all mutants.","In The Matrix(1999), Morpheus nods at the blind man in the lobby of the Oracle and he nods back.","In Annihilation, Lena mentions “duplicates” and “echos,” then stares at a tattoo on her left forearm. Later in the movie, we briefly see that the tattoo actually belongs to Anya.","In the Alien series, the names of each new android introduced in the films start with the first four letters of the alphabet (Ash, Bishop, Call, and David)","[Spider-Man 3] He closed the door, because the music/sounds from outside were 'attacking' the symbiote.","Avengers Infinity War Pepper is wearing the engagement ring from the end Spider-Man Homecoming.","In THE FUGITIVE, there is a scene where Richards Kimble poses as a janitor at Cook County Hospital and there is an orderly doing his rounds on roller skates in the background.","In Batman v Superman, Barry is holding a bottle of milk in the security video. He leaves the bottle behind as he takes out the thug, and catches the bottle before it drops a fraction of an inch. Watching the scene in slo-mo shows that the bottle starts to fall.","In Waltz with Bashir, the main character starts to have a PTSD flashback, but we can notice it happening first before him through the window reflection","A couple of frames before Buddy shoots Baby's iPod in Baby Driver, you can see the \"Now Playing\" screen, complete with the song that was playing during the scene.","In the Infinity War trailer, the Infinity Gauntlet only contains the stones that appear elsewhere in the trailer.","Aliens reference in Pacific Rim: Uprising","Brad Pitt agreed to play the Cameo of \"The Vanisher\" in Deadpool 2 because Ryan Reynolds personally reached out to him after he heard his children loved the first movie","Fury Road. Mad Max was indirectly responsible for death of Splendid Angharad. (explanation in comments)","In Infinity War the famous Robert Redford shot from Jeremiah Johnson is copied using Steve Rogers.","In Harry Potter and the Philosopher’s (Sorcerer’s) Stone, Aunt Petunia is visible in the background of this scene dyeing Dudley’s old clothes grey for Harry’s uniform. This is only ever mentioned in the book.","In the opening scene of Snatch, while Franky “Four Fingers” is going through security before the diamond heist, you can tell he only has four fingers by the ring finger on his glove sticking out while the rest of his fingers are closed in a fist.","In Return of the Jedi as Chewbacca and the Ewoks are swinging on a vine onto the AT-ST you can hear the Tarzan yell.","Further to a recent post about The Truman Show, as he steps outside the street cleaner picks up litter, except there is no litter and he puts nothing in the bag.","Justice League: news headline shows dead heroes Superman, David Bowie and Prince","In Talladega Nights monitor always displays 69","In Saving Mr Banks (2013) you can see the seven mini Oscar awards the Walt Disney Company had won for Snow White and the Seven Dwarfs (1937)","Currently rewatching Infinity War, and when Quill tells the Guardians \"Let's put on our mean faces.\", I noticed that Mantis begins quietly growling and scrunching up her face. Never noticed this before.","In ghostbusters (1984) the Stay Puft logo can be seen on the side of the building while the ghosts are being released. Also, when Dana returns from grocery shopping, we see that she also has a bag of Stay Puft marshmallows","The Spy Who Loved Me - ever noticed the already-existing tracks in the famous ski-jump scene?","In Sin City, Nancy Callahan wears a necklace with an H on it, for John Hartigan, who rescued her from Roark Jr (twice)","(Infinity War) After stabbing Thanos, Gamora's sword doesn't have any blood stain or blood drops on it indicating its a fake reality (I posted this earlier but was removed)","In Requiem for a Dream, during Ellen Burstyn's impassioned monologue about being old, cinematographer Matthew Libatique accidentally let the camera drift off-target. When confronted about it, director Darren Aronofsky realized Libatique was crying during the take and fogged up the camera's eyepiece.","(Infinity War) Bruce Banner's background reaction to Iron Man's new suit is priceless","In Inception, the First Letters of the Character's First Names, Spell out \"Dreams Pay\"","In the movie Natural Born Killers, when Wayne Gayle (Robert Downey Jr) is signing with his producer, Julie (Terrylene) he is actually communicating with her because she is deaf, which explains why she has no actual lines in the movie.","Cloak imitates Starks reaction from Avengers IW (credit: u/SoapHero)","In \"Upgrade\" (2018), directed by Leigh Whannell, protagonist Grey goes to an apartment looking for help... Whannell is buddies with James Wan, with whom he co-wrote \"Saw(2004)\".","[Infinity War] Loki tells Thor \"the sun will shine on us again\", and later in the movie a sun shines directly on Thor while forging Stormbreaker.","In Napoleon Dynamite, Napoleon can be seen in a couple of scenes carrying the \"delicious bass\" (wrapped in tin foil) that he later tells Deb he caught for her.","The events of the Indiana Jones movies transpire over a period of 3 years.","In Blazing Saddles Frankie Laine was brought in to do the theme song. Mel Brooks didn’t tell him the movie was a parody so Laine would take a serious approach to the song.","In Dumb &amp; Dumber (1994), Lloyd (Jim Carrey) takes a wrong turn toward Lincoln, Nebraska. In Yes Man (2008), Carl (Carrey) &amp; Allison take a spontaneous trip to Lincoln, Nebraska.","Wolf of Wall Street Airplane Party. Jordan Belfort's pupils are constricted or pinpoint after waking up on the plane even as he is looking toward Donny in front of a sunlit window indicating drug use.","there is actual 'garage stuff' in the fake garage, the Official Baseketball stadium. BASEketball (1998).","The fight between Superman and Zod in Man of Steel syncs up perfectly with the opening of Batman vs Superman where we see the same events from Bruce Wayne's perspective on the ground.","[Infinity War] The Chippy in Edinburgh where Witch and Vision are staying offers to deep-fry your meal; classic Scottish.","The deranged Santa Claus who stabs Nicholas Angel in the opening montage of \"Hot Fuzz\" (an uncredited extra role) was played by Peter Jackson, who directed the \"Lord of the Rings\" and \"Hobbit\" trilogies.","In \"The Fifth Element,\" Manhattan, the Statue of Liberty, and the Brooklyn Bridge appear to tower above the landscape because the sea levels have dropped significantly, with the city expanding onto the new land","[Infinity War] Eitri was making something else along with Stormbreaker.","In It (2017), the imagery of three dots foreshadow Beverly's encounter with the deadlights: when the water is dripping on Bill's drawing of Bev, when droplets of blood fall on her, and when she sees the deadlights themselves.","During the scene in Lone Survivor where Petty Officer Patton wakes up Commander Kristensen, Eric Bana who portrays him is seen wearing Birkenstocks. The real Commander Kristensen was known to favor wearing Birkenstocks.","In Insidious, there's a doodle of the Jigsaw puppet on the blackboard with Leslie Borchard's name scribbled above. She worked in the makeup department.","In \"The Princess Bride,\" Inigo tells Westley while sword-fighting him: \"I know something you don't know ... I am not left-handed.\" But Westley has already seen him pull a sword from his left side with his right hand.","(Kingsman: The Golden Circle) Statesman Distillery is in Lexington, not Louisville","The Dark Knight - Despite not being in costume Bruce instinctively switches to his gravelly \"Batman\" voice to warn Rachael that the Joker has come for Harvey.","In Mission: Impossible – Ghost Protocol, the \"price of admission\" remains the same as in the first film in the series","In Avengers: Infinity War(2018) When Thanos fought the Hulk he did not use the Power Stone. The stone didn't light up during the fight and did not augment his strength in any way.","In Dr. Strange (2016) Wong points out that people laughed at Dr. Strange only because they worked for him. Dr. Strange goes on to use the very same insult against Tony Stark in Avengers: Infinity War (2018).","The cap Chevy Chase wears at the end of FLETCH is similar to the one worn by Harry Dean Stanton in ALIEN and bears the insignia of the ship’s name- USCSS Nostromo.","Thanos did really love Gamora a lot. Look at him signalling Gamora to stop thinking Red Skull is gonna hurt her","In Casino Royale (2006), you can see Richard Branson being frisked by security at the start of the Miami airport scene.","Deadpools hand-drawn map outlining the X-Force attack on the convoy is actually a map of Vancouver, BC, where Ryan Reynolds is from and where the movie was shot.","In Ocean's Thirteen Turk asks Saul if he would go through the same torture as the hotel critic for 10 million dollars, Saul replies that he would do it for 11 million. In the final scene of the movie they rig a gambling machine so the hotel critic who they tortured wins 11 million dollars.","At one point in the horror film \"The Mothman Prophecies,\" Richard Gere's reflection subtly goes out of sync as he talks on the phone... and when he slams the door, you can briefly glimpse a ghostly face in the mirror","In \"Titan A.E.,\" the Drej destroy Earth by spinning it so fast that centrifugal force flings it apart. You can see the city lights go out as it happens, and the planet breaks apart along tectonic fault lines","In \"The Wolf of Wall Street\" Jordan sees many more porch steps, showing how much more intense the lemon-Quaaludes were. The subsequent rolling sequence is also over many more steps than shown in the distance-shots.","In Peter Rabbit (2018) Mr. McGregors Land Rovers Key has a Rabbit foot attached. It is the same colour as Peter Rabbits father who he killed.","In Coco, there is a small statue of a cat Alebrije next to Mama Imelda’s picture that is a ‘baby’ Pepita (sorry for quality)","In The Truman Show when Truman walks through his office's revolving door but comes back out again the next shot is of a shaky camera from far away zooming in on Truman to show that the camera operators were threw off by his unexpected action","In The Time Machine (2002), The Professor's finger nails grow long when he briefly sticks his hand out of the machine","In Stanley Kubric's Eyes Wide Shut [1999], Tom Cruise's Bill Hartford buys a paper moments after hearing he avoided sleeping with a hooker with HIV: headline reads \"Lucky to be alive\".","Who is pulling the fire engine horn in Independence Day (1996)?!","In the Truman Show, Truman always greeted with \"good morning, and if I don't see ya, good afternoon, good evening, and good night.\" The Truman show was broadcasted around the world 24/7. That means whoever was watching, in no matter what time zone, they always received an appropriate greeting.","In BlacKkKlansman, Nick Turturro's character 'Walker' says he spent time at Kansas State Penitentiary. This is the same prison that is said to have the softest mattresses in The Longest Yard, in which Turturro played 'Brucie'.","In Deadpool 2 you can see an ad for Alpha Flight above the taxi cab. In Marvel, Alpha Flight is a canadian superhero group.","In Aladdin (1992), whenever Aladdin tells a lie, the big purple feather on his turban falls and covers his face.","In the crazy 88 scene in kill bill vol. 1 there are only 49 members that show up (50 if you count go-go).","In hitchhikers guide to the galaxy,,,","Edward Norton physically reacts to Brad Pitt getting hit by Lou in Fight Club","In the new Ralph Breaks the internet trailer you can see sleeping beauty dozing off while the princess are talking @ the 0:50 mark","King Arthur and Ready Player One. The incantation I-roc used to activate the 99th-level magical artifact wasn't a nod to D&amp;D but rather Merlin's Charm of Making from Excalibur, 1981.","An Interesting Thing I Noticed In Deadpool 2 My Second Time Through.","In Jurassic Park, the 'mosquito' shown being extracted from amber isn't really a mosquito; it's a cranefly combined with other insect parts and fake wings.","Zootopia places the headphones where the animal’s actual ears are located, unlike other films.","At 2:05:11 in Return of the King, a single Orc can be seen charging a smaller door at Minas Tirith. Later, that door appears to be open.","In Atlantis: The Lost Empire, when Rourke enters the city he leaves several of his stormtroopers behind. The first scene of his takeover is the surviving sailors and mechanics from the Ulysses disguising themselves with spare uniforms and rifles to appear like Rourke has more soldiers with him.","In The Lion King, unlike the other lions, Scar's claws are always displayed throughout the movie.","A little throwback to Toy Story in Coco!","In Ironman 3 a ladder can be seen symbolizing the Avengers “A” in the ruins of Tony’s destroyed home.","In Spider-Man (2002) it's briefly shown that Harry and Peter's apartment is above WebString Platform","The straps on the sleeping mats given to the Guardians of the Galaxy in the Kyln are just standard perforated steel hanger straps, commonly used in plumbing.","In Moana, shark head Maui’s mini Maui also has a shark head.","In Ready Player One (2018), when a certain character is killed a myriad of loot is dropped. Some of the loot includes Sledges Shotgun from Borderlands 2 (circled in blue), and a SPNKr Rocket Launcher from the Halo series (circled in red).","Moana saving the turtle is a recreation of Lilo &amp; Stitch's credit photo montage","In Citizen Kane(1941) Emily Monroe, Kane's first wife is reading 'The Chronicle' which is the rival newspaper line to 'The Inquirer' which is owned by her husband. This small subtlety is there to indicate even more that the husband and wife are having marital issues.","In Maleficent (2014), her powers go from green to yellow depending on her emotional state. When Aurora is around her powers are always yellow, showing her vulnerability to her.","When Darla Dimple convinces Danny to fall for her trap, she picks up the cat animal cracker and bites its head off in Cats Don't Dance","In Misery (1990) there’s a quick shot of a newspaper article in a scrapbook that repeats the same two paragraphs over and over.","In the coffee run scene in Baby Driver (2017), you can see the lyrics to the soundtrack plastered in graffiti in various places in the background.","Avengers infinity war. Nebula's desire for revenge was the catalyst for the movie.","In 12 years a slave, the kidnapper only stopped beating Solomon because his paddle broken in half","This Ferris Wheel appears in The Third Man (1949), The Living Daylights (1987) and Before Sunrise (1995)","In Star Wars Episode III: Revenge of the Sith, George Lucas' son plays this Padawan during Order 66, of which half of this sequence was CGI.","The infamous dance sequence in MAC AND ME (1988) was filmed at a McDonald's in City of Industry, California, which is closed to the public and used for shooting TV commercials.","In Age of Ultron, when Tony Stark uploads Friday as his new AI, you can see several others sitting on the table. Amongst them, at the back Is one that looks like it says HAL as in HAL 9000 Space Odyssey... which shares the theme of AI gone rogue","In Moonrise Kingdom, after Social Services Begins writing the Sheriff a citation, he pulls a book of boating violations out of his pocket to retaliate","In Disney’s Hercules (1997) the Fates tell Hades all the planets will align but only show 6 planets aligning. These are the 5 planets plus Earth that the ancient Greeks were aware of and could see with the naked eye","In Shutter Island(2010), upon meeting Dr. Naerhing, Marshal \"Teddy\" Daniels is told that he possesses \"outstanding defense mechanisms\" which he believes is directed at his wordplay. However, Dr. Naerhing is actually referring to the persona that Daniels' mind has created to cope.","Gal Gadot wearing the same thing in seven different movies. Ralph Wrecks The Internet, Fast &amp; Furious, Fast Five, Fast and Furious 6, Keeping Up With The Joneses and Batman vs Superman.","Deadpool 2 detail. [Spoiler]","In 1983's \"Stroker Ace,\" NASCAR veteran Harry Gant (car #33) is prominently featured. When the film was made, star Burt Reynolds and director Hal Needham owned Gant's racing team.","[The Interview] Translations for text painted on Russian tank &amp; N. Korean helicopter","In Suicide Squad (2016) when they show the list of weapons Deadshot is expert with one of them is a potato canon.","In Jumanji: Welcome to the Jungle, the 'missing piece' is signified by an elephant...which was the same animal as Robin Williams character's piece in the original Jumanji","In Lord of the Rings The Two Towers, Smeagol's pupils are bigger than Gollum's when he has a conversation with himself","[Finding Dory] \"Clendenen Motors\" sticker in cab. Alice Clendenen was Art Director on the movie.","Thor Ragnarok: There are marks on the wall where Hulk throws his ball.","In Avengers Infinity War, Gamora reaches for her sword when Thor approaches her seemingly hostilely.","In Deadpool 2 - A sign in the prison shower reads \"Conduct cavity searches without warning\"","The iPhone plug-in “chirp” can be Heard in the Movie Minority Report [2002] 5 Years Before the iPhone was Released [2007]","[Finding Dory] This truck's bumper stickers include \"Share the road / Don't be shellfish\", \"How's My Driving / 1.HAA.HAA.HAAA\" &amp; Cal Arts A113 reference","In Deadpool 2, director David Leitch can be seen in a brief cameo during the convoy chasing scene. He's the first prisoner Cable throws off the truck to stop Deadpool.","In Children of Men, Theo removes the battery cable from the SUV. On the escape the SUV is seen crashing into the fence as it rolls down the hill without power while Theo pushes the EV for a start.","In CARS 2 the villain's hideout is in a garage surrounded by \"British Wheeland\" auto parts. This is a spoof of British Leyland, a defunct car company notorious for building unreliable vehicles.","In Fear and Loathing in Las Vegas, Johnny Depp plays the famous journalist Hunter S. Thompson under the pseudonym Raoul Duke. During a flashback, Raoul sees himself, played by Hunter S. Thompson.","In \"Spirited Away\" the scene when the family enters the spirit's world is the same as when they leave.","In Guardians of the galaxy(2014) the coordinates of the dark aster is T8IS IS1301319 31N3518 , when translated from numbers to alphabets(1=A,2=B) it says \"THIS IS MOMS CANCER\"","[Infinity War] Thanos pulls the same move Captain America used in Civil War","In ‘The Silence of the Lambs’ one of the police officers serving dinner to Dr. Lecter uncovers a ‘Bon Appétit’ magazine just before Hannibal eats his partners face off.","In Jeepers Creepers (2001) the missing persons flyers at the police station are filled with satirical descriptions.","Vulture's theme is a more villainous version of The Avengers' theme, reflecting how he scavenges technology from the Battle of New York to create his weapons.","In \"Batman Forever\", Twoface's helicopter has a steering wheel.","Deadpool (2016) - Aside from taking his wallet, Wade also takes Gavin's (bedazzled jeans guy) sunglasses.","In Deadpool 2, Wade is listening to the same Air Supply song he listens to in Van Wilder.","In Scott Pilgrim Vs. the World, the vegan police ride a smart, in the theme of being environmental vegans","during rehearsal for the dream sequence of The Big Lebowski Jeff Bridges took a photo while being pulled under all the girls, and the girls had pulled a prank of Jeff by having fake giant bushes put on underneath their underwear.","In RV(2006), Robin William's character, Bob Munro, rents an RV from a guy named Irv, who is pictured on the vehicle. The actor for Irv is Barry Sonnenfeld, the director of the movie.","In Deadpool 2, Zeitgeist has a 116 tattoo, a reference to the X-Force issue #116, his first appearance.","The score when Tony Stark speaks to Pepper Potts on the ship in \"Avengers: infinity war\". Is the same score playing as when Steve Rogers speaks to Peggy carter in \"Captain America\".","At the end of Deadpool 2, Juggernaut can be seen emerging from the pool.","The liquor store clerk from Dazed and Confused (1993) is the same liquor store clerk from Boyhood (2014). Both films are directed by Richard Linklater.","In ‘Pineapple Express’ Seth Rogen’s character has a jersey shirt under his shirt. To add to his character being a slob, and not wearing a white shirt.","In the Baby Driver laundromat scene, all the dryers are full &amp; running. They alternate between all red, all yellow, or all blue.","Infinity War - During the battle with Thanos at Titan, Cloak of Levitation (Dr. Strange's cloak) helps with restraining Thanos by tugging onto Dr. Strange.","In Deadpool 2, Wade Wilson actually has cocaine stored next to the cure for blindness in the apartment, as mentioned in the first movie","At the start of Avengers: Infinity War, Dr Strange's normal clothes quickly change into his robes as the Cloak of Levitation comes to him, showing that he was already wearing the Eye of Agamotto and hiding it with an illusion.","In 2001: A Space Odyssey, HAL easily defeats Frank at a game of chess. Frank is seen mouthing his strategy while he thinks, not knowing that the computer can read his lips.","In 'The Departed,' Costello buys a young Sullivan groceries. The same groceries are seen again at the end of the movie, as Scorsese uses them to represent the concept of original sin [MIC]","In Deadpool 2, when the members of X-Force jump out of the airplane, they form an X in the air.","In Deadpool 2 after Bedlam explains his superpowers, Wade says \"So basically, you're Dave Matthews.\" Then, when Bedlam smashes unexpectedly into a bus, Wade exclaims \"No! Tripping-mother-f*ing-Billies!\" \"Tripping Billies\" is a song by Dave Matthews Band.","Captain America: The Winter Soldier - When we first meet Kate/Agent 13/Sharon Carter, she is speaking with her Aunt on the phone. It's Peggy.","In Deadpool 2, Vanisher is played by Brad Pitt and the voice of Juggernaut is played by himself.","In Aronofsky's \"Black Swan\", Nina is seen eating a Grapefruit and Hard boiled Egg for breakfast, drawing reference to Aronofsky's previous film \"Requiem for a Dream\" where Sara Goldfarb, the Mother, eats the same meal as part of her goal to lose weight for her upcoming appearance on Television.","In the first scene of \"A Quiet Place\", when they are in the city, Regan is wearing a sound processor from the Cochlear brand. After the bridge scene, when the movie jumps in time, she appears wearing a sound processor from AB. It means she can't listen anything. (more in comments)","In Deadpool 2 a high wind advisory can be seen on the news feed of Russell. Further showing everyone but Wade knew.","In the title sequence of Deadpool 2, you can see \"Smile - Wait for the Flash\" on his gun","In Hocus Pocus, Thackery Binx could not speak when he is turned into a cat until the Black Flame Candle is lit.","In Deadpool 2, Russell can be seen with 2 pudding cups on his tray while 2 prisoners fight over a stolen pudding","In Spaceballs (1987) Dark Helmet's chest piece represents the male genitalia. [Very, very, mildly NSFW]","In The Great Gatsby(2013), Jay Gatsby wears a ring with a 'Daisy' engraved on it.","[How It Ends] Tom is a well-prepared guy; After dinner &amp; before driving, he put on a paracord bracelet (which is never used/mentioned)","[Star Trek Into Darkness] Spock \"can't even break a rule\" - seen here clambering to safety mid-fight, without using the side handles marked \"NO STEP\"","In Rocky (1976), Rocky Balboa brags to Adrian that he has never broken his nose, he says, “Look at this face, 64 fights and my nose ain’t never been broken”. Rocky’s nose is then broken in his first fight with Apollo Creed.","In Layer Cake (2004), Sydney drives a Yellow Range Rover. In Kick Ass (2010), also directed by Matthew Vaughn, Big Daddy and Hit-Girl crush a Yellow Range Rover.","Stranger Than Fiction: the cloud backdrop behind the main character begins to move as the narrator describes the woman he is falling for.","In Avengers Infinity War (2018), the fight between Thanos and Dr Strange was partially inspired by the magic duel near the end of The Raven (1963). More in Comments.","In The Dark Knight (2008), Batman says that the sonar device is \"null-key encrypted\". This was added as a joke since it actually means that there is no encryption.","Rampage Easter egg in the Rampage movie","In Blade (1998), you can see one of Frost's henchmen getting pumped up before fighting Blade","In Ready Player One Aech likely bought chucky at \"Avitar Outfitters\" while Parzival was shopping","In the German Movie \"Almanya – Willkommen in Deutschland (2011)\" the Turkish guest workers newly arrived in Germany could not understand German. But it been a German Movie everybody spoke german exept the Germans. To give an impression how the Turks felt the Germans spoke in a German-like gibberish.","Alpha Flight Ad in Deadpool 2","Canadian Mounted in Deadpool 2","Ready Player 1 - When Parzival pulls the pin on the holy hand grenade it blows up exactly three seconds later, just as it was stated in Monty Python and the Holy Grail.","In the Longest Yard remake (2005), Terry Crew's character 'Cheeseburger Eddy' has a cheeseburger tattoo on his right arm","In the original Scream, Wes Craven makes a cameo in the movie as the high school janitor. He’s wearing a grey Fedora and a red and green striped sweater in honour of his other well known fictional horror character.","In Avengers: Infinity War. When Cull Obsidian loses his hand, he is seen with a synthetic hand.","In Age of Ultron, Tony designs Ultron and uses the awkwardly worded phrase “Peace in Our Time” to explain his motivations. This was the same phrase used by Neville Chamberlain upon appeasing Hitler with the Munich Agreement in 1938. Both promises of peace didn’t quite work out...","In The Dark Knight, you can see the Monorail from Batman Begins in an establishing shot of Wayne Tower.","George Lucas makes his first (and only) Star Wars film appearance in “Revenge of the Sith”. You can spot him in the Galaxies Opera House as Anakin rushes to meet Chancellor Palpatine.","In Fear and Loathing in Las Vegas, burn marks can be seen on Dr. Gonzo’s arms. This is because the real Dr. Gonzo (Oscar Zeta Acosta) would often put out cigarettes on his own arm. Benicio Del Toro did the same thing when preparing for the role.","In Pulp Fiction, Butch finally rides to freedom on a chopper called “GRACE”","Pulp Fiction (1994) during the infamous \"Say what again!\" scene the moment Jules asks Brett if he reads the Bible, Vincent immediately finishes his cigarette and reaches for his gun, further convincing the viewer, that these two have been working together for quite some time now.","In The Space between Us, the docking scene to the station is from a Soyuz docking taken from YouTube","Sneakers (1992) Hackers Cosmo and Brice have a seat on Cosmo's Cray supercomputer.","In Suicide Squad you can identify Diablo based on his bright heat signature.","In Rise of the Guardians, Pitch Black's lair is located under an old small bed frame. Pitch is also known as the Boogeyman who is known for hiding under children's beds.","In The Lord of The Rings: The Return of The King, as we see Frodo finishing his manuscript, the director pulls back to reveal the missing finger of Frodo's hand, a reminder of his moment of weakness inside Mount Doom","Gossip Gerty from Batman Forever and Batman &amp; Robin is played by Elizabeth Sander-Kane - Widow of Batman creator Bob Kane.","In the movie \"the Shallows\" there is a seagull shown prominently throughout the movie, he is even given a chracater credit in the credits (Sully \"Steven\" Seagull as himself","Stan lee's cameo in Deadpool 2","These scenes from Thor (2011) and Infinity War (2018) are almost identical","Are you interested in helping the community by becoming a moderator? Apply within!","In PLATOON, Johnny Depp's helmet had \"Sherilyn\" written on it for his girlfriend, actress Sherilyn Fenn (Twin Peaks); who ironically wrote him a \"Dear John\" letter to break up with him while he was away shooting PLATOON","In Isle of Dogs (2018), the 5 dogs in the pack all have names that mean “leader,” further illustrating that they’re all their own leader.","In Thor: Ragnarok, Matt Damon has a scene where he is Loki in a play. Matt Damon was the fallen angel Loki in Dogma.","The kids from Spider Man: Homecoming return in Infinity War","In “Avengers: Infinity War (2018)” Rocket rides on Thors left shoulder. He rides Groot in a similar manner in “Guardians of the Galaxy (2014)” When escaping the prison.","In How It Ends the licence plate on the car Tom and Will are driving to get to Seattle has the code R2B in it, which is military slang for Returning to Base, a wink at the military past of Tom","in the new Netflix movie Father of the Year, the texts sent from Wayne are always spelt as such, but in this particular scene it's spelt incorrectly.","Details in the \"How to Train Your Dragon\" films.","In Baby Driver (2017), one of the things on the TV watched by Joe is the music video for \"Blue song\" by Mint Royale, which Edgar Wright directed and said inspired him to make Baby Driver.","Tremors (1990) - Despite being a self-proclaimed \"handyman\", Kevin Bacon is not very good with a hammer.","Facehugger Easter Egg in THE ABYSS OG DVD sub menu. ALIENS was director James Cameron’s previous film.","In Constantine, a movie about a man struggling with his faith and earning back good graces with God, there is a billboard placement saying “got faith” and a picture of a faucet and tap water turning into wine like the legendary tale of Jesus turning water into wine. A play on the old “Got Milk?”","In Pineapple Express (2008) Seth Rogen and co-writer Evan Goldberg had to roll all the cross joints themselves (~100) because no one else on the crew could roll them properly","“Gonzo fist” shaving cream drawing in Fear and Loathing in Las Vegas","In Reservoir Dogs, they discuss the meaning of Madonna's song Like A Virgin. In real life, Chris Penn was Madonna's brother in law.","In Platoon, Sgt. Barnes(Tom Berenger) is wearing a captured North Vietnamese belt buckle","In Despicable Me 3, the one-eyed bartender fumbles when he attempts to grab the horn off the shelf on his bad side","In The Goonies (1985), just before Mouth's scene trolling Rosalita in subtitled Spanish, Chunk's line in mouth-full, garbled English is subtitled to prep viewers for reading.","In Pixar's Up (2009), both young Carl and Russell have one collar tip untucked over their vests.","In Pixar's Coco, Héctor's notes for his song \"Remember Me\" show it's intended to be played \"simply, tenderly\". Ernesto de la Cruz, either out of ignorance or spite, turns the stolen song into a grand orchestrated number with lights, dancers, and pyrotechnics.","In Tim Burton's Batman 1989, Batman's boots are modified Nike Airs","In Minions you can see a young Gru with his mom in line at Villain Con to buy his Freeze Ray.","Shrek's Lord Farquaad strongly resembles history's Richard III of England","In Toy Story 2, when Hamm quickly changes the channels, the \"shows\" in the TV are the old pixar' shorts.","In 101 Dalmatians (1961) Lady &amp; the Tramp are visible in one scene.","In Wreck-It-Ralph, Venelope Von Schweets has different socks, single and double striped, just like the branches of the candy trees. “Double striped branches break.”","In Aladdin (1992), in the scene where the Sultan is stacking his animal figures, the camera scrolls up, you can see the Beast from Beauty and the Beast as one of the creatures on the left-hand side of his \"pyramid\".","King Kong(2005) takes place in 1933, the same year the original film was released. Early in the film, when Carl Denham is looking for a new lead actresses for his movie, the dialogue suggests that the original King Kong(1933) exists and was being made at the same time as this one.","Die Hard 2 - Shout out to another classic series","In The Shining (1980) Jack Torrance is seen reading a Play Girl magazine. Possibly for the articles...","[Licence to Kill (1989)] The bullet ricochet's sound like the James Bond theme.","In The Incredible Hulk (2008), When Hulk cracks the ice you can see a frozen Captain America.","In The Truman Show, Truman Burbank’s signature catchphrase is “And in case I don’t see you, good afternoon, good evening and good night!” When he says this, he is inadvertently addressing viewers in a variety of time zones all at once.","In \"Spirited Away\", Zeniba uses a paper doll to project a hologram of herself to interact with the other characters. Since the paper doll is missing an arm, so is the projection. (real Zeniba for comparison)","In King Kong (2005), the music accompanying the tribal dance in the theater is the same music that accompanied the tribal dance on Skull Island in the original King Kong (1933)","Thief (1981) - Ear Protection","In Scott Pilgrim vs the World, when Ramona chooses Gideon over Scott and she states that \"she just can't control herself around him\", Gideon gets out of a car and the Rolling Stones song \"Under My Thumb\" plays on the car radio, representing Gideon's manipulation and control over Ramona.","When Brian Arrives in his Skyline In '2 Fast 2 Furious' and is showing off his car by blowing off \"mist\", he's actually purging his NOS(Nitrous Oxide System) of vaporized Nitrous that might be in the system lines and getting the system ready to be used.","In Rio (2011), after Nigel intimidates the monkeys into helping him, three of the monkeys mimic the Three Wise Monkeys proverb","In Indiana Jones and the Last Crusade, Indy can be seen shooting at the German fighter planes in pursuit of him and his father with his trusty revolver. This explains why he is out of ammo in the following scene when his father uses the birds to bring down the fighter plane.","In Reservoir Dogs, the officer whose ear gets removed is related to an patrolman who is killed by Mickey and Mallory in the Taratino-scribed Natural Born Killers, as well as a member of the Smitty Bacall Gang in Django Unchained","In Brave [2012] Clan MacGuffin's family crest is a magical cauldron that produced enough potatoes to feed an entire clan before battle. In other words, Clan MacGuffin's crest is a MacGuffin.","At the end of The Secret Life of Walter Mitty (2013), Walter has email from the people he met in Greenland and Iceland who asked how to keep in contact with him.","In The Dark Knight Rises (2012) Alfred foreshadows Bruce rising from the pit prison as Batman when, as the Bat Suit rises out of the platform, he says \"Sometimes, a man rises from the darkness. Sometimes, the pit sends something back.\"","In Pixar's Coco all of Miguel's family are wearing shoemakers aprons in the afterlife","In SW: The Last Jedi, during the first flash-back of Ben Solo's turning (when Luke tells his version of the story to Rey), we can see a faint green hue inside Ben's room coming from Luke's light saber. This is before it is revealed that Luke raised his saber against Ben.","In Armageddon, after Col. Sharp’s initial briefing he asks, in a somewhat sarcastic tone, “are there any intelligent questions before we get started?”","In \"Star Trek II: The Wrath of Khan\" (1982) the plot revolves around the conflict between Kirk and Khan, who never meet face to face during the movie.","In Gremlins (1984) while the dad talks to the mom in the phone booth, there's a large machine in the background. The scene cuts back to the mom, then back to the dad, the machine is gone. The machine is from the classic movie The Time Machine.","Early in Scream (1996) when Neve Campbell and Skeet Ulrich are making out on the bed, you can faintly hear remake of the song \"Don't fear the reaper\". This foreshadows the reveal at the end of the film.","Tony Stark charges his repulsors a little when yelling at Peter Parker in Avengers: Infinity War","In “Deadpool 2”, while having a conversation with Cable, Wade Wilson dons the exact same Hawaiian shirt that Chunk did in “The Goonies”. This is a nod to Josh Brolin’s (Cable) first big Hollywood movie.","The set design for the Overlook Hotel in The Shining contains so many inconsistencies that the only explanation is that Kubrick intentionally made its layout impossible in order to confuse the viewer","In Titan A.E. (2000) at the New Bangkok Drifter station the Death Star and Amiga Boing Ball appear in the space junk.","During “Another Day of Sun” opening scene of La La Land all the cars that will be danced on already have dented roofs and hoods. They were crushed during rehearsal.","In Avatar [2009] when Jake Sully, and the other hunters in training, are climbing to tame their Ikrans, Jake uses a technique called the 'S-Method' [that is taught in Marine Bootcamp] to climb the vines while the other hunters simply pinch the vines between their feet.","In The Transformers: The Movie (1986) Slave I is seen on the Junkion planet","In Black Panther, King T'chaka requires his subjects to bow. In Infinity War, After T'Challa becomes leader and opens Wakanda to the world, he mentions 'We don't do that here.'","Unbreakable (2000): When Elijah is trying to convince David (Bruce Willis) that he is a superhero, he points out all the other careers David could have chosen. One that he mentions is “founding a chain of restaurants.” Bruce Willis a co-founder of the Planet Hollywood restaurant chain.","In the \"Cousin Kristofferson Arrives\" scene in Fantastic Mr. Fox (2009), Mr. and Mrs. Fox are listening to the song \"Love\", the love theme from Disney's Robin Hood (1973), another movie about foxes.","In The One, around 00:32:35 mark, there's a blink-and-you will miss it moment where Gabe's partner is flirting with hospital staff , using her stethoscope on her","In Star Wars (1977) an outer space version of the Stormtrooper can be seen outside the Death Star as the Millennium Falcon approaches. They’re seen nowhere else in the original trilogy","In Deadpool 2... a fight scene with Cable, Wade is heard saying \"give me your best shot, one-eyed willy\" - refering to The Goonies, Josh Brolin's first film.","In Infinity War, Thanos fires a white beam at Thor representing the combined colours of the infinity stones","Kenny's goodbye at the end of \"South Park: Bigger, Longer &amp; Uncut\" was voiced by Mike Judge. Lots of other very cool cameos I forgot about.","In Guardians of the Galaxy Vol. 2, Quill says that Nebula can't lie properly. In Infinity War, Thanos says that he never taught Gamora to lie. Both were Children of Thanos.","In RoboCop (1987) during the end credits, the copyright message states you will be prosecuted by enforcement droids for unauthorized duplication, distribution or exhibition.","When Holdo says \"for the transports to escape someone needs to stay behind and pilot the cruiser\" C3PO quietly backs up and gets the heck out of there! (Star Wars: The Last Jedi)","Field of Dream: Just noticed that young Doc Graham hits a sacrifice fly in his first 'big league' plate appearance just moments before stepping off the field the save the little girl's life. In doing so, he sacrifices his chance to ever play ball again. In baseball as in life, he makes sacrifices.","In an uncredited cameo during he first sequence of The Rundown (2003) Arnold Schwarzenegger can be seen for about 2 seconds exiting a club and telling Dwayne Johnson \"Have fun\" as he enters. An intentional handing down of the action hero baton.","In King Kong (2005), at the start of the movie, Jack Black's character is showing his movie to some Hollywood hot shots. Very briefly, they show part of the screen on which the original King Kong (1933) movie is playing.","At the start of Cast Away a parcel is collected from Dick and Bettina's. When Chuck makes the delivery at the end of the movie, Dick has been removed from the sign, suggesting that Bettina is now single.","In Focus, Nicky warns Jess about Australians, ‘they shipped all those people down there for a reason’. Margot Robbie, who portrays Jess, is from Australia.","STAR WARS: In episode 4 (A New Hope) C-3PO tells Luke that he is “not much more than an interpreter and not very good at telling stories.” Then in ROTJ we can see C-3PO telling the entire story of the saga, up to that point, to a very captivated Ewok audience. Interesting character development.","Dumb and dumberer - street signs reference Laurel and Hardy","Inception: When Arthur enters the room with the floating bodies the automated operator can be heard because the phone receiver has floated from the cradle.","The joke from \"Best in Show\", \"We met at Starbucks. Not the same Starbucks, at different Starbucks across the street…\" is based on a real-life location in Vancouver.","The Losers (2010) - \"I'm a lethal killing machine.\"","In The Wizard of Oz (1939) there is a large live bird in the Tin Man scene. For years it was rumored that it was a Munchkin actor that hung themself on set and it made it into the film.","In this scene from the Godfather, Kay is playing with a marionette, another nod to the puppet strings motif","During Two Face's crime spree in The Dark Knight, Harvey's coin alternates from clean side to burnt side in repetition until the last flip when Batman intervenes and breaks the cycle.","In The Goonies (1985) Sloth is wearing an Oakland Raiders T-shirt. Sloth's actor, John Matuszak, was a former player of the Raiders.","In “Atlantis the lost empire” when the submarine starts its journey you can see Mr. Whitmore (who funded the expedition to find Atlantis) crossing his fingers behind his back while giving the crew a thumb up.","In 2001 A Space Odyssey, HAL actually foreshadows his actions when playing chess against Frank, saying \"I'm sorry Frank, I think you missed it: queen to bishop three, bishop takes queen, knight takes bishop, mate.\" HAL is actually cheating and Frank does stand a chance of winning.","In Monster House, Zee's shirt/taste in music reflects her boyfriends throughout the film (first Bones, then Skull)","In Pineapple Express, Saul and Dale are locked in the same room where the soldier in the beginning (Bill Hader) is being observed smoking a joint. You can see the suit worn by the soldier who reignites his joint in the background.","In The Thin Red Line... you notice earlier, Woody Harrelson's character Sgt. Keck, modify the grenade pin with a knife before making the fatal mistake of grabbing the grenade by the pin","In Ready Player One (2018) Art3mis adds her birthmark in game after meeting Parzival IRL.","In The World's End (2013) Oliver is seen showing a house to a couple in the beginning. This is the same couple his blank is showing houses to at the end.","In Ghostbusters (1984), Venkman is introduced conducting what appears to be a fraudulent experiment testing a student's ESP ability by shocking him. However as the scene goes on the student's guesses improve, implying the experiment is actually working.","In Terminator 2: Judgement Day, John Connor is seen throughout the movie wearing a shirt that refers to the rap group \"Public Enemy\", it also refers to his status as public enemy number one for Skynet, along with he, Sarah Connor (his mother), and the T-800 being wanted by law enforcement.","In The Bourne Ultimatum (2007) one of the \"terminated\" victims' files taken from Vosen's safe by Bourne has a photo of Richard Chamberlain, identified as \"Robert Golding\", who played the original Jason Bourne in the The Bourne Identity (1988).","In Aliens (1986), to save having to make all the hypersleep chambers, the film makers simply built half and put up a mirror to give the illusion of their being more. This is clearly visible in the far left of this picture.","When Marty wakes up in his great-great-grandmother's bed in Back to the Future III, he checks to see if he has pants on. In Back to the Future I, he wakes up in his mother's room without realizing he isn't wearing pants.","In Star Trek: First Contact (1996) the Millennium Falcon can be seen helping the Federation fight the Borg.","In 2001 - A Space Odyssey, Kier Dullea's character ages drastically. Fifty years later compare the real aging with the makeup.","All the license plates in Ferris Bueller's Day Off (1986) are abbreviations for John Hughes' other movies. Katie's (Mom) = VCTN (National Lampoon's Vacation) Jeanie = TBC (The Breakfast Club) Tom's (Dad) = MMOM (Mr.Mom) Rooney = 4FBDO (Ferris Bueller's Day Off)","In Batman Begins, this is the scene where Bruce Wayne finds his Batman voice. (explanation in comments)","In Kong: Skull Island (2017), the corners of the screen are blurred to show as if an older camera is being used.","In The Terminator (1984), Kyle Reese's flashback shows soldiers letting guard dogs sniff their hands to verify whether their humanity. Later, when Kyle and Sarah check into the Tiki Motel, Kyle offers his hand to the dog outside the check-in desk because, presumably, it's now a force of habit.","In American Beauty, Kevin Spacey’s character is called Lester Burnham. This is an anagram of Humbert learns, referring to the protagonist of Vladimir Nabokov’s novel Lolita. Lester is meant to be a version of Humbert who sees the error of his ways.","The statues of replicants behind glass in Blade Runner 2049 move slowly and may be alive.","In Contact (1997) when the camera pulls away from Elly's eye, there is a silhouette of \"The Machine\" that gets built later in the movie inside her eye-glint. (Minus the rings)","In Inglourious Basterds you can hear the hammer of the gun of the Nazi Major set into position before the standoff begins","In Unbreakable (2000), Mister Glass’s mother explains to D. Dunn the 2 types of vilains; the soldier vilain, who is fighting the hero with his hands (Dennis in Split, 2016) and the real threat who is brilliant and evil who fights the hero with his mind. It’s like she’s explainning the future patern","(Infinity War) Right before Thanos escapes Wakanda, you can see the subtle green sparks of the Time Stone reversing his injury.","In Avengers: Infinity War, a bespectacled mustachioed blue man in jean cutoffs is seen in the background, a reference to Tobias Fünke from Arrested Development, a show that IW directors Joe and Anthony Russo directed episodes of","In Wanted (2008), Cross always waits for Wesley to shoot first so he can know how to stop the bullet without hurting Wesley","In Godzilla (2014), while Ford and Joe are looking through their old house, Fords Terrarium is labeled \"Fords Mothra\".","In Spaceballs (1987), the Millennium Falcon makes an appearance in the diner scene which suggests that Spaceballs and Star Wars both take place in the same universe.","In Contact (1997) during the opening pull back sequence when going past Mars, you can see the \"face on Mars\" phenomenon.","After fighting the Killer Rabbit of Caerbannog in Monty Python and the Holy Grail, King Arthur mistakingly counts the number of casualties as five instead of three. This foreshadows the well known joke in which Arthur counts to five instead of three when throwing the Holy Hand Grenade of Antioch.","In 'Avengers: Infinity War' the movie's co-writer Stephen McFeely has an On-screen cameo.","When Iron Man suits up for the first time in Infinity War, you can see his glasses are made of nanomachines too. The suit absorbs them as he takes them off.","During the filming of Harry Potter and the Prisoner of Azkaban (2004), all the pockets on Tom Felton's robes were sewn shut to prevent him from sneaking food on set.","Tony is seen using unfinished nanotech glove in Captain America:Civil War.Later in Avengers:Infinity War, we see the full nanotech suit.","In Kung Fu Panda (2008) Po describes the Dragon Scroll as blank while Tai Lung exclaims it’s nothing indicating their self esteem","In The Sixt Sense, when Malcom comes home after talking to Cole in the church, he finds his wife sleeping. When he sits down next to her on the bed, she shivers and covers herself because his presence is making her cold. Bonus; she is covering herself with a red blanket.","In the Shawshank Redemption, Morgan Freeman's son Alfonso Freeman is one of the prisoners cheering the arrival of \"Fresh Fish\" at the beginning of the film.","Sorry to Bother You(2018), when giving Cassius directions to the room with the magenta door, Mr. ______ has a white powdery substance around his nostril.","In Avengers: Infinity War, Bruce Banner falls through the window of Sanctum Sanctorum. This is a reference to the Infinity Gauntlet comics, where the same happens to Silver Surfer","In the post credit scene in Infinity War Fury and agent hill are riding in an Infinity","(Spoilers) In Fantastic Beasts and Where to Find Them (2016), the movie opens with Grindelwald facing away from the screen. Moments later another character is introduced and he is also facing away with a similar haircut to Grindelwald.","Power of the Infinity Stones (Avengers: Infinity War)","In Man of the House (1995) Jonathan Taylor Thomas' character Ben is reading a comic with a The Lion King (1994) ad on the back. Thomas played young Simba in The Lion King.","In the movie, The World's End, Simon Pegg portrait is used for one of the bars that is part of The Golden Mile. Also him and his buddies all have names related to royalty, Gary King, Andy Knightly, Peter Page, Steven Prince, and Oliver Chamberlain.","In Mission Impossible Ghost Protocol(2011) when Ethan was at the hospital you can see in the background when he gets off the bed","In The Avengers: Infinity War, when Dr. Strange creates doubles of himself, Thanos activates the Soul stone to find the correct Strange and the Power stone to disrupt the spell.","In Avengers Infinity War the mesh under Captain America's resembles his old suit from the comics","Ready Player One: A movie about finding an Easter Egg, was released on Easter weekend","In Avengers: Infinity War, at the bottom right corner of Thanos’ tent, you can see his armor being used as a scarecrow like in the comics.","In Harry Potter and the Deathly Hallows part 2 during the part where Harry, Hermione and Ron are running through the battle to get to Snape (basically after the protective bubble collapses) The whole scene of their running is a recollection of all the films.","In Kingsman: The Secret Service, Professor James Arnold is played by Mark Hamill. In the comic series, Mark Hamill is featured as the first celebrity to be kidnapped by a character named Dr. Arnold.","In Avengers: Infinity War, Dr. Strange's hands are still shaking from his accident","One of the final weapons Iron Man uses during \"Infinity War\" mirror the style of the Jericho, the first weapon we see Tony Stark use in \"Iron Man\"","In the movie 'The Fifth Element,' Corbin Dallas responds to the security check \"I am a meat popsicle,\" the military personnel he hid become frozen \"meat popsicles\" in the fridge.","In The Avengers: Infinity War, when Heimdall prays to the all father for dark magic to teleport banner, Loki in the first Avengers film, references dark magic for Thor’s teleportation to earth.","In The Last Jedi, Ben Solo’s lightsaber closely resembles the hilt used by Kylo Ren, implying that he reused it when he became Snoke’s Apprentice","In Avengers: Infinity War (2018), when Hulk/Bruce Banner crashes into the Sanctum Sanctorum, the markings of the Bifrost can be seen in both the stairs and the rubble below.","In Avengers: Infinity War, the blanket the Guardians wrap around Thor has the same pattern as his armor.","In Infinity War, After the snap, not only is the Infinity Gauntlet roasted, but Thanos entire left arm and neck is roasted also.","While filming Mystery Men (1999), a crew member on the set threw a disposable lighter into a trash can, not realizing it was a prop that would later be set on fire. The lighter exploded during a take in a sudden burst of flame behind Paul Reubens who improvised the famous \"Excuse me\" line.","In Dinner for Schmucks, Therman a “mind controller” has a framed autograph of The Amazing Kreskin, a famous stage hypnotist.","At the beginning of Donnie Darko, Donnie rides his bike past the same Pontiac Firebird from the climax of the film.","In the Book of Life, Camren and Jorge look at each other when Manolo picks up his guitar while all the other Sanchez family members are in disbelief because they’re the only 2 who believe in his music.","In Shawshank Redemption Brooks releases his pet bird. The bird has spent its entire life inside the prison and wont make it on the outside, much like Brooks himself.","In the Harry Potter series, the door to Dumbledore's office is a revolving griffin elevator, making it quite literally a \"griffin door\"","In Donnie Darko (2001), Donnie is the only one riding his bike without the light on. He doesn't need it because he can see \"God's Channel\".","In Shrek (2001) when Lord Farquaad uses the mirror on the wall to look at pictures of Princess Fiona, you can see his blanket move upwards accompanied by a look of surprise on his face. An indication of his ‘excitement’ for his potential future wife.","In Avengers: Infinity War, you can see the weapon Iron Man is selecting in the bottom left corner of his HUD before it actually appears in the very next shot.","In Monsters Vs Aliens (2009), the first few notes played on the keyboard by Mr.President are a reference to Spielberg's movie Close Encounters of the Third Kind (1977) where they use it to communicate with the alien lifeform.","In deadpool 2, Cable repairs one of his guns using a knob from a guitar. Later you can see that that knob goes to 11, a reference to the movie Spinal Tap.","In Godzilla (2014), a poster in one of the opening scenes depicts the 2 fully grown MUTOs. Even revealing that they will be in San Francisco with the Golden Gate bridge in the background.","Im Ready Player One during the race sequence King Kong brakes part of the track making someone in the Adam West Batman car have to come to a stop. When coming to a stop his tire screeches make the classic \"nananana\" associated with the Batman song before one of the main character crashes into Batman","In Men In Black, the \"known aliens\" visible on the screen include Al Roker, Isaac Mizrahi, Danny DeVito, director Barry Sonnenfeld, Chloe Sonnenfeld (Barry's daughter), Sylvester Stallone, Dionne Warwick, Newt Gingrich, Anthony Robbins, George Lucas, and executive producer Steven Spielberg.","Quentin Tarantino's, death proof","Cut-line on Nazgul Before the first strike?","In \"The Untouchables\", during the baseball speech, the only person who doesn't flinch at the sight of the killing is Capones hitman, Frank Nitti (Billy Drago).","In The Italian Job (2003), during the part where they detonate explosives under the armored truck, look carefully at the crowd of people running away. There you can catch a quick view of spiderman fleeing the sceen.","The Greatest Showman (2018) - During Zac Efron and Zendaya's duet, \"Rewrite the Stars,\" the sand on the floor of the circus ring mimics the craters and terrain of a planet/moon, adding to the astronomic theme of the song.","In Charlie and the Chocolate Factory, Charlie's father works in a factory that makes \"Smilex\" toothpaste. This is a reference to Tim Burton's \"Batman,\" in which the Joker unleashes lethal \"Smilex\" poison upon Gotham City by hiding it within personal care items such as toothpaste.","The Matrix - Nebuchadnezzar Model No. Bible Reference","Early in The Wicker Man (2006) Edward Malus is seen holding a copy of Man's Search for Meaning by Victor E Frankel, foreshadowing things to come. He replaces it and buys an audio cassette called \"Everything's OK\" instead.","TIL; The character ‘Switch’ in The Matrix was originality going to be played by 2 actors (a male actor in the real world, a female in the matrix, hence the name)","Ant man - When Cross shows up at Hank Pym’s house, you can see him wearing black gloves. He later confessed to wanting to kill Hank Pym that night.","In Spider-Man 2 after Harry discovers the Green Goblin lair he wears a green bow tie. Symbolizing his commitment to avenging his father.","Francis in Deadpool is wearing a crown of dicks.","In Pulp Fiction, Vincent Vega tells Lance about his Malibu being keyed just moments out of storage. You can see that particular scratch after Vincent rams the Malibu into Lance’s house.","Early in Memoirs of a Geisha, the Baron tells Chiyo she's ''Lovely as her big sister'', the only way he could've kown her sister was by going to the underage brothel. Giving us insight on the ulterior nature of the character for later in the film.","In The Breakfast Club (1985), the car \"the brain\" gets out of has the license plate \"EMC 2,\" while the car \"the jock\" gets out of has the license plate \"OHIOST\"","In Guardians of the Galaxy Vol. 2, after detaching from the destroyed Ravager ship, Rocket searches for the coordinates for Ego's planet. First he scrolls through Drez-Lar, Hala, Terma, and Terra. (More info in comments)","The set of the Nostromo on the movie Alien was built in real life on a sound stage. The interior of the ship was built as realistic as possible, to accommodate this the designers made numerous symbols that actually do make sense and could have been used on a spaceship.","In Kung Fu Panda, Master Shifu briefly looks at the camera as he steals Po's dumpling.","In this secene of the casino there’s the cowboy prior to meeting Robert De Niro https://m.imdb.com/name/nm0898609/?ref_=m_ttfcd_cl68","In Kung Fu Panda 2, we see Po’s dad hit a hammer-wielding wolf in the left eye during Po’s flashback, the main Wolf Boss in the film is hammer-wielding and blind in the left eye due to injuries.","In the opening credits montage in The Breakfast Club, you can see the janitor was destined for great things.","In Shock and Awe (2017) the flag of GDR is next to the German at the UN headquarter. 13 years after GDR and FRG reunited.","In The Holiday, both of Jude Law's daughters (under the age of 5) supposedly have their own phones because each time a girl phones him it's a different name.","In Kill Bill, the name the Bride gave to the wedding registrar was Machiavelli, Niccolo Machiavelli was an Italian strategist who faked his death to outsmart his enemies, which she does.","In Trainspotting (1996) after the boys beat up the american tourist we see the barman wearing his jacket, an obvious token from the boys to make the barman keep quiet.","In Tarzan (1999) when Tarzan apologizes to Kerchak, he hunches low and extends his hand to him, a common gesture of submission in apes.","In “127 Hours” Aron Ralston’s silhouette can be seen in many of the flashbacks.","Ready Player One - You can see Curator looking back and waiting to close the clip to see if Parzival will catch onto the hint.","In Kung Fu Panda 3 (2016), Tai Lung’s (Kung Fu Panda (2008) villain) chi amulet is visible on Kai’s chain.","In the beginning of ParaNorman grandma states “If they just bothered to sit down and talk it through, it would be a different story.” In the end Norman saves the town by doing just that.","In Mulan (1998), Mulan mentions 'Punctual' as one of the desirable qualities in a bride. This is a callback to Aladdin when the Genie accidentally tells him to say 'Punctual'","In The Little Mermaid (1998) when King Triton is introduced, you can see Mickey, Donald, Goofy and Kermit the Frog in the crowd, underwater...","In Close Encounters of the Third Kind (1977) R2D2 is attached to the Mother Ship. Since both movies were released in 1977, this is possibly the first Star Wars Easter Egg in another movie.","In Ready Player One, during the race, Art3mis passes a marquee with \"Schwarzenegger\" \"Jack Slater III\". A nod to Zak Penn who was a writer for both The Last Action Hero and RP1.","In Iron Man 3, when Tony meets the little boy for the first time, the boy says that he would add retroreflective panels(in Tony's words) to the suit. This inspired him to add those panels to his plane in Spiderman Homecoming.","In the opening shot of Back to the Future, the Harold Lloyd film \"Safety Last\" was being paid tribute, also foreshadowing Doc hanging off the clock tower.","In \"Donnie Darko\" there is a carved pumpkin on the kitchen island that looks like Frank's bunny mask","In Avengers Infinity War, Thanos has 6 adopted children, 3 girls, and 3 boys. Even his children are perfectly balanced.","In the \"2001:A Space Odyssey\" (1969) sequel \"2010: The Year We Make Contact\" (1984) Stanley Kubrick is seen on a Time Magazine cover.","In \"Mission: Impossible - Rogue Nation\", Ilsa's main theme, heard on her first entrance, is a snippet from 'Nessum Dorma' taken from the opera 'Turandot' that appears later in the film.","In The big lebowski, the shoe guy from opening bears somewhat of a resemblance to Saddam , that's why the dude dreams of Saddam Hussein giving him shoes","In the opening scene of Pulp Fiction, you can see Vincent on his way to the toilet during the dialogue between honey bunny and pumpkin further demonstrating the side by side comparison of the scene later in the movie","In the The Wizard of Oz (1939) When Dorothy lands in Munchkinland the film is already in color. They painted the house Sepia tone and used a Dorothy double so they would not need to do any film extra processing for the transition to color.","In Age of Ultron. display of subtle but massive respect for Captain America by Thor: Thor gives Cap a glass of Asgardian liquor BEFORE acquiescing to let the \"mortal men\" try it.","In Prisoners (2013) there is a billboard visible in the beginning of the film with the words \"aching knee?\", foreshadowing Keller Dover's gunshot injury later in the film.","Pulp Fiction (1994) Steve Buscemi plays the waiter at the restaurant, and he's the same person that played Mr. Pink in Reservoir Dogs who discussed how waiters should not get tipped. Best way for him to know is if he was a waiter himself.","In Ready Player One Parzival names his clan the High Five. Consequently through the entire movie he is left hanging all three times he attempts to high five some one.","In The Last Jedi, Rey sees her own reflection in the cave exactly halfway into the movie","Pulp Fictions opening and closing is different. The first version Honey Bunny says the line: \"Any of you fucking pricks move, and I'll execute every mother fucking last one of you!\". The second time she says: \"Any of you fucking pricks move, and I'll execute everyone of you mother fuckers!\"","In Avengers: Age of Ultron, when the Avengers are looking at S.H.I.E.L.D.'s dossier on Ulysses Klaue, you can see that it mentions Klaue's great-grandfather having been killed by a previous Black Panther for trying to annex Wakanda.","During the tesseract scene in Interstellar, there is a faint tick tock of a clock in the background as Cooper tries to find a way to relay information to Murph.","In the opening of The Breakfast Club, one piece of graffiti is a quote from Brenda Spencer, who committed a school shooting in 1979. Asked why she did it, she said: “I don’t like Mondays. This livens up the day.”","In Akira, the scene where Tetsuo thinks his guts are falling out is a very subtle reference to a later scene (spoiler in comments)","[x/post from r/Astronomy] Solid catch from a redditor in the Astronomy sub from Starship Troopers","In \"Indiana Jones and the Last Crusade\" Mr. Henry Jones clearly holds his newspaper upside-down (seen in several shots). It is likely because he lost his spectacles earlier in the film.","In Moonrise Kingdom, Suzy brings her lucky lefty scissors with her. However, the only times that she is seen holding them, they are in her right hand.","In \"Up\" there is a scene where there are two houseleeks that are similar in color and shape to Carls and Ellies chares. Latin name for houseleeks means always living","In La La Land, in the \"I Ran\" party we can see Seb on the right going to the stage to perform on the first shot of the scene.","In the opening titles of baby driver the entire sequence mirrors the plot of the film.","[NSFW] In Irreversible, during the infamous rape scene, you can briefly see a man walking in on the act in the background. Instead of intervening he quickly turns back and leaves the scene","Throughout What about Bob (1991), every time the movie's theme music is played, it becomes more manic and chaotic, paralleling Dr. Leo Marvin's decaying mental state.","In Eyes Wide Shut, during the scene where Cruise is talking to Nick after he gets done with the jazz combo, you can see Kubrick sitting at a nearby table.","In Black Panther, Killmonger’s mask resembles the Wakandan carrier ship.","In Ready Player One (2018), Sho totals his car in pursuit of the first key, even though there are no obstacles on the route. It's not until later that we find out that Sho is only 11 years old, and has probably never been taught how to drive a car.","(Batman v Superman UE) From the moment Lex sets the timer to one hour, it is exactly one hour until the end of the movie.","in Spider-man: Homecoming, when the team is on the way to DC there's a sign that states \"Triskelion Cleanup.\" This is a reference to The Winter Soldier's ending, with the S.H.I.E.L.D building blowing up","In Inglorious Basterds (2009), Col. Landa puts out his cigarette in the strudel, resembling the LaPadite cabin.","In Spider-Man Homecoming, one of the mysterious objects Spider-Man finds in the Damage Control Vault is actually the Key used to drop Sokovia during Avengers: Age of Ultron.","In Conan The Barbarian, Conan is chased by feral canines that take his fur tunic before he falls into the Atlantean tomb. After he finds the sword in the tomb he emerges triumphantly wearing no furs as the canines approach again. The next scenes show him striding along in lighter canine furs.","In Batman (1989), at the start of the movie, when Alexander Knox is walking through his office, getting heckled by his colleagues, an artist hands him a drawing of a \"bat-man,\" who wears a suit but has a bat head. The signature at the bottom of the picture is Bob Kane, co-creator of the Batman","In the action thriller Drop Zone (1994), villain Ty Moncrief (Gary Busey) makes a hand off with a corrupt cop and salutes him saying \"Garryowen,\" which was the custom for enlisted soldiers in the US 7th Cavalry Regiment when saluting officers, suggesting Moncrief was an ex-cavalry NCO in Vietnam.","In Disney's Planes (2013), whenever Skipper tells a story about a mission in the Air Force, he starts the story with \"The Jolly Wrenches ...\" instead of \"We/us\" as he wasn't actually on the missions themselves, which becomes an issue later on in the movie","In the Shape of Water, when Eliza presents the card to Amphibian Man, the inside of the card says \"I love you\".","In the Blues Brothers, when Jake finally accepts the new Bluesmobile, he says, \"Fix the cigarette lighter.\" Earlier in that scene, he had thrown it out the window. (Link is parody of this scene.)","In Captain America: Civil War (2016), when Tony calls in Spider-Man, he yells, “Underoos!” It’s a nice subtle piece of humor referencing the superhero themed underwear from the 70’s. Originally marketed to kids, Tony is poking fun at Spider-Man’s young age.","In ENEMY (2013), Denis Villeneuve uses spiderwebs all throughout the film. Here is one from the dream/film sequence.","In Avengers: Age of Ultron (2015), you can see the Captain America “Buy your War Bonds” poster seen in the Avengers tower from the Captain America: The First Avenger.","Doc Brown's bandana from Back to the Future: Part III is made from his shirt from Back to the Future: Part II.","In \"Indiana Jones and the Kingdom of the Crystal Skull\" in library chase aftermath you can see only a couple of black people among the students. It is year 1957 and racial segregation and related issues were still high in the US so not many black people managed to attend colleges or universities.","In Spider-Man: Homecoming, while Ned is asking Peter about his spider powers, you can briefly hear the teacher lecturing about the Sokovia Accords from Captain America: Civil War","Name of G.O.R.A.(2004) is not an acronym. Cem Yilmaz(scriptwriter and actor) explained purpose of the dots as \"to make audience curious\" in a 2011 Q&amp;A. Movie has 2 sequels, \"A.R.O.G\" and \"Arif v 216\".","In 2001: A Space Odyssey (1968), when Dave is pulling out HAL's chips, HAL regresses in time. Eventually, HAL starts singing \"Daisy, Daisy, give me your answer please\" (\"On a Bicycle Built for Two\"). This was the first song ever sung by a computer in the real world.","In ‘Avengers: Age of Ultron’, the back of Vision’s head resembles a simplified version of Ultron’s face, as Ultron intended for Vision’s body to be his final form.","2 decades before Marvel, Commando (1985), Predator (1987) &amp; Die-Hard 2 (1990) all co-existed in the same cinematic universe. The trio of Steven de Souza produced films are all linked by the fictional South American country of “Val Verde” - which features in all 3.","In Big Trouble in Little China (1986) - Jack’s monologue - “You just listen to the old Pork-Chop Express here now, and take his advice on a dark and stormy night. When the Lightning’s crashing and the Thunder’s rollin’ and the Rain’s coming down..”- refers to the 3 Storms: Lightning, Thunder &amp; Rain.","In John Wick: Chapter 2, the museum shootout choreography is tied to Vivaldi’s Four Seasons; sounds from John’s gunshots are timed with the music’s percussion. (Shots start firing after 01:35)","In Batman v. Superman Dawn of Justice. The first and last shots are of coffins.","In Mamma Mia,during the song Dancing Queen, Abba’s piano player Benny Andersson makes a quick cameo","In Back To The Future (1985) The sticker Marty's amp “CRM 114,” a nod to Stanley Kubrick. The CRM-114 Discriminator is a fictional radio device in Dr. Strangelove, the experimental drug given to Alex in A Clockwork Orange and serial number of the Jupiter explorer in 2001: A Space Odyssey.","In The Shining (1980), Dick Hallorann initially opens the fridge door to the right, but in the next scene, the door is shown to be open to his left. This was possibly done to indicate the mystical ability of the hotel and as part of a mirroring technique that is used throughout the film.","In Spotlight (2015), Joe Paterno can be seen on the TV. Paterno was fired from Penn State in 2011 for covering up systemic sexual abuse.","In Princess Mononoke when Moro the wolf god bites Lady Eboshi, she bites off her right arm. Eboshi shot Moro (&amp; others), and her trigger finger was on her right hand. She can’t shoot her rifle any more.","In Logan, Wolverine tells the thieves that they are going to strip the chrome plating off the lug nuts. When he gets hit with the tire iron, chrome flakes fly out of the end.","In A New Hope, Chewbacca reacts violently to Luke's attempt at putting handcuffs on him and masquerade him as a prisoner. This is more meaningful than it seemed because a large portion of the labor used to build the Death Star came from enslaved wookies. Chewy knew this and reacted as such.","At the start of Spider-Man: Homecoming (2017), Peter goes to school as an instrumental version of \"The Underdog\" plays. The lyrics to this song speak about a young, innovative newcomer who wants respect from \"above\", but ultimately realizes he just needs to respect himself: Peter's character arc.","In National Treasure (2004), the shot dissolves from the grandfather a shot of the pyramids, but the grandfather's eye remains, an homage to the pyramid on the back of the $1 bill.","Spider-Man 2 (2004) and Spider-Man 3 (2007) the name of Peter Parker's landlord, Mr. Ditkovich can sound familiar to many Marvel fans, that's because it's an homage to Spider-Man co-creator, Steve Ditko.","In The Book Of Eli (2010), People keep checking Eli's hands the first time they meet him to see if he shakes like all the cannibals (one of them). That's because shaking hands is one of the first symptoms of Kuru disease, which is contracted by eating the brains and spinal cords of other humans.","In Hairspray (2007), Edna (John Travolta) says, \"Look, if you want to be famous, learn how to take blood outta car upholstery.\" This is a reference to his earlier role in Pulp Fiction (1994), in which he shoots the character Marvin in the back of a car, getting blood on the upholstery.","During the La Marseillaise scene in Casablanca, several people can be seen crying while singing. Casablanca was released in 1942, at a time when the fate of France was uncertain, and most of the extras in the film were French expatriates who had fled Nazi occupation.","In The Dark Knight Rises (2012) Bruce Wayne has a picture of Rachel and his parents on a desk. The picture of his parents burned from the fire at Wayne Mansion. This is also the desk Selina Kyle took his mother's pearl necklace from. All the things most important to him in one place.","Small and rather apparent, but rarely mentioned: Leslie Nielsen's Frank Drebin from \"Police Squad!\" and \"The Naked Gun\" always introduces himself with three mutually exclusive ranks at the same time.","In Ghostbusters (1984) there's a running joke about Rick Moranis's character locking himself out of his apartment. Later, he becomes the Keymaster, and doors literally fly open for him.","The song at the end of Oceans 11 foreshadows the groups demise which leads to the following sequels","In Captain America: Civil War while Scarlet Witch is getting the gas out, she creates a shield to cover her back","The poster for Home Alone (1990) was inspired by Edvard Munch’s; The Scream.","[Unbreakable] - intentional foreshadowing right away /SPOILERS","In The Matrix Reloaded (2003) after henchmen are defeated Neo stands where he stood before the fight even started","In Hardcore Henry (2016) The More the Film Progresses, The More Damaged the Phone Jimmy hands Henry on the Bus becomes","At the end of Inglourious Basterds, Shosanna Dreyfus is seen speaking English, which is how she was able to escape Lapadite’s interrogation in the beginning.","In \"Get Out,\" Rose sits in front of a globe in the Armitage living room that is turned to emphasize Africa, alluding to their obsession with Blackness and African bodies.","In the climactic battle in Hot Fuzz (2007), Sergeant Angel gets his wings and rides into town on a pale horse.","In Planes, Trains, and Automobiles, after Dale 'steals' Neal's cab, you can see shower curtain rings in the puddle of water where Dale loaded his footlocker into the cab's trunk.","T2: Trainspotting - Sick Boy puts on a Sean Connery accent whilst stealing from an ATM as a throwback to his obsession to SC in the original film","In The Exorcist III (1990) - when Brad Dourif’s character is asked how he’s able to come and go from jail without being seen, he responds - “It’s Child’s Play”. Brad Dourif also provided the voice for Chucky.","In Skyfall (2012) 007 retrieves an Aston Martin DB5 with the license plate BMT 216A from a garage. This car and plate made its first appearance in an episode of The Saint in 1963, starring none other than Roger Moore.","All of the items in the room where Coach Klein is explaining the origins of the green notebook in the movie The Waterboy (1998) are green.","In Ex Machina (2014) while in a drunken stupor Oscar Issac's character mumbles a long obscure quote from Oppenheimer. This is a rejoinder to the shallow and cliche Oppenheimer quote that Domhnall Gleeson's character recited earlier in the movie.","During the climax of Blade Runner (1982), Batty mocks Deckard for taking a shot and missing him. When it cuts back to Batty, we see that his ear is now bleeding. Deckard didn't miss.","In Tron Legacy (2010), when Sam first enters the Grid, the camera pans up. You can see on a building something that looks like the number two in Tron style. This is a reference to the original Tron Legacy logo, which was styled so the letter 'O' in Tron looked like a two. (aka Tr2n)","In ‘The Time Machine’, Guy Pearce’s character travels to 2030 where his first encounter is with a lady paying to unlock a ride share bike. The future is now!","Tommy Boy (1995) When Tommy is teasing David in the hotel room, you can see that Naked Gun 33 1/3 is available on Pay Per View. Both movies were directed back to back by Peter Segal.","In The Shining (1980) A subliminal audio insert throughout the movie can be heard saying \"SHONE\" - the past tense of the word SHINE. I have verified this on my personal copy of the movie.","In “Moneyball” during the scout meeting, Billy Beane (Brad Pitt), says that they’re counting cards at the blackjack table, trying to beat the system. He says this directly facing Jack McGee’s character, who played a casino pit boss in “21”","In the plane ride scene of Scooby-Doo (2002) Fred can be seen reading his own book, this reflect his massive ego and consistent arrogance throughout the movie.","The Thing [1982]: During the blood test scene Palmer loses the reflection in his eyes. That shows the thing has fully assimilated him. (revealed by D.O.P. Dean Cundey)","Guardians of the Galaxy (2014) - During the battle for Xander, Rocket destroys an enemy just before it crashes into a bridge filled with civilians, a mother and daughter among them. Later, you see Dey(John C. Reilly) return home and it is revealed that this is his wife and daughter.","In Captain America: Civil War (2016), Cap knew Spidey was strong to hold the container because he just had an \"arm wrestle\" with him seconds before. So cap didn't try to kill Spidey, but knew that he would be strong enough to hold the falling container.","Near the beginning of The Cabin In The Woods (2012), The Harbinger tries to warn Hadley and his team that \"The Fool\" is not to be underestimated, but they're too busy laughing at the fact that they have him on speakerphone. Later, \"The Fool\" ruins their entire operation.","In Captain America: TWS, Steve Rogers finds out Hydra killed Howard Stark and his wife when computer Arnim Zola was stalling them. This comes up again at the end of Civil War when he admits to Tony Stark he knew that they were killed all along.","In Baby Driver, Baby doesn't drink wine on his date with Debora because he's the driver","The little girl who wins at the start of Battle Royale (2000) show up in the sequel as one of the freedom fighters/ terrorists - Battle Royale II: Requiem (2003)","Ready Player One - Collecting coins through an Arcade Machine Coin Slot GUI; Armor is really a suit of medieval armor; Mechagodzilla Falls on Goons; Personalized Player Vanity Cards [album]","If you watch the film with headphones or properly placed surround sound speakers, every time we see Baby in Baby Driver (2017) wearing only one of his headphones, you’ll hear the song he is listening to through that ear only.","In The Equalizer (2014), McCall claims his old job was a 'Pip' with Gladys Knight and the Pips. Later, during the warehouse shootout, McCall plays Midnight Train to Georgia over the loud speakers, a song by Gladys Knight and the Pips","In the movie Small Soldiers, the main villains name is Maj. Chip Hazard. Subsequently, also describes action of how they get their advanced AI. The manufacturer accidentally orders munitions chips for the toys.","In ‘The Dark Knight’, at the end of the movie, James Gordon says that Harvey was “not the hero we deserved, but the hero we needed”, but says Batman was “the hero Gotham deserves, but not the one it needs right now”. Both lines are true, since the first is ambiguous.","In It (2017), a small glow can be seen coming out of the hole that Pennywise vanishes down, hinting at It's return.","In Jumanji: Welcome to the Jungle, the guards’ vests are just animal faces.","In Lethal Weapon (1986), Mr Joshua played by Gary Busey worked for Shadow Company, a Heroin &amp; Weapons smuggling group comprised of mercenaries that operated under the CIA-controlled “Air America” during the Vietnam War. Mel Gibson would go on to play a very similar role 4 years later.","In Apocalypse Now, the title of the film is written on the wall when the boat first arrives at Kurtz's compound; it's the only time it's mentioned.","In \"The Martian\" Rich has to use props for his orbital demo because the room has no whiteboards","In Chicago(2002), Sophie Tucker is billed below Roxie Hart and Velma Kelly, a reference to a line from Roxie's song.","In The Terminator (1984), Lieutenant Traxler assures Sarah she is safe as there are “30 Police Officers” in the Police Station. During the Terminator’s rampage, if you count all the cops he shoots on screen, in addition to the gunshots he fires offscreen, it adds up to exactly 30.","In John Wick Chapter 2 where a fight scene has finished between these two significant characters, the train announcement says “This is the end of the line”, relating to to how their conflict has ended after John saved his life...","In Wes Anderson’s Fantastic Mr. Fox, Mr Fox can be seen wearing his “yellow corduroy suit”. The suit was based off of a pair of Wes Anderson’s own trousers that he sent to the Puppet Crew. “Wes sent us his trousers so we could match the corduroy”- Ian Mackinnon (head of puppet crew)","At the end of The Thing (1982), Childs' breath isn't visible. MacReady's breath is clearly visible with the same lighting.","In the 1993 film \"Searching for Bobby Fischer\", Josh plays a girl whom his father says is \"ranked 82nd\", the girl is Josh Waitzkin's actual sister, Katya.","The software to create the black hole in the movie 'Interstellar' is a full implementation of Einstein's equations in 40,000 lines of C++, and rendered thousands of 23-megapixel IMAX frames on a 32,000-core render farm at about 20 core-hours per frame.","At the end of Back to the Future III, you can see where the production team painted over the Lyon Estates signs from the Alternate 1985 in BttF II.","In Toy Story Woody is trapped in a crate which is stuck under a ‘Binford’ tool-box. Binford is the fictional tool company in the TV show Home Improvement which starred Tim Allen, the voice of Buzz Lightyear.","Rewatching “Good Time” and noticed the sign in the upper right of the frame during the final scene. Benny Safdie, the actor playing Nick, directed the film with his brother Josh!","In Jurassic Park III, Grant asks if Eric read Malcolm’s book. Eric’s dialogue mocks critics of Michael Crichton. “It was kinda preachy, and too much chaos—everything’s chaos. It seemed like the guy was kinda high on himself.” Specifically Andrew Ferguson of the LA times who said a JP film would flop","In Thor: Ragnarok, the device on the wall in the background is the same one used in Doctor Strange during the battle with Kaecilius","In Scott Pilgrim vs the World, Knives says the word 'love' to Scott exactly when it would be said in the lyrics of the Clash at Demonhead song heard later in the movie, an instrumental version of which is playing in the background.","Jody’s line “say adios to your huevos” in The Hateful Eight (2015) is a nod to Stiglitz’s “say auf wiedersehen to your Nazi balls” in Inglorious Basterds (2009)- both directed by Tarantino","At the beginning of \"The Usual Suspects\" (1995), Keyser Söze is seen with the things Roger \"Verbal\" Kint claims before his release at the end of the film.","In Batman v Superman: Dawn of justice, in Wallace Keefe's office there's a homage to Action Comics #1's cover with Superman lifting/shoving a car, Superman's first appearance in comic books.","In Silver Linings Playbook (2012), when Pat (Bradley Cooper) is chasing after Tiffany (Jennifer Lawrence) on Halloween night, they stop in front of a theater that is playing \"Midnight Meat Train,\" which Cooper also stars in.","In Psycho 3 you can see the book Mary Loomis (from part 2) was reading laying outside the Bates House","Isle of Dogs, Oracle can make predictions through the TV of this time period. Dogs can't see images from a Cathode Ray TV, which makes her special!","In Disney’s The Rescuers (1977), Orville the Albatross is seen using a runway and requires a running start before taking flight. This is because albatrosses in real life also require a running start due to their significant size and weight.","In Split (2016) Casey's marks of \"purity\" are visible during the initial attack.","In It (2017) you can hear a trapped soul screaming for help when Pennywise shows his Deadlights.","In Cars, the flies are actually tiny cars with wings.","In Yahşi Batı(2009), character Aziz Vefa calls a pastor as \"brother\" and pastor says \"It is not brother, it's Father\". In real life, two actors are brothers.","In Pixar's Coco, this skeleton' s photo is on the ofrenda of the dentist office in Finding Nemo.","In Yellow Submarine (1968) when Ringo is exploring the psychedelic submarine, he pulls a random lever against the wishes of the captain, Old Fred. Ringo explains, \"Can't help it, I'm a born Lever-puller.\" This is a pun on Liverpool, the Beatles' home town.","In Napoleon Dynamite, Uncle Rico references how he could have won the state championship in 1982 if his coach put him in the game. Later in the film during the time machine scene, the machine is set to 1982 before Napoleon tries it out, Uncle Rico having tried it first.","In 2007’s Enchanted, Idina Menzel’s character is poised to marry Patrick Dempsey and become a stepmother to his daughter. Her character’s name, Nancy Tremaine, references Lady Tremaine, the evil stepmother from Cinderella.","At the beginning of Coco, Mama Coco calls her great grandson Miguel by the name Julio. He has a Papa Julio, meaning he reminds her of her husband (or other relative).","In 'The Incredibles' scene where Syndrome shoots down the plane, the debri sinks into the ocean and flashes an 'S' for Syndrome.","In John Carpenter’s The Thing (1982), For the scene where Dr. Copper gets his arms bitten off, two shots that each lasted only a few seconds, had an actual amputee standing in Richard Dysart's place wearing a mask in his likeness","Doc’s clock collection has an interesting bit of foreshadowing in the opening of Back To The Future","In Iron Man (2008), Tony Stark overloads his arc-reactor. He is knocked back by an initial explosion while the iron monger is not, because his suit is more \"conservative\" (as spoken earlier in the movie) and lighter. This causes him to be outside the sky beam of death. (youtu.be)","In \"Animal House\", Delta Tau Chi's fraternity slogan is \"Ars Gratia Artis\", the same slogan that appears on the MGM logo","In Toy Story (1995), when Woody and Buzz are trapped in Sid's room, we can see that Sid owns a copy of an army technical manual on Improvised Interrogation techniques","In the opening scene of Scooby Doo 2: Monsters Unleashed, shaggy stops and recognizes his fans by the smell of weed","In The Conjuring 2 (2016) the letters on the shelf spell Valak, the demon Nun that Lorraine believes is stalking her family.","Biblical clues in the Unbreakable Trilogy: the main characters are all major Bible figures, and portray the overall Biblical narrative. (Details in comments)","In Pacific Rim: Uprising's Tokyo battle scene, a Gundam statue is located outside the building for Anaheim Electronics, the manufacturer of many mobile suits from the series including the eponymous Gundam","In Terminator 2, Judgement Day, the guy that Arnie tosses through the bar window is still visible on the hood of the car where he landed.","The monster in the 1998 Godzilla movie was later confirmed to not actually be Godzilla. The monster is based on a minor opponant of the original Godzilla and is known only as 'Zilla'. Zilla would make a cameo in a later Godzilla movie.","[Angels and Demons] Moments before the Preferiti is killed in Saint Peter Square, you can spot the assassin Mr. Grey carrying him through the crowd.","Steven Spielberg’s hidden cameo in The Lost World: Jurassic Park.","In Leap! (2017) the main villain, Regine Le Haut, has a hairstyle that makes her entire head resemble a black heart, which foreshadows the terrible acts she commits throughout the film.","When Butch escapes the pawn shop in Pulp Fiction he sees a neon sign that says 'Killian’s Red', but as some of the letters are missing it reads 'Kill ed'. Picking up Zed's keys, Butch looks at the 'Z' on the keyring, subliminally spelling out 'Kill Zed'. It's then that Butch goes to save Marcellus.","Game Night uses the tilt shift effect to make the scenes look like a game.","When the mall is getting seized in Paul Blart: Mall Cop (2009), customers try to warn Paul Blart through the glass to no avail","The bear seen in Borat (2006) can later be seen in the movie in the fridge of a hotel.","In Batman: Assault on Arkham (2014), when Harley is looking through hers and Joker's old stuff she throws out the mask from The Dark Knight (2008) and Batman: The Joker is Wild (1966)","In Spider-Man 3, a reptilian skeleton is shown behind Dr. Curt Connors; who in the comics, becomes Spider-Man's enemy: the lizard.","In Inglorious Basterds, Shosanna's theater has a poster for L'Assassin habite au 21. Its about an inspector looking for a killer in Paris. Also Shosanna was reading Le saint New York which is about an inspector looking for a killer.","In Looney Tunes: Back in Action in the Area 52 scene there are Daleks from Doctor Who","NSFW - In Bound (1996), there's a picture facing the door that can be seen only twice. First time it is a landscape, then, as the plot thickens, it changes to a nude figure in chains","Movie: Fury. During a scene where the character Norman is trying to seduce a young woman who doesn't speak English through palm reading, he remarks her palm says she will only know \"one great love in her life\" later that day after planing to contact each other her building is hit with artillery.","In Indiana Jones and the Temple of Doom, after drinking ‘The Blood of Kali’, you can visibly see the light in Indy’s eyes go out.","In Kung Fu Panda (2008), Oogway says to Shifu, “One often meets his destiny on the road he takes to avoid it.” Later Tai Lung escapes prison using a feather from the messenger that Shifu sent to increase prison defenses.","In Interstellar on the water planet, the soundtrack in the background has a prominent ticking noise. These ticks happen every 1.25 seconds. Each tick you hear is a whole day passing on Earth. (Math in the comments)","In 'A Quiet Place' 2018, in the dinner scene, the characters eat there food with their hands, because they dont want to risk making noise with normal silverware.","In Unbreakable, Elijah's mom foreshadows the end of the movie with his first comic book: Active Comics featuring The Battle with Jaguaro.","In John Wick Chapter 2, after John gets his car back, you can see his tags still say 2014 from when the first movie was made and the last time we saw the car.","In Coco, Miguel meets his stray dog next to a table selling alebrije (spirit) figures which you see later in the movie","In The Terminator (1984), the police dispatcher announces a “211 in progress at Bob’s Liquor, on the corner of Third and Cameron”. The Terminator is the third film directed by James Cameron.","In Moana when Maui's hook is cracked by Te Kā, his transformations aren't the usual blue but instead are purple.","In Howls Moving Castle, during an aerial chase scene there appears to be a group of protesters being shot at in the background by soldiers. Adding another detail to the movies anti-war message.","In Ready Player One (2018), Aech didn't have time to finish the Iron Giant before using it.","In Tarzan (1999), when the gorillas pick up Professor Porter and turn him upside-down, a beanbag toy of Mulan's dog, Little Brother from Mulan (1998) falls out of his clothes.","In Fantastic Mr. Fox (2009), a plane in the background is flying with a banner saying “Boggis Bunce &amp; Bean International Supermarkets” during the Whack-Bat scene. This foreshadows the ending.","In La La Land (2016), when Sebastian visits Mia at the cafe where she works the music in the background is \"When I wake\" from the Whiplash soundtrack, director Justin Hurtwitz's previous film.","In Hot Fuzz they reprimand the Hedge Trimmer for cutting down someone else’s hedges, later when they run from the sea mine, they can be seen jumping over trimmed hedges","In Top Gun, the pilot's voices transition between filtered and unfiltered depending if they have their mask on.","In Spider-Man (2002) Peter's wallpaper is made up of spider webs.","During the opening scenes of The Boss Baby, after Tim’s father asks him how he would like to have a new baby brother, Tim drifts to sleep while watching his marble machine. He then dreams of his new brother as the marble. He wakes in the next scene and you can see his inspiration for his adventure.","The infamous \"door\" in Titanic is based on a real piece of woodwork recovered from the sunken ship","In Saw II (2005) When Amanda First Wakes Up She Immediately Checks Her Head For A Reverse Bear Trap","Since the Minas Tirith and Minas Morgul are twin cities, they made a point about portraying it in Lord of the Rings: Fellowship of the Ring, even before any of the cities was named by the characters in the movie.","Each 'The Hobbit' film changed the colors of its opening accordingly.","High Fidelity - Rob's crime","In Big Fish, Ewan McGregor's character says that when you meet the love of your life, time stops. But this causes time to 'catch up' so all the performers and patrons are gone by the end of the scene. But the ring leader and giant remain suggesting that they fell in love at first sight.","2000's X-men is the only film where Storm has a Kenyan accent, indicating her nationality from the comics. For all other installments, Halle Berry used her own American accent.","At the end of Disney/Pixar’s Ratatouille (2007) Anton Ego is a little bit fatter. This is especially poignant since he states, \"I don't like food, I love it... if I don't love it I don't swallow.\"","In ‘The Avengers’, there is a small screen showing the heat signature in the room where Loki is being held which shows that he has a cold body temperature because he is a frost giant.","In Mad Max: Fury Road (2015) director George Miller purposely removed frames in scenes to make you feel as anxious as Max.","In The Incredibles (2004) Frozone isn’t using a pet name in the line “Honey, where’s my super suit?” - it’s his wife’s first name"]