["Understanding the new upvote/downvote arrows (+beautiful infographic)","Weekly verbal infuriation thread - August 24, 2018","The package delivery service at this building","Unacceptable.","So youtube is demonetizing people for not being “kid friendly” and for using the wrong tags, but allowing ads like this to pop up? I’m not even an adult yet. And I think they just ruined peanut butter for me.","These reviews.","None of the sticky labels are sticky anymore","This is basically an add right? A pretty far fetched at that.","How my friend eats pop tarts","This guy didn’t like the news station playing at Firestone, struggled to change it for a few minutes then ended up walking out entirely.","As a brit this really annoying","Damn I love walking so much","A person recently posted that Mint Chocolate Chip ice cream is disgusting, said it was like frozen toothpaste. Guess what BuzzFeed posted.","My mom sent me these pictures just to mess with my head","Anybody over 6 ft. understands the mild infuriation of mirrors that show you from your chin down (aka 80% of mirrors it seems).","Show the veteran some justice!","I took this amazing picture of my car but my sunglasses are in the shot.","These stupid rules on r/showerthoughts","The elephant not facing forward","My dude, its a private carpark and there are no spaces next to you.. at this point you're just blocking the exit.","Y tho","When a font can't deal with apostrophes","My dog refuses to go outside without a toy but never brings them back so I have to pick up after him. But I can’t stay mad at him he’s too cute.","This trash can where all the openings go to the same place","Pissed myself while pissing.","\"I would give him 10 stars, but since I can't, here's 4 out of 5\"","If you haven't used the damn product don't give it a mediocre review.","There are trash cans on front of every store and this is where people decide to throw their trash.","Um...","This mistake on the official South Park Site","Amazon trying to give me a 3.41 refund and charging a 48.00 restocking fee on a 52$ nintendo switch game.","App icon redesigns","This \"salad\" that came with my Bento Box","How these cans don’t fit together.","I bought these $100+ sunglasses less than 6 months ago...","Nice parking","Netflix actively striking down criticism on Youtube about a movie they helped with. Fair use by the way.","Candidate must have bachelors degree, 2 years experience and pitch/host/edit an entire show for \"internship\" that pays $0.","The powerwashers realised they got the wrong house, but at least we got a free sample","This","The new reddit mobile design ruined my day","The glare from a window behind my couch... And no it doesn't have a blind.","Glad they allowed us to skip!","“Your package has been left in its safe spot” yeah yeah okay.","Great design Starbucks....","This is how my mail carrier delivers my mail in the rain.","Oh, yes. No one's gonna stop me.","This poorly designed/kept arch...","And of course the cart return was empty","The most mildly infuriating 23 seconds of my life (that’s what she said?)","Another Holiday to deal with.","5 minutes apart...","College apartments are so spacious","This Customer's Desired Delivery Schedule","Meet my roommates","Not only is it an ad, its also a repost","So close","Ya I think I’ll pass","My Professor strictly uses this font. I may die this semester.","Websites like this","7 Pizza hut locations within 5 miles of my house, the closest being 2.3 miles away and im told i cannot get a pie delivered to me. Wont even let me order online fpr carryout because the address linked to my account \"doesnt exsist\"","When the first book of a series isn't available but the second one is","Wow","Got the most watered down iced tea of my life so I had to get another one","People that do this","The numbers on this game isn’t in the middle of the circle","I only bought this \"mix\" because I really like arugula :(","The Profile Pic for r/Perfectfit isn’t a perfect fit.","These labels..","This ad on r/stopdrinking","This guy driving over fresh concrete","Ads that try to be funny like this.","This fucking guy who parked at the exit whilst he paid","How do I terminate a friendship?","Seeing the same recycled post over and over, we all get it! You dont like it when people remove comments in an interesting conversation thread or when an entire comment section gets removed. We dont need 8 posts a day on this subreddit to remind us!","The brickwork above this elevator.","This wifi password","Gross","Bait ads like this on Reddit, that start with “TIL” or “TIFU” to make you think it’s a legitimate Reddit post.","I tried to open my Arizona...","The way this guy is folding his arms","This one random tile","These elevator floor tiles.","Not even one of them (X-post from r/crappydesign","Well crap","The “profile pic” of this sub is off center by a little bit","Some of them are broken.","Water shows the colored ink that went into my \"black and white\" print.","I mean...","Walmart doesn’t tell you the unit price of batteries - possibly the only thing I want to know the unit price for","This entire Instagram channel stealing content from r/showerthoughts","That my parents thinks this works","One can is upside down","These kinds of dictionary results","You are a horrible person if you do things like this for likes","People who do this","I ordered steak with shrimp and the box said steak + shrimp. Apparently chicken is land shrimp.","These sinks with three different types of faucet handles.","The block M on the 50 at Michigan Stadium is off center.","I must be missing something","750pc puzzle missing 2 pieces","This notice board is drilled into the concrete like this","Humans that do this WHY?????","The fact that 20,000+ people liked this post that is honestly disgusting, the kid is 15 and they’re talking about him in a sexual context.","If only there was a way to listen more clearly to who you’re speaking with instead of speaker phone...","Why would you build hotel like this?","He Knows What He Did","When people do this. Fun fact this is a employee restroom, primarily used by the janitorial staff at my work.","Comcast's online plan offerings if you want to downgrade to just Internet.","What kind of mouth breather does this‽","Could they have picked a worse place to leave their unwanted items?","This is literally the worst","When more than 50% of the screen is ads","My “quartered” pickle.","Why? Why would you do this? (Excuse the poor photo quality please)","Guess they couldn't be bothered to put it back","Tiles","The life of a new Redditor","Does this count","North wears her clothes over her hair and I CAN'T UNSEE IT. WHY.","Trying to do a system restore on an old iPad mini. Starting to pull my hair out.","Thanks, Reddit.","I really wonder what goes in their minds thinking that this is ok.","Spectrum Advertises 100Mbps Download","I made a crosspost on r/pewdiepiesubmissions and someone called it a repost","This is not a discount.","Girlfriend placement of hook on back of bedroom door","This is the result of Common Core teaching 😳","My Ben &amp; Jerry’s chocolate chip cookie dough slice had no chocolate chips or cookie dough.","This “checkerboard”","Grammarly at its best","This is how my day is going.","Spam","This sink, mirror, and vanity light combo","My little sister got a government survey thing in the mail. There was a puzzle with an intentionally missing piece in the envelope.","So which is it?","Just another day on the Farm!","When you try to open an envelope and this happens","The way these slices are arranged to look like slices from the same sandwich sets my teeth on edge.","Broke AF? Why not buy something..","The way my teacher has these books with letters set up.","Super misleading ads being promoted on Reddit.","Just tried to open a smoothie drink... How in the world","I hate this...","Our brand new Milling control panel at work","I think it might be a feature at this point","Reddit trying to ruin my plans.","I keep getting emails from eBay like this","There is no fucking gift.","Annoying af tbh","It took me a few seconds to notice","The way they positioned the closest sprinkler box","Grabbed my friend’s phone and witnessed this abomination","When You Have a Problem and You Find This","How long does that tag have to be.","This mess in the smoking area.","This fence on the side of my daughters dollhouse.","This rogue chair at the hospital today.","Having to complete seven of these in a row to change your password","After updating Windows 10, I suddenly have a shortcut to Microsoft Edge on my desktop.","My Toilet Literally Overflowed","I hate whoever did this","Bus stops directly in front of Georgia Dome implosion....","Everytime someone does this.","This guy parked his car in front of the restaurant","The amount of retweets on this post about Tesla","Inconsistent spelling","The height of the mirror my brother in law installed","Ordered a logitech g403 from Amazon but got a logitech g203","Post must contain post flair","My ice cream didn't have the gumball at the bottom.","This gym has a ice cream menu right in front of my workout bike","Every time...","This bullshit","How off-center this sticker is","This shit","Whichever nutcase thought this was acceptable.","I guess if we press the button we walk in to the wall","Floor tile in my local mall.","Netflix lying about not having ads in their emails","At the school I teach at... Nobody else notices a problem...","Misprinted butter label that requires guesswork.","Mistook sunscreen for toothpaste","Umm. Why does it have to be a long title?","My local McDonald's recently remodeled.","This Asshole.","Bought a lovely [cheap] bottle of wine after work and attempted to open it...","Sometimes this really drives me crazy.","When I tap on an Outlook notification","Everyone posting about the new reddit app icon on this subreddit","When your dog opts to enjoy the shade on a humid 90 degree day and NOT do her business!","During commute hours no less","Reported an ad for covering the article... Thanks google","When Your Family Group Chat is a Year Behind the Trends...","My local sushi restaurant with its constant Windows errors on its menu","When people eat something before paying, and then just dump it on a random aisle.","10/10 user experience","So I left my charger at my cousins house... it's somewhere in there.","YouTube gave me a 12 minute unskippable advert the other day. Has anyone else noticed longer unskippable adverts since YouTube brought it in its premium subscription service?","Apparently spring is really late this year","Can pay almost 80 dollars for lunch but can’t spare a dollar for the tip","This wheelchair accessible bathroom mirror","The person who does this at the office","Due to the new data privacy law in Europe websites now need to tell you how they use ur data etc. I was trying to opt out. Well","All the icing just came off my doughnut and stuck to the wrapping","Went into class today and saw this on the Whiteboard.","The punishment for those who want the things done right.","This sub has more people online than it has subscribers","This new reddit UI update.","I live in Australia...","My daughters stuffed fish","My friends idiotic email.","Who cares amirite?!😂😂😀","Spent too long trying to follow the arrows in the right order, don't know why it's not just organized by season instead","Windows added a shortcut to Edge on my desktop after the latest update.","The sleeve doesn’t match with the case.","When A Bag Opens Itself...","You can't tell the new Philippine coins apart, until you look closer. Meanwhile, you could easily distinguish the old coins.","This telephone pole in the middle of the road. Only in Pennsylvania.","This came with the binder...","Having to wait for your game to download. Call me old but n64 would never.","the struggles.. lose or lose","People who feel the need to take up two seats at once","ESPN, can you even math?","The release order for the games is Hotel, then Roots then Paradise. The chronological order for the games is Paradise, then Roots, then Hotel. This is the order Steam displays the games in.","The way the drain doesn't line up - gotta love construction.","Instead of having discourse, just block me when I disprove your point, that’s productive...","This floofy jerk who knows he is invisible to my cats while sunbathing on the porch 🙄","Resealable package with a pull tab that was too high","These unnecessarily long Reddit ads on the sidebar","We made dinner tonight, and forgot to check the oven before preheating it. Fiancé says the origin of this plastic tray is unknown.","Who thought this was a good Idea???","Literally unplayable","These kitchen exhaust vents","Winning the race in lane 0.","What. The. Fuck.","This single dead pixel on my monitor","these dates on a spreadsheet i use at work - i can only view it, not edit it.","When my friend makes tea and puts the milk in first.","People on freshly made road","Got a bag of Cheese ritz bits, this abomination was the only thing inside it","The plumber replaced the leaking cold tap","The design of the new mobile app logo","All these apps that look the same","This one tile in a flat I delivered to","It’s ICE. Frozen water!!","Excessive fees. This rental price doubled due to the fees added on.","I mean...they literally...never mind.","Mods ruining my master plan.","All this rubbish left after Leeds festival, UK.","r/all","\"This product currently has limitations on submitting reviews. There can be a number of reasons for this, including unusual reviewing activity.\" OR maybe it's because your product sucks and you don't want anymore 1-star reviews?","Bangalore Airport's Air Traffic Control","Why put it on the angled bit of pavement.","This tag on the glove.","This nonsensical bloody r/madeupbloodysubredditsashashtags nonsense","Ok...","When you leave YouTube to say hi to your friend and it decides to update at that moment of all","this might be a bit more than ‘mildly’.","This egg holder","Out of the entire box of straws this is the one I grabbed for a customer","When your looking for something to watch and find it, but realize it goes off in one minute","Seriously","My sister’s drawers are always like this. Even when I fix it it comes back by the next day.","When nothing lines up","Turning lanes are suggestions, right?","Going 5 MPH in a 25 MPH zone.","These two desk rolly bar things. I already had to remove them, double check if I was blind, and put them back on.","Getting these monstrosities in the mail every week","This traffic light button hidden behind a road barrier","“Get stuff done”","A collection","The number of champagne glasses is prime","This WhatsApp bug","This Elevator button at an Airport","How do you miss this opportunity??","I wonder if this mildly infuriates the visually impaired","They were downloaded one after another. Build God, Then We'll Talk was downloaded with the others in that album","Every sink, towel dispenser, soap dispenser and urinal (there are 3) are at different heights.","Reddit ad that is low-key porn","my reddit mobile cover photo","The 1800 Contacts Site","Integrated Reddit ads","The trolly park is literally 10 feet away!","The way this escape room writes its dates on the calendar.","I like that confession","Only the worthy are allowed","Look at the power line...","When you see the same post 3x in a row","This bathroom wall tile at [redacted corporation]","Two years ago I bought museum tickets during a visit to Chicago. Groupon has decided I live there.","I hate when people leave the protective film on. But this is too far.","This branding","When you don’t have enough falafel pieces to form a circle.","This string of ads","people that do this","Tweets arent being embedded in my browser, so I have no idea what the article is saying.","Reddit ads","repap telioT","Major subreddits with mods that don't have the time of day. Why even volunteer to be a mod then?","How my dishwasher was loaded this morning.","There’s no “report ad” button (inappropriate content at my age)","People that leave the foil seals on anything like this...","Doesn't rhyme","More like 49%","Cups with a hot beverage where I can't put my fingers in the handle.","Thanks for clearing that up.","Special Kind Of Stupid","Reddit’s new mobile icon change screwed up my rainbow thing I had going on","If I'm in an alternate app it's because I don't want to use your abyssmal official one","A single track from a stand-up special is unavailable on Amazon Music","This misaligned manhole cover on the D.C. metro","Why","This trivia question in my English textbook","Just go around the fuck**g edges","If only you could tilt it a little bit…","The way my son opened this box of chips","nooo come back, please i need you","The order of my answer choices","These wire earrings are $90","The official Play Station notebook has the colors of the buttons wrong","First it was parents, than siblings, now this?","Getting spammed through reddit chat, with no option to report or disable it altogether.","This fire alarm cover.","Neighbour cuts down bamboo over fence because \"the noise in wind annoys him\"","My gym is missing a 3kg dumbell, irritates me every time I pass it.","Buying a home that is 500k, end up paying 2.5x that.","The dishwasher was easier they said.","I find these stickers all over my town.","New password requirements are getting ridiculous...","Figures","I took one movie too many to my dorm.","Reddit mobile changed its icon which used to look nice against the dock","Software inbuilt redundancy at it again","This light combo at work","The New Logo for the Reddit App","Oof","Hey, do you have staples?","When there are no open seats on the metro","The pure infuriation of losing one seal on my earbuds","Reddit crashes when I click a trending post to get rid of the notification bubble","It literally says it on the box","When mymathlab decides you’re wrong","Why tho????","Two manhole covers on the same street.","Sitting on 100% for 5 or 10 minutes.","What is that","\"It's not *our* fault our website keeps crashing, it's yours!\"","Polling place, this isn't right.....","School so cheap, they sell this shit","“Official Sponsor” of the NFL, but doesn’t get the AFC North/East divisions correct","I know this isn’t the right sub for this, but I saw a lot of people complain about the new iOS Reddit Icon","What number is this toy race car?","My phone wont let me type the word \"🐶\"","Breakfast, lunch l, and dinner i guess","The middle seat on the back of my bus isn’t in the middle","Errr... no?","When the speed limit tracker just straight up mocks you in highway traffic","The ever-so-slight misplacement of the sticker on this macbook’s logo","Home Depot's Labor Day \"sale\" that marks up the original price, then applies the discount. Only two items are actually cheaper, one is more expensive. $189 savings on $6k of appliances.","Oh, that should just zip right back up","I’m about to quit my job because of this fucking 4 in the elevator","Something doesn’t belong here","Lock in a bathroom stall","When people never open the safe.","Two ACs. Same brand. Same size. Same functions. Buttons in totally different spots.","\"I haven't been, but I'd say it's three stars...\"","Now that I saw this concrete line I have to look down at it every day on my walk to work.","This movement activated light which only turns on when you go to the next floor","These floor tiles in the restroom at my office","This fortune has different lucky numbers depending on language","We had a few damaged tiles at my workplace, so we got a new tile job. The color is off, and the whole store has these mismatched tiles scattered around.","I googled Colombia population of","I do not like sushi","Instagram and Facebook have an extremely suspisious address even though it is totally legit and freaks me out on every email I get from them.","5 Renown Short","This restaurant menu","Samsung now puts ads in mobiel internet.","People that park their scooter like this.","These thumbnails","Ads during the ending of a movie","Great, thanks for the help.","The way this gold is stacked","When you organize your apps by color and an update changes the color of the app.","\"good game\" - 1 Star. Thanks man.","How my professor writes on the board","uhh","This sink","The perfect spot to spit your dip","Teespring sent me an ad before they responded to my ticket (the two emails were 12 hours apart)","All letters in the 7/11 logo is capital, except the n","Walmart parking lot laziness","No matter which way you put it, something wouldn't be aligned","Instagram won't let me view profiles unless I sign up.","When you turn on the shower without checking on the results of your cats' midnight shenanigans","Having to schedule off work for a whopping $6.00","The way OP spelled “razer”","The ad's sized compared to the video's one i was trying to watch","When you lose 2 hours of progress to shit like this","The fact that the Upvote/Downvote arrows aren’t consistent","These colors on the sink are wrong","they're supposed to be in sync","These things","Mk yea cause this makes sense","Somebody decided to stink up the elevator by leaving their trash in it","Well now sandwiches are ruined for me...","When you only use ~1gb of your phone storage and its full","Thanks for keeping my notifications in chronological order, Facebook.","Mom sent me this out of focus picture of the electric rice cooker asking 'is this normal for it to happen?'","Braille fail","Can’t believe I married this kind of person.","I can never look at the floor again..","This subway seat..","Amazon recommended me a single knockoff AirPod retailing at $679 with 119 unverified reviews","My friend has been using his old iphone 6S case on iphone 8 for one month.","Im flying on an airline where you have to pay extra for an entertainment package and the screen is broken","The way my teacher stapled the packet","The school i work at redid their floors and the new tiles have no pattern and seem to have just been laid down randomly.","Found out my dorms bathroom doesn’t have a drain. By walking in, in my favorite socks","Never even signed up for their emails to begin with. Guess I have to so I can unsubscribe?","Such a missed opportunity.","Amazon Q&amp;A's like this....","Vending Machine Gambling","Clicked an ad for a product I liked on FB, but couldn’t view it due to a mandatory email form.","Why are cookies called cookies when they are baked, why are apartments called apartments if they are together","This is fine..","It doesn’t make sense 😰😰","The way Vans soles are made","My apartment complex just repainted my patio","Damn it Reddit, you just ruined everything","Just why?","CD seals.","The swapped colors on this sink","It was a good one too","The spacing between the ‘L’ and ‘I’ all over these officially licensed Lions pajama pants","This cpu fan","This clickbait garbage on my feed. Like, who came up with this?","My sisters lawnmower broke on her last patch of grass to cut.","This “Wish” ad that is obviously total bullshit","Service fees almost tripling the cost of this AirBnB","When an app needs to 'Download new content' after being installed.","So much for that...","everything about this","Now why didn't I think of that.","Which monster puts the weights on like this?","Grrrr","Getting these robo calls all day","Amazon Add-on Items..","Silica bead stuck in my headphone jack.","The official 20$ LEGO Storage-Brick ladies and gentlemen!","My sister only eats the m&amp;ms and chocolate chips in trail mix then leaves all the raisins and peanut butter chips","Thanks ubisoft! I only play on console so I can use my PC after, no other reason I only play on console!","Videos do not work well on the Reddit app...","Based on few people’s opinions.","Good one Netflix","My table tennis bat, which broke 5 minutes into playing.","Floor tile in an auto shop.","Already not having a good day, this is the last straw!","I sent a note book to a transport boss who left it in my restaurant - at my own expense - couple days later I got a 4 star review. Thanks! I guess.","Captchas like this...","His school won't allow him to check his schedule a day before class","The Asshole Plugs: Plugs like these that end up being too big for an extension cord and force the multiple spaces next to it to become unusable.","Implying I broke it.","A chance to have an iconic logo in fitness was completely ignored.","Let’s just take up parking spaces because we’re lazy.","This bottle remaining sealed after removing the seal","The way my roommate cuts butter.","Bouquet I spent about an hour picking out and ordering vs the one received.","Thanks for ruining my kid's cake topper","The carpet has a wrinkle in the middle of the living room we can’t get rid of.","You can run, you can hide, but you will never escape advertising.... (typing “what the health” in my phone puts a link to a movie i can buy!?)","“How are you reading that” my band teacher","This shit!","This hotel directory.","The not-so-secret ingredient...","Throws you on their main page and doesn't let you read articles unless you agree","The pause button on spotify isn't exactly centered... &gt;:(","Well ok.","We were on the verge of greatness!","This oddly satisfying Snapchat ad","The tiles at my school","Google seems to be colourblind","Instagram has updated loads of times but the app icon has never changed on my phone.","People who try to act smart, even though the meaning of what the person is saying is pretty clear.","Take ALL the top bags before you go down a level.","come on british airways make up your mind","I get that it’s cute, but 6 times, really?","You weren't even close","3 identical cups, 3 different lids","White Sauce?","Waiting on steam","Been playing Candy Crush since the day it came out and still have never landed on the jackpot","The sheer amount of wasted space on weather updates","Ups guy dropped off 10 pound package at the top of my driveway instead of going down it","Death Wish o&gt;o Split","The \"trash\" could have helped someone who needed it more","Sign for an ABC Liquor Store","These bottles","The State of YouTube Trending","The ELI5 bot","What is wrong here?","I just love clickbait on Reddit","It was just icing and crust","My post on r/sadcringe got 8.5k upvotes, while my account still has 5.9k karma.","Reddit telling me what is trending on r/mildlyinfuriating","The color of iced coffee made by someone who clearly doesn't drink coffee.","Please fix","The new reddit app icon on iOS is a circle inside a square, instead of just being a square.","Pure horror soap","The way all the scales in this store are under calibrated so you end up paying more than you think you are going to if you dont check before putting your produce in.","Shopping Center parking lots that think putting massive decorative boulders in the middle of tight parking lots is a good idea.","The condition my brother leaves his bathroom in...","This stack of books in my French class","This Trump performance survey where the only options are great, good, okay, or other. (It also signs you up for phone calls)","So, how much charge do I have?","Reddit won't let me log in on my computer.","I think it’s funny but my girlfriend won’t when she has to put the dishes away","Sink broke and guy who fixed it replaced it crooked","A good car scrape at the local atm","I can't take this anymore","the way they installed this fence at my neighborhood.","The masonry design on this apartment complex.","I told them my name is Kai. I clarified it twice.","Got upgraded to first class today.....think I'd rather be in coach!","Please let me see what happened...","Washing machine at my college uses this lettering instead of making the ‘o’ and the ‘n’ capital which spoilers- they could.","Woohoo! It’s on sale!","USA Today added an Extra T...…..","The sticker on this stain","Saw this earlier today in town and thought it belonged here.","When you organize by color but reddit decides to cause a bit of mayhem...","So now we’re advertising garbage like this?","If I were the op I would die.","Going to Chrome app because for some reason the same video won't load on the Reddit app","Nike, San Francisco - That one yellow ball","Reposts in general","When you think you got a text but it is this shit","This is the worst","This new Reddit’s icon on IOS (iPhones)","Reddit’s new icon screws up my color coding","Someone seriously wants karma","This is gonna take a while","This article about a data visualization does not include the actual visualization","This table at a Chinese restaurant","Literally impossible to know for sure. Pure chance.","The owner of the red car threatened to call the police on me for “parking like an asshole”","3 of 2! How is that even possible!?","On the Now TV site... Twice","Cat doing this.","Beef jerky in Norway. 93 Norwegian Krone is roughly 11 US Dollars","When reddit changes their app icon and ruins my color scheme","When people leave the microwave like this.","Really? Never seen this before...","This advert puts a fake cross for people to click on to close the advert but instead it directs them to the App Store to download it","Opening a starburst and this bs happens","All of the icons are circles apart from snapchat, fml","The 2","My eBay account was randomly suspended, even though I’ve only used it once in the past few days.","Not sure which is more annoying, the passive-aggressive tone or the inconsistent capitalization...","The person at Chipotle wrapped my burrito with the guac on the outside","This bench in a mall in Norway","Thats a bit expensive for a T-Shirt don't you think?","People Who Do This","This family’s Christmas card.","over half the descriptions on this board are wrong or misleading.","Call of Duty: Black Ops series does not list in alphabetical order.","my grandparents have a couch and a love seat NIETHER of them are pointed at the tv (offscreen)","I love my home, the roof is so great.","When the pull ring fails","Nice Florida weather as always","Took three minutes to even get to the unboxing part of the unboxing video","Cheap bent micro usb charger that I just got a couple days ago","The inconsistency of my school district's high schools' webpages","My husband sent me this with the message: “Something your Reddit community will appreciate”.","Oh come on now!","Glad this is in my hotel and not my house.","I mean, I know clickbait sites get content from Reddit but seeing my only front page post get ripped off like that was mildly infuriating","My life gets harder every minute","This Manhole Cover/Paint Job","Putting an application name in quotations and none of the results include those words","Reddit’s new iOS app icon. 😡","My girlfriend is unable to properly use the lines on a sheet of paper.","When someone leaves this on the bag when they rip it open.","A two pieces of paper towel fused to make one.","It must be reslly important","How the blue and purple don't line up","v.redd.it - How can you be this bad?","So I... want to.... what?","Why is this what people are interested in. Who really fucking cares!","I won’t let you use PR for your marketing bullshit.","Figured out why these cards were on sale.","Different shades of orange","These stepping stones at a hotel I stayed in.","Trying to post multiple OCs","The price of this required textbook for my last semester of school. They jack up the prices everywhere else so you have to buy it from them.","Clicked the wrong upvote a few times. Fun times.","Nooo Reddit, why??","Having that bar of text over the image.","This Snapchat ad that stole someone’s comic, cropped out their name, and uses it to advertise","Apparently they know my first pet's name better than me...","The mobile logo redesign","Sitting next to someone w an open wound on a 6 hour flight (reposted w better pic)","Ok, tell me when something actually is wrong, instead of this every day with a pop up, prior.","Just when this lefty thought he caught a break.","Laziness to the max. I absolutely hate when people think this is okay to do to an establishment. \"Reposted for spelling\"","Newyortexican?","This trash receptacle has all three with on door.","Reddit’s new app logo","See if you can spot the problem","Women with above average boobs problems","MRW I get a notification for a post with 45 upvotes (Looking at you r/dadjokes)","Look at how many mid rolls this dude put on a 15 minute video","When frozen french fries do this shit","I just wanted to start a comment chain","How my headlights’ light beam is not even.","How the pokéball doesnt line up at all","Microsoft signs you out and requires a secondary email verification to delete your search history (which by the way is visible in the search bar on every device your account is linked to)","Always loading","Ordered the book over a week ago and this is how it arrived","At the bar, songs cost a dollar each. If I want to see the 6th song coming up in the queue I have to purchase 319 more songs.","When a new box of cereal is half empty","Wrighting a review to enter a contest to win the same product.","When the google update to the Phone app changed it to a different shade of blue than the Messages app","St. Mary's Basilica (Krakow)","Kids clothes with fake “adjustable” waistband","This tile pattern.","This drain isn't lined up with the tile.","This completely blank notification I can't get rid of","The weather in a airplane screen is slightly tilted","Not even a decent truck.","When your life is suddenly ruined","it hurts...","The way he complains and fails","When scrolling through a website and this shit happens","They wonder why people shop on Amazon instead","This is just a waste of soap.","Then why is that the only option given???","Went to get a drink at work and found this debacle","My phones back camera hasnt worked for the past 7 months and none of the \"fixes\" work.","Why would someone do this or how did they not notice?","what","When someone tries to help out by rewriting a deleted comment that gets deleted","Having Amazon Prime is fun, but this \"Tax\" is dumb. This happens to a lot of products.","This wall art","Get your stuff right google","My brother’s wall","Arrgh","The ridiculous size box these cufflinks were delivered in","Just 4 won't fit","This guy on a rascal in a drive-through","This sign at subway.","Anyone else hate this kind of stuff. Went through google to get a good example.","Reddit’s new update has permanently messed up my color coated home screen . . .","MHW level descriptors inconsistent... why do you cast a cloud over my inventory? [x/post r/monsterhunterworld]","Tried to pick up a wooden hanger. Stupid fingernails.","How the tile backdrop in my kitchen doesn’t line up with the cabinets.","Am I the only one who gets extremely annoyed when people do this?","When the box is incomplete","The \"Season ends in 5 hours\" warning is blocking the challenge text","This ad I got against net neutrality","There's a typo on my new vacuum's box","Buzzfeed just took posts from r/showerthoughts and didnt give any of the original creators credit.","Thanks, Taco Bell","Buying off eBay in a shellnut.","KSI vs Logan Paul is higher on youtube than news reports on a mass shooting","Youtube putting \"Get Youtube Premium\" in place of where subscriptions used to be","This panoramic photo.","Was searching for remixes of Stickerbush Symphony, but somehow it got typo'd as \"brush\" about, idk, 10 years ago and it stuck. I can't listen to the songs when I know the title of every video is wrong.","When people do this","Wooooooorldstarrrr","What I woke up to","Why is it backwards","This asymmetrical bathmat. No it is not the angle that is making it look weird","How lucky i am","These Locker handles at my school...","The quality of the image...","A repost getting twice as much karma because I forgot a subreddit existed","The reddit app icon changed","My pizza","Just because it's in a bigger package doesn't mean it's a better price","This bugs me so much","This ad covers half of the page","This manhole cover at the grocery store","These ads with impossibly small close buttons","Had a baby a couple days ago. My wife is the mother, I guess I'm just the 'support person'.","Reddit’s icon on iOS doesn’t fill the whole space","The simplest goddamn thing...","Freshman at my school took the entire bike rack for their two small bikes","The new Reddit icon doesn’t look like other social media apps anymore.","I literally bought this TV last week on Amazon","Why?","How FlooKooTV just reads content from reddit subs for his videos, and has thousands of subs 🙄","The drop menu on a Huawei has this little edge on one side but not the other","The door on this truck","Who knew the white ring was such a good design","These pointless posts just trick someone into liking a post","This scammy ad for homeowners that shows an unrelated video of a snail on a mushroom by a fake microphone.","The one guitar case that is larger despite all guitars being the same size.","The 50-cent Frosty deal was too good to pass up. Went to dig in only to find this!","This extra layer of plastic wrap on my bread","The Up and Down keys are just awful...","People who rush ahead of you into a Chipotle parking lot.","Who thought this was a good idea?","Trying to get information on car complaints only to stumble on this review...","I got 2. 1 when a iMessage sends as green and 2 was the text says","Dollar tree charged me a $0.10 deposit on this in OR when you can't return it.","Trending...","These upvotes and downvotes","At a GameStop in the middle of the day","Numbers don't line up properly with the rest of the decals","The \"𝑦\" in \"Universit𝑦\" is making me amazingl𝑦 angr𝑦","It’s kinda ridiculous that not only does Wired block you from using their site while using an Ad-Blocker, but now you only get 4 free articles of subpar journalism per month.","Walking the extra 4 feet to the cart corral would have killed them.","Reddit changed their mobile logo from dark to white, yet the loading screen is still dark.","Thanks eBay","This “check” that comes in the mail....","My fianceé leaves about this much of pretty much everything she eats...","This is a new one...","The way this picture isn’t perfectly centered","Why?!","When your internet is too slow to delete a video in time","Facebook search is bad and annoying","My girlfriend got this as a tip today","Cuz you need another reason to not pay attention in class","4rd","Reddit’s new app icon","The emoji on this eraser is off centre","FB - \"For my birthday I'm asking that you give to NAMBLA, a charity...\" Up yours, Granny. This goes in the same category as I bet Jesus can't get a like.","The way my boyfriend takes clothes out of the closet","Yet another shitty Instagram ad.","These hot and cold bathroom faucets in a mountain AirBnB. You get scolding hot or freezing cold, with no chance to mix.","What is this “crytocurrency”?! Can I still get in on the ground floor?!","Level will forever be uneven and he wouldn't care. (Also mediabar won't disappear)","Just gonna plot some data...Oh thanks for the...ohhh. weull, uh. Thanks.","Accidentally buying full size paper towels after adapting to select-a-size.","Really Dollar Tree... IT'S AUGUST!!!!","Hmm","Facebook moving the notification button to the far left instead of the right.","I can’t fucking find that last unread comment.","Seeing a geometric rhubarb pie on Reddit, then realizing the pie is off-centered.","#this#is#not#how#hashtags#work","We need you to make an account before we can update your drivers","the formatting on this billboard","Little girl gets a new heart for a heart transplant this is so wholesome lets see what people are saying in the comments","Saw this coming out of work today","Contractor left my house like this for 5 days now. I have a 3 year old.","My university gym... this is only the tip of the iceberg.","This website is not available on desktop browsers","the fact that i need to enter text in order to post images","Someone has been using my number to sign up for something. I've had this number for 10 years and my name isn't Travis. I get a couple of messages like this every day.","When spotify dont know how to count :—)","The cases for Monster Hunter Generations Ultimate and Mega Man Legacy Collection 1 + 2 on switch","how the top part of the window isn’t aligned with the roof","Hey! Do you speak American or English?","I guess not adding to the echo chamber and attempting civil discourse is being a troll.","This bad driver has their “Hows my driving?” phone number blocked out","This sponsored ad that is just red and incredibly long.","How Twitch Prime changed 20% off pre-orders to $10 in store credit but the image still says 20% off.","Getting a notification a dead friend has posted a picture of me because his old account was hacked.","Why is this necessary.","Posts from subs I’m not subscribed to and have never viewed show up in my history?","The science and color tempers the anger, but...","The new Reddit app icon","Idiot drives through freshly poured concrete with commentary","This “challenge” with an absurdly precise failure rate","The “Bauer” part of my backpack came off so now everybody just thinks I’m some asshole named Eddie","I mean, the thumbnail isn't even a sedan...","Someone in my family cut open the cereal bag right next to the obvious resealable opening.","That one tile in my kitchen","When BuzzFeed tries to sell crappy products without explicitly labeling them as sponsored.","I’ll be surprised if this post goes through","Thought this belonged here","Imagine having an egg allergy and you have to deal with this.","This gas station doesn’t sell beer, but it sells crack pipes and bongs.","Slow down the damn camera","This box says \"shell eggs\" instead of \"egg shells\"","[deleted]","3 and big 3","This street lamp is facing the right direction","The name of this store is cool New York","The fact I don’t even speak French makes this unremovable sticker (unless I want sticky residue) on my new laptop that much more infuriating","The amount of scam calls I receive every day.","Maybe they didn’t see an ad for a webdesigner","This never gets old","Xfinity wants you to buy the trilogy for $28.99 (says $18.99 before you click on it) when you can get the first movie for $3.99 and the other two for free.","As someone who LOOOVES coffee, this is very infuriating for me.","Wtf is this garbage","McGraw’s “policies”","Two correct answers, but only one of them is correct","The way these effect pastes are labeled","The locking mechanism is upside down","The Shift key on this keyboard","The dude we hired to power wash our floors needs to be shot.","Is it just me or does Verizon have no f*ing clue what the word unlimited means?","Turning this sink off","Holy Bread","How did these ads become popular at all","Taking up two spaces in a packed car park","Enlarged to show detail","\"Enjoy\" My mother said after opening the bag upside down","Should Have Stayed Home ...","The Postman cometh, and he don't give no fucks","Is anyone getting that","When you try to read an article and this pops up","I was trying 7 characters","I am for sure at least a little infuriated at these length differences","I think this is what they were going for","Surely this is illegal?","This shit and you can’t change it... I don’t even listen to that crap!","I’m Contemplating Transfering","I am really really bad at math.. But this is not 20% right?!","Who buys 4 coffees and just abandons them!?","It looked really good too. Scallops and zucchini pasta with creamy sauce. :c","This hoe stole my shoes.","All this salt that they include and only 5% sticks to a pretzel...","Should I clear them guys?","Very helpful, thank you!","This single ad showing up between every three posts","It's August 26th, Walmart. It's August 26th.","The way they welded the chain to the lock on the fence when they could have put the link through the lock, or better yet put the lock through the hole that was designed for it.","The song “4 Minutes” is over four minutes long","Shirts that do this:","No I didn't and don't put that on me","When people post the same thing on the same sub right after each other","It protect, I attack, it still protect...","An Invitation From My Honors College...","The only real choice is weather to use manners or not.","Why do you think I asked you?","Both are sealed. How does this even happen?","As a customer who likes to shop in a clean/nice store, I'm beyond irritated when I see this shit....","Wow! What a de-oh wait.","How?","I tapped the full screen button and this happened","When you finish the middle row of oreos and try and take out one from the side","Friends asked for \"round number\" odometer picture of my bike. And i'm an asshole.","I guess my shitty showerthought counts as wordplay","Someone grazed my car this morning in broad daylight, left no note","The cutlery drawer in my work's staff tea room","My new appliances from the same brand/line use different 7-segment fonts","Stude nt Driver","How my 7 year old opened his birthday card.","so close...","My wife bought a new hamper for dirty clothes because I'm terrible at separating. This is how she sperated her white towel today","When you get banned from a sub and the mods won't give a reason","The slight misalignment of the diverging sky and horizon in this contemporary art piece.","4 Nights in OCD","Verizon recently “upgraded” my plan to the Gounlimited plan, I wasn’t going anywhere without WiFi, thanks Verizon!","This pie chart","This women commenting on the recent esports tournament shooting","Yeah, because going Vegan is the only way to eat healthy","Some glue dabs to completely botch the tear.","My binder rings dont link up","Your entitlement is ready for pickup.","Semi blocks half the parking spots at my apartment instead of using the loading/unloading area.","A keyboard at work with the wrong shortcuts on the O and P keys.","Been like this for 36 minutes.","These comments all spelling “pigeon” wrong.","When you open a package like this","When you remember to water the new lawn after dark, and brush a few weeds out of the way to open the tap...","What even is midline?","Coming back days later to a massacre","When people misuse apostrophes like this","I moved into new rental and found this:","Love that this is gonna stay at the top of trending for 2 weeks","This toilet door in Italy, that can not be closed. [OC]","This guy taking up two pumps","the title says Best Fails of April 2018, but was posted 2 years ago. time travel much?","I got banned for calling GallowBoob on his bullshit","what a waste of ink","Santitas sold out to the man and are no longer $2 only. They are now $2.29, and too ashamed to display the new price as they did before","Co worker borrowed my truck the day i was sick.","When your are not wrong but you are still wrong due to poor wording.","I was going to crop it out and post it on oddly satisfying but NOOOO reddit doesn’t allow you to do what you want","Trying to tap upvote 17 times before you realize it's a screenshot","This 9$ mayonnaise from A&amp;W on uber eats.","Brickwork on the back of this garage.","Constantly making me think I have a notification","A brick out of colour","When they put these fucking stickers on the bottom of a kitchen set","mildly infuriating","When one video is xposted to r/powerwashingporn 2 hours ago and then the same video is posted to it less than an hour later","People who throw paper towels into the toilet","Congratulations you CAN’T complete the course!","Where Butters' Dad starts digging pissed me off.","I watch a few fortnite videos and this channel won’t get out of my recommended page ffs","When half your binder gets loose...","My cups aren’t lined up perfectly","One non-organic avocado in a bag of organic avocados","This guy milking out karma...","These textbooks all have different font sizes on the side. BTW these all are the same book.","“Tangle free” headphone cords","The letters on my ear buds are not centered and are not the same size.","I know there are tons of posts shiting of Voodoo but seriously what the fuck dose that mean","Leaving work...get low oil light...stop car...twist cap off...add oil to get home to do a full change...twist cap back on and the threads shear off...Shit!!!!","When gas stations put up signs with the products name and size but not its price","These ‘e’s should be at the same level","When you try to unsub from marketing messages","When people don’t break down boxes for recycling.","I thought this belonged here. Why is it so hard to just turn it so it matches?","Clogging intersections during rush hours, let alone multiple lanes of one.","The dealer taunt. You can't win against blackjack.","\"removed for the excessive amount of capital letters in the title\"","This soda brand that doesn’t tell you what kind of soda it is","My neighbor leaves their hazards on for 30-45 minutes every night. It’s really fucking annoying when you’re TRYING to browse reddit in the dark.","Stay classy, Thorndale.","Of all the potential colors available you choose black, gray, and light gray.","&gt;&gt;not monetized&lt;&lt;","My contact fell out while driving","As if ads weren’t infuriating enough . . .","Brand new superglue is only half filled. Lighter for scale.","Came blaring really loudly on my phone (going nowhere near where I am)","As if ads on Reddit weren’t infuriating enough . . .","12 ads 19 minutes","Maybe I won't go for a swim at my apartment today...","Sat opposite a bloke with his mcds on the new train line! Left this, now people think its mine...","When you post your first attempts at your work, it gets stolen and then is immediately sold on wish/aliexpress for cheaper then you could ever make it for.","The keyboard at my work has two little spacebars instead of one big","Okay... how can you be so bad","For such a tiny SIM card, it has a huge envelope.","The number of British cities displayed on Google Maps before showing the second biggest, Birmingham.","I put it on the correct way and it took less than 24 hours for the boyfriend to flip it","Seriously though...","Today is August 27","This bathroom door gap is lined up directly with the middle of the toilet and the entrance to the bathroom","This Off Center Taco Bell Sign","How this person parked.","Those are air ports, not tweeters","That one handle that is upside-down (no you can't turn it)","People that feed birds their scraps","Is this next level?","Just this","People who leave tables like this","The way people treat these (probably expensive) law books at my local court.","This pad has one page different than the rest","The building directory at this hospital","People like this should be banned from society.","One of these canvassers actually yelled ‘I like your style!’ at me today to try to get me to talk to them. Dafuq?","It wasn’t REALLY open","When Apple music fucks up your lyrics","Completed all requirements for graduation after four years but the progress bars don't fill up all the way","I was too slow with the photo.","Coming across a front page post that you completely missed the boat on.","These tiles","How coworkers leave the bathroom in my office.","Just let me burn.","I wanted to KEEP my original time, not CHANGE to this new time","Just why...","Started college today. I've never used a Mac before","Neighbor too lazy to put valet trash all the way into the trash can.","Whenever this happens in the comments","Another unrealistic body expectation for women","These tiles that don’t match up on the sides","Different shades of green, the ‘!’ is off center, the ungodly effort to say “Don’t fuck with the animals”. This sign is a clusterf*ck","I love not being warned &gt;.&gt;","Not using the easy open to open the box.","Opened my Hay Hay Caramel Biscuits to find this.","Does anyone else find the right side panel on snapchat to be inexplicably infuriating?","It finally happened to me..","Who’s in charge of pricing merchandise??","The way the yellow lines on this street were painted.","Apple music volume slider isn't actually centered.","Purchased a desk and chair from Staples, delivery guy decided to leave the 60+ pound boxes right in front of the door","Let me just tie my half eaten banana to the shopping cart.","This Kit Kat I ate...","Today’s daily challenge opening deal in Spider Solitaire.","This mirror in the nail salon bathroom","All These Packaging For This One Tiny Drill.","When you make one wrong click in Minesweeper","Stop with this cutesy bullshit and fix your servers. I didn't \"break Reddit\" your IT infrastructure sucks.","Making a 14-day supply of medicine when you could easily make it a 15-day supply.","Me and my girlfriend bought a $70 table from target. 3 hours later and we’ve decided to throw it out to save our relationship","I was banned from r/lgbt for defending a straight guy and calling out a bigot who just happened to be gay","University of Louisiana charging $1000 for an online accounting textbook","When I search for Note 9 screen protector and Amazon suggests Note 8 versions","Half-Price Books also on the bandwagon"]