["Have a question about the game or the subreddit? Ask away!","Made a zulrah meme after dying one too many times to 'mage' phase","whiskey on dharoks","a q p","Petition to let our boy Jelly achieve his dream of becoming a Slayer Master!","A teleblock has been cast on you, it will expire in 5:00 minutes.","It do be that way","How I feel whenever I successfully keep my kitten alive long enough to turn into 200 death runes","When Seerz takes your YT clip. Over Dubs it with some Psycho kid.. is content really that difficult to make. Cheers Seerz everyone will now think I’m either A) the Scammer or B) A crying 12 year old (Y) GJ","I take your cute cave horror, and raise you this!","Osrs mobile is #2 in the \"adventure\" section in sweden.","We are leaking again. r/kidsarefuckingstupid","We need more TPB/OSRS memes","When r/2007scape is interfering with your nofap streak","Bruce Wayne responds to edge lever PK","When Beta invites go out so now you have to see everyone who didn't get one explain why they're entitled to one.","I Caved and Drew Nieve","Doing ghost ahoy quest. Is this a trick question jagex?","Where is my IOS beta invite?","The Ironman theme","I got bored at school and gave this a shot.","Turns out the Scythe of Vitur doesn’t count as a weapon on Entrana. Literally unplayable","Lewd Nieve confirmed in PoH? WE DID IT","After 2 long years, it's finally over","TIL Jagex has a very fancy 404 error page","When you're so used to seeing sexy Nieve that regular Nieve doesn't cut it for you anymore","Brag much?","What universe is this","Why does the banshee enjoy being killed?!","Sometimes you have to really look for the Silver Lining","I posted my first 10HP vid to reddit and you guys made it blow up. Thank you. I've hit 50k subs now, I've made a face reveal to celebrate. Cheers guys.","I'm not even mad; viewbotting to spread awareness and protect the community","OSRS Mobile is #2 OVERALL in Finland!","Caption this - God Ash","Move over Salmones Guy, The Scrap Man is here","The jmods are talking about reworking poison tiers on today's Q&amp;A due to the complete uselessness of lower tiers. Here are some ideas.","First Jad kill ever, instant pet","Loot from 85-99 mining at the Blast Mine","I for one am saddened by how far this sub has strayed from its intended purpose, end Nieveposting once and for all","1,142.5% btw","People at GE","Please don't send help, I think I like it here","Nieve_-_Edgeville_Bridge.jpeg","Fresh new meme","[Art Comparison- RSC, RS2, OSRS, RS3] Demons, Dragons, and Giants","OSRS mobile is the 2nd most popular free app in the United States!","Crazy luck at pest control!!!","University Friend Finder","Full Torags and then some in 36 chests","This is why I play OSRS","Duff Devil","Once OSRS mobile gets a full release, can we please agree to stop hiding behind bushes and taking photos of people playing it in public?","When you give Thurgo the red berry pie at the end of the knights sword","No XP waste","Just spotted this man of culture at the G.E","[Suggestion] Reanimated Nieve.","That's a lot of damage","Didn’t fap at all to Nieve this past week, got invited by jagex to IOS mobile beta. Coincidence? I don’t think so","Is this still relevant","Rocking up to bosses in non efficient gear","Sooo.. I've been playing for a few years and just now realized we had a clear option for private chat. rip.","Mod MatK has Two Phones on him during Q&amp;A stream","OSRS Mobile is an unreal feeling","God Ash","Me when I achieved my first recolored graceful set","Slepe is beautiful","Sometimes there is life, even in the most dead parts of the world","FeelsBadMan","2 pets, 10kc @Tob ??","Angry Nieve (original image by /u/Auenke)","OSRS #1 Most popular adventure games in The Netherlands","248 Ability to Plant Magic Mushtrees within the Superior Garden (part of the Mycelium Transport System) [UPDATED]","When someone post a Nieve lewd.","Is this how you feel Zuhaar?","This absolute behemoth at sand crabs","Be careful to where your $10 goes to.","Dovy getting it in after learning he can make new accounts.","Loot from ten minutes at gargoyles","Literally unplayable part 99","Finally finished off base 70s and found that Runecrafting is both my lowest level and highest ranked skill","Nice.","The community asked for Eve. I tried to Deliver.","So I asked my friend to make a Cave Horror look as cute as possible..","The return of the 2007 rock models in a new way: Rich veins","Back in the day whenever I started losing an argument I'd just threaten to go get my main and log off.","To be fair I always did like dancing","[Spicier] when you get traded a black plateskirt instead of verac's","First ever raid tbow split","Decided to do my black dragon task at KBD for the first time. Worth it.","Oh hey look it's Nieve","Does the beta go live GMT time?","Actually Unplayable","Going a full abyssal demon task and not one whip drop","[Humor] killed c engineer on mobile today","12 Years Later - Doing It All Over Again","Man loses his shit over this simple osrs thing...","10k Fire Strikes at Salarin the Twisted","Asking people what their greatest achievement is.","Make people who recover their accounts after being hacked do the stronghold of security.","No iOS beta priority for premiere club members?...","Loot from 1 hour crazy archeologist","A tribute to my friend who keeps getting d meds at Zulrah :'( (please ignore that I never finished this!)","Menagerie","\"That's an action they're gonna gif\" *ASH*","First pet ever! Prime pet! 301 kc! :D","TIL Smithing requires you to pull extra material out your ass","Only two steps too.","HC Rockcake to 1HP and pickpocket a man in Lumbridge Challenge.","(S)pade (c)ollector","When you have to takeoff soon but","Saw this today, thought I’d share. True dedication.","Creature Graveyard Guide (Mage Training Arena)","OSRS is number 2 in USA. It's only hidden because of ::renderself","When you have to walk past the normies at the GE","When you check your email and theres no mobile invite","maxmoefoe with the Runescape intro","G.E scammers are manipulating the price of items like talismans to a huge extent. Don't fall for this scam.","go to pk they said it will be fun they said","Noticed 3rd age has been going up.. wasn't duel arena changes supposed to crash them?","Who else is hoping we find out what’s behind these walls sometime soon?","Some information regarding the XP rates while AFKing on NMZ, with different setups","White House only Ironman (btw)","when your loved by the community, but hated by jmods","Back in 2013 someone hacked my account and tried (successfully) to get me muted by doing this. Im actually impressed.","Thanks to you normies I've sworn my allegiance to the cause.","Should I save gp and upgrade my gear or spend on skilling for achievement diaries?","how has this subreddit gone for so long without pointing out that this gnome's surname is literally Ebola","A q p","Runescape in the future","I’m the cashless noob version of my bf","Runescape Client freezes my entire pc","Loot From 7 Skotizo Skills Plus Clues","Looking to go on a pking trip with some people","It was beautiful","Jesus replied \"You don't understand now what I am doing, but someday you will.\"","What's better to kill than wizards","Given a million for not being a bot.","My friend just lost all his items in his chest from theatre of blood.","mfw I see another Nieve post","iOS mobile invites","We're leaking","When your mom won’t pay your $11","Runescape pking video backing music circa 2006/7 appreciation thread.","Any advice to rebuild with 0 gp?","It's unacceptable how you can give bonds to ironmen willy nilly, but if you have a spare bond you CANNOT give it to a new player... You also can't droptrade them so what the fuck, jagex? why is this one-way?","Loot from my 3rd medium clue! No idea what to spend the GP on","Underrated Comment","Solution to barbarian potions - Just make each dose last a much longer duration or more potent strength","When you're one of the 10,000 chosen ones","Are there/ could there be home worlds on mobile?","What Happened to Chris Archie AKA Mod Archie?","Suggestion: A fun item from Diango that lets you \"drop X\" of a stack. Use the item on it, complete the dialogue, drop.","Dragon impling world 305 by morytania farming patch","IOS code for osrs","NMZ DH AFK Quest requirements?","[Suggestion] Naming pets","Saw this lure last night, not sure who would actually fall for it","*Snap*","Recommended F2P Skill Levels before going P2P?","When you finally see Nieve in person","Anyone know when the iOS beta will go live?","old school runescape is a game that truly shines when you use your imagination to bring the characters and settings to life","Looking for a baby pure practice buddy","What to level next?","Most of us right now","Just got a tbow, need suggestions.","Mobile question.","Whoops.","The magic mirror tells all","Monkey madness 2 or Dragon Slayer 2?","What is the most idiot-proof method to kill jad?","Skeleton attacked me while killing Venezuela Runecrafters. Lmao","LF Pheonix Gang Partner *Shield of Arrav Quest*","Jagex, please add an option to re-animate Nieve for 2500 slayer points, after mm2.","Dark blue graceful","Guthix be like","Membership Refund?","chaos fanatic","When another nieve post comes out","With the new teleblock changes","What would you define the economic system of runescape as?","Loot from 1 Minute of Fishing Trawler","KempQ's 12hp ironman Gmaul rushing","A rightly earned place.","Why does A Friend's most recent videos basically sum up his entire channel","the answer is no.","Any clans to learn pking?","One way to imagine it","barb fishing","All this Nieve talk.. What about Pieve?!","Would anyone like to learn/leech Volcanic mine?!","Guess the skill name!","HD Nieve","My Account Was HiJacked [Please Help Jmod}","Vorkath dhcb + buckler","What's a better range switch for Zulrah? (92 range)","This makes up for grinding NMZ the whole morning for Arclight","Afk skills for mobile?","Looking for a client to play OSRS on?","Players who play both OSRS and RS3, what do you like and dislike about RS3 compared to OSRS?","Can someone explain HOW this is a name?","2 Granite gloves at the same time","Does the beta release start at midnight or a certain time tomorrow?","When you check your inbox and there is no iOS beta invite","When you try to log into osrs, but you can't because you didn't log off of mobile.","I thought Lazy cats had a 40% catch rate.","Anvil in Lumbridge","To the people on the other side of the world","[Suggestion] Make the forums great again","Different Types of Pure Pking","How many bonds can you purchase osrs?","Umm jagex...?","A guy at GE asked me if a wand is good to train magic. I told him no, he should use a","Status about OSBuddy","Wait, you said \"draw lewd Nieve\"? I thought you said lewd Steve","need help to 60 hunter","Maxed AGS pure Goes Ghrazi rapier pking SKULLED (risking entire bank because unskulling needs to be fixed)","Ornate Pool Question","Void Pure Guide?","When you're not selected, but you have an Android","New online friends","Sand Casino on wheels","pushing drugs as a 9 year old","How long did your infernal cape take?","Fire cape question","looking for teleportation incantations","Good Stats For Theatre Of Blood?","Big ladies be like:","Infernal Spectating","Viggora's mace is a little bit too inaccurate","Almost completed every quest but I refuse to lose Nieve.","Please Help =/","Efficiency-scape vs Simplescape","Do you get something if you have a rs3 and a osrs account?","Nope","Some 30 second OC","Documentary request: \"The Rise and fall of Dovydas\"","Casuals bragging about 10hours a day over a week.","IOS RELEASE TIME?","someone has been heavily manipulating the price of craw's bow and viggora's mace for two days now on OSBuddy, why are they not doing anything about it?","Suggestion: Move Grand Exchange to duel arena so we don't have to waste time teleporting to ge at Varrock","Cannot change email","Suggestion for Zulrah","Getting more involved in the Community","tfw one of the snakes in the jar @ pyramind plunder bites you 8 times in a row","Jad Help!","Feels fuckin GR8 M8","Talismans","Needed 31 QP for a dfs.. Imp catcher was not the right solution... 35-38cb.","Bored as a Low-Mid Level HCIM. Suggestions for things to do.","Dragon warhammer 96kc on first lizardman task! :D","Stun Alching Tip","Any Community CCs?","[Suggestion] Game lobby.","RuneScape the top nothing in the UK...","Petition to sacrifice this scum in order to bring back Nieve","Any Good Community CCs?","You received","Noob bosses? Help me out!","Any remedy for getting hacked?","Kappa Ash","Question about OSRS mobile","When you guys keep jacking off to pics of Neive","Mods are asleep, so you should be too.","Stumbled upon this legend today","Somebody really put vorkath on their car","Decided To Draw My Ironman","REEEEEEEEEEEEEEEEEEEE","This song reminds me of the glory days of A Friend","OSRS Casual Clan","edgeville bridge (feat. Lil Xan)","Inferno Theme song but in Super Mario 64","Managed to beat my PB at Zulrah BTW","Some Craaaazy RNG","QUALITY OF LIFE- RUNECRAFTING","Solo raid melee hand","When your friend tells you to tp out but your a MAN","Back after 1 year histatus, what now?","When your shitty RNG can’t even beat 1/3.4 and you’re stuck playing on PC for the next 6 months","What is the current gp/hr (roughly) at Zulrah with Max combat stats?","Literally unplayable; Jagex must immediately fix","Mobile bug winterdodt game starts prior to countdown hitting 0 exp waste reee","Level 72 Combat with AGS and CLAWS Pking","Required stats to kill Vorkath comfortably?","How to save 4k on an antidote (+) sip","Heard this playing while doing a farm run in Kourend. IF you haven't heard it . Hear it. WTF its amazing.","People like me is why you keep getting rushed when you're going to buy barrows gloves. Don't reddit and pk","[Suggestion] Instead of implementing faster runecrafting methods - just increase the exp of runecrafting","TIL Nieve is based on an irl player from 2011","Lol","*Shoots arrow at kraken*","Account got hacked and potentially ratted, need help with what to do","Count your blessings","They’re real","Me thieving ardy knights on mobile","[Suggestion] Right click Empty Inventory","Ol’ Reliable","Feels Bad","A good day at rev's :) was half asleep and then...","Do you use full Justiciar? If so, where and why?","EARTHQUAKE during Alfie's stream!","[Theory] It's ok guys Nieve is just hiding under that rock","Thank you Jagex - Vorkath KC: 7","mobile phone for afking?","Turning pure into zerker question","Doesn’t get invited to IOS beta","2 accounts at once?","When you log in and bank stand the whole day","Beating PB at Zulrah without decent gear, wow","The edgeville bridge looks like someone is sucking it...","Is this gearing method against OSRS rules?","[Suggestion] RFD Glove Ornament Kits / Sidegrades V.2","I got an iOS invite on my runescape message centre but no email, what do I do","The sad truth","Low Effort","I present to you the ultimate iron man song","Is it too early to start a riot at fally W2 for a Nieve resurrection quest?","Are Ranger Boots removed from Medium clue rewards?","Hunter in a nutshell","Just finished a bit of NMZ, realized I was wearing a Torags platebody after 530k points FML","Are brutal black dragons still a good money maker?","86 raids dry for this","Sneak peak of new dragon pet [LEAK]","Recently started playing again on my old account... this cracked me up a bit!","IOS mobile question","the truth.","Looking for tips and tricks","Guys, they said 1 hour and 45 minutes until invited are out, 35 minutes ago. You are likely being phished.","F2P PKing (new to this)","Started a new OSRS account about 2 months ago and usually only play weekends, just reached total level 900!","Why can't platinum tokens be used as currency with NPC's and shops if the way we get them is from banker's themselves?","Lowest Def with Barrows gloves","Work got invite for IOS beta! I can finally play RS on work! PogChamp","125 quest points What to do until RFD","dam thats 1 T H I C C bih 😩😩😩😩👌👌👌 [NSFW]","Why do people alch when they can just superheat iron bars? Only -2.44gp/xp","Us iOS users have to stay positive","Dragon defender (t)","Waiting for iOS mobile like...","One of these things here just doesn't belong here..","Camera angle","(Suggestion) Add a collect option to fossil island bank chest","Hybriding all combats, monni killed for 70m","Elder chaos Druid","Unpopular opinion: You're all degenerates, jerking off to other people's cartoons","Looking for help with making my first proper PK account- HELP!","How do big clans (10+ people at revenant caves) even make big profit?","May aswell keep the Nieve hype train going... [NSFW]","He's afraid of water","Is limpwurt root worth growing?","The Dragon Longsword, the long forgotten about iconic symbol of a noob is actually an amazing pvp weapon (seriously.. the special attack is like a dragon godsword)","Unorthodox post: Thank God for no Auth Removal delay","a love letter to everyone who got accepted to the mobile beta","Theatre of Blood and how the Ely works","Torvesta fires shots within 20 seconds","iOS invites going out 1 hr 45 minutes after this post!","I need to find a new hobby","I'm a pc gamer","Osrs afk money making","My friend got to visit a pretty unique place on the weekend","273KC, Possibly fastest Ironman ToB completion?","Dawntained - Dharok's Montage","Is inting in league for a bond RWT ?","20M Zulrah setup, no barrows armour.","Dragon impling at elf camp during regicide w353","I want to make a obby maul str pure, any advice?","Ironman 1500 Barrows Chests Update","TIL the leprechaun can also note saplings","Quick Questions for NMZ","Real Ahrim’s Staff","What I’m expecting on the 30th: Runescape mobile beta code.","Minimum Watermelon Yield?","LFM - autist Albertan's and Canadian friends","so i tried hosting an lms game and we finally got to 24 people and this happens","Feeling like a genius for thinking of using ALT1 toolkit (rs3's runelite/osbuddy-like tool, basically glorified chrome tab with screenshots &amp; screenmarkers) on content that never changed between 2007 and 2018 on RS3","Armour Suggestions","QUALITY OF LIFE - RUNECRAFTING","What did i just wake up too?","what happened to giving out the oculus orb to everyone after a while?","Strong and fun pk build","Rather than telling him he needs to pray at dharok especially, i just watched the inevitable...","Suggestion: Remove abyss rcing completely.","An email I sent to Jagex in 2010, I don't remember getting \"phished\"","This is why i pk","Ran Into A Fellow Scaper at Bass Canyon","Is there a way to hide this on mobile?","Week 2 of the Nieve hype","This Sandwich Lady can be a real bitch","Daily \"What are you up to today?\" Thread x212","DMM Suggestion: Make looting bag usable everywhere","Fenkenstrain was wild","ios version for osrs","When you get an invite to the iOS beta","Sand crabs adventures","Came back 3 months ago and finished my goal of quest cape at 85 combat! Galvek was the hardest and funnest pvm I've experienced","On July 24 2018 the OSRS team posted something about Combatting Ragging. Where is it?","Kourend Teleport - Update?","My First Firecape","The God Wars Dungeon launched 11 years ago (OSRS vs RS3 art)","1137 clues later","What are the actual odds of gettin selected for the iOS beta?","LPT: Use partner slayer to double your block list","Zulrah is a c**t.","Me RN after not getting a beta invite again","Theater of blood dead?","You Guys Know What To Do","Well that escalated quickly","\"You have a funny feeling you're being followed\" 12 caskets","How is this possible?","Skeletal wyverns DHCB vs Melee which is better?","Share the IOS beta wealth","Got this email but no inbox message on site is this a phishing link?","When you unlock helm of neitiznot and think you're the shit","[Suggestion] Make the Katana F2P (better def than the Rune scim but weaker str) for pking.","Today I peaked: 4 Primordial Crystals in 97 Kills. What’s your best RNG streaks?","Ronins Clan (Kiludead)","Hmmm...","Redditor makes spot on prediction about the future of this subreddit","This is 10% luck, 20% skill, and $11 concentrated power of will","Question about Barrows","when that fire beat drops","I don’t come to this sub to be blasted with images of soft core hentai porn","Losing streak continues..","20 Totem Pieces but no Ancient Shards? WHYYYY?!","25 spines from cactus patch at 86 Farming","when your osrs account gets hacked....","IOS Beta","Friend got jail random event instantly after getting 99 thieving lmao","Switched from RS3 to OSRS","Getting that sweet mobile invite","I'm trying to use the keyboard shortcuts method to train construction and I have no idea what I'm doing wrong.","iOS Beta testing invalid code","Fastest method of transportation to a place.","When Nieve is on her period","Dear Mods that aren’t asleep, can we get a small cleanup on this sub for those of us that actually want OSRS content and posts rather than Nieve Fan-fiction and dank memes?","[Suggestion/Petition] Change Shilo Stepping stone requirement.","Amenity ranting about players getting forced into the wilderness","Loot from 157 Hellhounds - A Nieve Fanfic","Keep em coming boys, the folder's been lacking for far too long.","Dragon Kiteshield","It took me 12 years but i finally got my quest cape today!","People who got into the iOS beta, what phone are you using?","Imagine DCing When you get rushed by a team...","Buying bonds to sell?","&gt;tfw runelite keeps beating you","260 QP! MM2 = Final Quest. NO MORE NIEVE ='(","Data usage on mobile?","Loot from 5 minutes of talking to a BTW","When you realize what you just wanked to. Sigh... Zips","This hurts me deeply.","That time I got muted for calling someone a foreigner.. Oh how times have changed.","Autism LVL 99","Will jagex let you use a mouse and maybe keyboard for OSRS mobile ?","Old School Runescape","Back to back Robin hood hat on the iron","SELL YOUR WRATH TALISMANS NOW","So this just happened","Its been a little while but I'm back!","Homemade Meme, Complete with Terrible Pun","Need help with Giant Mole as I hunt for a pet!","[SUGGESTION] Require bank pin to access Grand Exchange history","MRW waiting for more Nieve posts on /r/2007scape","Scape Main programmed onto a breadboard","Using proxy to play osmobile ?","Buyable 99's for under 60-80m?","Great, thanks!","OSRS MOBILE ON IOS","New Clue Reward, Moonman Mask. 3+ Strength when fighting any Dark Creature.","iOs beta question","Does a Comprehensive OSRS GE Database Exist?","Upvote if you have an IPhone X and got a beta invite","Back in 2007 my old account got perma muted for asking for someones msn rip xD","New to RS and I feel like I'm not training construction correctly.","I canceled a buy, Jagex locked my account until I pay 11$.","Since when has there been a permanent fire at barbarian village where fishing takes place?","Reckful might stream OSRS (Sponsored)","And it won't be re-polled till Winter","V/ so many noobs here risking bank!? where to get free runescape money V/","Hacker's Scuffed Barrows Setup","Confirmed: Excitement safely intensifies","My Arms Big Failure (please fix)","Venezuela","Getting back into the game.","uhgjgjhghjghfhgfhjg","This game will need to have the exp rates changed in the future to ensure the Growth of OSRS","Ironman Luck","Double XP weekend","[Suggestion] HCIM bones should burn for their total level!","Do osrs get dxp weekend?","It MIGHT nearly be our time iOS users","Display Name Help","Draconic visage on 15kc Task","Where's the OG Nieve pic?","Sad","Can anyone figure out what these bots are doing?","3 months of membership for \"free\"","Once in 2006 someone convinced me their spinach roll was rare af so I traded my full rune for it","Looks like it's Winter 2017 for iOS finally","What kind of RuneScape videos do you guys like to watch on YouTube?","Cave Crawlers are adorable. When do we get one for a pet?","Sanguinesti Staff BUG at zulrah","The State of OSRS","New to runescape.","Runelite hacked my Computer?","Where Can I Burst/Chin on a pure?","740 medium clues? :O","I fucked up","In game phishing via mobile?","Not sure how to ask but...","Seen at Naka kon 2017","[DMM] Where do you find prices? Specifically, Collectables, Rares, Etc.","Daddys Home 3","Max so far 😅👌🏼","[Suggestion] Make PvM boss kill high scores","[suggestion] Can someone make an rs character do the Fortnite dances so we will lose all the respect that we have left?","iOS Mobile Beta - Questions for Mods/Jagex","iOS beta.","Quick question on MM2 caves","I know this will be controversial given recent ''wholesome'' posts, but its important we recognise beggars and stop enabling them.","Bryophyta Boss Recommended Skills","If everyone that's doing Theatre of Blood ffa's..","Dragon imp","Not even Minecraft will stop me from seeing my LEWD Nieve [NSFW]","IOS Beta Invites out!","Just got Rusty at lvl 7 Thieving!","Finally got an Eternal gem!","This pleases the self-diagnosed OCD.","Mama I made it!!!","new brideo","attempting firecape on my btw","YSK: About this common scam we run in Other Games (o7 guys!) that has now infected your game.","Skills to focus on","ios force touch as right click option.","I've wanted to play OSRS mobile forever and I still can't play","2 minutes of logging in at GE","What would you like to see from a Twitch streamer?","Just got the Hellpuppy today, exactly 3 years since the original release date","It took me 9 tries, twice I quit playing for months, but I finally got my first firecape.!!If anyone wants to celebrate I’ll be on world 330 giving out cakes in Lumbridge for the next 20 minutes!!","Made me jizz harder than any nieve nude","banknote for cave nightshade?","What would you rather get: 200M agility xp on 1 account OR a 4 year prison sentence?","He Could Have Won $25,000","A rare photograph of Jagex's owners actively taking part in the destruction of Runescape Classic","Posting for A Friend...","*casts Padewwa teleport*","Does runelite tell location of Transportation incantations??","OMG an uncut ruby :O","Billing: Other","Competitive Castle Wars Discord","Submit your questions for this week's Q&amp;A! (29/08/18)","Osrs fantasy league! (One more spot available!)","82-99 Fishing at Minnows on the Hardcore","bank issue!","After almost a week of these Nieve posts.","What do I do with 285k wine?","Guardian of the gigabits","At first I was excited for the Dragon dart tips, sorry not NSFW Nieve content","Most useful 99s","Mad skills tbh","PSA: Official Jagex emails address you by your display name. Phishing emails never do","It's not Nieve, but I made this over a few days. Hope you like it.","iOS invite via Message Center but no Email?","First attempt at fire cape ends with 2hp","Pk'd Yesterday for 1st time, very discouraging, reminded today of how trash my skills are.","When you've been blessed by Saradomin.","[suggestion] Buff Seercull/DK's armour","My dad walked in on me browsing 2007scape this week","A nice surprise","Range xp bug","Accidently found a bunch of noobs risking bank. recorded widowed mode like an autist so its a bit scuffed. how to steal black demon slayer kids.","[Barrows] Using Barrows Armor","The Best Way To Pk A Noobs BANK!!! Killing Black Demon Pkers! | OSRS |","Worst hard clue I have ever had.","Got iOS beta invite, can I use it if I upgrade my phone?","low effort.jpg","suggestion","Zulrah, what have I done to you? (what's the %?)","Runescape mobile release date?","RS3 vs OSRS","Accepted for iOS beta test. No exp waste","16 down, one skill at a time","Mobile AFK log out timer?","iOS beta invite","Osrs fantasy football league! (Draft tomorrow!)","Is there a way to check invite messages from mobile phone?","When you start skilling","Had to post it. Nieveposting is the future.","First of all dumb ass,","Record loot so far from 4 patches of berries","Higher Pay-dirt from Fally Hard / Elite Diary","Account Email lost","Nieve is not My master","Found one Wolfey boi in r/wow","how has this subreddit gone this long without pointing out that this gnome’s surname is literally Ebola?","The Slayer Master's Pupil","Getting back into it after &gt;1 year away","Locked osrs account","$11","I think it's high time for a Looking For Group thread. Give your approximate location to find Scapers near you.","Account hijacked after 1 day need advice","Game Breaking bug: Ring of Wealth automatically picks up coins, tokkul and numulite, but not trading sticks. Make it pick up trading sticks.","Love crashers...","10 Hours of Pest Control - Stats","We Ruined A Friend","[Suggestion] Give Mysterious Old Man a friend. Why is he so lonely?","Just got the iOS Beta invitation code!","Note 9 keyboard wth? Also with the stylus in the phone.","Barrows chest room help","To whomever got that justiciar set for 11m","Is it worth training slayer at 70cb or better to just wait till 85 for nieve(rip)","Clicked the link to download testflight from phishing email. Am I good?","A rewarding pvp \"minigame\"","If you haven't done it yet, do Underground Pass.","I just want to play on mobile...","Boissss","literally unplayable","[Suggestion] on mobile they should have a 1 5 10 all option on smithing and smelting. Like every other skill.","Does Augury give the same Defence level boost as Piety and Rigour?","Multiple devices","If you can pick one thing from RS and get it in real life what would it be?","Wholesome Noob Stories Thread","[Mobile] anyone else having \"phantom\" taps causing unnecessary clicks on mobile?","Been a rough few days, luckily i know what’s always there for me","You lucky 🤗","Found this in my Diary of a Wimpy Kid Do-It-Yourself Book. Grade 2 me knew whats up.","Feelsgoodmate","TIL Implings can be frozen with Bind, Snare, or Entangle","I said it before and i'll say it again...","Today is the day, guys. My family was too poor for a membership 12 years ago. It's time to become an OSRS member!","- - -Question- - -","No iOS invite....I’m actually very disappointed big RIP","Tryna talk my boy about hitting up the arena with me again 😂","There were 5 weeks between the last closed Android beta and the open Android beta. I guess us who didn’t get invited today will see you guys in October :(","Baby staff pure nh 4","Boat suggestion","Email Invite","This is impressive because itwas done at a low(ish) combat level, on an account that is unable to participate in the act of trading other players","Influx of new players.","WOO I GOT INVITE! but....JMod help?","Reddit , meet flipper!","ios beta - test flight invitation code problems","Redownloading Iphone Beta App?","Full sending tome of fire noobs at black demons","When the only email you got was billing: other","Loot from 77-99 runecrafting","Can I use the iOS beta on two devices? [Question]","LOOT from 100 Zulrah Kills. Onyx drops at 41 &amp; 98 KC","I've been working on a wholesome bot that gives free sets to noobs that trade it. Should I deploy accounts with it, or cancel it?","Wholesome World 1 player","Please make the game fit on displays over 16:9","Desert Treasure 1 def solo?","Can we have the next end game boss in GWD behind the frozen door?","Daily \"What are you up to today?\" Thread x211","Just got second beaver @98 wc","Inferno Cape? No melee?","Is the code in the mobile email the TestFlight invitation code? It doesn’t do anything for me","Looking for people to make the day of my friend with asperger's.","dragon impling w336 goblin generals","I decided to try out my luck at Zulrah","A sad autocorrect FAIL...","tbt to when my cat grew into an overgrown cat in the middle of ratcatchers","The beginning of the Elf quest series was released 16 years ago today (Plague City- August 27, 2002)","How I Ruined a 1 Defense Pure with Infernal Cape :( PLEASE FIX THIS GLITCH","Today is the day...","IOS beta question","Fire cape at 1 def / 1 pray","My body is ready.","Question about iOS beta.","Can the Microsoft Surface pro run osrs?","MFW i miss 2 invites to ios beta but have 5 accs member.","3 hours is a powerful amount of time","Leaf-Bladed battleaxe","Just recieved a beta invite for someone elses account.","We Made Millions Killing Noobs That Are Killing Orb Charger Bots","No username attached to my IOS invite?","Dear Jagex; a bit of feedback regarding the invites","Loot from 2 years of doing \"nothing\" after work","Zezima wanked me in RuneScape in 2007.","Not a nieve pic, but I found prove that I have been \"a q p w'ing\" for almost 10 years now.","3rd Party Client Questions","So I didnt get an invite to the IOS beta","How Do I Make Money With My Situation?","Any love for this actually OLD school video","How To get free tome of fire at black demons lol","Q: Money Making Tips?","Jagex sent the mobile invite to the wrong account of mine...","Casual player looking for my next challenge... Could I beat Jad? Any other targets to aim for?","Got Invited to the iOS beta, can I not \"opt-in\" until the 30th?","[Suggestion] Boots of ethereum","Have you heard the new joke about town?","Vet'ion guide with the Viggora's Chainmace without luring","Beta code doesn’t work?","Well, since you're all degenerates anyway...","Got my inbox message! Definitely legit now!","When I applied I had an IPhone 7, now I have a iPhone 10. Shame you can’t reapply :(","Cutie at bloodvelds","Moving up in the world","Suggestion: Rework LMS","Unpopular opinion: Zuhaar literally stole the golden gnome for best artist from people more talented than him because he drew pornographic pictures and the community memed it","OSRS Friends :)","Construction help","Give mobile Beta users this Crown.","Slayermusiq1 Hasn't won a golden gnome","IOS Mobile Invite","HCIM Dunzo... L0L","Did Jagex screw up?","Sneaky new botting script?","When you and your RSBFF both get mobile beta access","The beginning of the end for iPhone users","I leave for a few days and I come back to all this nieve shit.","1/100,000 drop rate of a non-toxic interaction in the catacombs","Just want to ask about invites","Could someone help me with a setup and tips for fight cave?","Noob question","Just got my iOS invite!!!","How effective would a total level requirement to obtain membership be for the sake of reducing bots?","Yeahhh boyyyy","Curtis raps so fast he gets logged out Monka","IOS invites out for mobile beta!!!","iOS Beta invite arrived!","All these Nieve pics got me feeling like","First semi-rare drop in Osrs!!!!","[Q] Is Thammaron sceptre worth a lot?","0:48 zulrah kill off task no tbow","How do I know how far to go to re-aggro monsters?","On android.","Hi, this is my first time playing since 2008. What is Nieve?","Winter 2017 has arrived","How much do you think mutagens would sell for if they were tradable?","Didn’t get an iOS beta invite","Moment of silence for those who still don’t have mobile access.","OSRS Ironman Content Creator - YouTube: FinballinOSRS (Need Ideas for Unique Ironman Content)","[suggestion] Allow us to buy untrimmed skillcapes at 200m xp in that skill.","Runescape Memes (Voice-Over Memes)","Me after all of these Nieve posts","Easy Clue Reward, 377k! Some much needed pieces for the Ironman","iOS mobile","What's up with the prices?","I found a reason to live again....","Stream Sniper Dies for 175m","Dragon Impling Anita house Gnome Stronghold world 309","Advertisement with OSRS music?","Nightmare Zone Noob","sorry ironmen","We Made Millions Killing Bots in The Wild | 1M/HR+ | OSRS |","winter 2017 its become depressing now","2018 Meme Calendar anyone?","This happened a while ago, but I hadn't made my reddit account","Giant mole as a mid level","3 Totem Pieces In One Barrage","Runelite 2010 interface is broken, Inventory Icon appears over top of Prayer tab and Inventory tab shows a blank space","Book of Balance(Guthix) vs Book of war(Bandos) for pvm?","iOS beta codes","hecc ye","TOB bug or mechanic?","Addy or rune darts for 99 smithing?","Kalphite queen kill for ironman not registered","W346 GE right now...","Suggestion: Hold a lottery or draw with the winner receiving a percentage of the staking taxes from a small period","Osrs asks a question about what the community dose to have fun and the first 20 suggestion crack me up!","I got an invite, I actually don't believe it","IOS beta invite","Question about testflight regarding ios beta","Cutting it close BTW","Quick question","One Upon A Time...","New account quest list order","Thought i'd post my Bird House loot tab before selling it all to buy dwh","This pet luck...","Just got back into playing after a very long hiatus. My question is, what skills should I be working on developing?","infinite cannon ammo","What's the point in another iOS beta if you're just going to invite the same people from before?","Coming back to rs after 7 years, question about building","So it's been over a year since the Mobile announcement... any chance we're going to see this appear on the App Store soon?","It's 4 am and I remembered this video for some reason","IOS beta invite? You not lucky","Killing zulrah should be a elite task instead of a hard task.","Need a JMOD Attention For One Sec","😍 Jagex just dropped NIEVE's PANTIES in front of me 🤭","My piano cover of Autumn Voyage. New OSRS covers coming this weekend. Enjoy!","\"Y-yeah, I totally finished RFD....\"","Good chat in the mines :)","Miles Davis performs his first live solo (1951 - Colorized)","IPhone 8..","True Pirate: Pirate Ironman, eye patch and all","Extra bank area for loot tab","Meanwhile on World 2...","Do male and female HAM members have an equal chance of giving easy clues?","Why should I turn off my public chat?","Ideas for how unused items can be used","Daily reminder the reanimated nieve thing was my idea","We’ve all got a story that defines us when we were fresh noobs... what’s yours?","The reason why Woox hasn’t soloed theatre of blood yet.","Why can't we just get a pj timer for the wildy already?","iOS mobile screenshot","Suggestion: Magic longbow (i)","Every time there is a new Nieve post","Progession past woodcutting","Oak dungeon doors vs mythical cape racks","Loot from pking at rev caves","Did a break and picked up OSRS again but dont know where to continue. Maybe any tips what to do?","feelsgoodman","Anyone remember this boi? I tought it was real and still waiting","CODE IN GAME INBOX IS SAME AS “PHISHING” EMAIL","What should I pvm?","Starting 6 month break soon - Change my mind?","Orange Justice Sea Shanty 2","The QOL we need","Who is Nieve?","[Suggestion] buff bird's nest rewards when an egg is offered at the shrine in the woodcutting guild. please read this post.","I made a Promotional ad video for Oldschool (Not the best)","worst KQ luck. 740+ KC no head... cant finish diary -.-... post 99 slay, wasting points on task, 11 chains, 3 2h, no pet... and if i get dark crab and ensouled kalf head drop again ima punch a hole through my computer screen","Oldest Runescape videos on Youtube?","Gnomeball minigame revamp idea","Any active clan out there still regularly doing gwd/corp not just raids?","What happened to the pvp/ragging update?","This video was ahead of its time","Training Mining - How to drop ores..","Current state of pvp","The Reason OSRS is different than the RS2 I remember..","Requesting more zily hentai.","Do you agree or disagree?","like clockwork","Waiting for iOS mobile invite like...","Looking to start/learn pking","NSFW - sketched a nieve, probably should finish it but xp waste","Looking for poster/drawling","Lest we forget","Starting off the making of my NSFW Nieve cosplay","Even Akinator knows what’s up","When you log in to check your billing: other and its not what you thought..fuck i just want to check my bill statement ffs.. cant jagex do anything right?!","Artisanal skilling (Not a new skill)","75 Defence, 35 Combat","SO IT BEGINS....","Issues btw","Ghetto Runescape Guides: Account Security","Co-op Slayer With My Favorite Master - Nieve NSFW Fanfic","Moved into my first apartment, sister painted my first piece of decoration","Buying mems through mobile","Repost (Because I did this in the early hours of the morning rather than during peak hours)","Fix teleblock in pvp worlds","Running Rune Essence makes me a dull boy","Unpopular opinion: The OSRS combat system sucks for high level PVM","Just a reminder that our arms just end in nubs","Why no Barrows pet???","D warhammer or bgs with 75 attack?","The only good thing that happened to me this entire month. Jagex you made my day","[NSFW] Nieve getting pummeled by Dwayne Johnson.","Why not let every osrs player test the iOS beta? We’ve been waiting for a good 7 months for mobile...","Account Hacked after 6-month break and after downloading RuneLite from official site (evidence provided)","New HCIM. Goodluck me!","What to do?","iOS Beta keys... btw...","Sent this in for the runescape mouse mat competition 3 years ago...","[Suggestion] Add commas when you examine coins in your inventory","Explain f2p in one image go!","Why can't I kill Zulrah?","Nieve","Not played in 11months what can I do?","Can't claim twitch 1 month free membership","Does staking effect the economy?","Confess your recent or past Runescape sins here.","[SUGGESTION] add a rune defender ornament kit to the game,","Levelling Progress","10 Thousand Hours in MS Paint","How to get AFK Marks of Grace on Mobile","I just lost a 13m cash stack to the Sand Snake from The Depths Of Despair. AMA","Why do I still play this game","Prayer Pet?","People with 0kc at Theatre of Blood","how","I started playing Runescape again, and it seems like no one chats with each other anymore. Am I just in the wrong place?","Can't make a really good cash stack","the bank geometry in west varrock is a direct nerf to pets while smithing, please fix for my poor rock golem :(","Just a friendly reminder to always do your clues b2b 3rd age rip no cloak....","[Opinions needed] Just got back from 3 week vacation and starting school soon. Do i keep it and ride the wave longer? I won't be playing for a few more months at least.","If jagex doesn’t improve/adjust their customer service and the way they deal with their players, this is what’s going to happen eventually.","[Suggestion] Alternative Ranged bonus rings (+1/2?)","Rs Mobile + Keyboard &amp; Mouse?","Suggestion: Move Nieve to Edgeville bridge.","[Suggestion]Let Agility cape count as TWO Graceful pieces, so you can use things like bracelets or gauntlets with the full set effect.","Quests with best rewards for mid-level","Blue drags prayer or defense gear?","RS3 refugee here! Looking for a fun community to hang out in:)","Best way to High Alchemy on Mobile right now (Twitch pop-out)","Wholesome stories thread. This time, the topic is \"fun moments in your early days\". The moments you fell in love with Runescape.","[Petition] Add an Iron Godsword as a cosmetic item from Diango","TIL you can name your cats in-game to anything, as long as it's under 6 letters","This subreddit","[Spoiler] [NSFW]You all know about Nieve...","Vorkath tips?","[Question] Any good OSRS Skilling Clans?","Got 99 Mage. My first 99 on this account.","Arceuus Can't att","Add alterntive ways to obtain pure essence for Ironmen.","[Suggestion] Better Clan Chat Updates","Remember to turn your public chat off","Why hasn't jagex focus on on content for lower level players?","Felt like sharing, 45 def btw","Osrs mobile buff icons","A friend?","Bigginner","Need Help with Rebuild","Wtf they made ironmen a real thing","How to Access OSRS Mobile (a Guide)","I don't always risk it for the biscuit, but when I do...","Well wasn't expecting this during my slayer task!","herbiboar herb threshold levels","[SUGGESTION] Imbued Heart Buff","iOS Beta :)))))","Loot from showing duel arena scammer 300m+","Questing is an Efficient Way to Level Up Skills in the Early Game of RuneScape"]