["Weekly Discussion: What do you think the MCU should do with the Infinity Stones after 'Avengers 4'? (Suggested by /u/tundrat)","Cliff Charles Director of Photography on Cloak &amp; Dagger","Hela cosplay. X-post from r/pics. Credit to u/etymologynerd.","When Spidey first hears Quills voice without his helmet he realises he’s human and his eyes show less concern than before the mask is removed. After Quill said he’s from Missouri Spidey removes his mask completely","Say what you will about Thanos’ social policies, but he’s a bizarrely positive model of foster parenting. His adopted children were well-educated, given personal attention and given positions of trust and responsibility in the family business.","When you try to make a joke on Twitter in 2018","Anyone else annoyed with the missing arc reactor?","It's too bad they weren't together for this one.","When a random person comes running up to you from across the party screaming your name","You're welcome Stan.","My boss told me I need more color and interesting stuff in my classroom. So I put this on my office door.","[CW] Can we just talk about how protective Clint is for Wanda?","Thought the Bad Times at the El Royale poster looked familiar","The group shot we wanted vs the group shot we actually got.","We've come so far the past 10 years. What are some of your favorite MCU moments?","The Avengers 3-film pack Blu-Ray cover art is wrong.","Just two centenarians non-blood brothers trying to survive a world they don't belong to","'Ant-Man and the Wasp' Concept Art Reveals Cassie in Costume","Shoutout to that time Hannibal Buress sent a random dude to the Spiderman press tour pretending to be him","Infinity War detail I noticed","I made a Galactus concept to practice some 2D and 3D techniques. Feedback is greatly appreciated!","Wesley Snipes Teases Two Upcoming Projects In Blade Universe","What MCU quote would be the worst if one word was replaced with “daddy”?","Doctor Strange - Didn't realize how slick this kick was","LEGO custom Thor","That time Hayley Atwell had to get her driver's license photo in full Agent Carter costume and makeup","I want the introduction scene of (young) Agent Coulson in Capt. Marvel to be him negotiating a tense acquisition of a critical object...only for it to be revealed it’s the last Captain America baseball card he needs to complete the set.","Is Hela's full name...","Vision is the only character in MCU, that always calls Cap as \"Captain Rogers\"!","While watching Ragnarok i thought the Address of Sanctum (177A Bleecker street) was a Sherlock reference from 221B Baker street. But TIL that Sanctum address was directly taken from comics and the Sherlock reference was just a coincidence ..","It's been almost two years since Dr. Strange came out and I'm still PISSED about what happened to Johnathan Pangborn.","Marvel's Iron Fist: Season 2 | Building an Epic Fight Sequence | Netflix","Just a little something I made in a cave with a box of PNGs...","Perfectly animated, as all things should be","Marvel’s Iron Fist: Season 2 | Violent Ballet [HD] | Netflix","Forget the Capatin Marvel hype and your Avengers 4 theories. I just wanna know what happened to this man and his family when Thanos decimated Xandar for the power stone and I wanna know right now!","It’s crazy how far Steve has come. These stones have tortured him almost his whole life when you think about WWII and the plane crash. He’s fed up with the power hungry. Now, he will fuck you up and brutally do it. I can’t wait for Cap in Avengers 4.","Full Timeline up to Infinity War linked by Characters","Who would have had the big emotional death in IW if.....","[FANART] Black Panther by Sūpāfro","My Infinity War arc reactor prop I just finished, compared to the first one I ever made.","A little detail I noticed whilst watching homecoming. The man and woman from damage control who took over from Toomes’ crew at the start of the movie can also be seen at the aftermath of the attack at the atm vestibule.","Do you think they'll nerf Captain Marvel for Avengers 4, and if so, how would you do it?","Everyone except Thor doesn't know Hulk can full on talk.","I'm amazed by the fact that r/thanosdidnothingwrong subreddit has more subscribers than this one","Sometimes your neighborhood just needs an Iron Man painted fire hydrant?","Hypothetically, IF Loki somehow returns, and IF tony survives Avengers 4, and IF they meet each other, how would tony react to Loki after the event of the 3 avengers movies and his PTSD from New York","Vision absorbed Ultron and Shuri let him out","Thunderbolt Ross &amp; Bruce should reunite in Avengers 4 and give a closure to their arc","Just for fun, I drew everyone's favorite rabbit with the infinity gauntlet and his infinity gun. Cuz, you know, Rocket would have to build an infinity gun.","Today was supposed to be the day","*Shower Thoughts* Captain America is reffered to as the first Avenger even though Thor is 1500 years old.","Black Panther 2 rampant speculation (spoilers for Black Panther)","This person is up to something.... how does he have the IMAX version? I checked it out and it’s legit!","If Avengers: Infinity War were a Silent Film","Marvel’s Spider-Man PS4: Homecoming Suit vs Shocker","'Black Panther' Environment Breakdown by Mariana Gorbea","I'm gonna make a silver surfer movie one day.","A way for A4 to be Chris Evans’s last movie without Steve dying or ending up back in the 40s","Concept Art vs Movie: Thor and Rocket","[Fan theory] I have a theory about the original purpose of the Infinity Gauntlet. (Spoilers) for Infinity War too.","Beside Star Wars, Did Feige ever reveal other inspiration for MCU?","\"Quantum Instability\" by Kittrose","“Spider-Man: Far From Home” fan-made poster by @UltraRaw26 on Instagram","If you haven’t watched AoS, didn’t like it or whatever...maybe this convinces you? #CoulsonLives","Thanos vs. Doctor Strange extended analysis as high-level combat in the Pathfinder RPG","The most accurate retelling of Captain America: The Winter Soldier I've ever seen","“RELEASE THE TRAILER” boys back at it again for Captain Marvel","My 7 year old programmed her robot to say her favorite Drax line from GOTG 2.","Why is there no AAA game set in the MCU?","My friend's Winter Soldier cosplay from Lanka Comic Con 2018","Theory about the Super Soldier Serum","10 Years of MCU Emoji WITH NAMES","Fate","My Avengers Age of Ultron Quick Rewrite","I really hope Loki is dead","Why doesn't Iron Man just call in Cap to help in Iron Man 3?","Does anyone know why Thanos glows after Doctor Strange closes his fist?","Relive the battle of Sokovia from The Avengers: Age of Ultron in this huge collaborative display","All credit goes to u/conrick","While looking at the Infinity War credits, I noticed RDJ and Chris Hemsworth have their own personal chefs","Avengers 4 - Theory","Tony Starks wedding would be a great time to introduce Reed and Sue.","GOTG Groot","Little Planet hulk easter egg in Ragnarök","MCU Norman Osborn","Nebula 💙","Serious question regarding the future of the MCU.","Hulk is going commando in Tony Stark's pants at the end of Thor:Ragnarok","Prediction: Ebony Maw will be revived in Avengers 4","Zola’s bunker in TWS","Vice interview with Wesley Snipes: Speaks about recent conversations he's had to bring Blade into the MCU &amp; rumors from the Blade Trinity production","Any news of Thor Ragnarok, Black Panther and IW getting matching slipcovers like these?","Avengers 4 will feature 134.46 Avengers","Is the Regal 20 Marvel IMAX movies pass for $50 only on Regal app?","I would love to see Thor reunite with Hela &amp; Loki against Thanos in Avengers 4","Writing Fanfiction And I Need Help","When do you guys think that we will see Valkyrie again in the mcu?","Is this rock giant from Thor Dark World the same kind as the rock guy from Thor Ragnarok?","Chris Evans' \"Captain America\" 1967 Camaro gifted by RDJ at the wrap of Avengers 4 filming","Why does everyone love Captain America: The Winter Soldier so much?","Groot making Stormbreaker’s handle is one of my favorite parts in IW.","I'm really hoping time travel isn't in Avengers 4.","I'm confused about the state of Asgard","Fan Theory: \"Cursed with knowledge'","Infinity War bluray versions","What would be your Top 15 Marvel Films you would like to see in Phase 4?","Anyone have a web site for rating MCU Movies?","Alternate MCU Concept Costumes for Captain America. I want that!","Black Panther and Captain Marvel theory?","Do you think we’ll ever see the Guardians again after GOTG3?","Ironheart MCU Theory","Found Baron von Strucker","Peter Parker's personal playlist","0:18 - 0:36 of \"Porch\" by Alan Silvestri is imo, the highlight if the IW score","People are acting like we missed the opportunity for this scene when Cap went up against Thanos when there’s a really good chance it can still happen considering they’re both still alive for Avengers 4","I think it would be cool if we got a shot like this in Avenger 4 but with Thanos on the opposite end of the arrow rather than Loki, and the Avengers with their new looks.","Was anyone else slightly annoyed that Obadiah Stane wasn't directly referred to as Iron Monger? I loved the film, loved the villain, just wish we got a more definitive 'he's the iron monger' moment, what do you guys think?","When Spider-Man Homecoming broke the timeline: Doesn't this scene 100% confirm \"8 years later\" was inaccurate? Or have I been living under a rock and this was all sorted out already?","I wish this scene from the trailer was released as a deleted scene so we could get more Bruce/Natasha dialogue!","Spotted CIA facility from Captain America: CIVIL WAR in Berlin","Theory/Commentary: this is exactly what Dr Strange wanted to avoid. More in comments.","If the Infinity Stones contained Cosmic Beings, which ones would they contain?","Exactly how much of the future did Dr. Strange actually see.","I've been wondering, after Avengers 4, what big storyline does the MCU tackle next?","When watching TV Shows/Movies, does anybody else like to imagine how they could fit into the MCU?","I just had a thought about Thanos snapping himself.","Thanos &amp; Mistress Death","Evidence Guardians 3 has been pushed from May 2020?","Since the Space Stone's main ability is teleportation, did the Tesseract-powered weapons in Captain America just teleport people randomly throughout space instead of killing them?","What I Want to Happen In A4 (SPOILERS!)","Rewatched infinity war, some thoughts","Full MCU Box Set","Avenger 4 symbolism?","Thanos in Captain Marvel?","[Theory] Why did doctor strange give up the time stone?","Tony was few centimeters away from cutting Thanos' hand. The Gauntlet got in the way as seen from the sparks.","Why wasn’t Loki worried about Thanos before Infinity War?","\"Why people hate mutants while love the Avengers?\" is actually a great issue to explore in the MCU.","Infinity War's Titan battle, but in Naruto style","Why didn’t Strange just alternate the dialogue on Titan","GOTG2 - I can't stop laughing at Drax's reaction when Ego says \"It's not half bad!\"","A look at the ranking of superheroes in the MCU following Infinity War","Black Panther by artist Anthony Petrie, Grey Matter Art, August 30th 1pm (EST)","Infinity War digital 4k?","Thanos obtaining the infinity stones very quickly","Wanna hear your answers to these question about IW","My hand-drawn diagram of the MCU timelime.","Marvel launched 128 characters (emoji-style ) poster celebrating MCU 10th anniversary","I tried adding more to this, but the lines faded away. Guess we're perfectly balanced","Request: I need a high res photo of Stormbreaker","Did Thanos kill him?","When did Maria Hill report energy signatures in Wakanda relative to the battle?","Chances we’ll see a trailer for all three marvel movies by year’s end?","The Usurper, enjoying a meal at McDonald’s.","I can see this splash panel being referenced in Avengers 4!","[Discussion] John Krasinski in the MCU","Hulka Hulka Burning Fudge.","A interesting parallel between The Avengers and Infinity War","Say the fox deal goes through, how'd you like them to deal X-men and the MCU?","The Incredible Hulk - Burger King Commercial","Guardians of the Galaxy video","Where can I find theories on phase 4?","If there is time travel in Avengers 4 what moments from earlier movies should they revisit and do alternate timelines of?","Could rogue kill thanos?","Theory: How Dr Strange,Captain America Winter Soldier and Captain Marvel tie together(original post by u/WamsyTheOneAndOnly)","What is the role of Hella in Avengers 4?","[SPOILER][S***post] When Ava's dad did that thing despite the risks, it sure made him appear...","Anyone else think it would be awesome for Star-Lord to redeem himself in A4 by discovering he still has Celestial powers and giving Thanos an almighty beat down?","Two redditors from 2016 predicted a dialogue interaction from 2018!","I know everyone’s hype about Avengers 4, but I have a good feeling about Captain Marvel","Worst MCU Casting","Interesting Avengers 4 Fan Theory","I want a scene in Avengers 4 where Tony Stark visits Aunt May after he returns to Earth and has to tell what really happened to Peter.","When your customizable character is in a cutscene","Who do you want to replace Gunn for GOTG3?","Which Netflix show should I watch?","Today I'm launching Marvel Guides, a platform to share MCU Viewing Guides and comic book reading orders. I'm sharing it here first with my favorite Marvel community.","What dead actor or actresses do you think would have a role in the MCU if they where alive and what character would they play?","[Spoiler] Why many people think Thanos only beat *him because of his skill and the infinity stone? This part obviously show Thanos also superior in strength, the stone doesn't glow either.","Black Panther inspired custom PC","Would you rather see ThunderBolt Ross used as a Skrull or as Red Hulk?","So following IW, is the infinity gauntlent damaged to the point that is rendered unusable?","Would Thanos have really lost if Peter and Tony got the gauntlet off him?","After watching IW again, I think Stark is the key to victory in IW2, and he already knows it.","Contest of Champions Exclusive MCU Posters","Did Doctor Strange guarantee Tony Stark's fate?","Thanos question","My idea for a Avengers 4 post-credit scene:","Are Galactus and Phoenix Force characters you want in the MCU sooner rather than later?","Rocket :)","Dr Strange sequel's Villain?","Why Dr. Strange bothered fighting Thanos at all, when he knew what the result of the fight would be...","Why hasn’t Captain Marvel been mentioned before?","Any characters within the MCU that you just don’t really care about?","A rare image of Thanos' Left Hand. So. Damn. Close.","Tony should have created a large blade instead of a repulser punching Thanos giving him a papercut","Hail Captain Hydra!","Why is Wakanda not shown to have any interest in space tech, science or travel?","Has anyone seen this? Avengers 4: Avengers Assemble (Animated Trailer) by bigoso animation","MCU Director's talking about James Gunn's impact on the MCU makes it all the more disappointing that he's gone from it","Just a Thor chibi i drew last night.","Question about Doctor Doom","The exact moment where T'Challa became my favourite character in Civil War.","Nice to know there are local S.H.I.E.L.D. agents in my area!","Imagine: It’s the end of Avengers 4 and this comes on screen","I wish this scene was longer","Avengers 4 Idea","Maybe.. Maybe.. Who knows?.. What do you think?","''You're not the only one cursed with knowledge.''","Was Ego right all along?","Avengers 4 and avengers 1","Spiderman's sarcastic joke VS Starlord's envious description","Tony Stark's Decade of Character Development","POLL: Which MCU Hero would be the worst babysitter?","Coincidence?","So Thor is assembling an Army...Valhalla or Hel?","Really hoping for a Doctor Strange 2 announcement, so many amazing visuals to draw on...","Nendoroid Iron Man Mark 50: Infinity Edition","Dora Milaje by Terry Huddleston","I made a cartoon about what Thanos should have done...","Just got this in the mail! I’m really hoping that Adam Warlock makes an MCU appearance! Jump in the soul stone and destroy Thanos from the inside!","Imagine Tony dying and him being in the same position as he was in Avengers 1 with Steve above him, but this time, Tony is actually dead and instead of smiling, Steve is crying onto Tony's armour.","Reed Richards fancast: Norm Macdonald","An unpopular Thor opinion","Cliff Charles Director of Photography on Cloak and Dagger.","Iron Man 3 is the most ignored and irrelevant MCU movie","Thanos' base power level vs Hulk?","Is it possible for Quicksilver to come back?","\"At what point do I have to say, enough with the robotic arms?!\"","Guys I think that agents of shield should be in Avengers 4","Avengers 4 Villains","Marvel should cast Awkwafina as Jubilee as soon as possible.","[Fan Content] T'challa himself","Thanos And His Method Of Destroying The Asgardians Makes No Sense","Before Ragnarök and Infinity War, this was the biggest feat Thor ever did.","How do you feel about Mysterio as first post-Infinity Stone arc villain?","\"Mr. Cake? I don't feel so cake...\"","{Spoilers}Could groot be alive?","I have a small theory","This Doctor Stephen Strange is not the one that looked into the future originally. This Dr Strange has been through the conflict and has essentially taken over his younger self to guide them through the steps to win. In a way, Strange sacrificed some of himself to win.","[SPOILER] Re: Thor's eye","Just found out James Gunn has a Spotify","Found this at Walmart, never even knew they had this version of the cover for the film","Guardians movies are stories of redemption and acceptance.","Zachary Levi supporting #Avengers4Keira.","Look how far back Wanda is able to push Thanos when she turns she tries to hold him back with her powers! Her strength and ability was depicted really well in IW.","I wrote a line for Avengers: Infinity War. AMA","When Thor and Thanos fought off screen, did Thanos use the power stone to beat Thor ?","Robert Downey Jr. Gave Chris Evans A Steve Rogers Themed Camaro","Bucky’s weapon(s)","The moment I fell in love with Stark's character. 10 years into this universe and Iron Man still remains one of its crowning achievements.","Did you know about this already?","It's these scenes right here why Thanos would've NEVER been defeated in the Battle on Titan. Even if they took the gauntlet off, it'll probably be just a simulation made by the reality stone.","Michael Mando aka Mac Gragan aka The Scorpion is doing an AMA on Wednesday!","\"He was the truth I chose to omit\"","What if Killmonger had lived to see Infinity War?","Willy Wonka and Grandmaster","[Spoiler] The Homecoming suit in Marvel's Spiderman","Would you watch a Marvel movie if it didn't have any fighting in it?","Skrull theory i guess","Thanos’ relationship with his “daughters”: Perfectly balanced?","[Theory] what if at the end of captain marvel, we get to know that some heros are a Skrull all the time?","These are the 4 best times to attack Thanos in Avengers 4","Mjolnir theory about Helas destruction of it","I hope we get to see something similar to this in the MCU. What some scenes you guys would like to see in the MCU?","Nebula &amp; Tony ! I hope they will team up!","So many threads about who stacks up against Thanos and no one mentions Starlord","Who actually is upset about Gunn?","[Spoiler] Infinity War: Titan Confrontation","SURVEY : what's your favorite/least favorite hero(es)/villain(s) in the MCU? Please elaborate a little","How to Play Captain America in Dungeons &amp; Dragons (xpost from r/DnD)","Question: Why did Dr. Strange kept asking Tony to turn the Q ship back to Earth when he himself can create a portal with magical ring he has and get back to the sanctum?","What’s the best case scenario for GotG Vol. 3?","Good fan trailers vs. bad fan trailers","I tried drawing IW's Thanos - not the best sketch, but I had fun w/ it!","A small Infinity War theory","We already saw Avengers 4 footage....","How to handle mutants in the MCU (alternate)","What I predicted came to pass...","Top 10 Best Changes From Comics to Movies in the MCU","can captain marvel and thanos be relatives in mcu?","Guardians Vol. 3 Soundtrack","Both of this scene from trailer excited me for the movie. But neither of them were in the movies. I was waiting for this two scene the whole time upon first time seeing the movie!","Marvel Cinematic Universe Films: Survivor Round 6 of 19","I love this moment of pure rage from Thanos after being crushed on Titan. One of my favourite moments of Infinity War.","Fun Fact","What is the decision that Marvel Studios made you hate the most?","I love the idea of Doctor Strange 2 being a psychedelic horror film. Here’s my picks for Nightmare. What crazy stuff do you want to see in the Nightmare Realm?","Who should direct the next Guardians? (Besides Taika Waititi)","Ant-Man and the Wasp has one of the creepiest post-credit scenes.","Interesting Dr. Strange theory","Question about Heimdall and the Bifrost...","What are some of your unpopular opinions?","So on my latest viewing of infinity war I think I noticed exactly why Starlord had to do... What he did.","[Spoilers] Emotional scenes in IW","Coulson for POTUS!","Will you watch the Avengers 4 trailer?","It’s Exciting to Know This Will be Onscreen One Day","MCU Database spreadsheet featuring all past/future release dates, box office statistics, Hero/Villain data, and more","How Would it have been if Thor, Groot and Reckon were at Nowhere with Thanks?","Got an iTunes gift card, should I get Iron Man or GOTG?","Title guesses for Avengers 4?","Does anyone else think that for some reason this suit looks much better in Civil War than in any of its's other appearances? I don't know why but it just looks better to me, let me know what you think :)","Spiderman must become a man.","An old Civil War promo Pizza Hut box I remembered was on my camera roll","Sony’s Spider Men in the MCU","On Twitter someone called Thanos 'Space Deebo', so I made this after I watched Infinity War back in April","New Iron Fist themed banner for people who can't see it.","The parallels after the final battle of The Avengers (2012) and Infinity War (2018).","What More Could I Lose? (Thor Fan Edit)","How Would it have been if Thor, Groot and Reckon were at Nowhere with Thanos?","Avengers 4 casting call that could hint to something from Phase 1 [SPOILERS]!!!","Anyone thinking about how avengers 4 is already filmed but Tom Holland hasn’t spoiled anything yet?","Why do we still need spoiler tags?","The snap and Gamora","A little Thanos drawing I did","Unique commentary on Avengers","Best/cheapest way to watch all of the MCU movies thus far?","Well this just angers me...","What happened to Titan?","Found this in my school’s library","This painting should be made into a canvas for wall hanging!","Reminder AMA Announcement: CLIFF CHARLES (Director of Photography, Cloak &amp; Dagger) AMA, August 28th 12pm PT/3pm EST","Wakanda Defense Team includes 4 members from each Civil War team. Perfectly Balanced?","Can we talk about Soulworld? (spoilers)","Thor - Victory","If you could adapt any Marvel comic arc into the MCU, which would you choose?","Which date did thanos snap his finger?","Are the songs of GOTG Vol. 3 part of the script? Or is the chosen director going to have the rights to choose?","Why thanos’s “all that for a speck of blood” line is really powerful when considering Tony Stark’s character.","(Marvel) Peter Parker | You're An Avenger Now","A second wilhelm","Thanos doesn't understand basic math","Captain America Theory","Marvel Legends Infinity Gauntlet Replacement Part","Post credit for A4","WHAT HAPPENED TO THAT PLANET/STAR IN THE SKY BEHIND THE TIME STONE?!?! LET THE FAN THEORIES BEGIN!!","Ant-Man and the Wasp: Scott’s IQ decline","Still my absolute favourite moment from any Marvel film.","Do you think we'll ever get to see this costume?","Avengers Infinity War Movie Mistake - The Maw's Q-Ship Self-Repair &amp; Then It Wasn't...?","Did Benedict Cumberbatch shoot all/most of his Titans scenes separately?","I'm thinking about making Infinity War-related fan-made comics. Any thoughts?","A random thought about Strange and The Time Stone...","So why was Wong in NY during Infinity War?","Why do all frescos in the Asgardian throne room(including the ones from Hela's time) depict Odin as an old man with white hair and beard?","Paddington Station","I really like this scene between T'Challa and Zemo, both of them have a similarity, which is Vengeance. But I like how they resolve the problem is pretty contrast. It helped that both of them did a great performance in this scene.","Found this picture scrolling through my Camera Roll. We’ve sure come a long way.","You said it yourself, bitch. We're the Guardians of the Galaxy (in Lego)","Introducing...the official Capmobile!","So Captain Marvel is going to use that helmet in the movie","(Spoiler) My theory about IW’s ending","If Infinity War was an anime","If time travel is at all relevant in A4,...","Forge theory! (Possible A4 Spoilers, but only a theory)","What if Thanos isn’t the main villain of A4?","Doctor Strange in Avnegers 4","Fate of the children of Thanos","Cable in the MCU","Thunderbolts Movie Poster (Fan-Made)","Possible thanos vs dormamu","Any reliable sources on when we'll be getting our first Captain Marvel trailer?","Mark 50 fan art I made","Bp2 Costume thoughts.","IW's tracklist if Giacchino scored the movie...","H O W","SHUT UP ABOUT PLOT HOLES","If the Avengers/Guardians were a Presidential cabinet, who would do what?","Future of the Guardians of the Galaxy Franchise?","Speaking Of Pizza Boxes, Here’s An Old SM Homecoming One That Looks Pretty Cool!","Ant-Man and the Wasp: Scott’s suit problem.","First Captain Marvel merchandise appears!","Who's Where When in the MCU?","Teen Groot who is on screen less than 5 minutes in Infinity War has a character arc where he goes from being a careless and negligent teen to becoming a selfless and responsible Groot. Regardless of the magnitude IW had, it gives a decent character arc to almost every character possible","Thanos Snap","What irked me about Ant Man and the Wasp.","Happy National Dog Day to the best thing to come out of the Inhumans","UNgrateful universe?","Currently watching Infinity War on the jumbotron at the university of wyoming","[Fan Art] Home of the Mad Titan by Koki","Ant-Man in Avengers 4, I'm super excited","Thor can never catch a break with Loki.","JJ S2 OR LC S2?","Despite trying to kill everyone, Ultron had a pretty good sense of humour.","Rewatched Black Panther on Blue Ray. Such an Amazing movie! BUT ...","Thanos Avengers Secret Ending","Stormbreaker","Infinity Pooh - I spent waaay too much time on this","These two tweets lined up perfectly","Intreresting how the most iconic interpretation of Bruce Banner is also the only one that's never had his own movie(or TV show).","I know it is not MCU, but since this is more proper an origin story for Hulk than the credit sequence in TIH I always include it when rewatching the MCU. Who’s with me?","This is how I initially wanted to Infinity War to end... But considering Drax's relatively small role in the MCU, and the PG13-label, I don't see it happening. I wouldn't mind seeing Phase 4 adapt the Annihilation storyline, though!","POLL: Who is the funniest MCU hero of all-time?","Perhaps one of the funniest scenes in IW","MCU Death Scenes where no-one died","Question about The Collector","Would love to get Charlie Cox for AMA on this subreddit before Daredevil Season 3.","Gundam X Marvel (artist 油屋とんび)","Why the \"Bring Me Thanos\" scene is the best scene in the MCU of all time","The Avengers Then VS Now [Minimalist Art]","Is the realm Hela was trapped in the same realm the Ghost Rider went into using an Inter-Dimensional Portal?","\"_______ will return\"","Starlords impact on Infinity War","My other superhero-themed creation: Baby Groot amigurimi!","A silly thing I made to celebrate the two Sherlocks in the MCU","MCU Thanos is the polar opposite of Comics Thanos","He deserved so much more","A bit of foreshadowing for Avengers 4 from Thor: Ragnarok..","Gotta give it to Chris Hemsworth in this scene, one of my favorite scenes in the film.","This aged like milk","Why Avengers 4 will be better than Infinity war?","Fan theory/headcanon on \"no resurections this time\" I promise it's not about Loki secretly being alive or coming back.","I don't know if this was posted here. Spoof of Infinity war by some Indian Kids.","The reason Spiderman is consistently hated by the public, yet saves them anyway, is because spiders are generally hated despite their vital role in curbing pestilence.","Thanos wound Disappears after putting the Time Gem.(That all for a drop of blood?)","If you could choose a team of characters best suited to defeat Thanos, who would it be?","Avengers: Secret Invasion poster I made","What’s your favourite scene from Infinity War?","Captain Marvel Promo Art","Remember in an interview where Karen Gillan stated Nebula would make a new BFF in one of the Avengers films? I know most speculate that it could be Tony, but what if it's actually Shuri based on this photo shoot?","MIA Thor","Why Thanos not creating resources with the gauntlet is not a valid criticism","Something I noticed during the Battle on Titan","Captain marvel-Ronan question","Why didnt Scarlett Witch bring out the hulk in Infinity war?","What do you guys expect for the 5th Avengers film?","Tony was been working with nanotech since Iron Man 2 (from a deleted scene)","Who probably will not come back?","A reality where Thanos was defeated.... And it actually happened in Wakanda","A4 Time Travel","What if the title \"Avengers:Infinity War\" is not due to the infinity stones or the gauntlet but instead it's due to the infinite number of alternate timelines where Avengers have fought Thanos and won just in one....!!!","This is awesome","Avengers: Age of Ultron: Good or Bad? Discuss.","Sam Wilson can roll with the punches (which is good because there are a lot of punches)","'Success'. My Thanos SDCC poster finally arrived today.","Dormammu, I don't feel so good","Will meeting captain marvel, and whatever happens in that movie, be what gives Nick Fury the idea for the Avengers Initiative?","[No Spoilers] First Avengers","Doctor Strange 2, in my opinion, could be a perfect link to the TV universe.","Thanos firing all six Infinity Stones at Thor. Amazing how Stormbreaker was able to cut through the raw infinite energy of the stones","Similar to the Tony/Pepper and Cap/Peggy scene sharing the same score, when Strange asks Thanos \"Then what?\" to his response of \"I finally rest...\" the track Porch begins to play, the same score used to end the film.","Shuri 2.0 by BossLogic","[Prediction] A4 starting positions","Spider-man and continuity","Should Cytorrak be a potential villain or ally to Doctor Strange in his upcoming movie(s)?","What exactly does Tony need Friday for?","Ned spoiled the whole movie","Soul Stone and Loki","Ultron is actually incredibly similar to the villain Moloch in Season 1 Episode 8 of Buffy the Vampire Slayer, created by Joss Whedon, who wrote and directed Age of Ultron.","Who would win from a fight of Black Widow, Valkryie &amp; Okoye?","\"I should have taken you back long ago. Instead we are both abandoned here.\"","An idea for a MCU phase 4 lineup.","What do you guys think Tony Stark's important role will be in Avengers 4?","Taking requests to photoshop fancasts! (free)","This video actually opened my eyes! It looks like all MCU movies are kinda the same with their stories 😲","Captain Marvel by Eric Basaldua","What would happen if Banner had been dealt a fatal blow in the war?","Which MCU character are you okay with staying dead?","[Discussion] I think this would be a good next installment for Thor. Thoughts?","Could X-Men and the Fantastic Four be introduced on the MCU ?","Does anyone thinks Thunderbolt Ross is about to get fired as Secretary of state after the events of Infinity War?","The hipocrisy about the american fans","The Black Thor!","Let’s keep #Avengers4Keira going. Anyone find any updates?","Captain America Stunt Actor Wants to Play Moon Knight","The Plot of Avengers: A Light Dusting","Iron Man - Trailer [HD] | What Started It All ...","How Bad are the One-Liners in Infinity War?","MCU Fantasy Football team name.","Do you guys think Marvel will announce the Phase 4 plans at D23 next year?","From an interview in Ragnarok bonus content... Chris Heimsworth on Thor films","Do you think street tier characters will have a place in future Avengers movies? (all spoilers)","Where is the infinity gauntlet","From someone who has never seen any of the MCU films in IMAX, does anyone have a recommendation for which one to see?","Where can I get a digital download of infinity war that includes the directors commentary?","Avengers 4: Tony Stark steals the cloak.","All credit goes to u/deathdart340","Theory: Tony selling the Avengers Tower was meant to open the door, for when Disney bought back Fantastic Four and it'll be the Baxter Building","Could the Quantum Realm be the intro to the Fantastic Four?","Question About Heimdall","I am Tom Pelphrey AMA","Da Hell Disney","Asgardians on Earth","Question about thanos snap","Do you think that ant man's extended time in the quantum realm will help him overcome the issues he has with supersizing?","Avengers 4. Will they find thanos. Or will he come after them again when they start doing whatever it is they’re gonna do to fix things?","Infinity Stones Post-A4","Drawing ironman:)","One scene that you love the most out of all Marvel movies?","Rocket's obsession with body parts","Any good Marvel podcasts out there?","The Outriders were shown to be burned and cut by Wakanda’s barrier. Wouldn’t it have been cool if Shuri had made the barrier turn on and off in the section really quickly, effectively cutting the Outriders into pieces?","What are the odds that rocket stole something from Nidavellir 🤔🤔🤔","Headcanon: Skurge (Thor Ragnarok) is the son of Dr. Randolph (Agents of SHIELD)","The alien army in the battle of Wakanda.","Deep down Erik Killmonger is a scared kid that became lost after his father was taken from him. He was left with nothing but his need for revenge, the only thing that made sense. Michael B. Jordan killed it.","Continuity error. Not a big one, just something I noticed.","‘Ant-Man and the Wasp’ Leads Global Box Office With $68 Million in China – Variety","I haven't seen anyone suggest this A4 Title","Got a question for ya'll to ponder because I cant decide. Who would win in a fight, Steve Rogers or Jessica Jones?","2011 is the only year where Marvel Studios are not King of Box Office","Third Ant-Man Movie!","Favorite scores/music from MCU?","This masterpiece was printed on my fiance's 3D printer and then painted by our friend Gio, who is the on-set scenic artist for the TV show Gotham.","Future Foundation Fancasts","I saw this very cool soup can today at my local grocery store.","A theory as to why Thanos was struggling with Steve Rogers in the final moments of the Battle of Wakanda.","Infinity War Question i havent seen anyone being up so far","Made this for my sister’s baby shower. She’s a huge Cap fan!","Hulk vs Thanos in Infinity War","X-men on the horizon. How do they fit in?","My Avengers Action Figure Toy Collection","In 14 million simulated timelines, all 5 original remaining Avengers survived the snap 1.7% of the time. Guess we got lucky.","How do you think Marvel change our perception of superhero movies ?","ANT-MAN AND THE WASP debuted with a mighty $68M in China this weekend--the 4th highest MCU opening of all-time in the middle kingdom.","World is about to be destroyed by a purple man holding infinity stones including your wakanda but here you are bitching about opening of your little wakanda to the rest of world. #Priorities #WakandaLogic","Who will (most likely) die in Avengers 4","MCU MARVEL'S THE UNCANNY X-MEN character/story pitch (possibly some spoilers for mcu tv shows)","Could the U.S army have defeated Thanos?","Made this Captain America blanket for my nephew for Christmas!","every time i see stark in a scene in avengers 4 you just have to smile how far he's been in this world especially his first flight test to going from another planet and made a big purple alien guy bleed","The *Infinity War* trailer #1 dialogue (plus a few scene descriptions), but feat. the TV characters","Why Banner didn’t try to force the Hulk out in Infinity War","Tony / Pepper phone conversation in Infinity War","Logical proof that Thanos is full of $#!&amp;","Just a doodle I made that doesn't feel so good.","One of my students drew this for me!","Official Captain Marvel merch started to pop up online","Guardians of The Galaxy 2 is a top 10 MCU movie","The Hulk","Hey, the Runaways are getting their own Funko Pops!","My kind of A4 Ending!","Anyone else think the scene where Mantis gets turned into paper and Drax into rocks is nightmare fuel","Iron Man's nano suite redistributing is the coolest thing.","I tried to come up with a newly rebuilt wakandian Vision! What do you think?","How does Nick Fury lose his eye in the MCU?","We should be getting the captain Marvel teaser any day now right?","Some Ideas For A Thunderbolts Movie","Did you know about this guys?","If Iron Man dies in A4....","If Steve had a replacement","In the theme of being perfectly balanced, I wish the trailer date for either Captain Marvel or Avengers 4 will be in October 21.","I had a pretty cheesy dream for Avengers 4.","Loved the witty dialogue in this film","Some question regarding Infinity War","Gamora and Nebula by vest","My pin for Iron Man fans","Disney Streaming Service apparently has a name: Disney Play","MCU movies mirroring eachother","Why am I seein' so many hate comments for Carol Danvers/Captain Marvel ?","Stealth armor?","r/MarvelStudios, how has the MCU shaped you?","How exactly did the tesseract get to its location?","Scott Lang and Janet Van Dyne’s quantum entanglement connection creates a communication channel between worlds.","A better Fantastic Four movie","Theory for Captain Marvel","Tom Holland Peter Parker's Spotify Playlist","Avengers 4 Titles","Cap's cell phone","Did Thanos use the Power Stone against the Hulk?","Where are the Mary Sue complaints about Doctor Strange?","Who’s better?","(RECREATED) Avengers Infinity War Comic Con Trailer","In Avengers: Age of Ultron, one of the alternate personalities for Tony’s virtual assistant is Jocasta, Ultron’s female companion From the comics. Just noticed on my 15th viewing.","[YTP] Avengers: Infinity War","If Hulk hadn't been part of Thor Ragnarok, how would that have affected his absence in IW?","Playing God of War makes me wish we had a mulligan on the Thor movies","Dr Strange is one of the only two people who has out-sassed Tony Stark himself!","What New Heroes Are You Hoping Have Their Own Movie In The MCU?","Captian Marvel question","[x-post] Knowing that I'm a big Ironman fan, my nephew made me this sketch..","Steve's been through so much in the last 7 years, he might as well have stayed a Capsicle.","Gamora and Nebula are the new Thor and Loki.","Ronan vs. Thanos","Avengers: Out of Time","When Thor tells Loki he’s the worst brother???????","MCU X-MEN pitch (alternate)","Question about Thanos vs the Hulk","Captain Marvel fanart by superhero_world1996 on IG.","Captain America's shield obeys the laws of physics change my mind","Missed Infinity War Opportunity","Thanos's use of the time stone","Everything's going to be OK with GotG3.","Can you skip a few movies?","I have no idea why they decided to give this T'Challa plushie eyes, but I love it","I think Wakanda or Black Panther should’ve been mentioned/Referenced in Luke Cage season 2.","Both versions of Thanos with gauntlet.","The Iron Fist we deserve","What is your favorite moment in MCU? Havent seen a single post about favorite moments.","Tried to design New Infinity Gauntlet for Iron Man. This Digital painting took 10 to 12 hours to complete..","What if James Gunn \"got fired\" because GotG 3 was never the plan? What if it was all just a ruse so that we think.....","Would Hulk have held his own against Hela?","How do you guys think his portrayal of banner would've worked had he been in the MCU.","Age of Ultron and Infinity War \"Foreshadowing\"","(FAN-ART) Bill Foster Project G.O.L.I.A.T.H in the 80's","This exchange in Spider-man Homecoming heavily implies that Toomes gang makes Scorpion's tech.","What kind of Animal would each Marvel Character be?","I wonder if the Black Order knew who they're fighting against. I'm sure rumors about how a group of six defeated the Chitauri Invasion have spread throughout the galaxy.","No marvel movies on netflix MENA.","Visiting my mom this weekend and made her watch Infinity War with me. She hasn’t been keeping up with the series since I moved to college but her reaction to the snap was perfect.","Is Natalie Portman returning as Jane Foster? What's the latest news?","If someone were to watch all the movies from start to finish, what would the proper order be?","Will we see Hela at all in A4?","If Thor understands Groot, why did he named him tree when intoduced to Captain America?","Besides Thor (and possibly Captain America), who else do you think could possibly lift Mjolnir if it were to be reformed?","In infinity war Ebony Maw says that Thanos is the first to weild two infinity stones, but Loki had the scepter and yhe tesseract in the first avengers, did he just not comprehend what power he had?","The Mind Stone is the only Stone directly named in the film’s before Infinity War. The others are referred to by their containers, a nickname, or simply as Infinity Stones.","I have a feeling that's the title","What is your favorite post credits scene?","How much does it costs to kill Stark's family","Ten Years of Marvel Studios - Another World - (Clip)","Iron Man. That's kind of catchy. It's got a nice ring to it.","What does Thanos choose bubbles?","[Question] Minimum amount of MCU movies to feel sufficient impact of Infinity War ending?","I hope Thor keeps stormbreaker rebuilds Asgard. And becomes a character that’s so powerful that he only pops up in REALLY big team up movies. Thor has suffered enough out of all the Avengers he deserves a happy ending after A4.","There was an idea...","Do you think this will happen on big screen?","I'm just curious, what happened or where is now the spear of Odin?","Captain America is lame character change my mind. (IW spoilers)","Did the T'Challa/Bucky fight from Civil war ever pay off?","[Theory] Stan Lee's cameos actually mean something.","Thor The Dark World has one of the more interesting opening sequences and I appreciated how it dove deeper into the mythology of Thor. Also wish we got more back story between Malekith and King Bor","A quick question for IW and AoU","Questions about finale of Avengers Infinity War... Spoilers Obviously","Did Thanos carry out ragnarok?","[A4] I have a theory about a certain friendship and how it will affect Banner...","Loki Could Have Save The Universe.","Nebula's New BFF is Rocket Raccoon","Ok I have a question about Ant-Man","How the movies link you with TV Shows.","Doctor Strange and its resemblance to ancient Hindu and Buddhist mysticism","Fury’s new message.","What MCU quote would be hilarious if you imagine Korg says it?","The hidden arm spike - fastest way to lose a fight in the MCU","Iron Man 3 is actually a therapy session😂😂😂 so how much of the story is fact and fiction? How much did Tony exaggerate just to keep Bruce interested? we may never know...","A shower thought: Thanos and Loki are opposites in IW","Do a quick elevator pitch (100 words or less) of how you would write Avengers 4.","What if Shuri became Iron Heart in the MCU?","Groot's real name?","Who should replace Guardians of the Galaxy Vol 3's release date?","Don’t understand why this movie was shot in “IMAX” 1.90:1 if it’s only available in 2.39:1 on home video...feel robbed","Just to remind you that Avengers 4 sounds insane!. What to do when waiting for Avengers 4 trailer? Watch news about Avengers 4! There's a bunch of hype there. Also Have a good day.","Infinity War in 4K is one of the best movie experiences in my life","Among the many reasons Nick Fury is THE ice-cold BAMF.","Loud cinema audience vs quiet cinema audience?","You can feel his pain during this shot.","Which MCU characters would you pit against which DCEU characters?","Loki by taking the space stone in Thor: Ragnarok unknowingly caused the extinction of his race, if he left it there Thanos wouldn't go for their ship therefore the asgardians would've lived.","A Chronological Dilemma","Help me settle something with a friend. The argument is who would win in a fight. Jedi counsel (jedi counsel in revenge of the sith, including anakin) or avengers (infinity war).","Am i crazy, or could you replace like half of the Avengers with regular soldiers and get better results?","Another brilliant thing I love about Infinity War is Alan Silvestri's score! \"Victory\" gives me chills every time, it's Marvel's Rain of Castamere IMO.","Can someone make a GIF of Spider-Man saying \"I'm sorry?\"","How would you redo this iconic suit in the MCU?","MCU Oscars","Why didn't Strange Sling ringed out of the flying donut if Stark didn't want to return home?","How do you think Phase 3 would turned out if Perlmutter and the Marvel Creative Committee were still involved?","Eric Wareheim in Ant-Man 3","Captain Marvel MCU connections","During the epic battle (and my absolute favorite in the MCU) between Thanos and Dr. Strange, what two stones are being activated in this scene, and what effects from the two respective stones follow to combat Strange?","What happened to this guy? Sorry but I'm not able to get if he survived Asgard destruction?","Tony's suit in A4.","Had a thought regarding A4?","Gamora fanart","I moved in with a new roommate and he left me a message on the fridge... I think we will get along just fine.","Steve Rogers takes umbrage at Nick Fury's compartmentalisation approach to intel, especially with regard to Bucky. Steve employs this same tactic when talking about the death of Tony's parents.","The Marvelists return to the MCU with our thoughts on Ant-Man and The Wasp!","I do NOT want GOTG to be absorbed into a new Thor 4 movie, nor do I want Thor characters absorbed into a new GOTG.","Mike Colter was the star at Soda City Comic Con today in Columbia, SC. Very glad I was able to see a fellow Carolina alum!","MARK RUFFALO? or ED NORTON?","Stark, Strange, and Parker on Titan.","Interesting speculative post: If Marvel Studios Would Add THOR to GUARDIANS OF THE GALAXY VOL. 3 it Would Excite Fans More Than Ever","My mom just came up with a theory for IW","Something I just noticed about Thor’s entrance to Wakanda, not sure if anyone’s posted this before","Finally put up the Odeon Infinity War posters in my room!","(not another theory) Imagine the potential of that possible time travel in A4 in terms of characters interactions","What's the best video recap to watch before Infinity War?","Every Avengers movie ending with Thanos smiling","X-Men and Mutants ... In the MCU","Question about Hela","I laughed out loud when we accidentaly paused Infinity War on this Billie Madison'eque quote","Russo Brothers share awesome and emotional 'Avengers: Infinity War' fan video titled \"Sacrifice\" by TheGaroStudios","All Captain America suits in MCU","[Theory] Cap will hand Tony the Gauntlet in A4","ant man 3 title","Ant-man 3 will probably happen now but with a few caveats","'Iron Fist' Season 2 May Introduce Daredevil's Sidekick 'Blindspot'","Where can I buy IW (digital) in the UK?","History Of Captain Marvel! (Carol Danvers)","What do you think about getting Kevin Smith to direct ‘Guardians of the Galaxy 3’?","Spoilers My understanding of why the mind stone was bigger when Thanos pulled it from Vision’s head","MCU heroes usually fight the others when they're introduced","Marvel movie ideas","Can we talk about how the infinity war scene where Strange was saved by Peter and Tony made zero sense physics wise?","Lee Pace on Instagram: #captainmarvel @marvel","This scene from The Infinity War Trailer... What if its from Avengers 4?","Something I noticed about this fight in Infinity War","Iron Man 2 wasn't perfect but it still has the greatest \"suit-up\" moment in the MCU.","Iron man shouldn’t die. Capitan America should bite the dust. Let iron man be a rare Avenger that appears every so often after A4. Because let’s be honest, Iron Man can comfortably retire if he survives A4. Tony and Thor are the ones I want to have an actual ending that doesn’t include death.","Will Tony make a new suit in Avengers 4?","surprises","How I want Captain Marvel's first interaction to the Avengers to look like and how Hulk would ultimately emerge out of Banner.","pretty neat continuity with rocket in IW(minor spoiler)","What the A4 post credits scene should be","Hear how disdainfully Loki says Odinson and then compare it to when he says it in Infinity War.","Just always looking for that piece of my soul","I hope we get something like this in Avengers 4","Ironman suits in MCU","'Guardians of the Galaxy Vol. 3' Production Put On Hold (Exclusive)","Yondu sleeps with Mantis","Did Thor care about Hela at all?","What if Marvel dealt with having to recast Rhodey like this:","I like to think this was a code Natasha and Clint came up with when they worked together (Budapest) to ensure they’re both on the same side.","Just realized that when Thor headbutted Iron Man, he dented his helmet.","Showerthought: If Ragnarok counts as the third Hulk film, then 2 out of 3 Hulk movies involve the Hulk fighting a giant dog.","We are dead","In Infinty War when Tony tells Strange to hide the Time Stone, Strange says he may want to use it. Later, he in fact does attempt to use it before the Maw strangles him. How did Strange intend to use the stone ?","[Poll] Without looking it up, is it Nidavellir, Or Nivadellir?","As annoying as this might be, this gives me chills and puts me right back in the theater as if it were April 26th all over again","Thanos cast.","Wakanda Forever","new classic comic and more sleeker outfit for dr strange 2","[OC] Infinity War except it's Anita Meyer","Dorothy Steel, the 92-year-old woman who played the Merchant Tribe Elder in 'Black Panther', explains how she landed the role and started her acting career at 88.","Infinity War: Who's Fault?","Should Guardians 3 be replaced by another movie?","So quite a while ago I asked this sub which Order I should watch the marvel Netflix shows in, and this is how far I’ve got up to now. My goal is to finish the last two seasons before Iron fist S2. Do you think I can do it? (I just finished the Punisher an hour ago)","Thor 4 Should Bring His Brothers Into The MCU","Which Hulk is your favourite and which Bruce Banner is your favourite?","Soul Stone (Spoilers for Infinity War)","\"Like Eugene O'Neill long\"","The ending for Avengers 4...","Absolutely perfect way to tease the Xmen in the MCU.","Imagine if it happened lol","Another theory on Strange's plan when he gave up the time stone...","Top 5 Strongest Avengers","Ebony Maw is lazy! Well instead of fighting off Hulk in IW which he was supposed to do, he rather let Thanos fight Hulk and enjoy mere spectacle. What’s the purpose of employing him if employer himself has to perform daily chores. Perhaps he should have fired him for being lazy!","For all the flack this movie got, it still had one of the best Marvel title sequences","Paul Rudd Talking About Filming Ant-Man","Question, question - is there a specific thing you'd change about Spider-Man: Homecoming or Spider-Man in general in the MCU?","What will happen to the stones after A4?","Was anyone here actually surprised Hulk was in Thor Ragnarok?","The Mk I from Iron Man is the most under appreciated suit.","Cap's question to Thor brought back painful memories.","I’m now accepting this as headcanon.","Captain Marvel's possible role in A4.","So what speculations do we have about the ramifications of Guardians 3 being delayed on the blueprint for the future of the MCU?","Alternate ending to infinity war","How many times is the soundtrack that plays when Thor arrives in wakanda played throughout the entire mcu?","What character interactions do you want to see in Avengers 4?","Nebula's new BFF is... [Spoilers]","The true look of a man wanting revenge.","As long as one man stands against you, Thanos, you will never be able to claim victory.\" “Noble sentiments from one who is about to die.\"","A satisfying watch of some Infinity War Visual Effects","In Avengers 4, will War Machines suit be nano-tech or not because his suit is very bulky, but stark has nano tech?","When Stark, Strange and Peter are Maw's ship in IW and they are discussing getting home, why doesn't Strange just conjure up some glowy orange portals home? Where did his sling-ring go?","Avengers 4 Time Travel","Defining the Movies, Defining the Heroes","Dude, you smashed his brother in NY","Thanos drops a sweet Snatch reference","Why does Dr Strange talk funny in Infinity War?","Storylines You'd Like to See","Who is this supposed to be? [From Ultron's first meeting with Jarvis...sorry for potato quality!]","The Avengers Will Return","I love Thor gets instantly comfortable and happy with the Guardians when he finds someone who is a big WEAPON FANATIC like him! Love how the Russo brothers paired these two up👍","Thanos wasn't using any infinity stone while plucking out the mind stone from Vision's body, that was just the strength of his hand crushing open a Vibranium body !","How will they promote Spider Man: Far From Home before Avengers 4?","Most sexualized woman in the MCU?","4K Blurays native or upscales","SNAP","The most cinematic shot of Star Lord in Infinity War IMO","How old is Valkyrie really? (Possible Spoilers)","Astros SS Carlos Correa’s MLB Players Weekend Jersey","Iron Man 2 Blu Ray doesn't have deleted scenes?","Infinity War Credits Question [No Spoilers]","Do Scarlet Witch's Powers Have a Certain Range?","Avengers: Infinity War opening • My Hero Academia style","We all know, it's gonna be awesome.","Avengers 4 potential spoiler. This meeting could be amazing given that they share interests","Which battle was the best?","Could Abraxas work as an MCU villain?","Agents of Shield Season 5 Bluray releases on Oct. 1st in the UK","Is 4k worth it?","Understanding the Balance of Thanos (spoilers maybe)","MCU TIMELINE","At this point I really believe that Gunn wouln't come back even if Marvel/Disney ask him.","Could anyone write down an in depth summary of Ant man and the Wasp please?","Black Order Name Meanings","Who else can’t wait to see these two together in the MCU?","Ben &amp; Jerry's missed an opportunity big time","Why I think Tony will be the downfall of Thanos","Inconsistency in MCU from Spider-Man: Homecoming and Avengers: Infinity War?","Spider-Man homecoming has interesting implications.","Like Father Like Daughter","Dr. Doom could be the villain any of these upcoming films and it would make sense.","[Theory] Rocket is going to be the focal character of Avengers 4.","Living tribunal reference","Thor 4 costume design.","What I want to see after the Fox merger when the X-Men and Fantastic Four characters are allowed.","Do you think we’re seeing all the major events of the MCU?","I hope Avengers 4 will show the consequences of Thanos's Snap","Guardians 2 or Black Panther for Showing-Off 4k Home Theater?","Tom Hiddleston deserves more credit for his acting in the MCU. This final look he gives Thor has so much emotion.","We never got an iconic slow motion shot of the Avengers in IW. We did in A1&amp;2 but the only slowmo we got in IW was them getting beat by Thanos at the end. Do you think we’ll see another iconic group battle shot in A4? Or was that just a Whedon thing?","Marvel in \"The Martian\"","In Black Panther, after Killmonger takes the throne, he begins to wear his father's ring on his right hand rather than on the necklace.","Given the rumours about A4, what are the odds its full poster would look similar to this?","RDJ's acting in this scene is fantastic. He goes through all the emotions he felt throughout Civil War in a matter of seconds.","You know, with the benefit of hindsight...","Battle on Titan or Battle on Wakanda? What did you enjoy more?","Yes... that's what killing you means","Which boss fight did you like more?","These few seconds of Thanos are the most impressive mocap in the entire MCU I reckon...","In light of the aftermath of IW, this quote hits home.","In the end, Ebony Maw was wrong about Thanos...","Biegel's RTd this tweet three times now. Maybe we should all RT in case it's some kind of push for New Warriors?","Cancel GUARDIANS OF THE GALAXY VOL. 3. Sprinkle some if not all the Guardians across the MCU at least until Gunn can be rehired. A THOR 4 from Taika Waititi with Rocket and Groot could work.","The Best Joke in Spider-man Homecoming","[Spoiler, maybe?] Marvel licensed some music","I think S.H.I.E.L.D has a new office","[Theory] Thor's huge power boost in Ragnarok and Infinity war is him getting the OdinForce","If Doctor Strange saw the one way they win...","I'm usually not a fan of jump scares, but this one was used so well and absolutely crushed me","Ian McShane","What if Cap is Stan Lee's character","Guardians of the Galaxy Callback in Infinity War?","What other armies does Thanos have control over in the MCU? We’ve seen two, one in A1 and another in A3. Do you think he has other armies ?","Feige is a smart guy so why do so many disagree about Black Panther and why do people not understand Feige is playing the long game?","Noticed this while rewatching IW","Potential A4 Title??? 🤔 - The Russo’s have said the closest guess so far is Avengers: Forever. The image below breaks down why I think the title might be AVENGERS: LEGACY - We all know how clever Marvel is when it comes to Easter eggs and linking films together - Look forward to your thoughts!","I love the dialogue between Wong and Strange at the beginning of the movie","[Infinity War Spoilers] Why did Doctor Strange get irritated when Tony said Steve Rogers could find Vision?","What's the best order to watch the Marvel Universe Movies?","Small suggestion/baseless theory","One thought about Infinity War final fight.","Avengers: Infinity War Alternate Ending","Anyone want to trade digital codes IW for DP2?","Why is everyone acting like James Gunn is irreplaceable??","Thor in Wakanda","Wait so if Thanos killed half of the Asgardians, did another half of them get snapped?","I feel like this could be a good alternative to having GOTG 3.","Rocket &amp; Retsuko: A Bro and Sis Story (Script in description)","Ultraraw26's Gory Avengers 4 Poster","What were your biggest misconceptions about the MCU?","Did Rocket Raccoon survive the snap because he is","SPOILERS: Avengers 4 theory via text","Has Tony ever referred to Cap as Steve to his face?","What story would you adapt for the next big Avengers two-parter? My vote would be for a take on Secret Wars with Doom as the big bad.","If you were Thanos how many times would you have snapped ?","Infinity Mom ( comic i made )","Best Marvel Titles Ever","(Spoilers) What if Infinity war had an Anime theme?","Theory: What if Ronan the Accuser really made a deal with Thanos to spare the entire Kree race in exchange for destroying the entire Xandarian race.","I’ve been verbally domed","Asgardians of the Galaxy and the Marvel Cosmic universe","Do we know what happened to the Defenders after the snap?","Not a great edit, but what the hell?","Who else wants to see Bob, Agent of Hydra in the MCU?","Mr. Stark, I feel so good","Avengers Infinity War: The Voice edition","[IW SPOILERS] Vision killed Corvus Glave and Wanda killed Proxima Midnight, a couple killed by another couple.","What do you want MCU Hydro-Man look like?","Ethan Hawke Criticizes 'Logan' and Other Popular Superhero Movies","Comics vs MCU: Warning Dr Strange, the most powerful sorcerer on Earth, about Thanos","This Week in Marvel Games: Nebula Takes Over Marvel Puzzle Quest While Hydra Crashes Avengers Academy","My custom Avengers: Infinity War Blu-Ray cover, in the style of the recent Re-release covers.","Marvel Cinematic Universe Films: Survivor Round 5 of 19","Tony Stark is back where he started.","The best viewing order of the MCU movies?","If Groot vanished in the snap, what does that mean for the handle on Stormbreaker?","Bringing your kids to opening night","I arranged the Spider-Man: Homecoming Intro for violin.","Just realized we're not getting any more MCU films until 2019.","About the A4 and GotG3 news (worries really)","Captain America - Aquaman Style (clip)","Proposed Intro For A4","Who do you think would make a great director for Guardians 3?","With Doom most likely being introduced in Phase 4, who would you like to see play him and why?","Since Thanos laid out Hulk so easily, does that mean Thanos is capable of this?","This might have been pointed out before but I thought this scene with Donald Glover was a hint towards the Prowler.","X-MEN film series like HARRY POTTER?","Valkyrie in CA1","Do you think the MCU will ever end, if so when?","I've recently become unemployed so I've taken to building armor for my dog. Introducing The IronJug Mark II!","A project I’ve been working on, Avengers: infinity war Thor Ragnarok style!","In Captain America: The First Avengers when Steve is getting beat up behind the cinema he grabs a dustbin lid to use as a shield. It's a pretty obvious foreshadowing, but I missed it when I first saw the movie all those years ago. I thought it was pretty cool.","I got a free AoU DVD inside of my IW DVD Package!","Question regarding characters","Robert Downy Jr. and Chris Evans retiring and who will be named the leaders after avengers 4","\"When the Earth starts to... settle, God throws a stone at it. And believe me, He's winding up.\"","Fess up... how many times have you watched Infinity War now and what was the thing you were most impressed by from your last viewing?","What would happen if Dr. Strange tried to close a portal and cut Luke Cage in half?","All Mighty Stan!","If you could replace the music in any scene to make it funnier, what would the new song be?","Why didn't the Iron Spider suit not have different web types and a bunch of extra stuff but the other suit did?!","Ant-Man and the Wasp starting really strong at Chinese Box Office!","My best on Devil Hulk. Please, let me know what you think!","Now that Xandar is destroyed shit's about to go down in MCU Cosmic.","\"I don't see how that's a party\"","What are some things that MCU modified/introduced from the comic book source related to the characters that you like ?","Why does everyone say the black order was weak in Avengers 3. When none of the characters could beat them one on one. Majority of the characters needed help to actually get rid of them?","Most Devastating Death Infinity War","AM&amp;TW scores $24 million opening day in China (record for solo superhero films)","At what point do you think Thanos stopped personally invading planets?","Tony Stark targeted by Project Insight Satellite ( CA: The Winter Soldier)","Here’s a thought about Asgard (kind of)","Watching Iron Man, my favourite MCU movie. Then I'll watch Iron Man 2, my favourite MCU movie. Then Thor, my favourite MCU movie... Get the idea?","Tony Stark's Glasses - Infinity War","What would Stark have done if he were in Quill's situation?","If mjolnir wasn't destroyed, could MCU Thanos lift it?","Marvel Showerthought: If Tony Stark was as good of a science bro/engineer/brainiac as he is, he would have made a backup of Jarvis in case 'Jarvis.exe' corrupted.","Tony Stark's Decision on Thanos's Ship","Evangeline's new haircut","Thanos (him personally going after them) all out blitz for the Infinity Stones was an opportunistic move that was never in the plans. Once Odin died, and the ancient one passed. And he knew the locations of all the stones, he thought, why not.","If Ultron had won, Thanos would have had to retrieve the stone from Ultron","Avengers 4 &amp; Marvel Rising?","Would things have been different.","What if?","\"All that for...\" [Spoiler] Theory","Besides Vision, what could Shuri update/improve on in Avengers 4?","Earth Is Closed","‪So... how does this Life insurance thing go if Thanos snapped your parents away. How do i put that claim in.‬","What if the MCU was made in the early 90s! just think about it ...Tupac as Black Panther, Brad Pitt as Thor ,Tom Cruise as Iron man with Spidey as Leonardo DiCaprio. It would've been amazing.","Old Comic book version of infinity war","I hope this means they're considering bringing him back.","What Spidey was trying to say to Thanos"]