["/r/WWII Weekday Party Up Thread | August 27 - August 31","Call of Duty: WWII - Game Update August 27 (PS4/XB1 -- PC Tomorrow)","Updated WWII Map Locations","My talent with the ladies continues to diminish","This should be the video where you guys get to learn how a blind person tracks their stats. If it didn't work I'm going to be annoyed LOL","Commando is fun","The only thing MP players want.","Every time","Knifing on a whole new level....","Bug Thread - Let's get them all in one place (again)","Gotta love infected...","Might just take a nap .. Yup Right here AHH lovely","My granade got stuck in my parachute...","There’s nothing more satisfying then making people fall to their death 😈","Did Butcher influenced you?!","Commando division is interesting","A surprising oversight in the commando update...","I finally did it, master prestige here I come","I honestly love using it.","Latest update and the sniper reticile rendering correctly still hasn't been addressed","Gotta love that PS users are onto DLC 4 and us Xbox &amp; PC users aren’t even allowed in the sandbox yet...","looks like its time for an anti-cheat update","A 9+GB update and the unremovable green star on the Divisions is still to be fixed? (Xbox)","A hacked lobby with paratroopers, and BTG in Search and Destroy on Ps4. WTH?","I found this interesting","Mid Air Mortar Collision","These bois squating in war cutscene. More noticeable in splitscreen","Commando gives players an even greater initiative to play the objective in War.","I’m 40, married with kids...and have an average internet connection at best.","The Commando Tac Insert Needs a Better Counter","Be careful throwing sticky grenades while in the parachute","Found a sword glitch, 2 of them","Daily Orders - 29th August, 2018","What is the character saying? And what does it mean?","In FFA, killing enemies while they parachute in, doesn’t count towards the 30 kills needed to win","Exo suit division confirmed","We are getting Polish Spec ops in next weeks event currently trying to view collection it just kicks you out. But polish spec ops is probably meaning Cichociemni unit the polish paratroopers. Maybe for commando class","I got the Commando division to prestige 3, and I was supposed to get “The Surgeon” uniform as a reward, but it’s still locked. I can’t use it.","I did not receive \"The Surgeon\" uniform after entering the third prestige for Commando.","25 kill contract on TDM?","I didn’t receive this animated CC after entering the second prestige for Commando.","How I feel about the Commando division...","Am I missing something? War Double XP Not Active","Freezing in gameplay since the update (PS4)","I can play the DLC solo, but when I try to get my Gf or any of my friends on with the season pass deal it won't allow it - Proof i can play DLC(refer to clip I posted as well)","New War map looks interesting.","Xbox Europe Update","Disappearing classes","Night #2 of the “season pass holders can have friends join on the new maps” and I’m the season pass holder.","S-Mine on enemy Tac flare?","Here's all of the VMG &amp; Tokyo variants in Maya","I didn't get to play on the sandbox with the toy soldiers map...","I wish we could have gotten this much customization.","How do you have fun playing at this point?","Hidden LMG??","Commando Solution???","New glitch on last few class slots?","8-man feed with Dualist+Escalation with the new Commando Division.","Here's all the AS-44 Variants available since I hadn't seen anyone else post them.","Am I the only one lagging like crazy?","How to capture your Supply Drop with Commando","Commando Division + extras","Can’t select orders","Commando Division tac insert is easily counterable","What's the quickest way to prestige Commando","Is the commando division good for disabled players?","Ontop of shipment..","did i lose my rank?","Anybody know a gamemode that gives you alot of XP / division XP?","This is why I’m going to use the Commando Division forever on Shipment and you should too.","Lost all paintjobs out of nowhere","Orders no longer refresh if they carry over from the previous day, an update we all sorely desired /s","Grip on the ribeyroller fix?","New Division makes hunger for this old girl.","1min, 10s V2 Rocket on Shipment w/ Ribeyrolles &amp; Commando","[? For the Devs] Regarding in-game medals.","Serious Damage From This DLC, Console Freezez.","V2 Rocket in War Mode (rip)","Commando VS Ball Turret Gunner","Best SMG setup for headshot order?","Are they nerfing daily orders?","Commando healing protects against Incendiary?","COD WWII Maps","Finally... The last spot is useable again!","AS-44 is Beastly (and they just can't handle it!)","Once again, classes are bugged.","So why did we never get Hardcore Ricochet?","Now that Days of Summer is over, this pretty much sums up the Xbox &amp; PC experience with Sandbox…","New upcoming weapons","Thoughts on DLC 4","Need TIPS for Controller for PC.","Reminder that Infantry STILL doesn’t have Extra Magazines","The most recent capture I could get.. I actually made it to 230days #TryNTopThat","The Proto-X1 is actually the Tokyo Arsenal Model 1927. It never saw actual combat, as it was sent through multiple redesigns, but was inferior to other SMGs at the time. It fired an 8×22mm Nambu from a 50 round drum mag at anywhere from 300-1200RPM","What position are you on the Leaderboards?","Black screen while editing class?","Armoured + Escalation vs Commando + Hunker + Escalation","PSA killing commandos by shooting their parachute does not count as a kill for Blitzkrieg","Voice chat bug?","Sledgehammer, can you guys replace that Cavalry Division contract with something else?","Keep in kind, an AS-44 collection exists, you just can't view it....","This hit detection! Am I right?","Another bug - but maybe a good one?","Here's the smg! It appears to have a fast fire rate and has extended mags","And This is why People Hate Quickscopers","I have an SMG bribe, and all the SMG's, but not all the variants. If I use this on Tuesday, is it a guarantee I get the new SMG when it comes out?","Post game supply drops","A love letter to my favorite COD game.","Remedy BT Challenge tips anyone?","Except we never received more information","I don’t mean to dig up anyone’s buried traumas but...the numbers, what do they mean?","Do you think emblem 'downloading' should return?","New patch - lower FPS on PC","Anyone having issues with their orders?","Weird Update - 75GB!!!","KC tags glitch when you kill commandos in the air.","Am I the only one who noticed the change in iron sights?","Excavation Spawn Traps","Knifing with commando","Patches on MP Uniform?","Commando Hustle+escalation = easy triple kills with m30 and sawed off","No more weapon charm contract","Nothing too special, but man, I love the Commando Division!","BUG on Zombies, can't put camo on some weapons: Error 1000","Summer event is over but at least I have a beach ball","I quit I quit i quit","Ayy whats up thank u to this guy for all the content","Operation Arcane suck. What do you think of this map?","Parachuting ability should have been reserved for airborne division, although...","SHG fix this head glitch please","I got the new weapons using Wanderlust in pubs","I have a burning question about WWII","PSA for zombies players: LMGs have abilities when upgraded","Question about season pass","They changed the iron sights of the automation assault rifle","Loadouts glitch (PS4)","Orders Glitch","How do you feel about Commando, any changes you'd make to it?","Commando II does not benefit hardcore players.","PSA for commandos, you can sticky your own parachutes.","Since I may never get a chance to play a class with sfifty &amp; duelist... :(","Ww2 new event any answers","PSA don’t Open your Drops","They were preparing us for this day","Some things which need changing in the game imo","Guaranteed all 3 new heroics!","Trying to play the new maps with someone who doesn’t have the DLC pack. Yes I have the season Pass.","Anybody else HQ not working? Cant do anything","Major Issue with Commando","I literally have to guess where people are to get kills...","Disconnected and cannot connect?","Weekly orders not selecting","Anyone else wish they would have saved Airborne uniforms for Commando?","Commando uniforms.","Waffenschmiede II","Loading screens are as long as at launch what's up?","Why can’t I change my last 5 classes? No matter what I do they always say Resistance with the grease gun, can I fix it?","Tac Inserts have completely ruined the flow of modes like Hardpoint and CTF. Really bummed about this.","Sledgehammer, please let second player select orders and open supply drops.","Best current smg weapon?","Sledgehammer, can you Just remove requisitions?","Last 3 classes are glitched for me","Division Set ups are messed up","Death From Above","When you're scrambling to change the batteries on your controller.","Weird Weapons and Winning Tactics: The AS-44:","wow the new division is so transparent about what it stands for","Waiting for Captain Butcher next week with their...","My Son bought it hook line and sinker...and lost","Automaton Sparrow II's Iron Sights changed??","Anyone else on PC experiencing stuttering on 99% of spawns after the new update?","Just got another update?","do you get the two new basic trainings ('catalyst' and 'remedy') from the specialist bonus as well?","Who's contractsand weekly orders aren't working","SHG, why can't we see the loadout of the person who got the \"Silver Star\" kill-cam at the end of the game?","Any one else having issues with Commando custom classes?","Expiditonary stealth nerf ?","DXP on War","Create a class bug is still around and has not been fixed like it was stated in the patch notes","Bless SHG’s hearts for trying so hard to please the fans","Daily Orders - 28th August, 2018","SHG, we've got a cheater over at the infected offices","Low HQ Population","Commando Problem/Feature?","Xbox one new content","I'm in Singapore, yet I'm constantly placed on European servers","DLC on PC?","Missing supply drops","Has anyone got the new smg or lmg using Wanderlust in a public match","Cannot accept new Weekly Orders","The new war map playlist is hidden in the italian version. Thanks double XP","The as - 44 is garbage","The Automaton no longer has its vertical iron sight","Anyone else notice this or is it just me?","Found a Commando bug.","They added 3 new Division slots!","25 kills in a single TDM","Bottom Divisions duplicating -glitch","Commando BT Combos","Dog Fight , WWII no longer boost on ground 🤣","Aerial Bombardment. Commando Insertion is coming in handy.","AS-44 Commando Division Rifle","Finally a political movement I can get behind....","Thoughts on new AS-44 in CoD WWII and how it compares to other rifles, where it fits in, and if it’s worth grinding?","AS-44 Variants","Cant pick up weekly orders","So does the serum not affect strafing?","Anyone notice the remove the progress bar","Issue after update (can’t get past loading screen)","weekly order bug","The final descent","Just got back from the game","But a dream...","The Commando Division is not OP","Where’s our map at sledgehammer?","Update 1.20 includes entire DLC4. Non season pass holders will have chance to play DLC4 if partied up with a SP holder.","Bugs i was able to find in dlc 4 update","Catalyst, what does it do?","\"The UAV is picking up an enemy, but where the hell is...OK, then.\"","Ez launcher killstreak destroys","*PSA* if you play war don't waste people's time.","One thing WW2 jacked COD loyalist players out of:","Can you believe we have five 3 shot rifles now?","Stuck In Air with Commando Drop","Just played a Hardcore TDM match... where you could capture the flag?","3 New weapons accessible through Wanderlust!","Triple double xp still up on standard War playlist on xbox one","Anyone else got their orders reset?","Please stop with the win x amount of games order...","Who thinks that SHG is now too focused on wild, game changing ideas which alter the dynamic too much? Para insert changes everything and not in a good way","DLC4 Zombies Intro is the most badass thing ever: shows 1000's of zombies swarming the navy","Are you guys trolling when you say that you can try out the new smg and lmg with wanderlust?","I guess his clan tag was accurate at least?","Unpopular Opinion: The Tesla Gun should be a scorestreak","New Favorite Thing to Do","Sandbox map,","Commando got me back into playing WWII.","I was using wanderlust then all of a sudden I got a new gun! This was actually in public match and I kept pressing triangle and I got a new smg! I'm not sure if anyone had posted this but there's a new LMG or so","Stacking Remedy with Comando?","SHG, why is this game still so glitchy 10 MONTHS into its life cycle? Give me my orders!","My personal review on the new DLC and Update.","Can someone test for me...","Has anyone used Commando in War yet?","New bug: Killing Commando during their parachute stage doesn’t register as a kill with blitzkrieg training.","Most OP combo with Commando ?","How the new division rollout will go...","New smg came out today?","Cannot name my wanderlust class with name wanderlust","Quick video of AS-44 rifle from DLC4","Wanderlust AS-44 Iron sight and magazine capacity","The NEW GUNS for possible newDLC4 Event","All of my classes past set 13 are default classes in game.","Hand Testing of New BTS and Division (NOT 100% CORRECT)","When you have an Xbox but wanna play the COD DLCs early on PS4 using your Elite Controller 🏆🏆","As a proud shipment 24/7 player","What do you think about it? 9.6GB update (XBOX)","No OP Combos like Req+Ordnance","New Weapon contract is on the Ribeyrolles","XBOX1 - Crash upon trying to connect online","I was so close","Weapon charm contract fixed! And weekly orders fix","Taking a look at the new commando division:","Please fix this bug ;-;","Somehow I won at the last second with less kills and score, weird.","Heroic AS-44 \"The Bear II\"","With all these divisions, which is your go-to?","They buffed the max level rewards for social rank","Do you stay in the lobby when you get nuked?","AS-44 Beast","When you're backed in to a corner with no way out. 😂😂😂","Anyone else getting kicked for \"inactivity\" while you're playing?","This happen to anyone else today? Only played one game so I don’t know if the kills actually go up to 32 now.","So about Reich Chancellery..","Could We Please see a Weapon Balancing Update Soon?","Can you get the days of summer stuff afterwards too?","New weapons","callofduty.com","To all the people who insta leave/afk after being turned into the first zombie in infected","Xbox update now available; had to hard reset to get it to appear…","Patch notes are still being typed out. Hopefully it wont be too much longer","Lost all progress..","I know a lot of ppl have this problem but how do you fix the orders issue?","Let's just honest with each other... regardless of how you feel about the actual game, the connections and online consistency are absolutely awful in WWII.","My Special order is gone","New AS-44 needs work","My fellow dualist’s, since you can’t equip shifty and dualist at the same time, this class setup is very good with commando (Choose your pistol preference and choose a sniper to kill those campy LMG people)","They cleaned up the Heroic Ribeyrolles","Thoughts on new maps?","VMG 1927 &amp; Proto-X1","They patched the glitch where you can see the new weapons with wunderlaust","Chancellery Map is too dark","Commando War issues","Commando is a teaser to Blackout","Operation Arcane Voiceovers (DLC4) WARNING SPOILER!","Shield bug finally gone!","So maby tryhards","When no one gets infected how long does the match last?","I seriously feel bad for COD youtubers and other people who have to wait hours to download it.","As-44 really underwhelming","AS-44's Rate of Fire","War Superstar Challenge - still broken?","AS-44 variants","Hordepoint and leprechaun hunt?","The AS-44 is already unlocked in Zombie","So the Update is out...open every supply drop now or wait?","SHG, a 10GB download with no pre-load is really not cool.","New Weapons?","So, the 10 GB download is...?","Commando sounds great!...but...","Commando Saved Shipment","Commando + Energetic is stupid","Ps4 Users... first impressions of DLC4 maps","After the update, the last 4 classes are being shown as the last one","Achieving Chrome &amp; Chrome Tiger is now a Cake","Update on Xbox One","Major props to SH with this new DLC.","New event.","This Here is a NO FLY ZONE","Can anyone on xb1 get zombies to work yet multiplayer?","special order is disappeared","(Xbox) I still don't have the update","Paratrooper tac insert","[Question] New player - how does one acquire the new/DLC weapons if you only buy the game now?","Why isn't there a playlist for the new war map?","S-mine glitch/bug??","Started playing again cus Commando looked fun","help needed for the update","Can somebody help me out","MP rewards question","This beauty should’ve got more love","Besides destroying tac-inserts, calling in flak-guns will prevent enemies from using them.","Do you ever just toss a rocket somewhere with no intention of it doing anything?","What are your go to weapon setups and/or loadouts right now?","Difficult decision to make today..","Weekly orders reset...","Orders are bugged again (for me)","Update glitched the orders...","They gave 3 extra class slots.","Depressing knowing Xbox gets DLC 4 today but can't access it for another month.","Me surviving one handed while eating a sandwich. Thank you teammate!!","I keep getting booted to xbox home after update","The paratrooper insert needs an urgent fix","WW2 Update Version 1.20 now live on PS4 - 10GB","Tried to play a new map this happened","WWII spawns were always bad. Commando makes them a joke.","How do you unlock the V2?","Commando Suggestion:","The new guns and Wanderlust","Sudden uncalled update","When the update drops..","HeadShot by MORTAR STRIKE","The new dlc gun","Shadow War DLC #4 Available Now On PS4","The most important question about the Catalyst Basic Training","Operation Arcane - The bug with the border of the zone","Never buying another SHG game on PC.","They did it again a new lmg and a new smg","Why are the new weapons locked in offline multiplayer?","Does catalyst basic training help recoil?","Commando Division is a game changer","The new flying Kill Confirmed tags are kind of annoying.","Finally and 1 hour after ps4 is too long","Seriously?","i wish we could've gotten a voice announcer pack, huge missed opportunity right there","Paratrooper Insert works in War.","Commando questions","cOnSpIrAcY tHeOrY (SHG and 3arc working together)","Wow, these DLC 4 maps look great. (No hate to SH, I just find it funny)","Glad to see they brought back the worst weekly contract ever /s","Possible Halloween Event?","Ribeyrolles core loadouts?","Anybody gotten this far yet?","Anyone else excited about Commando ?","Meanwhile, on shipment","Commando Perks worded properly.","why dont challenges complete when the final kill takes place as an \"after death kill?\" is this a bug?","How would you feel if SHG nerfed the Divisions and in return gave us the ability to pick 2 Basic Training Skills??","Let's do a small comparison shall we?","Is it just me or when you’re parachuting in, do your shots have travel time? (as opposed to being hitscan)","My Best Ever Clip Ever In Call of Duty (Also dropped a double v2 this game)","SHG: Button needed to skip supply drop opening animation","Tac Insert or Sliding?","Issue with commando load out.","So it looks like Commando is my go-to now","Cruiser II in Chrome Tiger","The connection indicator bars are lies.","The Luftwaffe Drilling's rifle bullet should be buffed","Who put that pipe there?!","Bronze star killcam with commando division using paratrooper insert.","Yo wtf? Why did they change the quartermaster?!","I decided to play on the planes, but it was not there.","Shouldn't the patch notes be up by now it's 10:15am PT and 1:15 ET","Need an easy longshot for your camo challenge? Shoot down an attacking Paratrooper at the beginning of a defensive round of Operation: Supercharge and you’ll get one for each game you play, so long your aim is good enough.","With the life cycle coming to a close do you think a new event will come by?","He gets an \"A\" for effort, this guy wanted to bayonet me so bad! 😂😂😂😂","Command parachute colors incorrect?","Balance is BAAAAAAAAAAAAAAAAAAAAAAAAAAD","Daily Orders - 27th August, 2018","Can you pre-load DLC 4?","When does the dlc drop?","Best of the War Maps?","New Commando Uniform: The Surgeon","Wonder how Commando will effect HC","How come War doesn't show connection bars/status?","Anybody else having problems downloading the 10gb patch?","Bring back Throwback Playlist?","HomeRun emote?","Call of duty ww2 shadow war/ patch 1.20","Has the update dropped Yet","Supply drops and new guns. (Xbox)","Haywire II x Summer Dreaming","DLC Guns and new Divisions to be added to ranked","Is DLC coming tonight ?","What’s the new weapon?","How long has demolition been back?","That moment your drop gets stuck on a tank antenna","Infected throwing knives: How about instead, zombies can throw their axe?","Can someone from PC tell me the specific details of the new Catalyst Basic Training?","There is no such thing as map control anymore. I cannot believe they added tac inserts to this game.","Shamrock bribe -.-","What are you looking forward to, in todays Community Update/Notes?","Finally finished HQ challenges!","Buying each DLC individually vs. buying the Season Pass - Any difference in matchmaking?","Commando Tac Insertion","To get the AS-44 faster play War with 2Xp Division Xp or Shipment","Past Events","INFECTED: Those joining games in progress or selecting class too late should start as infected."]