["TIL when Will Smith was 12, his grandma found his profanity-laced notebook and wrote, \"Dear Will, truly intelligent people don't have to use words like this to express themselves. Please show the world that you're as smart as we think you are,\" on the back -- inspiring him to be a \"clean\" rapper.","TIL in 2015, Queen Elizabeth II decided to not breed anymore corgis so that she would not leave any behind when she died. Her last corgi died in April 2018","TIL the Albatross is a large bird that can go years without landing. They spend their first 6 years of life flying over the ocean without ever touching the ground.","TIL the \"Awww but he's so cute\" has led to a breed of dogs (pugs/bulldogs) suffering from \"... breathing problems, eye prolapses, overheating, dental crowding and skin-fold dermatitis\", vets say.","TIL of William Kamkwamba, who taught himself to build windmills from library books. He built his first windmill, at age 15, out of junk from the scrap yard and brought power to his Malawian village. Later on he built another windmill to power water pumps to irrigate fields.","TIL a Chinese art collector paid for a $170m painting with his American Express credit card. He said he'll use the points to allow his family to travel for life.","TIL that in 2015, two men sold a fake Goya painting for €1.5 Million, only to find out all the money paid was counterfeit.","TIL that Alan Alda met his wife at a dinner party on the Upper West Side, when a rum cake accidentally fell onto the kitchen floor and they were the only two guests who did not hesitate to eat it.","TIL that Pope John Paul II was shot and critically injured in an assassination attempt. The Pope survived and forgave the attacker, and even requested that the man be pardoned from life imprisonment. After the Pope died, his would-be assassin visited his tomb and laid flowers.","TIL There are more Tigers in American backyards than in the wild","TIL about the PayPal Mafia. The original group of PayPal founders and employees who have gone on to become one of the most successful groups of individuals in the world. The portfolio of companies they've founded includes; Tesla, Youtube, Space X, Linkedin, Yelp, and Founders Fund, to name a few.","TIL more than a third of divorce filings contained the word Facebook","TIL that the common tumbleweed (Kali tragus), although used in Westerns to symbolize frontier areas of the United States, is actually an invasive plant from Russia. In the 1870s, it appeared in South Dakota when flaxseed from Russia turned out to be contaminated with Kali seeds.","TIL That horses can only breathe through their nostrils, and their anatomy prevents them from being able to breathe with their mouths","TIL that a frog was the mainstream pregnancy test in the 1950s. If a woman’s urine injected into the frog caused it to lay eggs, then the woman was pregnant.","TIL that the two founders of Pizza Hut sold the business to Pepsi in 1977, and one of the founders then became a prolific Papa John's franchisee, owning 133 locations by the year 2001.","TIL of David Goggins, the only member in the U.S. Armed Forces to complete SEAL training, Ranger School and Air Force Tactical Air Controller training. Goggins retired from active duty as a Chief Petty Officer in 2016. He's also an ultra-athlete and held the world record for most pull-ups in 24hrs.","TIL The Devil's Cigar is a fungus that strangely only exists in small area of Texas and Japan separated by 11,000 km the two populations have been separated for at least nineteen million years. It looks like a cigar, hisses, releases clouds resembling smoke, then splits open into a flower shape.","TIL that Neanderthals weren't the only contemporaries of homo sapiens: At one point there were as many as 4 different hominin species living alongside us","TIL there are rainforests in Wales as a result of high humidity and stable temperatures. The EU is funding an effort to maintain them by ridding them of invasive species.","TIL of The Shaggs: three teenage sisters forced to play in a band by their father. Almost completely musically inept, their album failed to gain any traction until years after it was recorded, when Frank Zappa claimed it was one of his favorite albums of all time.","TIL one theory why the human sense of smell is worse than our closest ancestors (monkeys and apes)is that since the start of agriculture, humans have been forced to live in crowded tents and huts with many other people, so we evolved a weaker sense of smell to better deal with it.","TIL there are 43 buildings in NYC which are so massive they have their own zip code.","TIL that it is illegal to wear armour into the UK Parliament. The law was passed in 1313 and still applies today.","TIL: The sound of a TIE Fighter from Star Wars is a combination of an elephant call with a car driving on wet pavement","TIL that the man who originally came up with password practices (changing every 90 days, using caps/special characters) recanted most of his advice in 2017","TIL Endangered 'water monster' Axolotl found in Mexico City lake after Scientists feared it only survived in captivity.","TIL The NYPD has two official beekeepers - officers who are also bee enthusiasts - who get called to relocate hives/swarms when they are in dangerous places","TIL that the weird death pose of dinosaurs (head thrown back, tail extended, and mouth wide open) is very common in their fossils. And there is no scientific consensus why…","TIL That No Number From 1 to 999 Contains the Letter A in Its Spelling (Word Form)","TIL the phrase \"scot-free\" has nothing to do with Scotland and is instead a reference to Scandinavian word for \"tax\" or \"fee\": skatt","TIL tailgating, or riding someone’s bumper, actually causes traffic jams, slowing everyone down","TIL that throughout history humans have only been able to eradicate 2 diseases: Smallpox and Rinderpest, the latter being only infectious to animals","TIL that Emanuel Ninger aka \"Jim the Penman\" would spend weeks expertly forging single US &amp; British currency notes by hand; only to be later caught by a bartender with wet fingers.","TIL that, despite their infamy, black widow spiders are not particularly dangerous or aggressive and most people who get bit do not need medical attention. Since the venom is not likely to be life-threatening, antivenom is mostly used for pain relief and not to save lives.","TIL that the red , blue and white rotating sign outside US Barber shops actually symbolizes Blood, Veins and Bandages dating back to when barbers used to do surgical tasks as well.","TIL Milking and Drinking Killer Whale milk used to happen more than you think! Staff at SeaWorld would taste it to test for PH levels. An Exec said \"I once had killer whale milk. I'll starve to death before I have that again. It tastes like fish. It's got like 15 times more fat than cows milk\"","[TIL] Carlos Hathcock, A sniper in the Vietnam war, crawled 1500 yards over four days to shoot a general in the heart. He survived.","TIL that when choosing a male sexual partner, a female chimp prefers those with large testicles. Why? \"If she chooses a mate with big balls, her sons will have big balls, and if big balls help him have more offspring, she’ll get more grandchildren.\" This is known as the “sexy son” hypothesis.","TIL: Germany didn’t have raccoons until the 1920’s. In fact, it wasn’t until a bomb hit a fur farm that there started to be a population of wild raccoons in Germany.","TIL the CIA set up brothels, dosed the unsuspecting clients with LSD, and then watched them having sex with the prostitutes behind a one way mirror","TIL that Mexico has created a marine reserve large than Greece to help protect wildlife. The reserve will have all fishing and hotel developments banned in the area. The aim is to help replenish fish stocks and save animals like the Vaquita, of which there are only dozens left.","TIL that the smallest measurable unit for a computer mouse's movement is a \"Mickey\", equivalent to 1/200ths of an inch.","TIL 81% of all competitors at the 1904 Olympics were from the US...they won 239 medals.","TIL that during WW2 the Allies converted an ocean mine layer (HMS Menestheus) to a floating brewery to deliver beer to deployed troops in the pacific theater.","TIL: Charlie Chaplin was originally excluded from the Hollywood Walk of Fame presumingly due to his left-leaning political views.","TIL that people who work for Waffle House Corporate spend one day a year working in a Waffle House restaurant.","TIL the Norwegian Department of Health will send condoms (including strawberry flavoured ones) to any Norwegian address for free","TIL that part of the aim of the Declaration of Independence was to aide colonist's land-grab from the natives, in spite of the King's proclamation against it","TIL the US military sent an 813 man operation to cut down a tree","TIL cheetahs are so genetically similar to one another that their organs can be freely transplanted between any members of their species without the presence of immunosuppression.","TIL Plastic soda bottles filled with bleach water and fitted with a rechargeable solar-powered LED inside a sealed test tube are being used as a light source in the poor areas of the Philippines, Egypt and Colombia.","TIL that coconuts can travel 110 days and thousands of miles by sea and still be able to germinate","TIL When MDMA gets absorbed into your blood stream, it hits your brain and causes it to release serotonin, noradrenalin and dopamine, which causes euphoria. MDMA also releases a hormone called SIADH which stops you peeing","TIL Shania Twain's album 'Come on Over' released in 1997 is the best-selling album of any female artist in any genre ever - selling in excess of 40 million copies","TIL that Icelandic surnames are based on your fathers first name, followed by either son or dóttir depending on gender. This is unlike most other western cultures which commonly use a family name.","TIL eleven humans have been born in Antarctica, which is 1 less than the number of humans who have walked on the Moon","TIL that cocaine and meth are still used in the medical community, particularly by older doctors who are just used to giving it","TIL about Giant Gippsland Earthworms which are native to Australia and can grow to be 3 meters (~10 feet) long.","TIL Hawaii is the only US state to both never record a high temperature of 100 degrees F or more and the only state to never record a low temperature less than 0 degrees F","TIL Actress Hayley Atwell got her drivers licence photo taken in full ''Peggy Carter'' makeup.","TIL that Disney recalled 3.4 million copies of the children's movie \"The Rescuers\" because one of the animators inserted a picture of a nude woman into two frames of the movie.","TIL \"Ferris Bueller\" was a wildly unsuccessful TV series based on the film \"Ferris Bueller's Day Off\"","TIL that Stalin's Granddaughter works as an antique dealer in Portland, has tried her hand at stand-up comedy, and is involved in the local EDM scene.","TIL: The eruption of mount vesuvius, which decimated pompeii, occoured on 24 August AD 79, just one day after Vulcanalia, the festival of the Roman god of fire, including that from volcanoes.","TIL, the Ford Explorer 4WD was the #1 traded vehicle during the 'cash for clunkers' government program","TIL J.K. Simmons, who played music teacher Terence Fletcher in “Whiplash”, has a music degree from the University of Montana, with a major in voice and minors in composing and conducting.","TIL that Louisiana is the only U.S state to currently have a civil law system based on French civil code rather than a common law system based on English common law.","TIL Lake Hillier is a pink-coloured lake on Middle Island in Western Australia","TIL that squirrels aren't just herbivores that eat nuts and such, but also eat birds, frogs, lizards and even cannibalize other dead squirrels.","TIL: Michael Jackson took the bass line for \"Billie Jean\" from Hall &amp; Oates' \"I Can't Go For That\".","TIL about Boy Jones who snuck into the Buckingham Palace multiple times to steal Queen Victoria's underwear","TIL there are more lifeforms living on your skin than there are people on the planet.","TIL that although GPS (Global Positioning Satellite) is free for the world to use, it costs the American taxpayer $2 million per day to operate.","TIL when the Friend's episode \"The One with the Lesbian Wedding\" first aired, NBC was expecting their phone lines to be flooded with angry calls. They only received four phone complaints.","TIL that the smoke inhaled in a typical one-hour hookah session can equal 100 cigarettes or more","TIL the pre-packaged sandwich industry in the UK is worth £8 billion a year. This means the average Brit spends £123 yearly on them","TIL A moths natural predators include bears","TIL dolphins sometimes ride whales","TIL about Slowworms; European worms that looks like a snakes, but are actually lizards.","TIL In 2017, Indiana changed its official demonyn (resident nickname) from \"Indianans\" to \"Hoosiers,\" making it the only state whose nickname does not contain some variation of its own name.","TIL Melbourne gave some of its trees email addresses so residents could report problems. Instead, the trees received love letters.","TIL Michael Jackson holds the record for top 10 hits in 5 consecutive decades. 6 consecutive decades if you count Jackson 5","TIL only one adult has ever been killed by a coyote, 19yo Taylor Mitchell in Cape Breton, Canada. A scientific study on the area found that coyotes were often within close view of humans, but stealthy enough to never be seen.","TIL about baseball player Hack Wilson, part of the inspiration for Tom Hanks’ character in “A League Of Their Own.” At 5’6” and 195 lbs with an 18” neck and a 5 1/2 shoe size, he was referred to as being “built along the lines of a beer keg, and was not wholly unfamiliar with its contents.”","TIL Most of Ellis Island is in New Jersey","TIL it was common practice in U.S. high schools that Male Students were Required to Swim Nude, however Female Students wore swimsuits for Modesty.","TIL when fire ants are threatened with flooding, they all huddle together and form a raft that can float for weeks before they need sustenance.","TIL in the '50s Idaho fish and game parachuted wild beavers into the wilderness","TIL that in 1989 the Queen Mother's dog, Ranger, led a pack of corgis to maul and kill the Queen's favourite corgi mix, Chipper.","TIL The Vatican recognizes the 1982 apparition of the Virgin Mary in Rwanda, where she appeared to three young girls and foretold of the blood and horror of the 1994 genocide. The girls said they spent countless hours in conversations with Mary, who called herself Nyina wa Jambo, Mother of the Word","TIL 85% of buildings were destroyed and 20% of North Koreans were killed in the Korean War Bombing Campaign","TIL that a stock photo depicting Claire Unabia was used in HBO's Westworld 4 years after it was taken. Unabia, having forgotten about the image, was later contacted by HBO via Instagram and appeared in a cameo role in the show's 2nd season.","TIL of Nicholas White, who, on October 15, 1999, was stuck in an elevator in the McGraw-Hill building in New York City for 41 hours","TIL about the Government Accountability Office: a nonpartisan organization that reviews different American policies.","TIL that the last discovered painting by Leonardo Davinci called \"Salvator Mundi\" sold at an auction for the record price of $450m in 2017","TIL of the the 1966 Film 'Incubus' one of two 1960's films made entirely in Esperanto, starring William Shatner. The horror feature was filmed on location in Big Sur and a 16th century California Mission. The film was considered lost until it was rediscovered in 1996.","TIL that the Icelandic parliament, the AlÞingi, is the oldest parliament in the world, established in 930 CE.","TIL that the labor price of light has declined dramatically. For 1000 lumen-hours of light, it would take 58hrs to collect enough wood. Other fuels? Sesame lamp (1750bc): 41.5hrs. Whale oil lamp (1815-45): 4.9hrs. Gas lamp (1800s): .23hrs. A fluorescent bulb? .000119 hours or .684 sec of labor.","TIL Living turtles and fish have been packaged in plastic bags and sold as souvenir keyrings in China.","TIL that two physicists at Michigan Tech conducted an online search for time travelers by encouraging them to use a particular Twitter hashtag before August 2013.","TIL Tom Hanks was paid a low $800 for the movie \"He Knows You're Alone\", $50,000 for \"Toy Story\" and a high of $70 million for \"Forrest Gump\".","TIL that the band Queen were friends with Michael Jackson; he was the one who suggested they release \"Another One Bites the Dust\" as a single.","TIL, other than Floyd Mayweather there are 14 other retired undefeated world boxing champions","TIL Xinghai Square, Dalian, China covers a total area of 110 ha (270 acres), making it the largest city square in the world. China's tallest huabiao (19.97 meters high) was once located at the center of the square but it was demolished secretly in 2016 at midnight without explanation","TIL Saddam Hussein wrote a romance novel, in which he'd vent about America through the characters","TIL the book Horton Hears a Who! (1954) was an allegory for the Hiroshima bombing and the American post-war occupation of Japan. He even dedicated the book to a Japanese friend.","TIL The culture of the People's Republic of China before 1978 was highly influenced by the personality cult of Mao Zedong. Most people were required to recite the Quotations of Chairman Mao and printed material at that time usually quoted Mao's words in bold as well as in the preface","TIL 2008 was declared the International Year of the Potato","TIL that the most expensive school in the world is the Institut Le Rosey in Switzerland. It costs $87,000 in tuition fees. The school has 400 students enrolled with 150 teachers.","TIL Tom Petty became interested in music after meeting Elvis in 1961 on the set of Follow That Dream. On meeting Elvis, Petty stated later that he \"glowed\".","TIL The tallest and heaviest horse ever recorded had football sized testicles.","TIL Rupert Holmes, the musician behind *Escape (The Piña Colada Song)*, later became the first person in theatrical history to win simultaneous, un-shared Tony Awards for Best Book and Best Original Score","TIL of the fifth down incident, where the refs in a college football game mistakenly allowed a fifth down to occur. Colorado won the game over this and went on to win the national championship.","TIL: to make the Cannibal Holocaust movie appear as the recovered footage of missing documentarians, director Ruggero Deodato had some actors sign contracts that disallowed them to appear in media for 1 year after the film's release. Because of this, he was later charged with making a snuff film.","TIL Portland was named by a coin flip. Had the coin landed the other way, the city would be Boston, Oregon.","TIL the Casio F-91W digital watch was declared to be 'the sign of al-Qaeda' according to classified Guantanamo Bay documents as it indicates a detainee was trained to make time bombs by al-Qaeda in Afghanistan.","TIL that Mt Athos in Greece is the largest land area on earth (335sq km/130 sq mile) that women are banned from entering.","TIL that the Boeing 747-200 Air Force One costs $206,000 per flight hour to operate (including fuel, flight consumables, and maintenance), while a commercial 747 costs about $20,000 to $25,000 per flight hour.","TIL that the von Luschan scale was used to classify skin color in the study of races.","TIL About Law 53 of 1948 which made displaying a Puerto Rican flag, singing a patriotic tune, or speaking of Puerto Rican Independence a crime punishable by 10 years imprisonment","TIL the only countries still using Fahrenheit are the United States, the Bahamas, Belize, Liberia and the Cayman Islands","TIL 70% of millionaires do not consider themselves \"wealthy\"","TIL that there's a kind of animal that for 25 million years has reproduced exclusively asexually and can dry up and go dormant for years at a time.","TIL Titanic's lights were still on even after the ship broke in half","TIL if men are bit by chiggers near their groin, they can get \"summer penile syndrome\". Symptoms include redness, itching, swelling, and trouble urinating.","TIL Mark Hamill voiced Darth Bane in the lost missions of Star Wars Clone Wars","TIL that canonically in the Harry Potter universe canonically students of Hogwarts used to poop wherever they wanted and vanish the evidence","TIL of Chuo Shinkansen, a Japanese maglev like under construction between Tokyo and Nagoya, with a planned extension to Osaka. It is expected to connect Tokyo and Nagoya in 40 min, and ultimately Tokyo and Osaka in 67 min, running at a maximum speed of 505km/h (324 mph).","TIL On August 24, 1919: Ray Caldwell who was pitching for the Cleveland Indians was struck by lightning after playing for 8 2/3 innings, got up from the ground, checked himself, finished pitching to get the last out and they won 2-1 over the Athletics","TIL that Smelly Kelly, the Subway Sniffer of New York City, had the job nobody wanted, but he investigatedthe smells of the Subways and kept everyone safe","TIL that Sabrage is the name of the technique used for opening a champagne bottle with a saber.","TIL Sigmund Freud's development of psychoanalysis, including concepts such as the id, ego, superego, and libido, was all done under the influence of a constant supply of cocaine, which he advocated unreservedly, and even endorsed for cash.","TIL that Germany made its last payment of WW1 reparations in 2010","TIL that Nutraloaf is a food served in prisons in the United States and Canada to prisoners who have misbehaved. Due to its lack of flavor, it has been banned in several states where food cannot be used as punishment","TIL Rupert Holmes, known for his hit \"Escape (The Piña Colada Song)\" also wrote the Jets' \"You Got it All\". He wrote the song drawing inspiration from his 10 yr old daughter. Sadly, his daughter died just before the record was released and Holmes can't recall anything at the time it was a hit.","TIL that chicken breast can be used to make a non-vegetarian tofu.","TIL that in 1899, the RNLI hauled 10 ton lifeboat 13 miles overland in order to be able to launch for a rescue.","TIL David Allan Coe was incarcerated in the Ohio State Penitentiary, killed another inmate, was sentenced to death, had his sentence commuted to life in prison, got released on parole by turning himself around with music, then went on to become one of the originators of outlaw country.","TIL that some species of spiders use their silk as a \"Balloon\" to disperse their young.","TIL In 1500s, A Mapuche Warrior Galvarino had both hands cut off as punishment for defying SPanaish. He returned home, raised an army &amp; fought Spanish with Blades tied to the stubs of his arms.","TIL about Toyota Industries Corporation the Japanese machine maker company which started with making manual and automatic Looms in 1926 by Sakichi Toyoda. It is the parent company from which the Toyota motor Corporation developed. It is the largest manufacturers of forklift trucks by revenue.","TIL that in the 17th century the Catholic Church declared beavers and capybaras to be fish so Catholics in the New World could eat them during Lent.","TIL: that a prank by an off duty, hitch-hiking pilot nearly caused a plane crash. The prankster was never charged nor faced any jail time for his actions.","TIL that bubble wrap dates back to 1957 and was originally called \"air cap\"","TIL that someone published a scientific paper about aerodynamic performance of \"Miss Kobayashi's Dragon Maid\" character. Based on his results, flat chested anime character is deficiently aerodynamics compared to big breasted characters.","TIL the new mini cooper has Union Jack rear lights","TIL that the least densely populated county ara in the U.S. has 0.015 people / sq km","TIL: In 1999, when footballer Stefan Schwarz joined Sunderland FC, the contact he signed included a \"Space Clause\", stating that if he travelled into space, then his contract would be void.","TIL Wawel Cathedral has a \"dragon\" bone hanging outside it, from when King Krakus killed a dragon in the hill and settled the city","TIL of the wild treeshrews, a group of animals, which are chronic alcohol consumers, with daily doses that would be intoxicating to humans, while they stay sober!","TIL about Wrongful life law, suing your parents for being born with a disability.","TIL about maggot therapy. Disinfected maggots are sometimes placed on wound(s) of a human or animal to clean out the dead tissue within a wound and disinfection. There is evidence that maggot therapy may help with wound healing.","TIL Dr. Seuss' first wife committed suicide after finding out he was cheating on her while she had cancer","TIL The WW2 dive bomber cartoon-ish plane sound was actually a siren used for psychological warfare","TIL about the frigatebird, a kleptoparasitic bird that steals food from other birds by chasing them until they regurgitate their meals.","TIL That Jackie Chan holds the Guinness World Record for the most credits in one movie - 15","TIL of Buphonia, an Athenian ritual where a laboring ox was sacrificed. This was a crime. So when a priest killed it with an ax, he had to throw it aside and flee. The ax would be brought to court, which charged the ax for the death. Sometimes it was absolved, other times it was cast into the sea.","TIL Washington's NBA team used to be called the Bullets. Owner Abe Pollin changed the name to Wizards in 1997, given the violent undertones with the old name.","TIL that on June 22 1941 Hitler's Wehrmacht had a total of 1,755 Tanks.","TIL Phobophobia is the Fear of Phobias","TIL David Hasselhoff released a cover of Country Roads","TIL the phrase \"Blowing Smoke Up Your Ass\" used to be literal. The practice was thought to revive people who were passed out or drowned. Equipment for the procedure was placed near waterways just as defibrillators are today.","TIL that we have a 99.6% probability that the ultimate fate of the Universe is to be turned into light. All matter should cease to exist due to dark energy acceleration to the point that all 4 natural forces will be violated, turning everything into light.","TIL Captain America: The Winter Soldier's working title was \"Freezer Burn\"","TIL While President Jimmy Carter was in White House, he reprieved a convicted murderer and employed her as his daughter's nanny. He acted as the parole officer.","TIL: Native American Indian chiefs usually had a different given name at birth, and it was not unusual to have several names through their lives.","TIL Instead of a jail sentence, a Texas man agreed to be sentenced to sleep in an outdoor doghouse for 30 consecutive nights, as a punishment for abusing his son.","TIL that British General Burgoyne from the American Revolution was a playwright and songwriter","TIL of the Flesch–Kincaid readability tests, which assign a score indicating the relative difficulty of a reading and understanding a passage.","TIL that earlier this year, big discounts on pots of Nutella caused customer brawls in French supermarkets in several places in the country as they were trying to buy as many pots as they could.","TIL Kim Il-sung and Kim Jong-il portraits are mandatory in North Korean homes. The practice was adopted from Stalin portraits in the Soviet Union and portraits of Mao Zedong in China. By 1972, North Korea had more leader portraits than the Soviet Union or China ever did","TIL that due to time dilation, a spaceship traveling at a constant acceleration of 1g (Earth gravity) would reach the edge of the observable Universe in almost a single human lifetime (100 years).","TIL Jackie Gleason once did a show so bad, on the 2nd episode he apologized to the audience.","TIL that in Singapore sales for \"discipline\" canes increase during times when students prepare for exams.","TIL that Vincent Price did the monologue for Michael Jackson's \"Thriller\" in one take.","TIL every Christmas in Lexington, Kentucky, you can pay off your tickets with canned food donations","TIL that the theory that Queen Elizabeth I was actually a man was first put into print by Bram Stoker, the author of \"Dracula\"","TIL that the Greek goddess of love and beauty, Aphrodite, was born from the god Uranus’ severed genitals falling into the sea. The site of this event is actually a real place you can go visit today in Cypress.","TIL that Martin Luther King delivered his famous \"I've Been to the Mountaintop\" speech the night before he was assassinated.","TIL that the largest tree in the world was once named Karl Marx &amp; the creation of the Sequoia national Park was in large part due to the Southern Pacific Railroad wanting to stop a group of anti capitalists from starting a commune","TIL that the US Navy has been training dolphins to carry out military tasks such as locating underwater mines and flagging enemy swimmers since the 1960's","TIL about Simulated Reality, a hypothesis that reality is simulated to be indistinguishable from true reality and that the conscious minds it contains may or may not be fully aware that they are living inside a simulation.","TIL of the teenaged \"Killer Babysitter\" Christine Falling, who murdered five children under her care and successfully staged them as accidents or natural causes over a 2-year period, at one point killing an elderly man on her first day of nursing after Florida families stopped hiring her","TIL African-American army regiments formed after the Civil War were called Buffalo Soldiers by Plains Indians because their curly hair resembled bison hair. During the Spanish-American War, Spaniards called them \"Smoked Yankees.\"","TIL that Portuguese neurosurgeon Antonio Egas Moniz received the Nobel Peace Prize for developing the lobotomy. Today the procedure is “deplored by many as brutally arrogant, and collateral derision has been directed at Moniz as its inventor.” The award has not been overturned.","TIL that the word \"caterpillar\" meant \"hairy cat\" in Old French","TIL - the Harris County Jail is the largest mental health provider in the state of Texas","TIL in Australia there is National Sorry Day to remember/commemorate the mistreatment of the country's Aboriginal People","TIL the letter M probably comes from the Egyptian hieroglyph for water","TIL Serena Williams is a Jehovah's Witness","TIL that in the Swiss boarding school Institut Le Rosey, a quota system limits students of any one country or linguistic region (e.g. English-speaking countries, German-speaking countries) to 10% of the school’s total population, which results in the 450 students coming from over 70 countries","TIL Luther witnessed the Pope concealing pedophiles on his first visit to Rome as a monk, writing: \"conditions are…worse than anyone can say…they decided that a cardinal should not keep as many boys…Leo commanded that this be deleted; otherwise it would have been spread through the whole world\"","TIL That During Medieval Times Boom Chains were setup to destroy any incoming ships that tried to land on beaches to take forts. They acted much like spike strips or submarine nets","TIL a Texas sheriff was duped into buying money copying box. Irate that the box did not work, he confronted the seller, who convinced the sheriff he had been operating it incorrectly and gave him some money for the trouble. The sheriff was later arrested because the money he had been given was fake.","TIL of Loukanikos, a Greek \"riot dog\" present and active at almost every major protest during the height of the financial riots. He was named a Time Person of the Year in 2011 and succumbed to tear gas-related injuries in 2014","TIL in 2014 a Chula Vista firefighter attending the scene of a road accident was arrested by a California Highway Patrol officer for blocking the road and failing to move his firetruck. The firefighter later sued the CHP for wrongful arrest.","TIL Social Isolation Heightens Sensitivity To Social Threats","TIL The Oval Office Study is the working office of the President of the United States. It adjoins the Oval Office, the ceremonial office of the president and is accessed from a small corridor outside the Oval Office, which includes the president's private lavatory and the president's dining room","TIL 20% of all mammal species are bats, making them the second most common mammals after rodents.","TIL the average age people on the autism spectrum die is only 36","TIL our biological day/night cycle (circadian rhythm) makes judges more merciful in the morning and after lunch, and less often before breaks...and we're all susceptible to the same mechanism.","TIL Sinistrophobia is the fear of things at the left side or left-handed people.","TIL that \"Max Manus\" (2008) was the most expensive Norwegian movie ever made, at roughly 50 mil. Kr., or $9 mil USD","TIL that \"Q\" is the only letter that does not appear in any US state name. Every other letter appears in at least one state name.","TIL that a mysterious disease killed over 200,000 critically endangered saiga antelope in Kazakhstan wiping out over half of the species.They died due to fatal blood poisoning caused by a bacteria that is regularly present in noses of saiga but grew out of control due to warm and humid conditions.","TIL Woman stoped on highway to help ducks and a motorcycle slams into her idling car, killing a man and his teenage daughter. Woman goes to prison.","TIL: Ben Stein, the Social Studies teacher in Ferris Bueller's Day Off, was a presidential speechwriter, lawyer and economist, and was speculated by TIME Magazine to have been deep throat.","TIL of Anna Coleman Ladd, an American sculptor who made life-like masks for WWI veterans whose faces were disfigured beyond repair","TIL that the inventor of the Popsicle was just an 11-year old kid.","TIL that one litre of liquid water has a mass of almost exactly one kilogram, because the kilogram was originally defined in 1795 as the mass of one cubic decimetre of water at the temperature of melting ice.","TIL That German POWs in Delaware worked in agriculture to make up for the 33,000 American men off at war.","TIL the average weight of a cumulus cloud is 1.1 million pounds, which is about the same weight as a herd of 100 African elephants","TIL Three of the 12 dogs in the Titanic survived.","TIL Eight thousand teachers in Russia's Altai Republic had their salaries paid in vodka","TIL that it is a rare condition to be allergic to goats’ milk but not to cows’ milk.","TIL that despite being considered stable, Bismuth 209 undergoes alpha decay with a half life about a billion times longer than the estimated age of the universe. (1.9 x 10^19 years)","TIL that cast iron pans are a good source of dietary iron","TIL : The Little Mermaid, Ariel appears as an adult in Return to the Sea and gives birth to a daughter named Melody, becoming the first, and currently, only, Disney princess to become a mother.","TIL about the 2038 problem. A technological glitch that after 03:14:07 UTC, January 19, 2038, clocks on various devices will revert back to December 13, 1901.","TIL that Don Bradman of Australia, considered one of the greatest batsmen in Cricket, was nicknamed \"White Headley\" after George Headley, a West Indian batsman also considered one of the greatest ever, who in turn was nicknamed \"Black Bradman\".","TIL that bile breaks down in the human body into stercobilin (makes poop brown) and urobilin (makes pee yellow).","TIL The First Presidential House in Manhattan housed George Washington from 1789 to 1790. The house was rented for one year at an annual rent of $845 and was demolished in 1856","TIL there is a road in Mexico which constantly forces you to change lanes to keep you from falling off the cliff","TIL a furnace used to heat pieces of glass is called a glory hole","TIL that The Who's album Who's Next was supposed to be a rock opera, titled Lifehouse. Its plot was a dystopic sci fi set in the year 2000, and predicted virtual reality and the internet in 1971, closely resembling th plot of the Matrix. It was shelved as the other band members didn't understand it.","TIL that Dennis Wilson of the Beach Boys is rumoured to have once beaten up Charles Manson over a dispute that the Beach Boys recorded a Manson-writted song without giving him the credit and changing the original title...","TIL about Saint Drogo, Patron Saint, among others, of the Ugly and Coffee","TIL That the name \"Bowser\" refers to someone of a cheerful, pleasant demeanor or disposition, or for someone considered to be good looking.","TIL that FIAT is an acronym for Fabbrica Italiana Automobili Torino","TIL firefighters sometimes use \"wetting agents\" to make water wetter. So, you can make water wetter!","TIL Emperor Hirohito, Emperor of Japan during World War II, was renamed Emperor Shōwa posthumously. Shōwa translates to \"period of enlightened peace\" while Hirohito translates to \"abundant benevolence\"","TIL despite being worth €37.3 billion the founder of IKEA drove an old Volvo, travelled by economy class, brought a lunch box to work, visited vegetable street markets right before they closed for the day, hoping to get better prices and shopped for clothes at the local flea markets.","TIL that in Jordan Peele's 'Get Out', the character Chris literally frees himself by picking cotton.","TIL that with some credit cards in Canada, you will be charged the cash advance interest if you buy lottery tickets on your credit card.","TIL about the Eurasian wryneck which when threatened, make snake-like head movements to try and scare predators. This attribute led to their use in witchcraft to put a \"jinx\" on someone.","TIL Mauna Loa, in Hawai'i is the biggest volcano on Earth and covers half the Island of Hawai'i (Big Island). It is also one of the most active.","TIL after Chamillionaire won a Grammy for “Ridin’”, he approached ‘Weird Al’ Yancovic on the red carpet, thanked him for the “White and Nerdy” parody and told him “I think your parody is a big reason why I won this Grammy, because you made it undeniable that my song was the rap song of the year.\"","TIL that Say Anything's album ...Is A Real Boy was recorded with a Pod/simulated amps for guitars in the producer's apartment.","TIL that Nicolaus Copernicus proposed the heliocentric solar system (making the sun the center of the solar system instead of earth) from his death bed because he was aware of the controversy it would cause and the danger it proposed to him. He was right.","TIL Locked In Syndrome a very low survival rate condition that can happen after a stroke.","TIL Kyoto Seika University offers a PhD course in Manga","TIL that Jamaica is split into three counties; Cornwall, Middlesex, and Surrey.","TIL British singer Tulisa successfully sued Will.i.am and Britney Spears over the song “Scream and Shout”, which she co-write to release on her own album, only to discover it had been given to Spears.","TIL that in 1995 Discover Magazine posted an article about a fictional creature that lives in Antarctica, head could heat up to 110 degrees, and could eat an emperor penguin in a matter of seconds for an April Fools prank","TIL Oscar Goodman was the defense attorney for some of Vegas’ most notorious crime bosses including Meyer Lansky and Lefty Rosenthal, the inspirations behind Hyman Roth from The Godfather Part II and Ace Rothstein from Casino, respectively. Goodman was later elected mayor of Las Vegas.","TIL Squid have three hearts and Squid blood is blue.","TIL about Frederik Kaarle I, the German prince what was elected first King of Finland in 1918, but who renounced the title two months later.","TIL that there is a statue of Jason Vorhees chained under the Crystal Lake located in Cosby, Minnesota","TIL There's a group of scientists who claim the earth froze entirely at one point: The Snowball Earth hypothesis. Another group insist the Earth didn't entirely freeze: The Slushball Earth hypothesis.","TIL: Whale Poop Freshens Our Air","TIL The topical analgesic \"Bengay\" is named after the anglicized pronunciation of the name of its creator, French doctor Jules Bengué","TIL that the discovery of elements 95 and 96 (americium and curium) was first announced by physicist Glenn Seaborg on the children’s radio show Quiz Kids, in response to one of the children asking whether any new elements had been discovered at the Metallurgical Laboratory in Chicago during the war","TIL 'Weird Al' Yankovic recorded a parody of Lady Gaga's \"Born This Way,\" entitled \"Perform This Way,\" and all of the proceeds from the parody and its music video were donated to the Human Rights Campaign, to support the human rights themes of the original song.","TIL there exists a federal, non-military, commissioned uniformed service focused on Public Health (PHSCC)","TIL that the 1997-1998 forest fires in Indonesia were among the largest fires in the last two centuries of recorded history","TIL about Cathy Smith, a groupie of The Band who was with them for years and at one point was pregnant with “the band baby” because it was not clear which member was the father","TIL that when George Washington was 21, his actions sparked the French and Indian War","TIL that Argentina executed a pregnant woman for eloping with a priest.","TIL the Gregorian calendar was introduced because the lengths of the 4 seasons didn't match the time it took the Earth to fully revolve around the sun. They also had to take out 10 days of the new calendar so that the spring equinox would remain on the same day.","TIL that out of the 100 oldest living humans only 7 are male","TIL that the 120 asteroids in our solar system that are named minor planets were discovered from 1876 to the 1930's and mostly by just 4 astronomers.","TIL there was an official, licensed 1964 Doctor Who story in which a Dalek fell in love with Susan, the Doctor's granddaughter.","TIL Yogi Bear used to be the mascot of a chicken restaurant franchise, and when they all closed, the statues were dumped in the middle of a forest. This site became a tourist attraction in and of itself, known as the \"Yogi Bear Graveyard\".","TIL There were so many bombs and chemical weapons dumped into the Gulf of Mexico not even the military knows how much is down there, or where it all is.","TIL That Western Pennsylvania has its own American English dialect, referred to as \"Pittsburgh English\" or \"Pittsburghese\"","TIL a drunk Norwegian with an air gun hijacked a plane in 1985, with demands to speak to the prime minister. After consuming the plane's entire beer supply, he surrendered his weapon to authorities in exchange for more beer. There were no deaths or injuries.","TIL that at some point every day there exists three different days going on at the same time in the world.","TIL That the infamous Dodge-PPG M4S Turbo Interceptor Pace car featured in The Wraith (1986) was not in the film, replica dune buggies were used instead","TIL that Girls' bicycle has a lower bar to make it easy to mount while wearing long skirts","TIL The Keto Diet was popularized in 1997 by the Director of Airplane!","TIL A 74 year old memorized Milton's Paradise Lost as a lark over a period of seven years; It takes three days to recite.","TIL that when an Army depot was built in 1941, a herd of white deer with a recessive gene were trapped inside. This created a whole heard of the rare deer to flourish inside.","TIL about the Tucker State Prison Farm scandal, in which inmates were routinely beaten, tortured with needles under their fingernails, and had their genitals crushed with pliers and electrocuted. Up to 200 inmates may have been murdered and buried around the prison.","TIL about Ms. Katherine Johnson, NASA human computer who calculated trajectories for the Apollo space missions by hand!","TIL Pantera was once a special musical guest on Spongebob","TIL that Sir James Dyson started his vacuum company in his 40’s when he had three young kids and was in debt by putting up his home as collateral on a loan and now owns 100% of his company and has a personal net worth of over 7 billion dollars!","TIL that the song mentioned in Ed Sheeran's 'Perfect' where he sings about being \"barefoot on the grass, listening to our favorite song\" is March Madness by Future.","TIL that a massive ice storm in Quebec in 1998 helped scientists to understand “epigenetic inheritance”: stress on pregnant moms during the prolonged power outage led to changes in infants’ DNA that is linked to illnesses later in life. The research program was named Project Ice Storm.","TIL Mount Rushmore was originally supposed to depict each president from head to waist, but lack of funding forced construction to end early","TIL Bloody Dick Peak is the 283rd tallest mountain in Montana.","TIL that standardized time zones were introduced in 1883 to coordinate cross-country rail service. Daylight saving time has an even more recent origin; it wasn't formally adopted in the U.S. until the passage of the Uniform Time Act of 1966.","TIL The BBC broadcast a feature length episode of Casualty in 2016 where a tiny drone downs a helicopter and carnage ensues. The episode was called ‘Too Old for This Shift’.","TIL about the International Date Line: An imaginary line roughly along 180° longitude, that marks the intersection of GMT+13 from the east and GMT-11 from the west. Since and Samoa and Am. Samoa are on different ends of this line, they have the same time but their calendars are a day, or 24h, apart.","TIL about the 1970s R&amp;B band The Escorts. They met and recorded their debut album while serving time for various felonies.","TIL to build the SR71 Blackbird’s titanium skin the CIA used a phantom company to buy it from the Soviet Union","TIL in 1933 Ireland deported one of its own citizens, Jimmy Gralton, for being a subversive (communist).","TIL The wall of China is being stolen brick by brick.","TIL: The letters Q, W and X were illegal in Turkey for 85 years until 2013 because the letters were associated with the Kurdic language. Enforcement wasn't that strict for Western companies (like Xerox), but in 2005 a group of Kurds was fined 100 lira for holding up signs with the letters","TIL that an entrée is the main meal in the US and parts of Canada","TIL It rains iguanas in southern Florida when it gets cooler due to them shutting down in the cold and not being able to hold on to their tree","TIL that the famous photo of Albert Einstein sticking out his tongue was taken on his 72nd birthday when he was asked by a photographer to smile for the camera. After smiling a dozen times for previous photos that day, he playfully stuck out his tongue instead.","TIL that instead of replicating and destroying the host cell, a large DNA virus could take control of the host bacterial or archaea cell, remain within the cell, thus overcoming the tradeoff dilemma typically faced by viruses i.e. eventually killing and dying with the host cell.","TIL that in one of the scenes of Poltergeist, the daughter character swims through a muddy pool filled with skeletons with the props being actual skeletons.","TIL Jeffrey Dahmer was killed by the method in which he killed his first of 17 victims: by a barbell to the head.","TIL of the Great Tokyo Air Raid (1945) during which 1665 tons of incendiary bombs were dropped on Tokyo in a span of 3 hrs, resulting in 100k deaths and 1M displaced. It's considered the most destructive bombing raid in human history.","TIL a mole can dig a tunnel that is 300 feet long in only one night.","TIL that a man broke into Buckingham Palace in 1982. He entered Queen's bedroom, chatted with the queen for 10 minutes and then asked her for some cigarettes.","TIL of Ivan IV, a Russian emperor who was imprisoned at 1 years old and referred to as \"the nameless one\" before he was murdered after 20 years of confinement","TIL Alabama and Mississippi were once part of the state of Georgia, until corrupt politicians participated in a flurry of deceitful land deals called the Yazoo Affairs. This resulted in the state ceding these lands to the federal government and splitting the state of Georgia into three equal parts.","TIL that Weird Al actually made a parody of two Nirvana songs on his album \"Off the Deep End\", one of them was a hidden noise track titled \"Bite Me\" parodying Nirvana's hidden noise track \"Endless, Nameless\" on Nevermind.","TIL that it was illegal to sell and eat ice cream on public streets in the seaside town of Carmel-by-the-Sea, California until Clint Eastwood's became mayor in 1986.","TIL that guitar solos are modified scales (still very impressive and requires huge skill though).","TIL since 1938 there is a sustained and thriving population of rhesus macaques monkeys living along the Silver River in Florida.","TIL The Eiffel Tower is painted in three shades, progressively lighter with elevation, in order to augment the structure’s silhouette against the canvas of the Parisian sky","TIL that France granted the US permanent, rent-free possession of the American cemetery in Normandy, which contains the remains of 9,387 fallen troops plus a memorial to 1,557 killed there whose remains were either not found or not identified.","TIL the Department of Defense made a set of playing cards for US soldiers to identify/respect Afghanistan and Iraq monuments.","TIL there is an R-rated version of the film Galaxy Quest, which includes sex scenes and lots of profanity.","TIL that when a bald eagle loses a feather on one wing, it molts a matching feather on the other wing.","TIL Long John Silver, the ruthless one-legged antagonist of Treasure Island, was based on author Robert Louis Stevenson's disabled friend, the poet William Henley.","TIL In California you have to be 21+ to purchase cigarettes - unless you're in the military","TIL That the US Navy operates several underwater microphones spread across the worlds oceans to monitor the seaward movement of foreign navies.","TIL that the earliest flush toilets were used by the people of the Indus Valley Civilization (existing from approx. 3300 BC - 1700 BC). Almost every home in the ancient cities of Mohenjo-daro and Harappa had a flush toilet connected to a common sewage system.","TIL the North American PlayStation 1 controller is about 10% larger than the Japanese version, due to a majority of North Americans having larger hands than the average Japanese person.","TIL that during WW2, allied pilots, paratroopers, and commandos were given \"Asshole Compasses\" inside of escape kits to use in the event of being caught in enemy territory. The kits included escape maps, a hacksaw blade and phrase cards, and a north seeking compass small enough to hide anywhere...","TIL Motley Crüe rocker Nikki Sixx has overdosed numerous times. Once he was revived in an ambulance with 2 shots of adrenaline to the heart, after which he went to his friend's house to take more heroin, it was only after the occasion Sixx was officially declared dead he cleaned up his act.","TIL there's a tough chicken meat called woody breast that makes for a very unpleasant texture.","TIL about the \"Barefoot Bandit,\" a Washington kid who began living in the wild at age 7. He was responsible for over 100 thefts including airplanes he learned to pilot by playing flight simulators. He was finally apprehended after crash-landing in the Bahamas with a Cesna he stole in Indiana.","TIL the film 'Casablanca' was \"rushed into release to take advantage of the publicity from the Allied invasion of North Africa which was a few weeks earlier\"","TIL that handcuffing dead people after shootouts is standard police practice.","TIL That Men experience a significant/abrupt decrease in testosterone levels after sugar intake.","TIL: that spacesuits are personalized and have to take into account \"growth\" due to less bone compression in space (i.e. you will be a little taller in space, which spacesuits have to accomodate)","TIL the floor in the music video for Jamiroquai's Virtual Insanity never moved. The entire set was put on wheels, with the camera attached to one wall. Movers would yell NORTH! and Jay Kay would have to dance corresponding to the movements of the set, giving the illusion of moving with the floor.","TIL The Paul Simon song “You can call me Al” was inspired by a French Composer mistakenly referring Paul as “Al” and his then wife Peggy as “Betty”.","TIL that in Ancient Greece, the famed slingshot mercenaries from Rhodes would often carve taunting messages into their rock projectiles, much like those written on modern-day bombs.","TIL of the Napkin Ring Problem. If you core a sphere, you also reduce the height by cutting off the top and bottom. As long as two spheres are cored to the same height ring, they will always have the same volume, no matter the starting size of the sphere.","TIL about the Hawaiian bobtail squid, which has an active cloaking \"light organ\" filled with symbiotic bioluminescent bacteria","TIL that Al Hendrix was in the US Army and stationed away from home when his son was born. He requested, and was denied, a furlough to go and meet his newborn son, Jimi Hendrix. The next day, he was arrested on no charge and imprisoned for two months with no trial to prevent him from going AWOL.","TIL that the largest palace on Earth was constructed 2200 years ago. It was 6.7 times the size of Forbidden City and 11 times the size of Vatican City","TIL Stone Cold Steve Austin had beat and bruised his then-wife and then-girlfriend. His ex-wife later claimed that it was due to roid rage and that WWE spent millions of dollars concealing these events","TIL Hammer Films - the British studio best know for Gothic horror films - and Toho Studios - the Japanese studio best know for Godzilla - once tried to join forces to make a film about the Loch Ness Monster.","TIL that there was an independent Kurdish state for 11 months in 1946 called the Republic of Mahabad, which existed until the Iranian government destroyed it.","TIL of San Miguel de Guadalupe, the first European settlement in the continental United States. It was a short lived, Spanish settlement in present day S. Carolina that predated the Plymouth Colony by almost a century.","TIL Japan apologized to its' own citizens for the Firebombing of Tokyo (done by the United States). The PM stated that loss was inevitable and that they were there cause of over 100,000 deaths from the bombing.","TIL, insurance agent Jack Lee Harelson was fined $2.5 mill for looting an ancient Paiute Indian burial site. He hired an undercover cop disguised as a hitman to kill the judge who had presided over his trial.","TIL In 1985, Reagan and Gorbachev agreed to pause the Cold War and work together in case of an Alien Invasion","TIL that one consequence of lower oil prices is that fewer plastics get recycled. Since plastics are petroleum based products, if oil prices fall low enough, it's cheaper for companies that might use recycled materials to just manufacture new plastics, and recyclables end up in landfills.","TIL that a machine has been designed that will allow its user to commit suicide. The designers of the “Sarco” (short for sarcophagus) intend to make 3D printing plans of the machine available for purchase online in the future.","TIL the idea of a mafia godfather was invented by The Godfather's author Mario Puzo, but following the film's success, it was adopted by actual mobsters, just like the saying \"give him an offer he can't refuse\".","TIL that Mormonism founder Joseph Smith was the first American presidential candidate to be assassinated while running for office","TIL Tesla is the leading car manufacturer in Norway and total of 32% of cars are electric in Norway.","TIL of Frank 'Cannonball' Richards, a vaudeville performer who was know in the 30's for having a seemingly indestructible belly. His most popular stunt was getting shot in the belly with a 104-lb cannonball. He limited this stunt to doing it 2 times a day because it was too painful even for him.","TIL that Venus has such a slow rotation on its axis that a single day is longer than an entire year on Venus.","TIL the main difference between bread and cake is the protein content of the flour used.","TIL A woman was successfully was diagnosed in 1984 of brain tumor, after she began hearing unknown voices in her head that told her she needed to have a brain scan.","TIL that the drug cocktail that allows AIDs patients to survive came along just months after Freddie Mercury died.","TIL the 1994 Northridge Earthquake epicenter was actually in its neighboring city of Reseda","TIL Most Break-Ups happen 2 weeks before Christmas, around Easter, and on Mondays.","TIL that Dr. Seuss pronounced his name so that it rhymes with \"voice\".","TIL that (unguided) air-to-air missiles were used as early as 1916","TIL that wounded US Military working dogs are triaged and treated just like human soldiers.","TIL in France, it is illegal for restaurants to offer unlimited free re-fills of sugary drinks.","TIL that when John Krasinski learned he got the role of Jim on 'The Office' he went out and shot the video of Scranton that was used in the title sequence. [Jump to 5:38]","TIL there is a plant that can mimic leaves of the host plant. Boquila can produce dozens of different leaves differing in size, shape and color, even when attached to multiple different host plants. Mechanism for their mimicry is still unknown.","TIL 2000 tons of unexploded bombs are still uncovered in Germany every year.","TIL in 1998 a lightning strike killed all 11 players of a football team in the Democratic Republic of Congo while the opposing team was unhurt.","TIL of gutter oil - cooking oil which has been illegally recycled from waste oil collected from sources such as restaurant fryers, grease traps, slaughterhouse waste and sewage from sewer drains. It is estimated 10% of low end restaurants in China use it","TIL more than 15.6 million people in the US identify as Italian American, and only around 1 in 20 actually speak Italian at home","TIL The first assembly language (a type of low-level programming language that is extremely close to the machine) ever created was made by a woman Named Kathleen_Booth.","TIL that there is a Greek god called Thanatos, the god of death.","TIL The Detective in charge of the Maddie case published a book about how he believes the UK police prevented the investigation from pinning the guilt on the parents and it's banned in the UK.","TIL there are over 43 quintillion permutations of a Rubik’s cube. This number is higher than the amount of seconds since the Big Bang!","TIL that some scientists believe suicide rates increase during the summer months because social interactions increase.","TIL that during the 1956 Olympic flame relay in Sydney, a man pretended to be the torch-bearer by using a chair leg as torch with underpants set on fire.","TIL that you dump popcorn in the water when you re-enact an oil spill.","TIL the moon orbits the Earth once every 27.322 days. It also takes approximately 27 days for the moon to rotate once on its axis. As a result, the moon does not seem to be spinning but appears to observers from Earth to be keeping almost perfectly still. Scientists call this synchronous rotation.","TIL That a one in a million chance, happens frequently as per Littlewood's law","TIL According to a survey conducted by Menchies, a frozen yogurt chain, roughly 95% of Americans believe the softer stuff is better for them than ice cream. Experts advise servings to be no more than half a cup full or size of a baseball","TIL Nintendo hired a developer that worked on unofficial emulators (such as iNES) to its team in 1998, to work on official emulators","TIL that Iwo Jima is a part of Tokyo","TIL that the Fleischer brothers released sound cartoons before Disney's 'Steamboat Willie.'","TIL the Curiosity rover on Mars has the ability to take selfies, and has been doing so since 2012","TIL Louie Armstrong discovered Swiss Kriss, an herbal laxative, in the 1950s and loved it so much, he sat for advertising cards that showed him, in bare bottom, sitting full on the toilet bowl.","TIL that the dogs who fought to the death in the infamous Faces of Death movie were really just two puppers smeared with jelly and playing","TIL France supplied weapons to Iraq until the year 2000 in spite of UN sanctions against it including components for weapons of mass destruction.","TIL that \"the\" was originally written as \"þe\" in old english. It was eventually abbreviated to \"þͤ\". Since \"þ\" looked similar to \"y\" in old english blackletter script, they were both mixed up. So, in old english, \"Ye olde\" was simply pronounced \"The olde.\"","TIL that stressed men prefer bigger butts","TIL Japan’s capital, Tokyo (or Tokyo Metropolis), has 39 million residents and a $2 Trillion Economy, making it the world’s largest metropolitan Center both by population and by Gross Domestic Product (GDP).","TIL Former Eagles players Chris Long &amp; LeGarette Blount are 2 of 4 players to win a Super Bowl with two different means.","TIL that bees sleep outside the hive during hot weather, forming large clumps of bees. This behavior is called \"Bearding.\"","TIL Dogs like classical music. In a study in 2003, shelter dogs were found to be more relaxed and quiet when they were listening to classical music. The dogs didn't seem particularly interested in pop music or radio shows but exhibited more barking when heavy metal was playing.","TIL that Microsoft photoshopped out a Black person from an advertisement that was published in Poland in 2009.","TIL the former video game magazine 'GamePro' are the ones behind the \"pro-tip\" meme.","TIL in 1920, Franklin Roosevelt was on the losing ticket as the U.S. Vice Presidential candidate. In 1932 he won the Presidency. He is the last losing VP to eventually become President, although many have tried.","TIL the word **billion** in Britain used to mean **trillion** until 1974. Basically, the number lost 3 zeros behind it. In France and Italy, it also changed its meaning, but then changed back.","TIL in the mid-1980's Italy overtook the United Kingdom as the 6th largest economy in the world - an event known as \"il sorpasso\"","TIL that according to buddist tradition Buddha was born after his mother was impregnated by a Elephant in her Dream.","TIL Kidney transplants do not replace the old diseased kidneys, but instead adds 1 or more kidneys in the lower abdomen of the body.","TIL Private First Class Dhan Ryan Bayot and his team were surrounded by Maute group members, he disclosed his position so the Philippine Army can bomb the area even if it meant that he could die too.","TIL of SS Richard Montgomery, a U.S Naval ship that sunk near Sheerness, England at a average depth of 15m(49ft) in 1944 with over 1400 tonnes of high explosives aboard. To this day, it is considered too dangerous to move or extract the remaining bombs.","TIL of the Bronze Age collapse, in which incredibly rich, powerful, advanced civilizations, dependent on complex trade and agriculture, vanished in the span of a human lifetime.","TIL there is an elephant named Koshik who spent much of his youth at Everland Zoo in South Korea where he learned to speak 5 words of Korean due to the fact he lacked social interactions with his own species and was lonely.","TIL Yo-Yo Ma's relative hid the Ma family genealogy in the wall of their home during the Cultural Revolution. It was uncovered that his paternal ancestry traces back eighteen generations to the year 1217.","TIL there's an Australian moth (Uraba lugens) that wears its previous heads as a hat. They call it the Mad Hatterpillar.","TIL that peregrine falcons are the fastest animals on the planet, capable of reaching speeds around 200 MPH.","TIL about the abandoned Sanzhi UFO houses in Taiwan. This resort began construction in 1978 and was meant for the American military. The resort was never finished due to various deaths and suicides. Demolition began in 2008 and finished in 2010. The site is being redeveloped as a tourism spot.","TIL: That Buster Keaton fractured his neck on set in this scene and didn’t realize it until 10 years later when an X-Ray showed it.","TIL five golden retriever puppies died during the filming of Snow Buddies in early 2007","TIL that according to a popular Sudanese myth, a rope once united heaven and Earth, until a mischievous hyena severed it, ushering death into the world.","TIL that the guy who wrote \"Afternoon Delight\" co-wrote \"Take Me Home, Country Roads\"","TIL Sequoia trees need fire to reproduce","TIL of Phineas Gage, a man who had a large metal rod go completely through his head and destroy his brain’s left frontal lobe. Miraculously he survived, and was able to recover his social skills over time although people noted changes to his personality, behavior, and memory.","TIL that Australia has no maximum period of service for a Prime Minister, unlike countries such as the United States, where the President can only serve for two four-year terms.","TIL a man angry at Caltrans over the lack of a sign, made his own, and Caltrans used it for years","TIL that Apollo (the Greek God) actually aided Paris to kill Achilles by guiding the arrow to Achilles' heel after Achilles killed one of Apollo's sons in Apollo's own temple. Apollo also killed the Cyclops who fashioned the lightning bolt used by Zeus to kill another of his sons.","TIL Aleksandr Karelin has a wrestling record of 887 wins and 2 losses. He went 13 years undefeated in international competition and six years without giving up a point.","TIL Brazil's Kayapo people rejected money from dambuilding companies. \"We have decided that we do not want a single penny of your dirty money... Our river does not have a price, our fish that we eat does not have a price, and the happiness of our grandchildren does not have a price\"","TIL: The CIA attempted a \"character assassination\" of Fidel Castro by putting thallium salts in his shoes, hoping it would cause his characteristic beard to fall out.","TIL King Louis IX, who died today in 1270, is the only French monarch venerated as a saint. He invited beggars to eat with him at his table daily, and replaced trial by combat with evidence-based trials.","TIL that in Kentucky all public officials, including notaries, must swear that they have “not fought a duel with deadly weapons within this State, nor out of it.”","TIL recent research shows that fasting in mammals can improve longevity in the long run, but the underlying biological mechanisms (i.e. how it actually slows down aging) are not yet fully understood","TIL that in 1997 a woman was diagnosed with a brain tumour after she hallucinated voices telling her that she had one. The voices said \"goodbye\" after surgery to remove the tumour.","TIL that the remnant cut of paper left from a hole punch is called a ‘chad.’","TIL about Michael H. Kenyon a.k.a. \"The Enema Bandit\". He would break into women's homes, tie them up, and give them an enema before robbing them.","TIL in the mid 1800s, a woman named Mary Ann Cotton murdered 21 people by arsenic poisoning, including four of her husbands and 11 children, to pick up their insurance. She was arrested and later hung for her crimes.","TIL Phil Hartman was a successful graphic designer before becoming a comedian, and also helped co-create, along with Paul Reubens, the character of Pee-Wee Herman","TIL: Tom Bodett, the guy who does the Motel 6 commercials, also did the Good Idea, Bad Idea sketches on Animaniacs","TIL when Theodore Roosevelt's Rough Riders made their famous charge up San Juan Heights, they were entirely on foot. The only one riding anything was Roosevelt. They'd left the horses in Florida.","TIL Don LaFontaine, \"the voice of movie trailers,\" voiced an estimated 5,000 trailers, and 350,000 commercials. His favorite was his trailer for The Elephant Man.","TIL about Gregor Macgregor who convinced hundreds to invest in government bonds and land in Poyais, the South American country he ruled, only for them to later realise that he was no prince and worse, there was no such country. He was hailed as a hero and died with military honours in Venezuela.","TIL that over 4,000 prisoners die in custody each year in the United States. Suicide is the leading cause of death in local jails, while state prisons see more cancer deaths. White males are the most likely to die in prison, with one fourth of the fatalities occurring in Texas and California.","TIL that the Ford Pinto was notorious for a defective fuel system, which led to fires and increased the chances of death. Instead of recalling the Pinto to put in an $11 part, Ford decided it'd be cheaper to settle any wrongful death suits","TIL the bullet impacts on the T1000 in Terminator 2 were a practical effect. Only when they disappeared were they CG.","TIL most bank vaults are made of concrete, not metal, and even the metal door is usually just a thin jacket of metal over concrete.","TIL That there are Nuclear Icebreakers accompanying cargo ships in the Northern sea route","TIL there are 616 air parks or private aviation communities in the United States where you can 'live' with your plane","TIL:In The Phantom Menace, Yoda has three toes. But in The Empire Strikes Back, Return of the Jedi and Revenge of the Sith, he has four","TIL that Prince, Carrie Fisher, Leonardo DiCaprio, Brad Pitt, Angelina Jolie, among other music and film icons, were never nominated for a star on the Walk of Fame","TIL that there is also a Brownout which is referred to an intentional or unintentional drop in the voltage of an electrical power supply which can be hazardous to precision electrical equipment.","TIL 4-year-old Paulette Farah was reported missing from her room on 22 March 2010. Nine days later, Paulette's body was found in her bed where previously experts had come with trained dogs and where her mother had given interviews","TIL of Ralph Lazo, a 17-year old American student of Mexican and Irish descent, who voluntarily relocated to a World War II Japanese American internment camp, to provide moral support and share in his friends’ struggle; he would spend three years living there","TIL that Ennio Morricone and Sergio Leone attended primary school together in 1937, in Rome. Over the years they lost each other’s contact information until 1964 when Sergio Leone hired Ennio to write “For a fistful of dollars” soundtrack.","TIL Drinking a glass of ice water rather than a glass of water at room temperature only burns about eight calories. Your basal metabolic rate, which keeps your organs functioning, burns about 70% of your calories.","TIL China had a peace treaty with Taiwan called an \"even-day ceasefire\" where they would only shell a Taiwanese Island on odd-numbered days","TIL Harvard and the University of Saskatchewan say parents should not discourage their children from picking their noses because they contain 'a rich reservoir of good bacteria.'","TIL Inspector Gadget was conceived as a way to recoup costs when Lupin VII, a planned futuristic spinoff of the Japanese franchise Lupin III, failed to get off the ground.","TIL On the same day as the Sandy Hook shooting (December 14th 2012), a mentally ill man wielding a knife attacked and non fatally injured 24 people at a school in Chenpeng China.","TIL that the official sport of Maryland is jousting.","TIL after Stalin's son Yakov, failed suicide attempt in his room via firearm. He missed his heart and hit his lung instead; while his stepmother Alliluyeva tended to his wound and called the doctor, Stalin is quoted as saying, \"He can't even shoot straight\".","TIL There is a fungus named after Spongebob Squarepants, it’s called Spongeiforma squarepantsii","TIL jambalaya, a popular rice and assorted dish from Louisiana, has influences of Spanish, French, African, Native American and Caribbean cooking styles and produce.","TIL that 5 years before the Stoneman Douglas Valentine’s Day shooting, David Bowie released a song about a school shooter called, “Valentine’s Day”.","TIL of Brandon Woodard, the bicoastal drug dealer who was executed in New York City in 2012 so his partner could avoid paying him. He was killed in broad daylight in the middle of Midtown Manhattan. He had chosen the spot for safety. The man who pulled the trigger has never been caught.","TIL that Frederick the Great ordered executioners to secretly strangle criminals before they were broken on the wheel. This was to keep the illusion of brutality while, at the same time, being merciful.","TIL that General Ulysses S. Grant was once so offended by the mistreatment of a team of horses that he had the perpetrator tied to a tree for six hours.","TIL That the first Christmas party held at the US Embassy in the USSR featured three performing seals, who came into the room balancing a Christmas tree, a tray of glasses, and a bottle of champagne. Afterward, the seal's trainer (quite drunk), passed out, and the seals galloped freely in the house.","TIL whilst working as a marine-biology teacher in 1986, Stephen Hillenburg was asked to create an educational comic about anthropomorphised sea life. He later adapted the characters within it, such as \"Bob the Sponge\", into one of the most popular and longest-running children's series of all time.","TIL an attempted assassin armed with two pistols had them both misfire and the very not assassinated President Andrew Jackson beat him with a cane","TIL Newfoundland was originally granted independence as a separate country from Canada, but chose to rejoin the UK during the Great Depression. It proceeded to be independent again in 1949, and joined Canada, 82 years after Canadian Independence.","TIL that in Ancient Greece people would scrape the accumulated sweat and olive oil (gloios) off of wrestlers after a match and sell it for its alleged medicinal properties.","TIL that, after the death of jazz musician John Coltrane, he was worshiped by a San Francisco religious group as \"an earthly incarnation of God\". When that congregation joined the African Orthodox Church in the 1980s, it \"demoted\" Coltrane from God to saint, and now venerates him through jazz","TIL that salmonella is named after Dr. Daniel Elmer Salmon","TIL that for the 24th season of the National Football League in 1943, the Pittsburgh Steelers and the Philadelphia Eagles merged into a single team known by fans as the Steagles.","TIL The voice actor of Spongebob (Tom Kenny) is married to the voice actor of Karen ( Jill Talley)!","TIL despite having “Squid” in his name, Squidward is actually an octopus.","TIL that VISA (the credit card processing company) is actually a recursive acronym that stands for Visa International Service Association. It is the parent company of all the regional Visas.","TIL that after Indira Gandhi was assassinated by her Sikh bodyguards, massive anti-Sikh riots and pogroms ensured, described by her son as: \"When a big tree falls, the earth shakes.\"","TIL that all North Carolina venomous snakes have diamond shaped heads.","TIL Caesar's supporters once humiliated his co-consul by pouring feces all over him after he had opposed Caesar's \"moderate and carefully reasoned bill\".","TIL that not all Norse soldiers who die in battle go to Odin’s hall, Valhalla. Half go to Freyja’s field, Fólkvangr, which has a different hall: Sessrúmnir. Freyja rides a chariot pulled by two cats and occasionally rides her boar, Hildisvíni (who is actually her protégé Óttar, disguised).","TIL of Operation Cherry Blossoms at Night, a plan of the Japanese Empire in 1945 to deploy thousands of plague-infected fleas on California via aircraft and long-range submarine, aiming to kickstart a major epidemic within the United States.","TIL at least one style of pizza crust, Neapolitan style, requires 3-5 days of advance preparation under a 'cold fermentation' process","TIL that when the Parker Pen company began marketing in Mexico, a mistranslation claimed that its pens \"won't leak in your pocket and impregnate you.\"","TIL About Leslie 'Bull' Alan who carried twelve men to safety from Mount Tambu described as 'a gigantic man striding up Mount Tambu like he was on a Sunday jaunt'","TIL that horses are measured using the measurement term HANDS!","TIL J.K Rowling was rejected by 12 publishers before Harry Potter and The Philosopher's Stone was accepted by Bloomsbury - and even then only at the insistence of the chairman's eight-year-old daughter.","TIL that Indonesia created manta ray sanctuaries upon realising each manta ray brings lifetime tourism income of $1 million.","TIL that Lindy Vopnfjörð, one of the members of Canadian indie band, Major Maker, released an unfinished track titled \"Talk To You\" nearly ten years after it was used as a jingle for a Canadian telecom company, Telus.","TIL of of Gottfried \"Götz\" von Berlichingen who is regarded as the inventor of the modern prosthetic. He created an iron hand replacement in 1504.","TIL The United States had a stockpile of weaponized anthrax up until 1972.","TIL in 2004, a woman was electrocuted while walking her dog after stepping on a metal manhole cover. Utility company had to pay a total of 7.2 million dollars.","TIL in 2016, \"a boy was killed and 20 others infected by anthrax released when retreating permafrost exposed the frozen carcass of a reindeer killed by the bacteria at least 75 years earlier; 2,000 present-day reindeer were infected, too, carrying and spreading the disease further.\"","TIL about the Colossal Squid, the largest invertebrate animal in the world. It can grow to nearly 45 feet (14m) and about 1,700 pounds (750kg).","TIL in the USA, there are two manufacturing sites for paper currency. The bills made in the Fort Worth location have a tiny FW in the top right corner.","TIL about FM-2030, an author, teacher and transhumanist philosopher. Born Fereidoun Esfandiary, he legally changed his name to FM-2030 to break free of the practice of naming conventions that he saw as rooted in a collectivist mentality and existing only as a relic of humankind's tribalistic past.","TIL Jay-Z released \"Glory\" on January 9, 2012, a song dedicated to his first child, Blue Ivy Carter. Because Blue's cries were included at the end of the song and she was officially credited on the song as \"B.I.C\", at two days old she became the youngest person ever to appear on a Billboard chart.","TIL that the twitter logo \"Larry the Bird\" is named after Celtics legend Larry Bird","TIL when an air conditioner thermostat says 'wait' it means there is around a 5 minute compressor delay to protect the compressor from short cycling and is a normal operation when settings are changed.","TIL that Joe Pesci recorded a rap album","TIL that Grace Slick of Jefferson Airplane was invited to the White House for a tea party in 1969 and planned to spike President Nixon's tea with 600 micrograms of LSD. The plan was thwarted by White House security.","TIL about worm grunting, a method of earthworm hunting.","TIL After closely investigating Michael Jackson for more than a decade, the FBI found nothing to suggest that Jackson was guilty of child abuse.","TIL Thursday is derived from \"Thor's Day\"","TIL that botanically, strawberries are not berries. Neither are raspberries or blackberries. But bananas, eggplants, and pumpkins are.","TIL that in the late 1920s the United States Army created several colour-coded war plans, including War Plan Red, in which the US Army estimated the requirements for a hypothetical war with the British Empire. Even planning a series of possible precautionary campaigns to invade Canada.","TIL Wall Street's Lehman Brothers Got Their Start in 2 Commodities: Cotton and Slaves.","TIL of Mao Sugiyama, a 22 year-old Japanese man who cooked his own genitals to serve to paying guests.","TIL by age 14, Aretha Franklin had two children. By 16, she was on tour with Martin Luther King, Jr.","TIL NFL player Tyrann Mathieu filmed a PSA on the dangers of leaving a dog in a hot car. It was 90 degrees outside and Tyrann gave up after 8 minutes when the inside temperature reached 120 degrees","TIL James Doohan’s last child was born when he was 80.","TIL of the biblical practice of shmita - every seven years, farmland would be left fallow. Any crops that grew were free for the taking by all, and all debts were negated.","TIL the creator of spongebob is dying of ALS","TIL we shouldn't feed ducks bread as its harmful to them","TIL that Bruce Springsteen's 1980 hit \"Hungry Heart\" was originally written for the Ramones. He had written it in five minutes after seeing one of their concerts, and only recorded it himself after the band turned it down","TIL the deadliest animal in Australia (from 2000-2010) was horses","TIL The contracts of the \"Baywatch\" cast members specified that they could not gain any weight while appearing on the show.","TIL Rupert Grint At the age of 16, he left school to focus on his acting career. \"I didn't really like school that much,\" he later commented","TIL That the olive trees, have an approximate lifespan of 500 years but some can live up to an incredible amount of 1500 years!","TIL that when the Beatles met Elvis, they were amazed by the device he had that could change channels on the TV from across the room","TIL Bambi is listed in the Top 25 Horror Movies of all Time by Time magazine. Bambi, Time states, \"has a primal shock that still haunts oldsters who saw it 40, 50, 65 years ago.”","TIL During WWI soldiers from opposing sides laid down their guns and celebrated Christmas together.","TIL: 27 US states are completely or partially north of the southernmost part of Canada (41° 41' N). That list includes (very northern) California!","TIL For centuries Romans preserved a primitive house from early Roman settlements that was the reputed house of Romulus, legendary founder and first King of Rome.","TIL that AMC's Mad Men character Don Draper (acted by Jon Hamm) was based on Rosser Reeves, an advertising executive who also wrote science fiction poetry.","TIL that only Japan (1951-1978) and China (1982-2014) has been crowned overall champion in the Asian Games since its inauguration","TIL that at Hunter S. Thompson's funeral, his ashes were blown into the sky from a 153 foot tower, accompanied by red, white, blue, and green fireworks. The 'celebration' was attended by Bill Murray and Johnny Depp, who funded most of the event.","TIL that in 2007 the Australian government ran an ad campaign aimed at reducing road deaths. Their slogan suggested that speeders have small penises: \"Speeding. No-one thinks big of you\"","TIL alchemists believed you could grow a Homunculus (a miniature, fully-formed human) by filled a gourd with semen, then planting it inside a horse's womb.","TIL while 95% of U.S. adults support organ donation, only 54% are actually signed up as donors.","TIL the opening scene of Raiders of the Lost Ark was inspired by a Disney Ducks comic book from 1959 where Donald Duck, his nephews, and Uncle Scrooge must evade a succession of booby traps - flying darts, a decapitating blade, a huge boulder, a tunnel flooded with a torrent of gushing water, etc.","TIL there was a compilation album released in 2011 after the Tōhoku earthquake and tsunami in Japan, consisting of 37 different artists and songs and 4 record labels. The album was called Songs for Japan.","TIL that, between 1907 and 1922, American-born women who married non-citizens automatically lost American citizenship. In 1917, hundreds of American women who had married German men were forced to register with the government as 'enemy aliens'.","TIL observatories shoot lasers into the high atmosphere to create an artificial guide star which is used to judge the distortion caused by the atmosphere. This information is then used to negate the atmospheric distortion and produce sharp images of celestial objects.","TIL Indian nationalists fought for the Nazis in WWII to kick out the British","TIL Frank Sinatra weighed 13.5 pounds at birth and had to be delivered with the aid of forceps, which caused severe scarring to his left cheek, neck, and ear, and perforated his eardrum, damage that remained for life.","TIL that other countries spell the word \"check\" as \"cheque\", but only in the banking sense.","TIL Roller Coaster tycoon was programmed by one guy. In Assembly!","TIL that Formula One driver Ayrton Senna greatly contributed to the popularity of the series in Japan, becoming the first non-japanese sportsman to achieve stardom there","TIL Sperm whales are so loud they could kill a human.","TIL that one of the mighty Soviet Kiev class aircraft carriers is a Chinese hotel now","TIL that the name \"Holland\" does not mean the nation of the Netherlands, but only 2 of 12 provinces.","TIL that 1/3 of cats have no reaction to catnip. Many cats that don't respond to catnip do respond to honeysuckle wood. Honeysuckle contains a chemical that is similar to the active ingredient in catnip. Most likely, it is this substance that puts cats into a delightful, temporarily altered state.","TIL The northern leopard frog swallows its prey using its eyes — it uses them to help push food down its throat by retracting them into its head.","TIL an photographer turned a shipwreck near Key West, Florida into an underwater art gallery. Located around 30 meters deep, the gallery is frequented by scuba divers. The ship - The USNS General Hoyt S.Vandenberg was intentionally sunk to become an artificial reef.","TIL that the hand gesture used in the \"Circle Game\" is also used as a gang sign.","TIL no one is sure what the original name of Los Angeles is- but the most accepted one is “El Pueblo de Nuestra Señora la Reina de los Ángeles del Río Porciúncula”. In English: “the town of the queen of angels on the river Porciúncula”","TIL that older Coca-Cola bottles were made to resemble coca (cocaine plant) seed pods and that the drink still uses post-extracted coca leaves for its flavoring.","TIL the boom box is the fastest adopted gadget of the last 50 years","TIL Some guy once tried to sue SpongeBob creators for $1.6 Billion for copyright infringement of a character from a 1991 comic strip Bob Spongee, the Unemployed Sponge","TIL that actress Lucy Liu has also led a successful career as a visual artist, having produced art through painting, photography, and mixed media. She's published this art under the pseudonym, Yu Ling (her Chinese name) since 1993.","TIL that in Australia, 5-50c coins are only legal tender for a sum up to $5","TIL: Blind people have lower cancer rates.","TIL The little bump on the back of your head is called the \"inion\"","TIL in order to perform the anti-gravity dance move from “Smooth Criminal” live, Michael Jackson and designers developed and patented a special shoe that locks the performer's feet to the stage, allowing them to lean forward at 45 degrees.","TIL the Svalbard Global Seed Vault is a secure facility built into the side of a mountain intended to safeguard the seeds of the world’s food plants in the event of a global crisis.","TIL English Foxhounds were bred as part of a 16th-century conservation effort during King Henry VIII's reign. Because deer populations were depleting, partially due to nobles hunting them for sport, the fox was chosen as a new prey. Foxhounds were a blend of Greyhound, Fox Terrier and Bulldog.","TIL Barry Manilow wrote the commercial jingles for State Farm, Band Aid, and McDonalds.","TIL of Daniel Lamb who at the time of his death in 1809 weighed 739 lb/335 kg and his coffin required 112 square feet (10.4 square metres) of wood","TIL there isn’t a single reported case of a person dying from a Tarantula bite.","TIL 1983 was the battle of the Bonds with both Sean Connery and Roger Moore releasing James Bond films to see which Bond was the most popular.","TIL that Don Gorske, who has eaten 30,000+ McDonalds Big Macs in his life, ate only one Burger King Whopper in 1984 on a bet with a friend, and proceeded to spend the money on Big Macs","TIL of Dylan McWilliams, who has survived a bear, rattlesnake, and shark attack, all within three years","TIL: Papua new guineans would breastfeed piglets back in the day","TIL, Indiana once tried to ban Robin Hood because it was communist","TIL The Great Pyramid of Giza, 146m tall, was completed in 2540 BC. It remained the world's tallest manmade stable structure for 3,871 years until the Lincoln Cathedral in England, 160m tall, was completed in 1311 AD.","TIL Cassandra Peterson, a.k.a. Elvira briefly dated Elvis Presley when she was a showgirl in Las Vegas.","TIL the Amish have such a high birth rate (average of 7 children per family) they are among the fastest-growing populations in the world.","TIL nitrates in their drinking water from the eff3cts of mining are causing renal damage in Australian Indigenous communities","TIL that in early 1900's, the Congo workers' hands were cut off by soldiers who were made to account for every shot.","TIL that the Lawson's convenience store chain from Cuyahoga Falls, Ohio, is not only thriving in Japan, but has extended to other countries","TIL Richard Nixon could have used his birthright as a Quaker to avoid the draft, but chose to enlist anyway.","TIL Muse's Matt Bellamy used his iPhone to record his unborn son's heartbeat, and later used that recording in the song Follow Me","TIL the median age of people who watch cable news is more than 60 years old.","TIL that Steve Guttenberg wanted to work with Ron Howard on Splash, but when he got turned down in favor of Tom Hanks, he quickly found his way into Police Academy. Ironically, the Police Academy producers had wanted Tom Hanks for the role that eventually went to Steve Guttenberg.","TIL The guy who started Atari sold the company and used the money to start Chuck E. Cheese","TIL Bajau people of South-East Asia have developed bigger spleens for diving","TIL about Earth's own earthbending badgermoles: South American giant sloths (of avocado-eating fame) apparently dug massive tunnels and burrows","TIL: That a former Soviet cruise ship full of cannibalistic rats it had accumulated while docked was lost at sea while being towed to the Dominican republic for scrap metal","TIL about the Hot Chocolate Effect, where the pitch heard from tapping a cup of hot liquid rises after the addition of a soluble powder or air bubbles.","TIL Zurich has modern drive-in \"garages\" for sex workers that have been successful for the last five years.","TIL Charles Osborne (1894-1991) of Anthon, Iowa holds the Guinness world record for longest continuous hiccups at 68 years..","TIL of the claque, a group comprised of claqueurs, an “organized body of professional clappers,” particularly in French venues. It was inspired in part by Emperor Nero of Rome, who arranged to have 5,000 of his soldiers give him praise for his acting.","TIL that Felix Salten, author of one of the most notorious and depraved works of erotic fiction in world literature (\"Josefine Mutzenbacher\") also wrote the book on which Disney's \"Bambi\" is based.","TIL Pancho Villa was once a movie star... sort of. He was funded by Hollywood, who in exchange filmed his battles to be made into a movie.","TIL that the term \"bottom line\" originated from corporate America in the 1960's referring to a company's Income Statement, because the bottom line of the document shows the company's profit or loss for that period.","TIL that pop song Could It Be Magic (with music by Barry Manilow), is based on a classical piece: Frédéric Chopin's Prelude in C Minor, Opus 28, Number 20","TIL that \"wifi\" was so named because it sounded similar to \"hifi\" (high fidelity)","TIL One of the methods used for identifying witches in the Salem Witch Trials, was to bake affected girls urine in a cake, feed it to a dog, and the controlling witch would then supposedly cry out in pain.","TIL that a Swedish transport company in 2017 named their latest express train \"Trainy McTrainface\" after asking for the suggestion of the public","TIL there is only one species of parasitic conifer in the world. It is threatened with extinction and no one really knows how it \"finds\" its \"victims.\"","TIL on 'Rain Man's' release many airlines showed an edited version on flights, cutting the scene in which Ray highlights crash records for specific airlines. Quantas was the only airline that showed the scene in full due to Ray stating they \"never crashed.\"","TIL after the abolition of slavery in 1833, the British introduced a scheme called the Indian Indenture System. The newly freed slaves were not willing to work for the low wages offered by the British, so Indians became a substitute in what became a second slave trade. It was banned in 1917.","TIL that in 1995 a man named Nicholas White was trapped for 40 hours on an elevator.","TIL that Gary Larson (The Far Side) hates having his comics posted online and actively pursues people who post his work online.","TIL that the decision to remove Alexander Hamilton from the ten-dollar bill was reversed due to the popularity of the musical, Hamilton.","TIL in 2007 a feral child who didn't know how to speak emerged from the Cambodian jungle.","TIL the coat of arms of Appenzell, Switzerland depicts a bear with brightly colored penis. When a printer from another canton forgot to print the penis in 1579, it nearly started a war.","TIL that the actor who played Blacula, William Marshall, also was the King of Cartoons on Pee-wee's Playhouse","TIL of The Battle of Los Angeles, in which several anti-aircraft operators fired artillery at what was thought to be a Japanese air raid. Thorough investigation eventually led the government to believe that the UFOs were actually weather balloons.","TIL that in the 1920s, during the prohibition, the Longhorn Caverns in Texas was used by Burnet County residents as a speakeasy. Musicians would entertain through the night. The popular spot was known as Sherrard's Cave before it was dedicated as Longhorn Cavern State Park in November 1933.","TIL that Alexis de Tocqueville, the author of the famous Democracy In America, actually came from France to the United States to study prisons.","TIL The reason male cats have barbs on their penis is to stop the female cat from getting away during the process.","TIL that prolific South Korean director Sang-ok Shin was kidnapped by North Korea in order to make a giant monster movie for Kim Jong-Il.","TIL that Bin Laden was once believed to be hiding in a series of enormous fortresses carved inside of mountains. Each was supposedly capable of holding up to 1,000 people, along with offices, supplies, tanks, trucks, and a hydroelectric generator.","TIlL The Japanese invaded most of Malaysia while riding their bicycles during WW2","TIL that there is a boiling river in Perú","TIL the captain of a submarine permitted a stripper on board said submarine as a reward for the good performance of the crew","TIL In 1964 Donald Currey discovered the oldest known living thing - by killing it. It was a Bristlecone Pine. He was trying to take a core of the tree to count rings, got the tool stuck, so he and a park ranger cut the tree down.","TIL Disney is so powerful that Disney World has its own government","TIL That between 1918 and 1929, Heinrich Himmler was a Fertiliser Company salesman and a unsuccesful chicken farmer","TIL Ernest Borgnine played a Guardian Angel sent from Heaven in an episode of Little House on the Prairie.","TIL Steve Aoki's dad founded Benihana","TIL in 2013 Michael Mancuso became boss of the Bonanno mob while being imprisoned, and has continously been in jail since then. He controls the family through Bronx associates and underboss Thomas DiFiore.","TIL that, since Battle Fever J was first aired, the Super Sentai and Kamen Rider franchises are considered part of the Marvel Multiverse, designated Earth-79203.","TIL The women of the Red Yao tribe in Guangxi, China, only cut their hair once in their lives, usually right before they get married.","TIL That the videogame company Valve was hacked in 2003 by someone who stole the notorious Half Life 2 game and got arrested for causing over 250million dollars of damage. (Article is from 2011 though)","TIL astronomers found a huge cloud of dust containing ethyl formate, the same chemical that gives raspberries their taste, in the middle of the Milky Way.","TIL Queen Elizabeth II and much of the Royal Family, past and present, are advocates of homeopathy. QE2 is the patron of the Royal London Homeopathic Hospital, which only stopped providing NHS-funded homeopathic remedies in April 2018.","TIL the Roman Empire had burgers and fast-food joints."]