["By popular demand, we now have a discord server. Join this","A vegan said to me, people who sell meat are disgusting","A company had a position open that required a great deal of sensitivity dealing with people...","\"What are the broken condoms doing on the couch?!\"","A man was looking for a place to sit in a crowded university library...","A single mother wakes up from a coma after giving birth to twins...","Doctor, I have a sexual problem.","How many dads does it take to change a lightbulb?","Why are gay men so well dressed?","The 6th grade science teacher...","Two scientists walk into a bar.","What’s the best thing about living in Switzerland?","My wife left me, so I posted all the nudes she ever sent me onto r/gonewild.","I went on ebay and searched for lighters","I’ve always wanted a swimmers body so I go to the swimming pool everyday...","There was a man in Bulgaria who drove a train for a living...","How do you discipline your pet rock?","After 23 school shootings in 2018","Wife: \"Honey, I think you're a little to harsh to one of our kids.\"","Up the mountain, a japanese asked the wise man: \"Master Akira, why every western man thinks that we, japanese, all look alike?\"","I dont get why people say cancer is hard to beat","No matter what sexual role play idea my wife decides on, I always have to play the same character.","How many Feminists does it take to screw in a lightbulb?","What do you get if you add up all the seconds of your life?","Breaking news just in. A cement mixer has collided with a prison van on the highway,","Whoever coined the phrase “dad bod” missed a golden opportunity...","A gay guy, a fat guy, and a gambler.","A blonde kidnapping","A man buys a motorcycle","While in China, an American man is sexually promiscuous and does not use a condom the entire time he is there.","I was hacked by Russia.","A man is having a walk in a park and sees a woman from behind.","My wife gets jealous when I go grocery shopping...","A little girl asks her grandpa, \"Would you make a frog noise for me, Grandpa?\"","If Jesus was killed in 1865,","Mahatma Ghandi walked thousands of miles with bare feet...","I named my horse Mayo","Leroy's Hearing","A Texan walks into an Irish pub...","Original joke that actually happened in real life. Slightly dirty.","An man was in the hospital for a series of tests...","In three seconds, anagram the word SNIGGER into a derogatory term for a group of people based on a distinct physical trait.","A man running from the police runs into the Catholic church and hides in confession box..","How many Microsoft engineers does it take to change a light bulb ?","What happens in the bomb shelter...","“I should be in charge”","One day, a Mother Superior was attending to some matters just outside the main doors of her convent. She noticed that the Seven Dwarves had huddled some distance from her...","1890s Kids will get this","A priest and a rabbi are walking through the park","Pope Trumps","Two guys meet at a bar.","Lets open a club for procrastinators","A constipated man goes to the doctor","An American tourist in Australia was in an accident.","I hated the girls at my school","How many hookers does it take to screw in a light bulb?","Wanna with saliva or not?","(Dad Joke) You know the best way to catch a polar bear, right?","Confession","English food and English women","Why does the Buddha float in water?","My wife likes it when I blow air on her when she's hot, but honestly","Yo mamma's so fat...","How do you determine who the best musician is?","A little girl asks how she got her name.","A sadist, a masochist, a murderer, a necrophile, a zoophile and a pyromaniac are all sitting on a bench in a mental institution.","what do you call a Norwegian call girl?","The set of natural numbers, the set of rational numbers, and the set of integers walk into a bar","Policeman: \"I'm very sorry, sir,...\"","School shooting rates in America have dropped by crazy amounts over the past 2 months","Why are verbs afraid of talking about people?","A man visits a chicken farm.","How do people in Wisconsin communicate with each other?","What did Yoda say when he watched Star Wars on Blu-Ray?","Shocking results came in after Keith Richards went to the hospital.","How does The Rock pee?","Stay humble my friend","I was feeling lonely, so I bought some shares.","How do you punish your coffee beans?","I went down to the patent office trying to register some of my inventions earlier today and walked up to the main desk to sign in when the lady pulled out a form to fill out. She asked for my personal info, wrote it down and then asked me what I had invented...","What's the glitchiest car in the world?","My wife left me because apparently I'm to paranoid","What does suspense mean?","What does a girl want more than anything in the world?","My ex-girlfriend just got fired for drinking on the job.","An illegal immigrant and sex offender get into a fight at a bar.","A man was walking in the street one day when he was brutally beaten and robbed","I don't often tell Dad jokes,","A guy goes to the doctor. After a while the doctor says the the man “Sir, you are going to have to stop masturbating” The man responds with “Why?!”","Before it starts...","If Steve Jobs is in hell..","A constipated man robs a toy store. He steals everything but one teddy bear","A Rabbi walks into a bar with a frog on his shoulder...","My girlfriend asked me to write down the name of every girl I've ever slept with.","What did they serve for lunch at McCain's funeral?","What is Trump’s favorite brand of cookie?","God decides to spread his word","So, two vampires walk into a bar...","Einstein famously said that insanity was doing the same thing over and over again but expecting a different result...","What did one butt cheek say to the other?","What did the whale say after eating the boat?","Did you hear about the archeologist who accidentally destroyed his dig site?","Clever joke","I’m working on a top secret project using honey to create alcohol","I gave my friend an elephant to put in his room.","Why is there no Walmart's in Afghanistan?","If reddit mods were anymore thin skinned....","If you came here for the the pee jokes...","What did the drummer call his two daughters?","People in glass houses shouldn't throw stones","“Those are some damn sexy legs” a cute customer said to me while we toured the showroom of the furniture store I work in. I was so flattered- obviously my workout routine was working!","What do you do when you want to find a mythical location on a map?","Sex is like eating BBQ","Did you hear about the guy on the news that's addicted to soap?","A lie detector robot that slaps you if you lie...","A lady sneezes on a plane","What’s got two legs and bleeds profusely?","What do you call a snake that is exactly 3.14 meters long?","\"Dad, your credit card has been stolen for 3 months and you haven't reported yet!","A guy picks up a hooker","What does the Flash says when...","A dog went on a backpacking trip to Africa and decided he'd spend a few days in the safari","Why did the guitarist get arrested?","What water does Alex Jones drink?","How do you drown a hipster?","What does a priest say when he gets excited?","I held the door open for an old Japanese man today","I named my penis \"Mom\"","A man with a really tiny penis seeks help","A kid was sent to a French summer camp program that lasted three weeks.","I Have Good News and Bad News...","What do you call a circuit board that identifies as a different electronic component?","I took a class on irony...","'Your boss wants you,' said my coworker.","A cabbie picks up a nun.","A short poem about schizophrenia.","How much does a hipster weigh?","Did you hear about the schizophrenic almond...","Why don’t they send cats into space?","Doctor: \"Looks like you're pregnant\"","Tom only chases the most suitable mouse.","A man dies and finds himself at the foot of a mountain.","A kiwi man was in Australia for the Bledisloe Cup when he began to experience testicular pain..","Why couldn't the toilet paper cross the road?","Sapnu puas","If money doesn't grow on trees...","\"Mind if i smoke?\"","Last weekend I childproofed my home,","What do you call a decorative wreath with a picture of a turtle on it?","An ant knocked on the door of a house.","What do you call a guy who wears a flannel shirt and likes to sleep?","A bear is walking through the woods","An engineer dies and goes to hell ...","What does a unicyclist and a model have in common?","What is Owen Wilson's fovorite video game?","Bad and good news","A cat dies and goes to heaven","Do you know why the Eiffel tower is so tall?","RIP boiled water","What goes \"Oooooooo!\"?","20 years together and my wife still gets upset when I use her toothbrush!","What did John do when the dog ate his crime novel?","How is it, that the capital city of USA is also the place of most successful laundry bussines?","Boris and Ivan are walking down the street in Leningrad","John McCain didn't need chemo in the first place","Say what you want about wasps.","What do you get when you cross a adult and a teen?","What happens to a frogs car when it breaks down?","Modern art is like money.","A British tourist visits a brothel in Germany","I was disgusted when my gf showed me her penis.","What do you do with a rubber trumpet?","There are 10 types of people in this world, those that know binary","Study on Prostitutes","With all the crossplay Sneaky does it’s safe to assume he is into BDSM (nsfw)","How do French people feel about the Honda Accord?","A math student runs up to her professor...","What’s invisible and smells like worms?","If a priest went swimming in the shallow end where all the kids are","Why did the assless man go to the chiropractor","3 guys were riding in a car; a hardware technician, a systems analyst and a programmer.","I like my women like I like my coffee...","Never trust a cosmetologist...","A man was taking out his trash when his wife angrily asked him to also take the recyclables...","I've never used condoms when screwing in the living room","Three old women sneak some Jack Daniels into a baseball game, taking shots after each half inning. What inning is it now?","What do you call a \"fixed regular payment earned for work or services, typically paid on a daily or weekly basis.\" in South Africa?","During my job interview I was asked: “After a long week how do you normally recharge your batteries”","A present for the girlfriend.","What does Verizon have in common with my teenage daughter?","What did the egg say to the boiling water?","What did the yoga instructor say to the landlord that tried to kick her out","Today my spice rack fell to the ground, making a big mess.","West London police wish to alert local residents about the activities of the infamous cross-eyed burglar.","What do you call a transgender vampire?","Roses are red, violets are blue...","Why are vampires so boring?","A cartoonist was found dead in his apartment","A blind man named Tyrone lost his dog, his remote, and his whole car, what did he lose first?","A man walks into a bookstore at 3.00 a.m. [Long]","How many Trump Supporters does it take to fix a lightbulb?","Ron has got the most number of votes in a presidential election.","What do you call a guy with a Summer hummer Cocktail?","Why did the weatherman sue the clouds?","What kind of Gator enjoys beer?","What happens to Russians when they break the law?","Licking a frog is good for depression","Wanna find original posts on r/Jokes?","My brother asked if i could help him come up with a way to advertise the new vacation resort he was opening up.","What's the difference between a hippo and a zippo?","After a series of crimes in the Glasgow area, Chief Inspector McTavish has announced that he’s looking for a man with one eye.","\"Forget everything you learned in college. You won't need it working here.\"","Liam's mom is trying to wake him up in the morning. As usual..","Just got arrested for masturbating with weed when I was on a plane.","Whats the difference between babies and onions?","I started my first rock garden last week","What day makes it easier to clean your shit?","Fastest way to be rich, 100% success rate!","A man walks into a brothel with a honeycomb and a jackass.","I'm always surprised to see Asians at the library","In 1969, the Beatles originally wrote one of their hit songs for a Broadway version of Peter Pan. Captain Hook’s right hand man wanted to Broker a truce that would give Hook the ability to fly and give Peter and the Lost Boys safety from pirates. It ended with a big event where Hook and Peter flew..","A priest is driving along a country road when he is pulled over by a copper..","What's the difference between a garbanzo and a chickpea?","AND GOD CREATED MAN","[politics] If Donald Trump was a spy, what would his code name be?","An Elephant has escaped from the Zoo...","What does an Italian say to you when they suddenly realize you smell bad?","I needed to have some white noise on in the background to help me fall asleep","An American asks an Australian;","When I pass gas and people look to me as if I was the culprit,","If gay men come out of the closet....","What’s your phones favorite game?","I found a new homophone today","I breathe heavy whenever I’m around woman’s underwear.","The pope was stopped by a woman yesterday.","What do you call when someone eats oriental food on the tennis court?","Remember that time when we were both diagnosed with Alzheimer’s?","I dodn't often tell dad jokes","What happens when you fuck shit up?","I'm opening a restaurant called \"whatever\"","To make life better, we have to put the \"try\" in \"country\"","A White horse walks into a bar.","Why do Catholic priests like golf?","Schwebels stocks are up","Why does Pennywise make such a horrible SQL database architect?","A police officer candidate goes in for an interview","Everyone at work got made at me","A married couple has two beautiful children.","Shouldn't have named my son \"Rated\"","My dad always said, \"Never give up on something you love.\"","What did one stoner noodle say to the other?","[NSFW] A nun was alone in the church rectory","A man was speaking with God and asked him, \"God, is it true that to you a thousand years is a minute?\"","Back in my hippie college days, a professor came up to me in the cafeteria and asked me, \"Ya dig?\"","My dick just died","What is an epileptics favorite food?","What’s the best nation for a homeless person","Why is the Catholic Church against circumcision?","I finally met someone online who shares my fetish for urinating on dried fruit.","What do a chicken and a Boston dog have in common?","Do you know what a reverse werewolf is?","An Irish father and son are drinking at their local pub","What do you call an acrobat in shark infested waters?","If Queen Elizabeth accidentally farts during dinner, the other guests are supposed to pretend like nothing happened.","The problem with political jokes ...","A programmer","What do you call a cushion with transcendentalist views?","I just got 3 hours or oral work done by 2 professionals. All I had to do was lie there","I don’t like frieza","The rotation of the Earth...","I was recently told I should date a gentle optometrist.","The pregnant lady and the serial killer.","It's weird that I have health class in third period","I now understand why the Brits have leftenants instead of lieutenants","This is my stepladder...","What’s a photoshop artist’s least favorite tool?","Where does the architecture school's principal send bad students?","I wish I had the chance to be poor for just one day just to see how it feels.","I tried submitting a colorized to r/OldSchoolCool","A Pirate's son to his dad \"what is it we say when we burn down an enemy ship?\"","My friend who works as a pizza chef apparently gets paid well","Why do spies care about the quality of their air and water?","Yo momma so fat","What do you call an orgy in kentucky?","There was a big controversy over my craft beer joke","Whoever coined the term \"wet nurse\" missed a golden opportunity...","Two hillbillies walk into a restaurant.","How many programmers does it take to change a light bulb?","A man who escapes from the USSR is being interviewed by an American journalist","How many magicians does it take to change a light bulb","[Long] How many steps does it take to put a giraffe into a refrigerator?","A man goes to the police to call his wife missing.","I‘ve decided to run a marathon for charity","A CEO has a business meeting in Japan","You have been listening to a presentation by me, Stephen Hawking","As a kid I was made to walk the plank","My dog Minton ate a shuttlecock, a net, and two rackets!","What's the difference between the Nazi Swastika and the Hindu Swastika?","My mom makes me feel homy.","A man confesses to his girlfriend that he like to have sex with vegetables.","4 engineers are on a road trip when their car breaks down.","I wanted to tell you a joke about illegal immigrants...","Im worth six figures","Why do SCUBA divers fall backwards off the boat into the water?","I called my wife to tell her to be careful because the news said some maniac was driving down the wrong side of the interstate.","What did Hitler say to his men before they got into their tanks?","I went for an early walk through the cemetery yesterday.","How is holy water made?","My grandma was wondering what the cloud is...","What do bats and Australians have in common?","An old man sits next to a young man at a bar...","A lady walks into a veterinarian with a parrot","Blonde squeals!","Favorite Pick Up Line","One place you HAVE TO visit before you die!","Unfair , girls get over 400 likes when they show a little nipple on facebook","Y´know I´ve always wanted to wade in the north atlantic","Imagine if there was a military alliance consisting of China, Japan, Mongolia, North Korea and South Korea.","The secret to a good clock joke is the","What's the difference between mad girlfriends and memes?","Doctor, on a scale of 1 to 10, how bad is this tumor?","A reporter was interviewing circus workers for a story he was writing.","What's Donald Trump's favourite baseball team?","How can you tell if a red neck is married?","What did the 0 say to the 8?","A boy comes home one day and sees a weird device next to his parents","Screaming ladies !","My grandfather has the heart of a lion!","What’s in common between a chair and a table?","Richard Nixon's favorite vegetable","Why did the 100m sprinter get a lead medal?","My brother proposed to his girlfriend while on holiday. I called to congratulate them...","What did the British Police man say when he found his wife bed with three men?","A woman gets on a bus with her baby","A guy and his friend are sitting on the couch while having a conversation.","What’s Clint Eastwood’s favourite line to use when hunting skunks?","I Germans and an Italian","\"I slept with a pair of 18 year old twins last night!\" - said a young man to his best mate. 'Wow, awesome!' replied his mate. \"How could you tell them apart?\". \"Easy, Janet paints her nails red...\"","\"Boxers or briefs\", she asked...","I was seeing this girl recently","A blonde was sick and tired of people making fun","I never knew my mechanic was a psychic","Being a midwife must be a tough job...","Doctor: I have some good news and some bad news.","A super-villain walks into a bar.","Boys go to Jupiter to get more stupider,","What did the Chinese mathematician name his boys?","A man survives Hiroshima and wakes up in the hospital","What happened when Uncle Abel passed away?","What do you call African spaghetti?","\"Mr. President, we have evidence that there is going to be an attack on the US...\"","If Korean pop is Kpop","After completing a celebrity pro-am golf tournament, Jackie Chan walks into the clubhouse bar...","I went to the doctors recently","What is the link between a bad computer and slow internet?","Isaac stood at the door of the synagogue, with an outstretched hand, asking:","My friend just got a dildo and a fleshlight in the mail...","Audiences used to love him,","What do you call a group of cool trees trying to get an education?","“Mom, am I real polar bear?”","I just got a job at a pharmacy. The pay isn't great...","A dyslexic plumber had a bad day.","I never realized British coins were so heavy","Little Jhonny used to ask a lot of questions","Whenever I think of the phrase \"high off their own supply","What did the green fart say to the red fart?","What do you call a one-humped camel that likes to say mean things behind people’s backs?","As a married man, the only time I get a piece of ass....","What do you call a party full of bbq utensils the day before a wedding?","This is old but I just heard it.... Where did Prince Charles go for his honeymoon?","How many Mexicans does it take to screw in a lightbulb?","Decided to rename my Bank app to Onion","You know what makes my day?","A boy calls 911","Broke","Two nuns walking down the road","A young, poor boy approaches a cheesemaker...","George Bush dies and goes to hell","My girlfriend and I usually joke about how competitive we are.","Porn scenario: An 18 year old in Spanish class shoots one at a \"teen\".","What do you call a dead fly?","How do they say \"Physicist\" in Alaska?","What do neckbeards call milfs?","Did you know that the toothbrush was invented in Arkansas?","Election day is 69 days away...","My dad is like the reposts on this sub.","If North Korea tries to pull anything, they say the international retaliation will turn it into free space for South Koreans to store their cars","My cats religion is a","Why Mexicans are freezing in the hot summer?","There were three POWs together in a British prison in the Second World War, a German, a Japanese, and an Italian.","You know those small sex-houses? The wooden ones, with a hole for your penis?","What happened to Dumbo over time?","A black man is lost in a desert","My boss went to a wedding. She said it was all very emotional.","This just in! The first cow was sent up into space...","Sam died...","You’ve never seen “The Princess Bride?”","Jokes about communism are only funny","What sound does a dead fly make when it sneezes?","(OC) I hope","A guy is off to America...","Pierre, a French fighter pilot, takes his girlfriend, Marie, out for a pleasant little picnic by the river Seine","Why do hypochondriacs make for good chemical catalysts?","My cat died crushed by a car.","Doctor: \"I'm just waiting for your X-Ray.\"","How do you know when you’ve heard a dad joke?","I've got really bad insomnia.","A man checks into a hotel on a business trip","What do you call a parade of rabbits marching backwards?","A guy walks into a bar...","Domino's pizza sent me a box with nothing but pizza toppings in it, so I called them to complain...","What's a musician's favorite weapon?","When I was a child, I remember lying in bed with my eyes closed and waiting for Santa to come...","I've just joined the Jehovah's Observers.","An old man asks his grandson \"What was that German who keeps hiding my stuff called?\"","A man is driving down the road when his car breaks down in front of a monastery...","In Soviet Russia a Man Goes to Buy a Car...","So my girlfriend and I were out to dinner...","[NSFW] My sister's finally out, so I snuck into her room, opened her drawers and took a giant sniff of her panties!","Rescuing villagers from the flood:","Two young engineers applied for a single position at a computer company.","A man goes into his doctor’s office and the doctor tells him he’s dying. The man yells “That’s ridiculous, I want a second opinion!”","The editor rejected my book, he said my metaphores are incomprehensible...","I want to make a Russian coffee table book based on sex positions using cross stitch images. I will call it...","A married Irishman went into the confessional and said to his priest","My life is like /r/jokes.","\"Look Elmo, we're the first people that this tribe has seen in years!\" Said Murray...","radical education reform coming up","A chicken walks into a library...","My wife told me I was one in a million","I almost made a new friend today,","An engineer, a physician and an economist are in the middle of the desert with only a tin can. [long]","Why don't arts students stare out the window in the morning?","What do you call a cardinal who does anything the Pope wants him to do?","My job circumcising elephants doesn’t pay much.","A man walks into a bar","How to transform a tin can into a glass container.","Nakamushi! Nakamushi!","Lizzy bird","what does it feel like to join a suicide bomb squad?","Why didn't anyone buy the Trump line of liquor?","Why can a 747 never crash?","My wife gave birth the other day.","What do the Titanic and Sixth Sense have in common","Mozart, Scarlatti and Jean-Baptiste Lully are performing at a bar.","Father buys a lie detector","What do you get when you cross an egg with a sperm?","A man is driving home with his wife and the dog.","I don’t mean to brag","My son steals our money","I'd say Hitler was too dramatic.","A man runs out of petrol","A penis says to his balls, “I’ll take you two to a party.” The balls replied, “you fuckin’ liar‽!! –","My newsfeed keeps showing me a video of a former US Vice President playing the drums...","Who is EA Games best friend?","What’s the difference between an old bus stop and a crab in a bikini?","A sloth got robbed","I was killed by a hashbrown","Do you know why when you see ducks fly over head in the v -pattern , one side is longer?","A very cold winter!","In Turkey, a prisoner goes to the prison library and asks for a book.","Pussy Green","Little Johnnys grandma comes to stay","Why does Queen Latifah hate dyslexics?","Why is Alzheimer's better than Parkinson's?","Why World War 3 will be the end","Waiter: Tea or coffee, gentlemen?","Do you know why Africa is never in the Olympics?","Did you hear about the cross fit guy doing keto?","Studies show that prostitutes have higher levels of oxytocin than the average person.","My approach to sex is a lot like the government's approach to Brexit","What do you call 3 idiots who form a band?","Whyd the international student get detained.","Three Russians are sitting together in the train that takes them to the Gulag.","\"How much do you weigh?\"","Lots of balls?","Sometimes when I think of romance novels","Let’s start a support group for procrastinators","Did you know your carkeys have travelled further than your car?","Grandmas...","I'm ready for a new sub...","Why didn't the orchestra worry about the thunderstorm?","What are the hispanic twins names?","Why did they stop the leper hockey game?","There's going to be a new TV show about menstruation research in the 1950s.","I ordered a Thesaurus from Amazon yesterday","Just saw a poster for a film. In big lettering it said: Don't Knock Twice.","My friend said his dog could retrieve a stick from 5 miles away.","I don’t know if you guys remember the coconut story","\"Wanna hear a knock knock joke?\"","When does a joke become r/dadjokes?","Did you see that movie about scatter graphs?","A Woman goes to buy a Parrot. The prices are $100, $200, and $15. She asks why the last one is so cheap?","I once had a dream I was swimming in an ocean full of orange soda...","The fact that the shampoo company, Head and Shoulders doesn't make a body wash","What is the formal name of the Bobby Pin?","Men will be men","A man went to the Police Station wishing to speak","\"Sir, we're mining too many useless mineral ores.\"","Teaching Maths in 1950s","What’s the difference between a grizzly bear and a police officer?","Instead of “pain in the ass,”","A farmer takes his donkey to a vet","Mr. Punn could not save them","A man suspects that his wife is cheating on him.","A speed boat sped by a couple standing on the docks","What do Kevin Spacey and a guitar player have in common?","I unexpectedly had a good time today.","Courtroom","Join the army.","Knock knock","A genie magically appered in front of me. He said he could grant me 3 wishes, except for the classic 'wishing for more wishes'","There’s a store near my house that sells nothing but basketballs and alcohol.","Three men are exploring a rain forest...","England doesn’t have a kidney bank...","What do the mafia and Pussy have in common?","A Swede and a Finn meet for a drink.","I've decided to start planning ahead","Why do dolphins always swim in salt water?","How is hummus like a golden shower?","I use to have a fear of hurdles","A Sheppard tried to take inventory","How many Republicans does it take to screw in a lightbulb?","Why did the KGB trainee fail?","What came first, the chicken or the egg?","A man's pet lizard has not been eating for days....","They should have called it Silence of the Lamps","What do you call a fake noodle","What do gay horses eat?","What did Hitler say to the driver when he got lost trying to invade France?","What is the actual highest city in the world?","I Hate Making Freudian Slips","What's the definition of a Professional Farmer?","A pessimist, an optimist and an engineer where discussing how full a glass is...","Doctor told His patient: I have bad news and good news","A man on a horse tries to cross a river.","I had to break up with my imaginary girlfriend.","An elderly man in Florida had owned a farm for many, many years","A religious person was excused from school on April 14.","I’m a tour guide at a museum, and when I told a group that the fossil they were looking at was 65 million years and 3 weeks old, they asked me where the 3 weeks came from.","How did Darth Vader know what Luke Skywalker got him for his birthday?","A girl in a restaurant asked me, \"are you single?\". I happily replied, \"yes\".","I'm not fat....","What's the difference between an Indian and an African elephant?","I just don't get it...","Why did Narcissus love going to the grocery store?","Depression...","Spinsters at a porn movie","My girlfriend broke up with me because of my obsession","The other day I found a spider in my shoes","A mugger held a couple.","My sign is Sagittarius","Two Ukrainian ladies, Mary and Martha are sitting in a small town cafe and sharing a plate of perogies...","Do not be racist!","Do you think back in the day people would write each other jokes by carrier pigeons?","What time do North Koreans eat lunch?","Dave: Excuse me, sir, is this carrot genetically modified?","A little boy was doing his math homework","I have a joke for you","An athiest , a cross fitter and a vegan wall into a bar .","Boobs are like Music Notes","My wife said she’d leave me if I didn’t stop making puns about Scandinavian locations.","The only store with classic rock singles near me just went out of business.","What do ants drink?","Why did Luke Skywalker never marry?","What did one tampon say to the other?","There's one thing I can say about playing with explosives.","Why was the man so sad after he knocked over his toothpaste?","There have been no major protests against former Park Geun-hye's imprisonment.","What's the most common type of owl in Great Britain?","One time I took a few hits of weed in public and freaked out. So I went into my car and tried to stay calm","Waitress, this coffee tastes like dirt!","Where's the best place to store your GMO produce?","What hit TV show do muslims love?","Mr. Price and his brother are still virgins after 30+ years.","With great power","At what point does a joke turn into a dad joke?","Why do you all call it “black coffee?”","A corny joke.","An Engineer, a Physicist and an A&amp;P Aircraft Mechanic","Why did sine get on top of cosine?","There's this snail","Trump, a charity worker, and a fire fighter are on a plane.","You know what the funniest thing about abortion jokes are?","Boy George would be a wonderful reddit user.","Toilet Paper and Spock","What's the difference between being hungry and horny?","What did the reddit poster say when he didn't get any gold for his post?","What do you call a European born in Mexico?","The head of KFC called the Pope","Once upon a time, there was a boxer who always wins every single match...","How do you get Youtube Red for free?","I tried to audition for the part of a tree in a school play...","Why did the SEMEN cross the road? Haha","Kenny the Rooster","My dog’s pace of wiggling his tail depends on how long I have been away. Longer I am away, faster he wiggles his tail.","Why did the breakfast sausage laugh?","I got kicked out of my gym in the middle of kickboxing class","Mother, you're so sweet yet salty at the same time","How do you get a thousand Pikachus on a bus?","Q: What's the difference between ignorance and apathy?","How do lesbians settle an argument?","A doctor overhears two 8 year olds on hospital beds next to each other","Belt jokes are neither the funniest nor unfunniest.","Mum: I have a friend who is flying in from Muscat","Reality","What’s 2000lbs of Chinese soup called?","A woman opens up a stand near the train station selling apples for 1$","Why did the blind man fall into the well?","Life was recently discovered on Mars.","A man went to a doctor and said “Doctor, I feel dizzy for half an hour when I wake up, and then I feel fine”","Man arrested for selling eternal youth pills.","When does a joke become a dad joke?","A local sofa shop owner crowdsourced his business name on social media to be more relevant with young people.","The waitress insisted that I tip her...","What math class do gender studies majors take?","If Alex Jones and Chris Brown were both on fire and you only had one fire extinguisher...","I guess that people that got whiplash...","I went to the zoo the other day,","A women in the alley tells the man passing for 1 dollar I'll give you the time of your life","My doctor has just diagnosed me as having low blood pressure.","What’s the difference between sex and premature ejaculation?","374 losers from 151 different countries came to the World Loser Gathering.","I heard Sodium Chloride was charged with a felony!","If pronouncing my b's as v's makes me sound Russian","Science joke","I just paid hundreds in vet bills for my cat.","My fart is able to store data...","Did you hear about the tennis players who didn’t score?","What do you call a 13 year old girl from Kentucky that can run faster than all 6 of her brothers?","Why did NASA bring Sprite to the party?","If Paul Chuckle died instead...","Quickly now! Time is of the essence!","What's a bear with no ears?","Want to hear a Swedish joke?","What kind of animal is also a Italian’s favorite song?","My wife left me for her lesbian lover","How does a girl get a mink?","Don’t be ashamed of who you are","Patient With a Small Penis","Jack, a renown atheist, dies...","What do you call a selfish sponge?","What is an American's favourite way to have sex?","When Donald Trump was visiting disney land, a man pulled out a gun.","How do you circumcise a hillbilly?","A chicken and an egg are in bed","Why Did Louis CK Perform at the Comedy Cellar?","Man calls up, \"Is this reception?\" but the line goes dead.","Why did Jared Fogel love Walmart?","Why are amputees the easiest to subdue?","What do you call something sad and small?","A cow stumbles into pot field,","When I was younger, I went to confession","Political joke competition in the USSR","A gang of midget burglars broke into a butchers but fled empty handed.","Why do French tanks have mirrors on them?","A Sardarji (someone who is a Sikh) goes to Hotel management school","I’ve been on a tequila diet...","My local beauty shop was broken into last night.","\"I hate being half motorcycle half bicycle\"","My track and field team complained that the hurdles were too short","How do you make 5 pounds of fat look great?","The hardest part about success","A man walks into a bar with two women yelling at him.","My buddy got stranded on a ring of coral in the ocean","My wife had very strong cravings throughout her pregnancy, right up until she was in labor on the way to the hospital","You guys know what Mario's favorite type of pants are?","Ok Google , tell me a joke","Dyslexic guy walk into a bra","Orion’s Belt is a big waste of space.","I told my wife so many cheesy jokes","I missed the toilet today.","What do you call a party with 100 midgets?","A woman's husband had been slipping in and out of a coma for several months, yet she stayed by his bedside every day.","If you get a virus from pornhub","If my last name was Case I think I would name my firstborn Justin","Why did the man at the recycling factory quit his job?","Engineering professor","What do you call a stoner who is also a nudist?","Funny that when a guy sleeps with tons of girls, he's a stud..","To celebrate the launch of the new website we are offering one lucky winner $50 in cash or a meal for 2 at an Elvis Presley tribute.","What's the Opposite of Christopher Reeves?","It’s a Mob boss’ 80th birthday","My friend asked me to get him a condom jar in the shape of a dog","Going around corners too fast...","I asked over 100 women which shampoo they are using.","Jesus is hanging on the cross...","What do you call a robber with good skin?","A woman gets married and has 10 kids.","You've heard of alphabet soup","68","A dad walks up to his son","What happens when Thanos watches The Addams Family?","Confucius Say","If a slender woman’s butt is described as a peach, what do you call a fat old woman’s butt?","It really annoys me when people say that Hitler did nothing wrong.","How do you kill the queen from inside a beehive or an ant colony?","I’m dating a drag queen and we keep breaking up and getting back together.","My dad is a pediatric chiropractor","How many Christians does it take to change a lightbulb?","Have you seen the movie “Constipated” yet?","Why are U2 fans happy to work for free?","How do you make a hormone?","Jackie Chan can break a brick while holding an egg in his hand.","A priest and a rabbi are friends . . .","What happens to Donald Trump when he takes Viagra?","How to registered sex offenders swim?","Two fishes are in a tank","What if Trump was a chef?","A college professor started to notice that one of his students, Dave, started gaining lots of female attention.","A philosopher, a mathematician, and a physicist were at starbucks.","I'm trying a different writing process in which I write out a bunch of ideas in small rough drafts, then I choose to work further on the one I think works best.","What killed Vincent van Gogh?","A man with terminal cancer robbed a bank and was sent to prison.","An old guy in his Volvo is driving home","I like my women like my Little Caesar’s pizza","Thank you, student loans, for helping me get through college","Blondes shouldn’t eat alphabet soup","What’s the hardest part about eating vegetables?","Sometimes I envy Julius Caesar...","Nitroglycerine.","Why is the Devil masculine?","\"I'm leaving you!...\"","My wife whispered in my ear today that...","Going to Vegas is a lot like dating a stripper","My vegetarian friend","Why are all jewish boys circumcised?","Two nuns are driving through Transylvania","Mad Mary","What did the Beaver say to the Platypus?","They told me to dress for the job that I want","Ever watched Italian Tom and Jerry? Speedy Gonzales sounded a bit funny....","We should stop...","What do you call it when Thomas the Tank Engine beats his wife?","Finding a corner in a sphere is futile.","Baking a Cake","Why was Walter able to commit so much crime for so long on Breaking Bad without getting caught?","Why did a slave go to college?","Everyone should become a chiropractor","What do you call an Indian music teacher?","What did he say to her during intercourse?","What do lawyers do with a injured leg","Dark Humor","What's furry and stops your mom from getting wet?","People need to stop joking about ligma, it’s a distasteful joke and it really makes me sad...","I could tell you a chemistry joke","Dads are like boomerangs.","A guy notices a crowd of women at the end of the bar","My boyfriend gets upset when I insult his hair.","A man goes into a doctor’s office feeling a little ill.","Why doesn’t Jesus eat M&amp;Ms ?","Hear about the tennis players that didn’t score?","Bill was a farmer...","An officer officer say to a man","If only all antivaxxers would step on a rusty nail.","If smells are nostalgic, does that mean they’re ...","Who's the most famous scottish rapper?","When my friend told me to stop acting like a flamingo ...","What's the difference between ignorance and apathy?","If a wedding goes off without a hitch","Why does the dyslexic guy have to work every Christmas?","Remembered some Russian Reversal jokes recently","What’s the greatest fandom of all time?","Two Jewish kids are playing in the Ghetto","How much does a Rhino weight?","A teacher calls her first grade class","Someone on here just offered to comb my hair","I failed my Spanish exam today.","Man walks into a pet shop and sees a parrot for only $50.","What do you call two pigs having sex?","One day I'll create a cure for blindness","Gagarin, Khrushchev, and the Pope","My buddy _______ and I were riding horses one day","Holding Chopsticks","A man was crossing the countryside in his car.","3 dogs met at the park","Do you know that look women give you, when they want sex?","I slept with a blind girl last night - she told me I have the biggest dick she has ever touched...","Two guys from Michigan die and wake up in hell.","My hipster server didn't bother telling me the specials.","My friend keeps saying \"cheer up man it could be worse, you could be stuck underground in a hole full of water\"","When I got my Mac Pro","My friend lost a testicle when he was younger and ever since has had hang-up about sex.","How do you think the unthinkable?","If I had the power of invisibility,","John dies and passes on to the afterlife...","Three Guys Walk Into a Restaruant","Do you remember that group of whales that had a distinct higher pitch to their songs?","A man goes to see the doctor and tells the doc that his penis has turned orange.","To the guy who stole my antidepressants","In the 1930s, a Ukrainian farmer was asked \"What will the future of this new communist society look like?\"","How is God just like a regular man?","A woman was accused of snorting a family members ashes.","Tom Clancy and Tom Cruise got in a fight.","Bush or Bin Laden, who would win in a game of chess?","Soup","Archbishop accused of impregnating a nun is summoned by the Vatican to explain.","A pun, a play on words, and a limerick walk into a bar. No joke.","Four kids were being tried in court after some foul behavior at the zoo.","A father is waiting for his newborn child outside a hospital","What did the child say after World War II ended?","What happens when you're not ready for a corny pick-up line?","Wow are you a sponge?","The difference between a hoarder and a collector...","An invisible man goes to the doctor","So you're telling me you don't like foreplay...","A truck driver was heading down the highway when he saw a priest at the side of the road. Feeling it was his duty, he stopped to give the priest a ride.","Did you hear about the two lesbians who built a house?","An ex-businessman, now bankrupt, is preparing to jump off a bridge...","A university student wanted to sit next to one of his teachers at lunch","What did Bruce Wayne say when Wayne enterprises was dying?","So my cousin reminded me of the \"saying\" girls go to Jupiter to get more stupider and so on.","A stop sign in the country","My friend,who is a little person,got pickpocketed on his way home from work...","Flies in vine glasses","I don't always tell dad jokes","A girl asks her dad for the car","Cigarette Butts—Not Plastic Straws—Are The Worst Contaminant of Oceans, According to New Study","I thought my doctor was helping me with these lumbar injections...","My girlfriend broke up with me because i stole her wheelchair.","[Game of Thrones S7 Spoiler] What do Dragons call Jon Snow?","What do you call two Mexicans in a T-bird?","Mildly racist joke?","I asked a millennial hipster yoga teacher to leave the room...","I saw my neighbour hitting his plants with a long stick. I asked him why he was doing it but he wouldnt give me a straight answer,","A woman and her lover were in bed, when the woman heard her husband getting back.","Why can't sous chefs get girls?","Reminded of a variation of the Bee Pee joke","Why are drug addicts usually good detectives?","What is a crack heads favorite song?","What would you call a movie made entirely of r/Jokes?","A man is lying on a nudist beach wearing only a hat covering his crotch","My favorite sexual position is 169","Did you hear about the two antennas who got married?","I remember the last thing my grandfather said to me:","What do a female musician and an elected head of the county police have in common?","A Father meets his old friend, the Major after many years.","A Man Dies and Goes to Hell","What do you call a Judaic dojo that is into black magic?","How did the electron got its name?","Steve Rogers gets into Santa Claus's automobile...","What do you call a guy with no arms and no legs water-skiing?","I hope that when I die it’s during sex","It was so cold on the weekend,","The doctor starts to explain it to the two ladies","Stranded on an island with a gay and horny native tribe","I am so frustrated about banks telling me to use their financial software","We finally get a robot onto an alien planet and the first thing we do is roll over an adorable little fuzzball. Its true.","Infinity War Spoilers","A woman goes to the doctor","Alaska doesn't exist","Santa Claus, the Tooth Fairy, a loyal Canadian ally, and an old bum walk into a bar. Who is served first?","Just been banned from a Christian dating website.","I was voted “Least likely to Suceed” by my high school class.","You should never...","How do you react when an anti vaxxer wants to speak to you?","What do you call an attorney with an IQ of 50?","Morgue employee cremated while taking a nap....","What is 50 feet long and has 7 teeth?","If the Swiss flag is a big plus...","An Irishman and an African American woman had a child who turned out to be a vegetable","What does a midget with several natural skills have?","Whats the opposite of a vampire?","My friend kept on trying to tell jokes with famous people's names in them, but he always mispronounced them.","I used to go to the furniture store a lot more when I was younger","What's the difference between an insurance agent and a shark?","The magic hat","The wife just told me, \"I think you've had an affair with that Welsh tart, from Llanfairpwllgwyngyllgogerychwyrndrobwllllantysiliogogogoch.\"","What did the hand dryer say to the beautiful paper towels?","If you ever see an baby owl in a toilet don't flush...","What do you call an elderly woman who stars in films?","What is the most violent part of a loaf of bread?","What did the Cat 5 hurricane say to the coconut tree?","What do you call a digital cow?","Almost got FIRED","How do we know God is a man?","Feminism: Strong, smart, and independent...","The Pope goes to Washington DC.","\"I'd like this book on revenge please\"","Whats worse than 10,000 conspiracy theorists?","200Years in the future.","A bartender seriously declared that, if he met someone with five heads, they would get every drink or snack for free.","What size envelope do you need to send a letter bomb?"]