["You fool never mess with .","Didn’t think that was going anywhere until it went all the way","An abomination","Man verbally abuses, abandons wife and children on side of the highway. Sentence: Murder by Words.","Don’t you dare mess with the National Spelling Bee","This entire interview","[edited]. What would a gay plantation look like?","Amazon user dismantles an \"EMF Neutralizer\"","Booze + guns = murder","Liberals AIN'T Texans","Girl posts the same comment 3 or 4 seperate times in the same thread, gets murdered","Guy destroys girl","Journalist attempts damage control after falsely identifying the Jacksonville shooter; gets murdered","To spot a Scotsman...","Vaccinations are definitely dangerous","No one is really old...","Scientologist Admits They Are Paid To Create Fake Reviews Of Narconon Fresh Start (Scientology)","Local parent puts embroiled Buford City Schools BoE on BLAST","OP thinks a game feature would be ridiculously easy to implement. Developer finds OP ridiculously easy to murder.","Bill O'Reilly corpse is still smoldering","\"Journalist\" gets rejected","Thin Privilege isn't Real","The Abrahamic religions aren't a thing I guess...","Best review of Big Bang theory.","Person tries to lowball pawnshop owner","Not cooking frozen nuggets does not save a chicken. (Fixed my earlier submission)","Don't add your boss on Facebook","I Do Not Choose to be a Common Man (complete &amp; reformatted)","Zach LaVine get's murdered by a seafood restaurant","An interesting take on boom-boom music","Attempt to call someone out backfired","Jimmy's Seafood taunts PETA with a plate of crabs and then proceeds to point out their hypocrisy","The Independent Press Standards Organisation complains in style","Native American man shuts up Anti-immigrant protesters in Arizona","Teacher knows better than the FBI because of her training","Apparently my potential college has an attack force based on this site—an utterly vicious attack force in the greatest way possible","\"I apologize?\"","Philly D taking shots at Mike Martin (Daddy of 5) yet again","Sir David Attenborough argues the existence of evolution with Professor Carey","Ryan has no chill (murder at 4:57)","On r/MarvelStudios, someone is schooled on filler words in writing","Ex-gf burn, take 3","Count the Burgers","When John McCain was first running for Congress in Arizona, his opponents liked to label him a carpetbagger since he was not from the state originally.","\"Canada has a problem\" (scroll down)","An Irish man, abused by members of a religious order, responds to a government minister on live television","Roastmycar sometimes spews out gems like this one","Yet another reason to dislike Taylor Swift - Her fans. 🤦🏻‍♂️","META: I propose this as a logo for this lovely subreddit","Because it’s totally possible you took a naps as a child in a car in 45C heat.","I know you said no politics but...","Homicide in the Amazon Reviews Section","Definitely not a celebrity","BMW throwing some shade at Audi","[AskOuija] Without the USA the world would be &lt;BETTER&gt;","My buddy builds rockets and sends them 150,000'+ into space. A flat-Earther had something to say.","\"This has to be the dumbest thing I have ever heard.\"","The ol' \"Technology is the Devil\"","Why won't you stick to sports? Reeeeeee","You're confusing two modalities (umm, yeah)","Anthony Burgess, author of A Clockwork Orange, asks his editor (Hunter S. Thompson) if he could submit a novella instead of a \"thinkpiece\" to Rolling Stone, this is HST's response.","Hyprocritical Hateful Christian","Azealia Banks on Nicki Minaj’s twitter meltdown","Thanks for the offer, LinkedIn is for real jobs!","Twitter history is a bitch","BUMPING bass hard.","“Put up or shut up”","User explains why it's shitty to attack a veteran in a wheelchair","Guy has had enough of people arguing over things when they haven't read the article","On a post about why someone didn't think a joke about addiction was funny","My frazzled friend to her houseful of teenage boys.","What have you done to help the people of Flint?","Anti-vaxxers on hepatitis get me destroyed by facts (x-post r/vaxxhappened)","A moment of silence for the state senator from Mississippi","The brutal truth","Catholic League gets taken to the mat","Friend had enough of her inconsiderate roommate","My favorite murder of all time. From the show \"Tough Crowd\"","Fox News went after socialism in Denmark, big mistake, yuuge!","We all know we’ve wanted to say something like this","Career ending MBW","Didn’t see that coming.","truth hurts","\"Eating things that don't feel pain is cruel!\"","Heckin' Big Doggos","In 1993 NY Post columnist Liz Smith wrote: \"[Aretha Franklin] must know she’s too bosomy to wear such clothing, but she just doesn't care what we think, and that attitude is what separates mere stars from true divas.” Aretha wrote to her...","In response to the whole James Gunn hysteria","Guy attacks motivational post and gets shut down","A wholesome murder","Jerry Seinfeld on why Roseanne Barr shouldn't have been fired","As a NY Giants fan, I enjoyed this...","Guy tries to bring down former quarterback Ryan Leaf. Whose out trying to teach young athletes not to follow his footsteps and better their lives.","Naruto Fan Retaliates","Murdered on, \"No Problem/You're Welcome\"","Burnt huckleberry pie","Murdured with the truth","Australian MP murders racist Senator and his apologists, who called for a 'final solution to the immigration problem'","Blizzard Speaks About Fixing Issues","You go, Glen Coco, you go.","On the discussion of The Silence of the Lamb's portrayal of the trans community","In response to Fox's dystopian description of Denmark","Some guy took offense to MLB’s Facebook page being impressed by a player","Murdered by the Drive-In","Guy on r/facepalm is brutally murdered","An elemental reaction (x-post r/teenagers)","Minor UK celebrity upset about a black actor playing James Bond murdered in cold blood","Anti Vaxxer destroyed with her own logic.","Ignorant republican doesn't know the history of his party","College student gets destroyed by professor.","Air Force Recruiting FB page murders a heckler","Unamused Dane meticulously murders Fox journalist who tried to use Denmark as an example of the failure of socialism","Stephen Miller Is an Immigration Hypocrite. I Know Because I’m His Uncle.","That sure is an extense assortment of insults","Nice Guy Learns a Valuable Lesson About the Word “NO”","r/iamverysmarts vs what they could ever hope to be","Sometimes not many words are needed to shatter someones dream","Homeopathy cures glaucoma","Man who never attended college thinks all professors teach \"liberal views\" - Person with Master's responds.","On a post pointing out racism towards a teenage Arab girl","Ouch! Murdered After Picking on Kid's Cooking Video","General Lee, defeated at Appomattox and surrounded by Union forces, addresses General Alexander who suggests resorting to guerilla warfare","You tell ‘em","\"I told my boss to fuck off and walked out\" Yeah, right... Co-worker tells the real story.","Fucking ouch","This woman is in her late 60's to early 70's and is known to the 2nd commenter through their DAV chapter.","\"Yes, but Monsanto actually does good things for society ...\"","Someone gets murdered over virtual surround sound","Twitter user absolutely slaughters Alex Jones","Mom destroys son","Kat Von D gets schooled on not vaccinating her unborn son (and yeah, I censored her name out even though I didn't need to)","Someone got slaughtered in my defence (i’m the first comment)","I agree, \"This is so very true.\"","Ocasio-Cortez MASSACRES conservatives with logic and reason.","Soldier tears apart argument that you should join the military if you want free collage","Murdered by Meredith","Atlanta Braves broadcaster implies Dominican 19 y/o superstar is cheating...Dominican Prospect League murders broadcaster with a pen.","Completely destroyed by words","So racist he’s delusional about the history of Canada.","Student in my online accounting class calls out our negligent professor for occupational fraud after weeks of little to no communication","Sydney Morning Herald's Ben Pobjie writes a sarcastic take down of Rich Cohen's patronizing profile of Margot Robbie.","Commenter on r/Art gets schooled on the topic of photorealistic painting.","Jeff Ross never fails to deliver!","You are a depreciation asset","Attention-seeking foolishness","Cleveland Stadium Slaughters Fan","A little murder from The Worst Things For Sale","This murder on a thread about a kid who beat cancer scoring a TD in a Jets practice is still less painful to Jets’ fans than the “Butt Fumble”","A Pox on you.","Context: Walmart lady paints the nails of someone who is wheelchair bound after being refused by salon for being too shaky, this person is a twat in the comments and gets what is coming to them","The definition of public ownership","Student in my class sends mass email asking for answers; Professor responds.","Burned like California","Mia Khalifa murders sports writer","No Interest","This POS trying to illegally buy food stamps","Angry man defending nazis says he isn't one, redditor lists the top five nazi ideologies he follows based on his comment history.","Guy tries getting sleazy in youtube comments, gets SLAUGHTERED.","When Lysias the druggist asked him(Diogenes) if he believed in the gods, \"How can I help believing in them,\" said he(Diogenes), \"when I see a god‑forsaken wretch like you?\"","Indian Mom brutally murders her son","Comic sans ≠ fact","Anthropologist shuts down vegan who tries to invalidate her experience by destroying their pseudoscience claims.","Homophobic parent has deposit donated to Stonewall in their honour.","Melee is old and boring, get over it.","Pro tip: read your own sources","A Three-Pronged Takedown","Steve Kerr 2020","Armchair critics nowadays...","Chris Brown murdered by words (old)","Coming Out of the Closet as an Asshole","Go and read some history..","Man sends unsolicited dick pic, gets accused of sending child porn.","Someone claims addiction isnt a disease and got shut down","Missiles flying over a football match","Addiction is a Disease","Woman calls out woman who was complaining about no good happening","Gold bar in a trash bag","Philosopher Bertrand Russell's letter declining an invitation from British fascist leader Oswald Mosley to debate. Credit to /u/inawordno","Murder Nextdoor","Racist guy gets shut down","PUBG Mobile Gamer and vaper gets roasted for calling a certain subreddit cringy 40-year old weebs who jerk off to their hentai body pillows","J.K. Rowling knows how to throw a punch","Rick Riordan fucking snaps","It’s not brain surgery.","Dictionary.com throwing shade","Attempted racism failed","Good Germans obey Godwin's Law","In Putin's Russia, Journalist Murders Government","Prince Charming, Murdered By Words","Guy thinks he knows geography","Incel pretends it's not his personality","WW2 Vet responds to a comment he had no clue about WW2 (context in comments)","Kiss of death","Bring back Prohibition!","Assimilating in Australia is easy!! (OC)","When a make believe lawyer meets an actual law professor.","Tinder is hard","Australian Health Department slays anti-vaccine \"documentary\"","A little perspective for a vegan.","Tim Curry responding to someone on Twitter re: his stroke","UFC ref Responds To Fighter's criticism","A little bit of youtube comments can go a long way","Or maybe it has nothing to do with what you think and has a reason..","My dear that’s a short term solution to a long term problem.","Heated debate","Jason Kander is a word serial killer","After a 16 inning game, some opposing fans get salty.","Pissed off Father calls out the corrupt Judicial Council of California to their face.","Well, you're stupid too.","Warped Tour going out with a bang!","My friends mom coming in HOT","LAist writer murdering a NYT writer who wrote yet another moronoic piece about LA","When bobcats move to defend their young.","Floyd Mayweather punches back at 50 Cent, who called him out for buying an $18M watch","Immigrants, you say ?","Murdered by none other than J.K. Rowling.","An excerpt from Mesut Ozil's agent, Dr. Erkut Sogut's response to Bayern Munich's president, Uli Hoeness' delight at Ozil retiring from international football...","FB Friend Laid Into Person Hocking Their Craptastic MLM Products on FB.","When the murder victim says thank you","I love it when this happens","Rekt by Google ads","A Murder By Words About Words 2: Stop! He's Already Dead!","My friend's dating app-match has been burned before. Gets burned again.","Hunter S Thompson's obituary for Richard Nixon","I'm a short dude, so I usually ride a pony...","A murder by words about words","NYT columnist murders VICE CEO...","Communism is good?","Company offers partial compensation to revise poor eBay review on a set of shoddy rainguards, then changes their tune to a full refund and sincere apology after this thrashing","Facts vs. Opinions","Quora Murder (X-post /r/insanepeoplefacebook)","Sexism results in murder.","Businesses are the worst!","What's your expertise?","Destroyed.","To be fair, the illustrations helped.","Ooph, this one must have hurt","Dennis Miller RIP","It's Called a Fundraiser...","Bears on Welfare","Trevor Noah taken down with tact by French ambassador","Absolutely murdered by my own father","I didn't take it as a compliment.","One word historical burn.","Woman just wants to find things to complain about. Today’s target? Service animals.","Police make video giving out ice cream instead of tickets in act of goodwill, pisses off random guy - Police Chief responds with murder.","OP gets destroyed by his post history","YouTube tried","The Rock strikes back","Salty rejected corporate partner gets murdered","US hasn’t done any of these horrors since the 1800’s... apart from all that of course.","Red guy replied to a downvoted comment that was shitting on Infinity War","I wanna start a gofundme for this Trump supporter's hospital bill","Murdered by Beards","From the comments section on an opinion piece: OP had me at “you angry, bigoted knuckle-dragging, mouth-breathing walking cerebral cortices”","A email from the Editor in Chief at Buzzfeed to one of the founders of the Daily Caller, explaining why he does not consider the Daily Caller to be a good journalistic outlet","Three personal trainers typed dozens of judgmental shitty comments to put down and make fun of over weight people","OP lies about \"finding\" a \"dead bird\" that is actually an art piece","Kumail murders Elon","Patriotic, but bigoted homophobe called out","Bilingual murder in Canada 🇨🇦","I felt that one from here","IKEA kills ignorant American with American law","This is really what it means to be self made","Old people commenting on a video of \"high class\" people guessing the meanings of slang terms seem to hate the advancement of language","When Americans know nothing about football...","Genocide by words","Elon Musk calls British rescue diver \"pedo guy\" after the diver criticizes him. Musk is then politely murdered by a lesson in why rescue workers deserve respect.","Trumpist get's countered hard.","Damn, Ancient Greece was savage","What’s your degree?","*smashes wheelchair on his face*","He just got murdered by an account with a default profile picture, that's gotta hurt","Army veteran rejects excuse from \"soldier\" dismissing his toxic chat logs on admin app for gaming community","Scottish national newspaper, The Scotsman. Unprecedented in 193 years of daily publishing.","Work intelligently","Posts about leaving reddit for a week because of toxicity. Redditor proves that op is the toxicity","Language is just a tool","In 1996, Billie Joe Armstrong of Green Day received the letter on the left from an angry mother, who’s son received a copy of Insomniac for his birthday. Billie responded with the letter on the right.","Public execution","Democratic Rep. Jamie Raskin uses actual quotes from Republicans about Trump to debunk \"deep state\" conspiracy against Peter Strzok","Chloe Bennet destroying villains in shows and irl.","Notes from the cancelled 2017Wipe","No Country For Old Men","Australian Police' official twitter account following England's World Cup exit","That \"charity for the poor\" line though","A programmer burn","On the subject of \"fight or flight\"","Dictionary.com back at it again","Oh so, women can't code?","User gets taught economics","FBI Agent Strzok responds to accusations made by Trey Gowdy","Wife murders husband on twitter","Okay, so I lied.","She was being all cunty and then posted a picture of herself to r/RoastMe to prove that nobody could touch her","She posted about how healthy her unvaccinated children are on a post inquiring whether Canada should penalize parents who choose not to vaccinate their kids, so we can try to protect the young, old, and sick people who can’t get vaccines from being killed by preventable diseases.","He believed that Jesus is a fictional character made up by the gospel writers hundreds of years after his death","In response to someone saving tonnes of birds after a demolition.","Happy wife happy life","10 seconds, go.","Murdered on a genetic level","Quick maths","Throwback to when the singer of Fall Out Boy eloquently lost it (context in comments).","Parent serves justice to their spoiled brat of a kid","Killed with kindness","'Hate group' claim thoroughly dismembered","Comment and reply from a video of a policeman illegally searching vehicle at a DUI checkpoint","Vegetarians are natural!","Cultural appropriation","Journalist leaves goal wide open","Don’t argue with someone when you know nothing about the topic","Virtue signaller faces reality check","Poor attempt at a burn ends with a murder","At least New York has better pizzas!","Irish pagan socity is out for blood","Happy Mother’s Day"]