["Looking to group up and climb the ranks before the season ends, a place to discuss all things Siege, or maybe just a place to keep up with game news? Come join the Rainbow Six: Siege Discord Server!","More changes coming to Grim Sky","A fucking bot hit me with the ultimate disrespect","Today marks the 1 year anniversary when Ubi took away Jager and Bandit's ACOG.","Was the free weekend extended?","Pixelated Rainbow Team - GSUTR (Maverick &amp; Clash fan art)","Rook Elite. Old vs New, I prefer the old one.","The best Lord cosplay.","Draw! Draw..","Guess I’m a Tachanka main now.","It's Lion's birthday !","Would anyone else enjoy a reward system for levelling up because there is literally no point of levelling up past lvl 20..","Your Smonk outfit is cool but I raise The Dark lord","Ying...put your shades on","Professor isnt here yet","If one Face needs changing, it's Ash's","The hardest clutch...but what can I say?","That moment when you want to boost your FPS but it goes to another level...","Bullet Magnet Buck","Daft Punk x Vigil","Everyone makes mistakes... except the lord.","When your girlfriend tries to make your room looks nice, the Lord takes centre stage.","New Op idea: Quake","Intense 1v1 with Blitz","Can’t have your cake and eat it too","IQ should have smokes and Fuze should have a claymore","Coming Soon: Operation Silent Night, A Fanmade Project.","Changing recruit options is now incredibly difficult on Xbox One.","Mute should have cleaned his mask","nani?!","I can't be the only one, can I?","I see your Dark Lord, he would be nothing without his troops","Brand Director Alexandre Remy says they will never make a solo campaign or another solo event like Outbreak","Disco Six Siege [Baby I'm Yours R6S Edition]","Cool r6 keychain that my brother 3D printed for my birthday","Disrespecting a blitz","Drone should have tiny white flags so I can beg the defenders not to shoot me.","Rap God Finka","My collection. :)))","Ingame report system through chat?","I sat in spaghetti for 2 minutes to achieve the unachievable","Matchmaking system working as intended I suppose...","It's my birthday and my renown is the year I was born","Gamescom 2018 Cosplayers!","[Fan Made] Tachanka Rework Idea.","Pre-round Reinforcement Gift","ubipls.jpeg","The whole sever just got kicked and they slapped us with a ban","I,too,have become a Master Assassin.","UBI what actions are you taking against these \"scenarios\"?","My most brain dead ace","Meelee hitreg still poo poo","Who Would Win: Four Shields VS One Sneaky Boi","This drone trapped inside the mira window.","Should we tell him?","This Is Casual","Ladies and Gentlemen, we got him. I found Myth in Favela","Super buff Ela","I See Your Dark Lord, But How Would He Fair Against The Pride Of Russia?","SnooChanka (feel free to use it ;))","Clash Art","All that renown was worth it","hotbreaching....\"working as intended\"","Cool iPhone screen saver (not mine)","When the Attacking team has Thermite, Hibana, Maverick AND Thatcher.","A Simple Vigil Wallpaper/Profile Pic as Requested (1920x1080p)","Is this still the misalignment thing ? (Mainbuild)","enemy team left until it was 1v5, so we decided to take a picture :)","I see your Chimera Chanka. Now bow down to the Blood God.","Don't watch your yokai when the game ends...","You should be able to sell cosmetics from alpha packs and in return get renown","Can we please get this skin Ubi?","Died as I threw a cam and found this...","Animated Rook Badge!","When you get pulse with his own trick","What’s wrong with those prices?!","So close to the Monty ace :’(","Clash | Obey Poster","Which one of you is this? (cropped)","Had the most equally balanced match today in terms of skill. Come to find out at the end we were fighting and beat a diamond","What is this mean？Easter egg？","The people who meme Jager's acog or Ash's headshot hitbox forget one very important thing,","Just a little edit to the IQ's Mica Standard set to make match headgear and uniform better","Zardonic mask for Vigil? :D","1v5 clutch for the boys","Some IQ art I've been putting off doing","Uhhmm what?","I see yourloadouts and raise my tactical IQ one","Got my first ranked ace yesterday in O.T match point. Not the most impressive but I'm proud","Playing Casual With A Baked Random","Since my last clip I have improved my sensitivity by 0.05, can you tell the difference?","We all living in 2018, while this guy is in 2028","Buff Blitz Shield or Nerf Smoke Pistol?","Recruits","I see your Darth Chanka, and summon thee sexiest outbreak/taiga combo.","Clash has the best voicelines","Can we all take a second to appreciate how fucking cool Chimera was","Some users asked me about this, so i decided to share it here. Try to record the screen for few seconds, edit the video, download video live wallpaper app from play store, and use it as a wallpaper. Enjoy.","Scumbag Hacker gets Teamkilled (What Everyone Should do When a Hacker is on Their Team)","I know it's just Casual. But it still felt good. 1v5 Ace","Worlds most bullshit shot","I knew she reminded me of something...","I'm always amazed by this game's community :)","I'm Gonna Miss the Old SMG-11","Rainbow 6 logic","Since everyone seems to be showing off their cosmetics, here are my favorite attacker and defender","Let's end this smoke fashion show","A lot can happen in less than ten seconds... never give up","“What was siege like when it first came out?”","Once upon a time...","Friend Removal Story","To all of the ps4 players","My tachanka","I am the real tachanka main","Mira-cles do happen","Alpha Packs Update Concept","Ranked im plat2 will play with anyone","Operator Prices","Guess I'm a Tachanka main now.","May have lost the round, but I hit the shot of a lifetime","Looking to buy second dlc attack operator","J a g e r w a v e ft. Buck","Confession: I team killed the other day.","Charge Blew Without Consent","1v4 on Match Point, closest loss of my life","Pro League Frost that I just did","Why aren't seasonal uniforms universal?","Even AI likes them sick 360 shots","Suppressors in Grim Sky","Tested... Saying 'Kobe' REALLY does give you a 73% increased chance of getting the kill","Should i get Clash or Maverick?","Get it Girl","Need help new rainbow defense operator who should I get cav. Mira. Echo. Ela. Or maestro or alibi REDDIT HELP","Blackbeards new shield buff","Looking for a group to get back into the game with [XB1]","Is the C75 also nerfed?","My absolutely disgusting fuse ace","Angry Tachanka","How to leave wood rank?","Detailed post on how to Warmup","The best Ela NA!","\"It's my turn !\" \"No, it's my turn !\" \"No it's mine !!\"","Some information regarding why the TTS is only on PC","Family Trip to the Rainbow 6 Park! (sadly, one family member was out of the shot)","What do they have trapped in here?","What is butterflying?","Smoke and Cav get it on then kill the witness","neither monty nor glaz expected that xd","Doc deleted, Jackal deleted, VG deleted... wait.. Jackal deleted?","Tattoo Ideas","TTS code","lol","Console player about to play first PC game, any advice?","Am I doing this right guys?","Feels bad man","Who else got this secret charm?","This is my Kapkan uniform load out, since that's what we are all doing","Do you guy's see this too? (jager's odd BO uniform texture)","Para Bellum Tribute","Is R6 a Simulation Training game?","I prefer this old loading screen other the new one.","Dokkaebi","when people bother to open their mic. (watch till the end)","Minimalist Vigil by Chrisfch","Lone Wolf Terrorist Hunt as offline fallback mode","The Clash Spin trick","Heard we were showing off our outfits","HI i'm console player and don't got PC so I don't use my TTS acces so:","Just chillin","When did people call meeting room \"church\" in Oregon?","Attack","ubi plz. make the stock wood","My best clutch with maestro!","Why are half the threads on this subreddit about skins ?","Possible Casual TKing \"Fix\"","Did Rooks Elite Skin Need The Change?","How do you guys feel about capitao and his current state","Can we count total damage dealt to team members instead of kills, please?","This is why you don't use a laser sight.","Para Bellum Charms, Skins and Outfits","I'm sure this has been discussed before, but I really want an event mode queue like PUBG has.","What does \"clutch\" mean?","Na server and Frost","MP7 weapon skin","Trophy","Best headset for high-rank competitive siege [PS4]","So if Glaz has an Ots-O3 (Dragunov SVU) and Maverick shoots an AR with a 50 Cal round is Maverick also going to be able to shoot through the windows on plane?","Unlimited Ammo/Gadgets in Custom Games","How to get fit from siege, credit to Epi","Nasty 4K round and 2k clutch with Doc","Visit Us! We’ve got Pasta!","Did Y1 operators have season pass exclusive uniforms?","they said it's not a shotgun , they said it was designed for snipers , they were wrong","Hibana","A montage of my friends and I collected over our time together.","Reward players for playing defensively on defense and attackers for playing the objective","Since I can’t play siege on my college campus I’m getting my fix through Reddit, Youtube &amp; Twitch. Y’all keep it up lol","Jäger just wants everyone to be happy.","I don't have a \"Dark Lord\" or anything but I have velvet shell headgear for Glaz and I'm totally happy with just that. &lt;3","Ranked in a nutshell","Can we get the ability to customize reticles?","A compilation from my day off with the boys.","EU data server","Hello people of the R6S subreddit","Hey Ubisoft.","Welp just played r6 in 3rd person","Unpopular Opinion: Not all operators need to be good","Is the new Hereford any good?","Don't you love it when a plan comes together","how do i control bandit’s recoil? what attachments should i use?","I need help...","looking for a squad UK PC EU / ranked low silver - low gold / casual chilled out / 14+","many black ice, many frags","Sledge or Jáger elite skin?","And this is why you never rush when defending.","I Love Rainbow Six Siege, but How Does This Happen?","Help ?","Some Bandit Highlights!","Cleanest clutch I've done so far","Found some good shit on 9gag","You’re the last one left. Complete the mission.","codes","Grim Sky all legendary alpha packs","Suggestion for custom games","Can I play r6 on two seperate ps4 accounts","Cheese!","Blitz Elite Skin: Expectation vs Reality | Art by 菜包子 (x-post /r/SiegeArt)","Is it weird that I can control bucks c8 recoil better with an acog?","True Capitão mains","Lion's birthday challenge, where is it?","help me pls","Making people YouTube, Twitch, Desktop,etc Backgrounds for Operation Grim Sky and Para Bellum.","Learning the game got harder.","Smoke Ace Clutch (Notice my Legendary Plasma Pink Shotty)","Nice map!","It's raining a man","Got Sanction Banned for no Reason","Getting back into the game, how good are LMGs currently?","Forced Abandon Sanction?","Voice chat not working","Anyone else think laser sights should go through smoke and you should be able to see the beams of other peoples laser sights?","Best Frost meta.","Ranked: how the hell do you climb up if you fall to copper?","top 10 anime fights | r6s edition","How to win a 1v4 in ranked to go into overtime ft. Ubisoft servers","I'm relatively new, so I'm quite proud the alibi bait worked","Can we give our Recruity-boys skins?","Reloading","Leaning in rb6","Why blitz has speed boost as gadget???","R6 advanced edition PS4","Cav Elite idea","A single OP should be able to walk behind Monty with a secondary out, Like so","New Ranked Interface (Idea)","My mouse sensitivity will dramatically lower in-game without any settings changing.","Guess I’m a Capitão Main now","am I an ash main now ?","Oh hi Mark !","Chalet defense","Neeed team","A desperately needed operator: Titan","Zoom with sights","A way to lean without ads on consoles","One of my only legendary skins","why do I have to pay 6.99CAD for 600 Credits, when other users pay 4.99CAD???","Ranked messed up xbox1?","Idea I came up with while playing ranked concerning dokka calls","How would you group R6S Operators in terms of playstyle?","Worst guns possible","If you ever feel useless remember that Hibana and Echo have pistol","Comrade Fuze helps his friends escape Goolag","Thatcher","What the hell is wrong with ranked","Operator random select","Clash n Mav","Xbox Elite Controller Suggestions!","Just got shot through my shield window as blitz","Is clash faster with her pistol sidearm?","Question for TTS players","How did you guys get good at this game?","DPI vs in-game sensibility","Will winning a hostage on the new hereford count towards the trophy or am i totally cucked from getting the plat?","First time back for 6 months, is it usual to get kicked every single game?","Operator Pick Screen","TTS skins","3 legendaries. Alpha pack charm, Bismuth and concealed. I’m way too happy with my kapkan.","Question about TTS","Why Must You Use the Elite Skin to Use the Animation?","Good 3 speed ops other than Ash?","why is kafe in ranked??","The way Thermite deserves to be played","Useful flank on Herford defending basement","\"I win\"","Usernames","AFK Recruit to Round-Winning Nade Kill","Red dot rework","Can't access Uplay Overlay/Challenges reward screen in R6S,need help!","Need Your Help","Hurts my eyes","TIL: Montagne's Real name is Gilles, which is Greek for Shield Bearer.","Mans flicked so hard he teleported","What's going on with Maverick's name and icon?","Year 3 season pass","I’m so done with ranked","Since I don't own Rainbow 6 for PC, this code is up for grabs","smoke elite idea","Thank you Ubi (for once). My game started in the middle of opening a pack and I didnt know what rare item I got. So instead of having to go through everything like I thought i would have to I got a notification instead. Thanks Ubi","Swiggy swooty \"bluebeard\"","Battleworn Echo Artwork by Zorvaine","TS Question","is the smg 12 recoil nerf that bad?","Tachanka","Operator selection screen freezing","Alright boiz if you have any cool outfit screenshots now it's the time to post it!","Who do you have the most hours on, for both attack and defense?","Operator idea","Your pulse outfit is cool but I raise my magnificent smonk","Your buck outfits are cool but no one can ever top this pulse","Blackbeard + Maverick will be OP, they said...","Fixes for boosting","I recently got caveria but don’t know which primary to use: M12? Or Spas 15","Mouse and Keyboard on Console","Changing settings outside the game","I wish people knew what Zofia's concussion grenades do.","What happens if you leave a placement match?","Death By Rad Zip-liner ?","I've peaked with my flicks","Is there a single argument against showing a team where they will be spawning in casual?","Why the hell is everybody I get matched with so toxic.","Maverick opening the new hatches in Operation Grim Sky","Can we have a subreddit or at least a flair for loadouts?","To Be Continued","Test Server","How Many Of You Guys Run A 144hz Monitor?","Creating some RB6 themed textured headers/wallpapers for PS4","Did i miss the op loadouts?","IQ Elite should have been something like this. Instead we got gym clothes.","All DLC Operation/Operator Trailers till Operation Grim Sky","looking for a ranked squad / low silver - low golds / 14+ / eu / chilled out players / decent at siege","Thought I’d make a Maverick wallpaper for you guys :) hope ya enjoy","Why not just add glass penetration to DMR's?","For the love of God please add this ubi.","Black Ice Wins Games! - Rainbow Six Siege","Love this game","Did they buff Monty's melee range to counter Clash","How Would YOU Buff Mute?","Smoke wants to get shot...","Toxicity?","@tuxbird","Maverick concept art","Toxic/accidental TKs","Effective Way to Learning Map Callouts","What operator should I buy?","How important it is to keep Team killing ON in the Casual Mode?","Never Ever rush a Blitz (Forgive my aim, It was bad to say the least)","Show me a character that has an all black ice layout.","We still doing cool operator loadouts?","So I got a little bored","Is it just me or is it hot in here?","I am a good teammate but do not have enough individual skill to win every round on my own.","Can someone confirm","When you want a kill but luck is clearly against you","[Photos] Pro League Finals 2017 - São Paulo","I didn't even touch her","Ranked ps4 my username is saffar22","What even is silver?","Wtf is this","TTS Invite Code","How do I add text to my flair?","I need help fast","Cav gets Triple-Interrogation and Achieves Flight","Reminder to check rooms you enter.","Guess I Will Be Using Mira and Jackal Now. I Know The Headgear and Uniforms Are Generic Af. But They Work, xD","Caveira (I tried)","Hmm... Where could it be..?","Looking for clan!","The best Smonk skin","TTS Code","Jäger Main Whore","What defence DLC operator should I get?","Should Ubisoft let community design skins in the game like CSGO","Small Operation Red Crow Wallpaper","Add lean without scope to console so it feels more like pc.","rainbow six siege resolution","Does anyone actually like the smg 11 nerf?","Leon casually killing everybody","What's up with all the Smurf accounts (especially recently)?","Is casual just a place to get destroyed by diamond or gold players?","Returning player needing some info","What if we gave tachanka an AK74 with a bayonet as the gadget?","Sick IQ snaps","Is capitao bad?","does rainbow six toxic behaviour ban's time reset?","Recommend nickname plz","It went so wrong, so fast","Thanks","Sky's most viewed clips of all time!","Probably the only instance that I didn't complain about the lag","Your lord may be legendary but i raise a fresh blitz","How to get xbox clips to reddit","Mute Grim Sky Edit","I've noticed that some people are saying about a Test Server email saying they have access to it.","I got r6 abut a month ago and i dont know what defending op i should buy next i only have rook kapkan smoke and jager any advice will be helpfull tnx.","Game mode idea: Document (NOT MINE)","Stuck in a loading screen...","Uhhh WTF thx? drug lab is screwed","Sp1cy banned my friend??","Heyo","yeah clutch is my middle name","I've only played a little bit on PS4, but I got this in my email. I don't even own the game. Can someone fill me in on Uplay/Test Servers?","A few Ideas on two new defenders.","Best streamers to learn from?","Razer Kraken 7.1 v2 Synapse settings","Dear Idiot,","Grim Sky universal outfit","My new operator idea","Trading knives","New Operator Idea, Australian Attacker","A new map should be added to the ranked playlist the season AFTER it","It would be great if C4's were not silent when thrown or ripped to be thrown :)","Abandon sanction for no reason?","Can't play Seige at University, Help!","Does any of you know exactly when the update for Grim Sky is being released??","What should my first DLC operator be?","Old habits die hard...","Consulate ground floor rework- Aim is to make Main Lobby and Piano site more viable and to add the 4th bomb site into Tellers and Visa Office","The Recoil Battle","Had a few too many drinks; Sweaty Try-Hard TK in Duos Classic (Realistic) THunt... fun was had (TTS)","Test Server fucked my pc","Why toxicity bans are stupid","Looking for a creative defender OP to choose.","I’d shit my pants if they made the characters from Vegas into operators. Being able to play as the original rainbow members would be pretty awesome. Especially bishop since he was an animal and a great leader.","They fixed the most important thing ( ͡° ͜ʖ ͡°)","Deployable Shield Skins?","Is there a similar website to csgostash for rainbow six skins, headgear and uniforms?","Test server code not for sell it's free","New Australian Operator Idea!","My \"please shoot me\" collection. Pushing for 100 hours as the lord.","I don’t play the game anymore so someone else should put this to good use!","Mute is OP","Why is the smurfing so prevalent compared to other games?","Low Fps","Frost, Lesion, Echo, Valkyrie, Vigil,","ubisoft login","Ubi fix plz","Bow down to lord Tachanka","TTS SMG Nerfs","Montagne Bundle Idea","What camo is this?","Need a clarification.","Jäger Ace I think you will like","I put memes into my gameplay","Does Anyone Want To Play Ranked With Me (MUST HAVE MIC) [PC] {Australia/New Zealand}","Anyone else had everyone in their game kicked out?","Can we please have something to auto kick terrorist hunt team killers after the first obvious offence?","I guess what ubi is trying to tell us","Change my mind: Unlocking operators is a detriment to Rainbow Six","What defense operator to choose","Which one","Black bomber smoke","Ela Bosak but without makeup","Interview with Siege Brand Director about new spectator tool, reworking operators and the worst development decisions","Why are kills not consistent?","Noice Sledge Combo, What Do You Guys Think. P.S My Rank Is Trash Cause I'm Trash And I Don't Have Friends..... (Re-Uploaded Because Of Bad Quality)","\"Implementing a time limit for the phone calls (7-8 seconds and the call ends) is interesting...\" VERY BAD IDEA, it removes the tactical consideration of having to manually turn it off.","Take a gander at these misnamed operators, how could you forget such classics as Emp, Black &amp; WiFi??","Advice for next attacking operator","Are we all sharing our uniforms again?","Can we please get a fix on this? It’s covering up the game mode and map info.","Incease punishments for leaving a ranked match severely","what operator should i use?","1V3 clutch against blitz while flashed","Test Server Key for PC","Ubisoft, my Xbox and PC accounts are linked. Why don't you transfer my skins, cosmetics, and charms?","Ash main","Any Ash/Bandit mains?","Can I have a feedback on this?","'Camper' trophy is driving me nuts","Payback! Karma is a bitch...","I love it when they just line up for you","Dear Ubisoft: PLEASE ADD AN ASK/FORGIVE TEAM-KILL OPTION!","Recruit gained power from All Might","Code for TTS in PC","Since Favela is returning, here is a quick 30 sec video on how to spawn nitro. Enjoy!","Luck-bringer IQ","There should be an AFK auto-select operator option for when the timer runs out.","It costs $221 to buy all the elite skins so far.","Clip from Blood Orchid","Weekly challenges August 28, 2018","Bandit vs Jager as a roamer","My sick Bandit outfit. B-))) Very cool.","Woodburning art of Mute","I saw this on a Rainbow6 community on Facebook and thought that everyone here should see it, I also hope that the Dev team sees it and considers it.","Footage from my first day on the R6 BETA.","Guy having a rightful breakdown after losing a match","What happens after 7 day team killing ban","Does Smoke’s gas canisters obscure Glaz’s thermal vision?","Harsher Penalties For Exploiters","Looking for teammates","Are every character on Team Rainbow inspired from/based on the real/fictional person?","Pranks abusing the automatic ban-system","Copper 4 impossible","This game was infinitely better in the first 6 months","I didn't even see the guy behind the one I was aiming at.","I don't know whether this has been mentioned yet","New operator idea: blackout","Any tips for a beginner?","Rainbow Six Siege Trolling 1: LITTLE KID RAGES!!!!","Frost Buff","Ranked queues cant find games after 3 matches","squad love","I really didn't mean to do it.","Should i throw away slesge SMG now?","Cant get higher frame rates?","Sometimes the only way to save a life is to take one","What ops arw you guys using righ now and why?","What Will Happen If Pick And Ban Comes To Ranked","Flicky on my blicky HUH?!","So... this happened today","I need some tips for ranked.","Missing year 3 pass.","Whats your top tip to improving my k/d? (Plat III)","IQ literally shoots herself... excuse me what the finka?","What a nice community. I said \" Hello team \" and got insta kicked from the game. 10/10","toxicity won't get fixed with penalties","\"You can stop worrying about grenades now.\" (Artwork made by Me)","Explain plz? Recruit with skin and atachment","Shameless Plug","Need me a man like this","Does anyone else think we should be refunded for the base ops and attachments we bought with reknown since they now just give it away when you buy the game?","This guy was having a bad night.. worse than mine anyways.","Increase Leaving Time Penalty","Never Forget: The 2016 Christmas skin is so ugly that it doesn't even have a rarity.","More YouTube videos. I’m doing my best. I make these on my iPhone lol.","Closing in on 25k renown, should i buy Zofia or wait for Maverick?","Free test server key(only one use)","Solo Queueing Ranked is cancer","Blitz the heavenly demon","Does casual need friendly fire?","You Know I Rock The Black Ice, Unfortunately I Have The Worst Headgears/Uniforms For Jager. Dont Mind That \"Legendary\" Silver 4 Solo Queue Rank, lol","Tl:dr inventory system for your skins that doesnt go by weapon (aka all of the skins that you have in alphabetical order rather than all spread out)","Rip the Bearing-9","How would you feel about existing operators with only one or two weapon choices getting new ones?","How to be sweaty KD hunter.","New idea for recoil","No luck involved at all, trust me","The Cursed Suicide Bomber","So i got the code but i dont have a pc..can anyone else have it? Or can i just use it?","200 IQ method to avoid Mute Jammers on stairs","Just buck things","Here’s a code for test servers on pc. I don’t own a pc so here you go","When in doubt, spray and pray","Silent, echoing guns","Recruit's goggles are off-centre on his artwork when you spectate him.","Just something useful to prevent of getting baited by the players","Someone was salty I couldn’t pull off a 1v6 but I feel like I won","I wanna know..","i dont even know anymore","An Idea for a Alpha Pack","The best and worst minute of my life","They've clearly mistaken garage for bakery","Pc Seevers","Server problems?","-New Ops Release Date for Season Pass Holders-","I have the proposal for something new in the game","Daily/Weekly Challenge Operator Name Consistency","About Edpi and sensitivity in R6","How to Fix Tachanka","New Operator Idea for Spetsnaz","Uplay PC Test server access.","1.5x sight?","Quick Peek","TTS key","When a operator uses his lines (not the regular ones)?","I just found this spot on VILLA map.You can do it with a 2 armor and 1 armor.Not sure about 3 armor!","Hahaha. U want to die!","It's been nearly 3 years since Siege came out...","hello:))) i hate the new system","First few weeks with rainbow six siege","Some elite ash artwork","Overpowered Operators?","My attempt to create a Funtage out of the funnier games we've had over the last couple months! I worked really hard on this video, and if you decide to take a peep at it I really do appreciate you!","New legendary skin for type-89 in grim sky","Did Ubisoft just send me a free copy of siege on PC?","What the f* is up with matchmaking?!","Super Siege Bros Trailer!","How many of you guys are going to switch to the fmg on smoke after the new update?","Will anyone else miss our cosmonaut Rook?","Just some casual fun","In casual anything is possible [warning - loud children]","Rainbow Sixers dont lack patience.","Ubi fucking fix alibi’s shotgun","Here to settle a disagreement..","If anyone needs/wants a tts code. I play on console therefore the code is useless to me!","When life hands you an W for once","What do you guys think/do when trying a new sens?","My new phone lock screen. Calling notification are the ringing sound she make when calling.","Hating on Clash?","Need some help with sights !","Team mate thought he could get a breaching charge on the final kill cam. He wasn't wrong.","Bow before your lord","My dude is bad but good?","Thought: Every time we have gotten new hardbreacher we have also gotten one gadget from attacker side to the defense.","R6 cartoon artists needed!","why does recruit only get one reinforcement?","Probably a stupid question, but I just got an email saying I’m invited to the TTS and I play on Xbox one. Can I only play the TTS on a pc or can I play it on console?","Why send me this Ubisoft?","hard to see the ACOG reticle against this wall in tower","What’s the best sounding gun in your opinions","Who do you guys believe is the most unbalanced operator?","Shield operators aim down sight too fast","downranking. is anything being done to stop this?","Game/Team Chat on Xbox?","1# star Ash","Mira Window on the wrong side of reinforcement","Consulate Easter Egg of recent creepy screeches?","We should have a subreddit for rainbow six art","Siege Team Signals (For those who don’t know)","Well thanks UBi... But uhh can I borrow your pc?","I would love to see a new defender gadget (not a whole new op, just a replacement for camera / c4 etc.) that covers up drone holes.","Defender Idea.","FPS Lag Help","Update Grim Sky","Yall like my Twitch setup?","Opinions on Ying?","Free TTS invite.","Giving renown to team mates?","Post your sexy operators to r/r6fashion!","Buff TH","R.I.P. Solo Q'ing. (Ranked, Xbox)","Can we please have a new op that can build indestructible walls","The Chances Are So Low.","Everyone’s impressions on the new Operators? (Balancing, fun, etc.)","Why are rank disconnects basically epidemic in Ranked but quite rare in Casual?","Aimbots like this still exist...","\"Shotgun isn't viable.\" + Bonus clip","My Siege Realization","I've corrected the new operation name","Really think they need to sort matchmaking out. Oh and footsteps...","Mute Elite vs Jager Elite","Ope","I present to you my golden red capitao","A tragic story of betrayal, sorrow and revenge","First time encountering the Washing Machine exploit","New and Trying to Learn","When The Stars Align","IQ's operator video","Voice Chat not working on Live Server, but works on TS?","I can't use season 2 operators even though I own them.","Why Ubi? WHY?","Wow, BattlEye is really effective nowadays","Everytime I hear this theme I feel nostalgic","Is there any attacking op I should save up for?","R6 Community in a Nutshell","Cant use it. Maybe one of you can.","ubi pls fix","All I have is a Mac....","Question about season passes","A 4 piece in ranked my buddie got. Im the cav that got the last kill btw(still my favourite kil with Luision","When does Grim Sky go live?","Why does everyone who plays on Console have to be so toxic?","How do you look up someone's Rank for a different/past Season?","Only 2 rounds? No problem","Article 5 game xb1","Test Server Code","Closest thing we'll get to a training mode","thx to ubisoft to kick me in matchball in an 1v1 Situation #trashgame","Everyone is gonna be an ash main after grim sky comes out","I have 25000, and looking to buy a Year 1 operator?","Bolivian Operator Silva (Leave constructive critisicm, this is my first concept operator)","TTS PC code","Is Bucks AR good now?","What is that rainbow six subreddit that is dedicated to fashion advice?","Vigil or lesion","Only in Casual","Worst thing Ubisoft ever created in Siege? | Exclusive interview with Brand Director Alexandre Remy | courtesy of Team Six on youtube","I had the greatest play last night but wasn’t recording at the time!","Why can't I see the indicator for Hibana's weapon's pellets?","Best Jäger Strat 2018","Looking for a good r6 artist to make a profile picture and banners","Used a code on Ubisoft to get the Year 3 season pass.","Which girl do you think has the best fanart","Can someone help","Can they add a background back to the 'Play' 'Operators' and 'Shop' screens once again?","Should R6 get more game modes?","How Bout Some Gone Rogue Elite Skins?","Monty! No!","Banned in first match of Rainbow Six EVER on PC?","F2 recruit is a legit main and may i say overpowered","The AA12 when spammed causes frame drops and my ping to skyrocket on PS4. Can this get fixed?","My fastest ace - Silver 2 - Headphone warning towards end","Just bought the Y2 Operator bundle, what are some good loadouts for all ops for y2?","People dropping hard R's and not getting banned","How to make someone rage quit in 15 seconds or less","This is Another Reason I Hate Skyscraper","When you get your best snap kill ever.. but it's a TK ¯\\_(ツ)_/¯","You thought your Buck looked cooler than mine? Ha","Amethyst skin","Anyone noticed the recruit standing behind the left tree on Hereford base (old version) as the game loads in?","I love this game!","Best roamer to learn roaming besides cav?","Secondary SMG idea for the future","Maestro hs trough unbreakable wall","Test Server access","My Friends made me this for my Birthday Cake.","Toxicity in Rainbow 6 Seige","Best barrel attachment on Maestro?","Best gun in the game?","Some say Alibi is a roamer. Me? I say she's an anchor.","Kapkan Buff Idea","my logo that i made","Ubisoft buddy what about console credits to Alpha Instinct on yt","Thermite's out of body experience","Still no release date on Grim Sky?","Modded Lord Tachanka NZXT H500i case - Dietec","How often are 50% renown weekends?","I raise you all my Buck loadout","The MPX has problems","Shout-out to Ubi","Update Rate icon: what is causing this??","I got a code for tts... but I play on console. Here, Someone have it.","When does Para Bellum end?","When will operation Grim Sky come out?","Something's wrong here","Frost House Gnome","What do you guys think of my new phone case?","Lowkey can people rate this ranked ace 1-10, plus any thoughts on this?","TTS on Xbox one","Imo this video by DXFan619 needs more attention, so I'll post it too!","Where is the Lion dog tag for this bad boy’s birthday for the challenges this week?","Does the TTS code for console players last forever","Who’s the worst operator for Attacking and defending?","Potentially highly informative video comparing methods of gaining renown","Anyone else excited for this and are u buying this?","Operation Grim Sky","A question for Zofia mains: do you think the nerf announced for Grim Sky will make her considerably worse?","What is the community's opinion on headshots?","issa sloppy 3k but its k","Rook Ace","Official Maverick Concept Art","App Hang on R6 (AMD Drivers after 17.10.3)","Ubisoft won't give us a match demo viewer, so let's learn from ourselves","The New Icons I make will be put in here or on my Twitter, so Keep an eye on both for updates!","Rewards for getting all trophies/achievements","South African servers","[Suggestion] Team killing whitelist","Why is my aim so trash in rainbow six seige?","Why do 4 stacks (or any squad size) feel the need to party chat?","My friends and I decided to make a small video because why not. Didn't have any real guidlines so we winged it. All your thoughts count! Thank you!","This game isn’t worth $60","Robby Rotten as an operater.","Are \"ace\" intros underrated and slowly dying??","Worth Switching from PS4 to PC?","How to tell if charms are limited time only?","Can someone pls help me","Uplay PC test server key","we understand why they are nerfing the smg 11/12 bearing 9's recoils , but why are they nerfing scorpio's recoil?","Can u shoot through the plane windows with the AR 15.50?","Alpha Pack Drops","I have two Test Sever claim codes for PC. First two to claim them will be allowed to play on the PC test sever. If you already have access to the test sever or the PC version in general, please save this for people who would like to experience PC.","Only In casual Maybe Once In a blue moon In ranked","Advice for playing on PC?","I made a highlight video of Macie Jay's most viewed clips of all time. There are some oldies in here so I thought some of the newer member to his stream / the community would appreciate this!","4 in a line","Should I feel bad about this? AFK Kills","Should i save renown for Grim Sky or buy an operator","What weapon skin should i get for the P9?","Word meanings","Test server","Honestly didnt even realize i had this until i checked my email today and i play on console whoever wants it i guess","To help choosing operators","Should Ash have a Shotgun or Uzi?","Terrible ranking system...","Such a delicious number","I think the ump needs a buff a least little bit of a damage buff to compensate with the slow fire rate","My first ace ever with my boi Maestro","[PC] Test Server Code","Ubisoft favourtism? Nerf/buff conversation","My buddy made this for my birthday.","Audio option: Voice chat record level","When your at school and need to kill some time.","ACE 1v5 echo clutch I got a while back","Wow.. he almost saved his buddy.. ALMOST","This my house now","ESL Highlights #2","Quick question: Grim Sky release date?","What is going on with the xbox servers","Just got Gold IV after getting placed Bronze 3 a few weeks ago","tips for a smoke player?","Cross Platform Purchases","What's next for Attacker utility?","God clamor kill","Smoke-Ying?","Allow us to Play ALL operators during local play + make custom games available for offline!","Be aware of Finka's res","Getting banned randomly.","Multi CTU weapons","M1014 semi-Shotgun and 9x19VSN damage buff","Operator ideas","This is why Ranked Siege sucks right now!","Favela","Just found out someone has been logging (or trying to) in my account for around month","New operator idea: Graffiti","Always rush the last guy","Peekaboo","Glaz... Cancer?","Making Ps4 G04 ESL team NA West","Please post the link of video about Cav asking Rook to heal her and being disappointed, I lost it and it was hilarious.","Have Elite skins change the operator icon background to gold.","Eminem=Bandit?","G2 Pengu's most viewed clips of all time! My last video got some good feedback so I made another.","It's all fun and games","Unable to enable voice chat, cannot hear or speak in voice communications","Can't find the \"Jager Covert Set\" Bundle","Valkyrie, Maestro and Bulletproof Camera spots on the new Hereford Base.","Just saw the Documentary \"Another mindset\" and found out that I am part of it at 5:22. It was such a great day at Gamescom, since I also got to meet the Lord Tachanka himself!","My 1v3 as Blitz","Got 25k to buy first operator","Has anyone made a Rainbow Six tabletop?","Lesion gun selection","What did you got when you scanned in your code at gamescom?","when to start playing comp?","This game is funny sometimes.","Universal Language","Why Vigil Is always the First To Be Scaned","Events that could be interesting for the game during the seasons.","Found this Mute cosplay on Instagram","PS4 Servers.","insane flick!","So, can we please stop ignoring that T-hunt still exists and give it a decent lone wolf reward again?","does maestro aim faster with his LMG if you remove the vertical grip? not sure if my mind is tricking me","Yo who wants this","Friend got this 1v5 clutch (in like 20 seconds) 0-3, we came back and won five rounds in a row to win the game","When Ubisoft wants you to stop spawn peeking","Just got this idea.","TTS Code for someone","Free test server key! I don’t play on PC so enjoy it","Old versions of ops in custom games??","Favela Back in Casual","Can oi av anover beeeerrrrrrr???","MPX smg","Black ice","1v3 Clutch Overtime Matchpoint after my teammate called me trash + a pu$$y =) Well..","If you lose/win a match and leave during the MVP screen does it still roll/give alpha pack percentage?","What’s wrong with thermite's guns ?","Which operator should I buy right now?","I play on Xbox, I don’t even own a pc, why did I get this email?","An unintentional nod at My Hero Academia.","Game keeps freezing and making me manually shut it down, turns my Xbox off when trying to access the game again, any help? (XBOX)","Does anyone else think Ying is underpowered?","Got an invite for test server on Uplay PC. I play PS4. Any PC players want the code?","Free test server code","Why is the chat system still in the game?","Beast roamer for each season.","When FUZE knows what to do","Updgrade Starter edition with CDkey on Uplay","jaeger out here servin' lunches","Naughty Lion. (the sync was accidental, i was working on a video haha)","Do Dumb S#!T the music video.","Playing with VPN","Is it possible to get unbanned","What a strange noise...","Does anyone else experience increased input lag with 1440p?","The AK-12 has probably the tightest hipfire spread on any AR with a laser equipped and prone.","Has anyone else realised Lion has 2 sidearms?","what are the best elite skins?","Flying too close to the sun","How does the matchmaking system work?","A Very Green Castle","I see your Dokkaebi 1v4 and raise you my Maestro 1v4","When will Operation Grim sky likely to drop on live servers?","Keychain my buddy made me","Interrogation STILL needs a fix","How do you guys feel about the upcoming castle buff In my opinion I do not like it will do enough with only glaz not being able to destroy his Barriers anymore but I’d like to hear from others"]