["Update - City police called my wife saying a store reported her for mis-scanning at a self check out to steal things.","UPDATE - MI - My brother (33M) needs a new guardian, I want it, my mother (61F) is fighting me","My mother's vehicle was parked next to a golf course yesterday and was hit with a golf ball, causing damages to the windshield and the roof. She just got a call from somebody at the golf course saying that they are not responsible for any of the damages.","[NY] Can my employer prevent me from eating food during my required break in an office setting?","Daughter was raped at 14 and lost custody to the father who was 22. Help!!","Canadian customer wanting to sue me and the company I work for because he found out that he had to pay duties/taxes in order to receive his package (the thing he ordered from my company).","[MN] While looking for a renter to rent my townhouse, was handed a signed emotional support animal document from her doctor after they found out I won't allow pets.","Landlord Company's employees regularly come into the apartment to use things, and are preventing me from accessing internet","My estranged narcissist mother is demanding that she has “visitation” of my children, she says she’s pursuing legal action. Can she do that? (I’m in Indiana)","I lied on a resume to get a job. Is this illegal?","My school forces us to purchase things.","My landlord refuses to provide internet eventhough it is promised in the lease.","vet refusing to give back pet","(CA, USA) Daycare recorded a conversation we had at the daycare without my knowledge.","Kuwait bank trying to get money back after 6 years, which is now Statute Barred in the UK","Too Old for Selective Service, Now What?","Two months of rent by tomorrow? (MI)","Bought a car, just got a call from the sales manager stating that something was entered into the system wrong and the interest rate on my signed contract is wrong. 4.24 to 4.3X. What should I do?","Found a high level security seal broken by railroad tracks in the woods. Should I report it to someone?","[Virginia] Work Lock-In and Employer Requirements","Dozens of people are using my parents' driveway to turn around every day. (VA)","Strip Club Chargeback Fraud?","I missed my connecting flight and was delayed by over 30 hours. Now the airline is offering me a 800 EUR voucher or 71 EUR compensation, but I don't want a voucher, is this legal?","[WA] The sink in my bathroom broke- landlord says we need to pay up, insurance is saying the landlord needs to. Who pays?","Polyamorous Married Couple Looking to get Divorced","Seizure during work due to heat, AC was broken, can legal action be taken?","Construction next door is using the “right of way” in front of my yard to unload machinery. It has destroyed the lawn. (Georgia)","Update: title IX or police (MD)","[NC] Vehicle accident and person wants cash instead of going through insurance","[SD] Special Needs group home sprayed with insecticide while residents were inside","Partition property--Do I have to sell to other owners?","I’m an American citizen and was raped in Munich. Reported it. What can I expect to happen?","Moved out of an apartment, set move out date the 31st. They trashed my remaining stuff the 10th and charged me a cleaning fee.","Husband found an audio recording device placed by his business partner in the ceiling above his desk. Where to go from here? (Canada)","Georgia- unmarried couples not allowed on the same auto insurance policy?","I posted about a sexual assault that happened to me as a minor at a previous place of business, now the company is threatening to sue me?","Property Dispute, Sister bought Neighbor Houses Separately deeded backyard.","A car shipping company damaged my car while in transit, but they violated their insurance policy so the insurance company won't accept my claim. What do I do?","My mother who we do not talk to beat my sister for trying to get her belongings from the carport -- British Columbia","[Pennsylvania, USA] My friend was raped, and she reported it to the police, and to her University. What's next?","Birth Certificate birthplace error— should I be worried? How can I get this corrected?","My wife legitimately slipped at a grocery store (major national chain), what should we do?","Am I required to refund a payment made in error by a previous employer?","3 days jail time with no bond?","[OK] My next door neighbor has a constant odor coming from her home. Can I take her to court for the nuisance it causes?","A Trademark I need is already taken but it hasn't been renewed in over 10 years","Refusing a person Notary","Landlord lets herself over daily, is this normal? (TX)","Falsely billed for urination damages to hotel room. HELP!","Grandmother had leg mishandled by rough nurse, ignored by senior center, and now is in hospital with severe infection. Do we have a case against the nurse? In California.","Is there a statute of limitations on the amount of time my landlord can wait to fix something I broke before I am no longer monetarily responsible for the broken item - Pennsylvania","Pay per piece vs commission employee in California","I had a lease for a townhouse that was to be from 9/1/18-9/30/18. I messaged my landlord to get the keys today and she told me that they are going to cancel the lease because the owners want to sell. Is this legal?","Lost almost everything in my apartment to cockroaches. Can I at least hold the landlord responsible for removing the infested furniture?","Relocation repayment: fired","(US-MN) City knocks down (leaning) retaining wall during road replacement, ignores me","Hybrid battery under warranty keeps breaking down. What are my options?","My dad may have used my SSN to get foodstamps in another state. What do?","[CA] I am a beneficiary of my Grandmother's trust and want to request a distribution of funds, how do I go about doing that?","Mechanic won’t return my vehicle or my calls (Indiana)","Commercial tenant won’t vacate property and now is on vacation (Nassau County, NY)","MI - my sister was fired a week after telling her workplace she was pregnant.","Being taken to court to “amend P.O.” by stalker - what can I do to bolster my case?","Pennsylvania, getting conflicted answers on throwing someone out of my house.","(MD) Hit a fraternity brother in face with golf club..am I liable?","[IN] Insurance coverage for Native Americans","Attempted suicide in jail and medical power of attorney?","NY - Last minute notice/concerns for \"day of\" (&amp; maybe a possible contract violation) with historical building &amp; the ADA","(Victoria, Aus) Mum to be, landlord ending lease 6 days prior to due date with no reason","(VA) landlord had workers begin illegal eviction proceedings","Girlfriend committed suicide. She left letters, requested that I photo all of them. Police won't let me","So, my father passed away","NJ: Company failing to make FSA payments on time","4 men around the University claim we always have to pay them for a (bad)service no one asked for.","Motorcycle Warranty Issue and Small Claims Court","OH - Friend's husband beat her up, then beat himself to accuse her. Now he's pressing charges on her, and they're both being charged.","Stepdad died...Buried him and took his dog rather than letting him die. He has reasonable amount of money/items left behind. Sister is trying to sue. (PA)","Smoking neighbor in Florida.","Medically Retired Veteran looking for legal help regarding workplace accommodations for overseas travel.","[CA] Need advice on legalities of “Job Duties” outside of what someone was hired for","My neighbor has his pool ventilation fans blowing right into my motel rooms.","[Georgia] Delinquent tenant in a house going into foreclosure","Can I receive any compensation if I lost everything in a fire but didn't have renters insurance?","The company I work for (Lionbridge) is literally stealing from their raters. What should we do?","Our dog bit our next door neighbor and we received a letter from her today. What do we say/not say in response? Can she legally require us to put up a fence?","[MI] Dealer scratched paint while vehicle in for repairs","Looking into lawsuit for college athlete injury","[PA] I got pulled over because my muffler was too loud and turns out I had illegal inspection stickers on my car that I didn't know about now going to traffic court.","Safely Selling a Car With Damage? (NY)","Potential Netherlands Inheritance Scam","Broken lease and unpaid (personal) debt","Employer NON-competition, solicitation agreement","[CA, US] Purchased dubia roaches online from reputable site that claimed roaches cannot carry diseases or parasites (TIL this is bs.) One of my pets is dying now from parasites and I am now concerned my other (expensive) pet is infested as well. Do I have any sort of case against the company?","Is cheating a crime?","Writing a contract for payment of accounts under my name","I was pulled over last night in Iowa and learned I have a 15 year old warrant in Indiana.","Alzheimer's Sucks. Southern Colorado","Release of liability document for driving kids I’m babysitting in my own car?","Do I have a chance this time of getting this injunction on my ex?","Vehicled titled to business seized by City of Chicago in 2014","Mother was hit in multi car accident caused by one underinsured person, taken to hospital by ambulance a year ago. Ambulance company demanding payment from mom. California.","MN- Landlord Issue","Should Cease and Desist in Discovery letters be listed as Confidential?","[NYC] My job has given us no mandatory meal breaks for the past year","Advice for a coworker.","[Scotland, United Kingdom] Neighbours have attached planks of wood to the fence? Who owns the fence? What are our rights?","My mom had been seeing a Dr who diagnosed and had been treating her for wet and dry macular degeneration. She paid out of pocket for the appointments and treatments. (California)","[IN] Friend's manager sending violent messages to her on Facebook, company threatening legal actions if she doesn't take them down","(PA) Malicious Cleaning Fees so No Security Deposit Return","Can I win fighting this ticket?","Traffic Violation - Nassau County NY","[UK/US] Stranded in UK after passport and green card got stolen","[PA] Is it possible for law enforcement to subpoena information from an email service provider?","Hispanic friend needs help getting her kids a passport","Canada my landlord sold the house then filed for bankruptcy and didnt give me my damage deposit. What can i do?","Received a self-written \"cease and desist\" because I commented on someones poor ability in running a community... see attached \"legal document\". I can't contact a lawyer until morning but wanted peoples opinions/advice.","I just learned that my cousin, for whom I was next of kin, died 10 months ago. Seeking advice.","Step son custody Texas","My flight got delayed two hours which means I will not be able to make it to my tour on time. What recourse do I have?","So I bought a private-property car with a lien on it","A \"friend\" of mine damaged my family's boat while at our cottage, said he was committed to paying for it, and has since changed his mind. [Ontario, Canada]","air conditioner dispute","What can I do with rent-to-own furniture that doesn't belong to me and left behind by the owner?","I was told I wouldn’t be paid for time worked, I was passed up for a work promotion, made to feel bad for my use of sick time that I earned, then when I put in my two weeks notice, I became sick with one week to go and was told “When you leave, don’t come back.”","The company Lionbridge ask for all raters to cut several hours from Timesheet/Invoice since July/2018.","I cant get a ss card without an id, but I don't have one...","Coworker at work is filing misleading complaints; HR responds by creating policies that can only affect me without ever getting context.","UPDATE-Friend is going to get evicted because drug-addicted son won't leave","[WI] MSA addendum to minimize future legal fights?","Ontario, Canada Labour Laws.","Early Payment Discount on Lease Kinda Seems Like A Bait &amp; Switch","Any legal grounds to challenge father's conservatorship over grandmother?","Purchased a used car from a dealer with a possibly expired license","I don’t get paid for going to work, only when it’s busy?","NC - Can a property owner use a towing company other than who is contracted for that lot?","[CA] Family Member moved out, but came home and stole money. They aren't allowed home anymore. Are there any issues with this?","shotty dentistry. 2+ years of hell","[CA] Occupancy verification at apartment day before we move out","39 in a 30?","Old apartment is charging me a $149 cleaning fee but I have photos showing the apartment is clean on move out. What are my options?","Friend's ex[M] is threatening to sue friend[F] if she gets police involved post-breakup","Can I submit estimate to buy/install new tree in court? (NC)","[New York] Paychecks consistently coming late, GM saying Taxes aren't being filed for employees","Town's recommended plumber isn't licensed!","[OK, USA]Employer Rescinds Employment Offer Over Background Check That Has No Convictions","How does the GDPR law affect what my ISP knows about my web actvity?","Need help for college: Legal Guardian died when I was 14","[KY] Mediation process length","Advice needed for Louisiana marriage issue.","Obligations to parental care in Ontario!","Are there legal ramifications to using a company credit card for personal expenses even if those expenses are reimbursed by the employee?","What can I do to give my mom full custody of me, a 16 year old?","Copyright and the mouse","Who owes whom in this conundrum involving a crashed car &amp; no insurance?","Kickstarter questions regards to running out of money","California; Is it required to take an oath to the the United States or the state of CA for a government job, specifically, corrections officer?","[Los Angeles] Trying to kick roommate out without a lease.","Can I legally charge my roommate for cleaning/stealing?","Lost my ticket to go to court","Advice needed for upcoming DV conference and trial","Passed by a Stopped Bus on Accident","Non Disclosure Agreement and game design TN.","My wofe broke her leg, orthopedic surgen absolutely botched the surgery - Canada","I cussed in class and my teacher fined me 50 cents and she said if i didn’t pay the money she would report me to the office for cussing. Is this in any way extortion?","Abuser has manipulated a partner into transferring ownership of car and is now withholding access.","Bedbugs in newly rented apartment. Eastern TN","(very serious) Help with car insurance dispute","Savings Bonds","[Ohio] Landlord has not fixed AC. It's been over a month since I notified them about outage.","[Canada] Father has a child out of wedlock while still legally married.","[CA] Employee afraid of using PTO","(NY) Can I still be evicted?","Signed a lease for September 1st but the condo owner is backing out now (Ontario)","Mother passed away, she left a deposit on a piano at a store and the owner refuses to refund it to me.","Failure to communicate medical results","Do I have a strong case against wrongful termination ?","I will have a 19y/o roommate in my house, do I have to lock up my alcohol? South Carolina.","[NY] State tax levy","Child Support for a Married Child (Alberta)?","Not married, separation of property","Landlord making me move to paint?","Copyrighted + non-copyrighted work?","Drug paraphernalia with no plant matter, no arrest or ticket in Pennsylvania","Getting paid PTO after Quitting","Landlord told me three days before move-in that a form was improper and wants me to pay for overnight shipping of that form or else I \"won't be allowed to move in on-time\" (BOSTON)","(CA) My Roommate Moved Out and Disagrees with Deposit Refund","Inherited a home with liens, and I don't know how far it will follow me.","customs problems","Wife will not let me see my kids.","Disgruntled former medical patient having friends book bogus appointments and no-showing. Is this fraud?","Homeowner's Covenants, no ARC, no HOA","I just got my ass kicked, need to know how to proceed","Seller refusing to sign release disclosure","Move-Out Inspection of Apartment","Unpaid bills in a different country","Was I sexually assaulted by my dentist???? What can I do????","My employer got me in collections","[TX]Planning to gift Gun for father","Still being sent bills for car that has already been traded (Georgia)","Unlawful possession of alcohol advice","[KS] Trying to clarify grey area on a Non-Disclosure Agreement","Question about being a beneficiary in a medical malpractice lawsuit","[CA] Hit and run by driver, drivers insurance denied claim, small claims granted judgment for defendant.","Hacker may have gotten my tax returns and SSN.... what do I do?","Legal Shield Coverage in Virginia With Reckless Speeding","DE - Records request from a law firm to a private business?","Landlord trying to get me to pay for a repair to the sink. NY","What is a “reasonable amount of time” before repair and deduct in Wisconsin","Trying to figure out what rights my cat has to hunt (if any)","[VA] Dispute over egging damages","What do I do next? Feeling overwhelmed.","CA - time for attorney? Employer retaliation by decreasing pay 30% and turned off email.","Gf’s Dad is selling a house","Legal Obligations of Next of Kin-is this fishy? Do I have a case?","[CA] Employer increasing prices of stock options after I signed a document locking in a lower price","Question for divorce lawyers regarding 401ks and investment plans.","Taking the guardianship of my brother","$5,200 Worth of Equipment Ordered, but nothing being shipped.","Missouri - Corporate Lawsuit (Still work there)","First Speeding Ticket 19yr Buena Park, California ~ 15 over","Business Partner trying to replace me with his insane son in law - need advice / help","Resident of my nursing home wants to change guardianship [AR]","What potential ramifications could I as a father have with no child support order?","All personal belongings were thrown out while subleasing","Can a landlord charge me for parking, even if the lease says that it is free?","Brother made a bad choice (PA/NJ)","[Montana] All-State Insurance Claim Over Reimbursement","Just recognized an unauthorized charge on my credit card that's been occurring for months","Landlord altered lease agreement and I have proof","My friend (23F) is accused of stealing a sign out of a bar bathroom","[TN] My wife's commercial landlord wants to increase her rent only after 2 months.","[IA] Finding court documents on a specific state inmate.","Is it legal for underage people to produce underage pornography for other underage people to consume?","Can I travel to Alaska on Non immigrant Status","Forfeiture of a trust","Los Angeles County- i'm an Amazon worker and I think I'm getting paid below minimum wage","My truck got repo’d, I paid it off two days ago, they still won’t let me pick it up.","(TN) Can siblings/relatives contest parents’ joint will?","My Dentist charged my insurance $20,000 for things that he didn’t do !!!!!","[MA] Can my security deposit be used to cover late rent?","Friend [CA] asking for a personal loan from me [MA]. What should go on the contract?","[NY] Office Job - Employer admits they can verify I was in and working despite forgetting to clock in, but still refusing to pay for the time - anything I can do?","Can an employer keep information of their employees that can be used to terminate them at their own discretion, or must they have the same policy for all employees?","[TX] Antique vehicle registration","Does the Open Meetings Act apply to student organizations in Oklahoma?","The word 'smiley' is not allowed","Life Insurance Policy Guidance Needed - Advice Greatly Appreciated","Landlord keeps adding on random services post lease","(CA) Can I record a phone call between myself and a company representative during operation hours?","[Update] AT&amp;T made a hard credit pull despite not getting permission. Recourse?","NY Is genderqueer/\"they\" a protected class?","How do I find the best, low cost legal representation? Washington State","What legal obligations does my landlord have to fulfill and how do I hold them accountable?","Easement laws concerning power lines in Georgia. US.","[Florida] My social security number was leaked by equifax in 2017. Accounts have recently been opened in my name. I would like to consider the option of taking them to court.","Mail from IRS arrived open","Ex accusing people of rape. How do I protect myself?","Month to month rent, Afraid I'm going to get screwed.","My liscence is suspended and I have a warrant","Using a celebrity's name as part of a business title","[CT] Road Hazard/Hit and Run/Evading Responsibility","My sublet is harassing me for their security deposit back before our subleases ends","Let a friend borrow money and statute of limitations has passed - anything that can still be done?","Current property management wont do final walkthrough with us present, what can we do to protect ourselves?","Paying off a lease early. Is it different from breaking the lease?","Help with Definition of \"Document Copy Notice\"","Suing my cousin for a void business deal","FLSA tip pooling","[MA] Tenancy-at-will lease, only gave 3 weeks notice, but the owner found a replacement moving-in Sept 1, and I would be move out Aug 31. Is the Landlord allowed to keep my rent check for September (effectively charging two people for rent on that month)?","Cops banging on my door at 2AM (NJ)","Minor Car Damages","My dad got scammed on facebook and would like some help resolving it","[Update] I allowed my sister to move in with me, dad tried to say I kidnapped her to avoid child support (CT to NY)","Is it worth trying to pursue legal action against an automaker (Lemon Law/Class Action)","The Post Office is refusing so much mail that my town is on the verge of revolution","Selling first piece of artwork. Buyer is having it printed","[CO] Can I file a Restraining order for an event that happened over a year ago?","Check getting garnished for ex-husband's debt in Kansas, US","How to avoid an Alcohol Minor","Do I have grounds for \"deficient condition\" against my landlord?","Do I need to wait for the bus driver to signal me to cross the street?","I got a wrongly accused traffic ticket","Probate in California-guidance needed.","Will I be harassed by the cops or cps for documenting an injury?","passenger in my car hit another car while opening the door, what do i do?","Do I have a good case?","Im very sad because of my abusive teacher","Tampa FL. Curious about walkthrough of a rental property after vacating.","Trademark used as descriptive","Boss didn't pay my last 2 paychecks at my Co-op term, unsure how to proceed","Union withholding informational","Escrow company contacting us regarding a lien we placed on former tenants property. What are we entitled to?","Georgia (state/USA)- temporary emergency jurisdiction","Can you seek to have trustee removed before trust is established?","[Canada, ON] Company is asking for part of bonus back to pay for taxes \"they forgot about\"","4 Renters [all 21] being imposed by landlord for over $6k in repairs.","Employment contract enforceability if signed as a minor [DE]","CIS caption question","Landlord knows I’ve been living with bed bugs for 2 months (AZ)","California Lien by Mechanic for Car","What are the most obvious reasons anyone knows of as to why a dying family member living in their own paid off home would \"give\" or sell their home to another family member? Also, if I saw the listing of the house on parcels.com which states it was sold for $0, does that mean it was a gift?","(WI) Apartment flooded for the second time in just over 2 years, apartment manager is trying to minimize the situation.","How long do I have from the injury to sue someone?","[Aus] what legal requirements are there of an office to have a qualified first aider?","Public Intoxication Dayton Ohio","Water leak in apartment destroyed personal items in NYC","What can you do legally if you move into a house and later find hidden damages that actually make the property unsafe?","Previous employer refusing access to personnel file [WA]","My dad is hiding over 100K from my mom every year - what can she do to find out where the money is going?","Just received a speeding ticket which puts me over the point-limit in NYS","GA Resident, Out of State Car Purchase, Lost title","San Diego, CA. Roommate stopped paying her share of utilities","Tow truck damaged my bumper with their tow bar in a parking lot - can I get the tow company or parking lot owner to pay for repairs?","Our former loan service provider owes us $2000+ , keeps telling us they will send us a check, and never does.","Admitted to smoking Weed at an Airport.","Witness Fees","Apt Complex filed an eviction due to a mix up but later withdrew it. Is there any legal recourse?","A woman promised most of her estate to our non-profit upon death, but now most is going to a single person (her legal guardian) instead","(CA) Amazon Cloud Cams in my house and audio recording.","[ut] my apartment building barely has any water and the owner doesn’t want to do anything about it","Help! I (19m) didn’t tell my doctor the truth about my past alcohol activity. I need help ASAP!","[MI] My girlfriend had to pay $206 to use handicap parking at our University","Rape threat?","Step parent legal position after death of biological parent","(NJ) business partner is stealing the business.","Getting custody/fostering my nieces??","Landlord change - NJ","Question about using company logos in an advertisement","MD - Gender Mark Change - Form DC-222","Adding someone to lease/violation of lease (SC)","Contract Law Q","PA- Bad business debt when billed incorrectly","LLC and POA Advice -IA","Maybe a silly question, but in which state do I register my car? [MA, NJ]","Found Girlfriend’s car moved several blocks, ransacked and a random persons ID on the floor, cops say they cannot do anything.","Fell for a job scam; may have cashed a bad check.","Potential Western Union Scam?","[Student Loans] Can federal student loans legally be used to pay off high interest private student loans?","Hoping for advice involving having my license suspended due to being at fault in a motorcycle accident without insurance in the state of Florida.","Certified mail / post office mistake","Is a UK deed poll enough documentation to change my name on my US Passport?","Question about a picture I took in Germany.","Im being accused of fraud by my father.","Apartment cleaned itself??","Help i was physically assaulted at work","My boss occasionally refuses to give staff breaks where do I report him? [Virginia]","IL - Parking ticket from the future","My brother going to court tomorrow due to his ex claiming harassment from his ex","Changing LLC name and activity","[BELGIUM] Is it legal for an university professor to use pictures from a book without referencing the book?","Rear ended someone","(CA, Los Angeles) Passed a school bus with flashing yellow lights.","Suspended sentence","Consumer Credit Summons, reached settlement over the phone. Do i still answer the summons? NY - Nassau County","Slept in a walmart parking lot, a cop pulled right behind my car and stayed for a good 10 minutes looking at my license plate, and then left. I was in the car, sleeping but noticed the car there so I just stayed in my seat, down. Will I get a ticket or something?","Mn: ex power of attorney spent all my money but says I owe him money","Is it legal to record employees","When is it best to file for Chapter 13?","University bans guns where law says its protected. Help needed.","How to stop/intercept a package legally in Canada","Pregnancy and child support","Is a threat of property damage enough for a restraining order? [Indiana]","What’s the amount of hours you have to work to get paid for the day? TX","Juvenile record appears on job background checks","Am I screwed ?","Let go from work after being sick for 2 weeks, only worked there since 2 months ago, can I get sick pay? (UK)","Wife's company claiming they charge a fee for not using their health insurance.","[CA] How can I become the guardian of my adult mentally ill sibling?","Threats made to come to my house. Happened in KS.","I owe over 15k plus in child support to my ex-wife","Debt collectors and how often they're allowed to call. Alberta,Canada.","Haven't signed a new lease in 10 years. Does continued payment mean the original is still valid?","(Orem, Utah) Land Lord withheld my deposit for over 30 days, also found he doesn't have a permit","Rental gone bad!","Ex-Boyfriend claims I owe him money for simply dating him. USA, Virginia","Rear ended in New York","Do ICE or other immigration enforcement arrest people at the social security office?","Rear ended at stop light.","Broke the law.. (TABC)","I had tires installed and 2 months later because the Lug nuts were over torqued the wheel broke off on the highway.","Wrongfully charged for medical appointment","[TX] Is it Landlord's right to have the keys from the tenant to make a copy?","[Update] still have not received my mail key. It's been four months since I moved in.","Can i tow my vehicle with expired tas?","Landlord withheld information about maintenance workers using garage attached to my apartment","(Alberta,Canada) Fridge in rented apartment stopped working a few months ago. I unplugged and plugged it back in and it started working again. Landlord did nothing \"because it's working now\". it's stopped working again. Food is spoiled again. Do I have to deal with the cost of spoiled food again?","Is avoiding an animal and crashing considered careless driving?","Is it legal for foreigners to go hunting in Russia?","[CA] Changing information for LLC filings","General Manager of a Small Restaurant Taking Tips","I was the cause of my friend's dislocated/broken arm","Shady practices at my bar?","Do I need permission to speak to mothers doctor?","Buddy hurt his finger working on my motorcycle, am I liable?","Question regarding FMLA denial (VA)","(WA) Neighbor ia flying his drone over my property","I'm living in the UK and am battling with the local council over my father's care.","Delaware limited liability company doing business in CA and VA - question about attachments","Paid my friend to draw a mural inside a giftshop that I own. Do I now own the artwork?","Boats abandoned on property (NY)","Assult case, do I need a lawyer?","[California] just got my Wage Claim conférence letter. How can I prepare?","TN: Can I (21) be forced to testify by my parents?","Can my apartment legally bar me from having comcast service?","[NY] Software engineer wondering about Proprietary Information and Inventions Agreement for new job","Can you be fired for drinking off the job.","Rescinded auto loan, dealership forcing me to get a new contract that increases monthly payments","\"Citizen's arrest\"","Roommate is stealing my medicine","[OK, USA] Being charged interest by lawyer for debt that was paid to debt collector","Can you claim a child on taxes when they aren’t your child?","Are my old boss’ actions illegal, or just childish?","Parents have \"taken\" personal belongings (computer/laptop) from me","Car Insurance assumes 100% liability and is now giving me the runaround (FL)","Red Light Camera Ticket - Fight it or no?","Electricians Apprentice 1099 to log hours towards license","Closing in 2 days, what are the chances of me not receiving the key or if sellers don’t want to leave the house? (extend closing date last minute)","Trailer Park Claiming To Sell My Family's Trailer, But Is Lying","Roommate on a joint lease violated the lease by adopting a puppy and not submitting a pet deposit/pet forms, and lied to me about doing so","What is main difference between someone being gifted money for school and receiving a scholarship? [USA]","Domestic Violence Clause in Consent Decree of Dissolution of Marriage","\"Friend\" Broke my phone and wont pay me the agreed price on fixing it","My S/O was notified today that his daughter is being beat and more...","Geico refuses to reimburse additional gas expenses for my crashed Tesla","Found out my state is filing a lawsuit against a credit company I stupidly got a loan from. Should I take any action?","[Alberta, Canada] Requested time to get disclosure, still haven’t received it, the time is up and court is far away, is there any way to add time without making the trip?","Possible Felony Theft","[AZ] My job underpaid me by $105, I had extensive proof. When I told my boss, they fired me. Do I have recourse?","Are my photos company property?","Neighbour problems","passenger in vehicle during inspection of citizenship","I was assaulted &amp; had my jaw broken in two places, $7000 surgery, &amp; the cops never filed my police report......","Need advice on podcast made by various persons.","[CA] Mom lost her school job due to it closing down. Is she eligible for unemployment?","Guardianship Program with Dog Breeder (OR)","Can I have a dash cam recording audio/video inside my car as an Uber driver in Texas?","Is it legal to send a thank you of value to a police officer who went above and beyond in Arkansas. Not a bribe.","Landlord taking forever to repair leak. What action can I take?","(Location: New Jersey) Am I required to finish an auto claim that I started?","Girlfriend was fired for not being at work exactly 15 minutes before scheduled time.","Baited and switched by landlords (USA, MO)","Involved in bicycle/car collision, driver's insurance company called me yesterday.","Montana, USA Identity theft. Dont know what to do. Please help","(NYC) Management company allowed process server to my apartment in doorman building without notifying","I signed a purchase agreement for a used car and I’m supposed to pick it up tomorrow. Can I refuse delivery and back out?","Trying to break my current apartment lease due to my air conditioning unit not being fixed. Going on 60 days without AC","Possible rape charges","[CA] Recovering costs from dismissed lawsuit in civil court","Apartment Security deposit","would osha requirements apply to independent contractors?","Charged with assault as youth and applying for jobs as an adult [British Columbia, Canada]","I found out that my estranged father self published a book, with my name on it as a co author. The book's contents are based on him describing what might be considered child abuse against me when I was 16. Is there anything I can do to get this book pulled off amazon? [MO, USA]","Advice needed about validity of Nikah as wedding document in California","Sending picture of credit card?","Workers Comp question about RTWSP and SJDB","I want a medical card for marijuana but also want to legally purchase a fire arm. Can I do both?","I reported asbestos in my living quarters(which was supplied by my employer and mandatory for residence for the position), fired today without any reason given.","Neighbor grabbed my cat. Now shes lost. What are my options?","Forced overtime and not told when shift ends","Chase locked account based on fraud","Erratic neighbor living in trailer in driveway of his mothers abandoned home. Is this a legal dwelling, and is there a way to report his behavior? WA state.","[OH] broken AC in the middle of summer has not been fixed or replaced after over a month of initial contact.","Hired under false pretenses.","Think my lawyer lost my case for me... thoughts?","Is a counsellor allowed to say this to someone?","Leak, Mold, Baby, Unlivable in room","Setting up a company HQ in California to resell products to the Philippines","Water dripped from upstairs window A/C to my window A/C which then seeped through &amp; warped the floor","restraining order respondent​ rights","Help me with my legal ignorance","My ex wife overdosed and died while with a man that should have been in prison for raping, strangling, beating and falsely inprisoning her.","Custody weekend visit swap am I looking for trouble.","Got rear ended by a truck. Unfortunately failed to get name and license information.","Issues with post office","Wife's friend in Nursing School was just left by her husband (TN, USA) - crosspost from /r/personalfinance","[California] Would such a contract be valid or void? (Buying a used car)","Can I sue my member of Congress?","How to insure a car with now plates or tags","Debt collectors calling for car I sold a year ago.","Parents Falsely Gave my Address as their Physical Location to IRS.","PayPal scam. Do I have any recourse?","Real estate contract breached by person with possible mental disability","Refusing consent letter","Parents asking for rent, help with contract- Ohio","Can I view court documents about my parent's custody battle that took place when I was a child, without consulting either of my parents?","How many junk cars can you have on private p property? (PA)","Police searched/damaged my things, Apt C, while carrying out a search warrant on the resident of Apt A.","Do I have just cause to file a harassment report?","Inheriting properties","Question about being sued! (MS)","Never been in any legal trouble before. Get lawyer or not?","Jury Duty Suggestions ?","Responsible for carpet?","Bumped a car when parking. Passenger was inside","Can I get charged if someone sticks their hand through my fence and is bit by one of my dogs?","[TX] Am I liable if someone else dines and dashes without my knowledge","Want to break my lease early and my landlord wants 2 months Rent AND the reletting fee upfront regardless of whether she finds a new tenant before 2 months. Legal?","Got a traffic ticket in California, live in Wisconsin. Can I just not pay it?","Writ of Garnishment - Pay off or go through court process (WA)","Adding terms to rental agreement as tenant - am I being overly cautious here?","FTA Warrant (Michigan)","Terrible roommates harassing me after moving out","First Speeding Ticket!","(ON, Canada) Concerned for friend's safety and want to anonymously report her drug dealing boyfriend- what is the best way to handle this?","Emotional Distress Civil Case (NM)","Job Offer Rescinded Due to “Confidential Unlisted Reference”","Father passed away on Monday. He moved to Tulsa OK 1.2 years ago and married a woman I've never met. Do I have any legal rights to assets?","Stuck with a car from dishonest owner, please help.","Can my employer pay me a set stipend regardless of how many hours I work? (Wisconsin)","Spray Paint usage agitating a neighbor (CO)","Rear-ended by 18 wheeler earlier today. Never been in an accident before. Help please. (NC)","Underage Car Accident w/o license.","Inheritance from a long deceased parent (Pension)","$1400 in deductions for benefits I didn’t know I had and don’t need.","Property management company deducted $600 for paint charges from the security deposit. Is this normal?","Father of child temporarily moving out of state, unsure what I need to file","Dollar Car Rental added Premium Road Service without us accepting","All work and no pay makes Jack a dull boy","(Indiana) Signed 12 month lease for apartment but never moved in.","Ceiling fan fell on my friend","(TEXAS) I'm being sued for a loan debt. What can I do?","I've been sued (conciliation) without my knowledge and only found out after I lost by default.","Overtime and new ownership (IN)","Friend Reselling Discounted Items from his Job. (Texas)","Is it legal for parents to buy a house under your name without you signing anything?","Puchased house after Landlord terminated lease, now won't pay early termination fee.","Can my former roommate \"charge\" me rent? (Wa)","Anonymous witness testimony.","Non-Compete Agreements and what your rights are as an employee...","So Comcast wants me to adhere to a “policy”that is not in my contract.","Sutra Beauty affliate pressured my teenager into buying an expensive new hair straightener, unboxed to find she recieved an entirely different product, that was used.","Flooded Vehicle Insurance \"washes carpet\" and says its sufficient.","[CA] Car accident, at fault party doesnt have enough insurance coverage.","Legal rights against lanlord","Selling candy in school. Bad or not?","[CAN] [AB] Revoking condo approval years later","Rhode Island - Employer tracking cellphones without telling employees","Termination without warning due to vague \"violation of company policy.\"","Michigan Out of State Car Insurance","DUI and the Board of Nursing","A company is taking way too long to refund my money, what can I do?","Movers are now requesting an extra 400$","[ON] Not Getting Paid For Hours Worked After Quitting Due to Medical Reasons","Employee 1 borrowing another Employees car during break. Employee 1 has a suspended license due to DUI for the next year. (USA CT)","Can a landlord deduct from security deposit if no pre-move-in inspection was conducted?","Colorado- closing bank account and forgot to cancel gym membership with MESA","Disputing landlord keeping $900 in security deposit on home rental - Phoenix AZ","Company Failed to Deliver Preorder and Went MIA","Question about a Medicare application","Is it legal for me to write a tell-all about my narcissistic abusive ex-boyfriend if it’s all true?","[CA] Landlord hasn’t returned my deposit after 21 day of finishing my lease agreement. Am I entitled to my full deposit?","[PA] Can a Landlord deduct for damages that they don't have proof of and didn't include a receipt of repair?","[NJ] How do you notify the court that you've settled a matter outside of court?","Liability Waiver. Hiring a Nanny who's bringing her child.","Definition of personal service","Release of interest on a car.","Roommate is a criminal, could I be held responsible at all for his possible recidivism?","(Utah) Tore ACL, surgery needed, living on 4th floor of building without elevators - any legal recourse to break contract?","Dentist Lied About Contacting Insurance, Now Stuck With Unexpected Bill","Ex roommate wants abandoned belongings back 5 months later","Hotel refusing to refund our stay, despite drilling and hammering above our heads at 7am. What can I do?","Check Forgery or Should I Take Legal Action?","[Chicago, IL] The back stairs to my apartment complex have been under repair for 3 weeks. I cannot exit the back nor bring in furniture to move in.","Annoying situation with used scooter title","My landlord won't give me a microwave","Didn't purchase a meal plan at University but was given one anyway.","My son's medication was tampered with.","Legalities of an expired trademark? [IA/WA]","Parking structure across the street constantly full of modified vehicles deliberately setting off car alarms with their loud cars.","OWING MONEY","sister posed as me during a traffic stop","[California] County wants vacation rentals to get business license and pay business tax on all contents","Minor being sued for defamation (California)","Roommate is suing me for unpaid utilities.","Importing cars into the USA from Dubai","Brass knuckle paper weights","Boss isn't paying me, help?","Can a cop issue a ticket without seeing the crime?","Who gets the asset ownership of a deceased partner?","Ontario Canada Chipped Paint on Car, Being Asked to Replace Entire Panel?","Final statement","Landlord is refusing to look at applications for subletters and planning on selling rental property","[NJ]Ex Boyfriend maliciously leaking nudes of me on social media, etc","Worried that I might need a new lawyer? Do I have a case for getting my kids back?","In My Country You Need To Be 18 To Enter And Purchase From An Adult Store, But The Legal Age Of Consent Is 16, Why Is That? (New Zealand)","Parking ticket in Culver City, CA I can't afford","(US/NC) Misread C/T scan / fractured neck","Renting in Philadelphia. Sewage leaked into basement. Is Landlord legally obligated to remove soaked portions of carpet and assure room is cleaned properly?","Wrongful termination?","How to find out if you have a trust?","Will i get sued if i perform a cover song live?","USA [IA] Real Estate Sale: Simpler fix than quiet title action?","(MILITARY OFF-BASE) Mold and Water Damage in apartment. Want to kick my family out while they work.","I Need legal advice (Victoria BC law)","Filing a Judgement","Landlord Threw Away My Things Without Notice (NY)","Lawyer in az","Mystery Shop company I work for makes me do recorded phone calls in a 2 party consent state. (Florida)","Landlord withholding prorated rent","Get Emancipated?","Neighbor's boyfriend's boss put him to work in raw sewage with no protective gear or hazard pay. Any advice?","[TX] Non-exempt employee not currently getting paid travel time","Advice regarding Land sold.","[Ca] Just got served divorce papers. What's the difference between joint physical custody and her having physical custody + and me having visitation rights.","Charity auction scam?","Need some advice","Being sued for debt","Mom claims I’ll be “guilty by association” if a friend gets caught with weed, is this true?","Grand Rapids, MI. Is there recourse I can take for a landlord charging me for damages after move out and then never actually making any repairs?","Parent charging rent with official looking contract","ISP Early Termination Fee Tax question CT","Attempting to break a lease early due to the downstairs neighbor threatening my wife and me","Lease over, propane I purchased not being refunded","Subletting from owner in a trailer park","Executor of estate","Nursing home","[VA] A co-worker was fired over something I accused her of doing but did not witness entirely, she's threatening to sue the company, what do I do?","Court in the morning. Charged with petty larceny","Child Abuser fled the state - trying to track him down for court. (Missouri/Alabama)","New York and Illinois - Loan Contract","Mobile Home Park has been tapping into my electricity for street light, what can I do?","High Electric Bills (Pittsburgh, PA)","'Stealing' car back during divorce when car is a pre-marital asset.","(NY &amp; NJ)Bought a used truck &amp; it has problems","Home construction materials problem","Engineering Senior Design Projects","My sisters phone got stolen and the perpetrator is pleading guilty. UK","Fire Brigade trying to collect fee","Can I publicly solicit information about the activities of a public official?","No bill of sale for car","Should I continue to trust my lawyer? Should I push forward with preliminary hearing?","I have $7K of credit card debt; $21K of student loans; I might move to another country and I'm not sure what to do [VA/MX]","Company Overpaid a Benefit in 02/2018 and is Demanding a Repayment","[GA] Friend rented car for 1 day for set amount, after he signed, amount was changed without informing him, nearly doubling costs","Hearing Officer ruled in my favor after company that didn't pay me did not show up to hearing. What is my next move?","Car dealership commercial with major logos on apparel.","[WA] Taking my own Stock Photos of branded Products","SO was told “we won’t pay you if the sales target isn’t reached”","KY. Can you be brought in for a bench warrant when you go to the courthouse to get it removed?","Texas - is landlord responsible for mold testing in rental home?","Stopped renting an apartment from a company in Athens, GA and now I'm being charged with over $100 in cleaning?","[QUESTION] About youtube promotion of a musical","Time limit to remove your items from private property in new jersey","[NJ] Landlord keeps scheduling no-show realtors","Is there a way to benefit from pointing out the solution to a public-but-unnoticed problem with a company?","Authorized Service Center refuse to return my car","Is there any type of help I can get with this situation currently happening with my girlfriend at college?","If my former employer filed for bankruptcy and is shutting down, does that nullify the non-compete I signed upon being hired?","Ex won’t title my old car in his name. What can I do to protect myself? (Utah)","[IL] My girlfriend was not paid for work that she did.","In CA husbands company work truck got broken into, over 3k worth of tools stolen.","Can I be held to purchase a car?","Moving from CA to NV to be with fiance - can I collect unemployment?","Greedy Aunt Taking Inheritance","Is it worth disputing an unjust parking ticket?","Can I get out of a lease","Including video of random kids playing my game in a document","Tax Consequences to Employee for EPP for Health Insurance Premiums?","Potential Negligence by Academic Entity [Pennsylvania]","No Animals allowed including Service Dogs CA","Customer owe us 32k, We are in CA and he is in IN","Still being harassed by auto repair shop","(Canada) Can a newspaper agency push the cost of business phones onto contractors even if they have been using a personal cell all along","Potentially Stolen Data by Public Official","Roommates trying to evict me (Ontario, Canada)","Unlivable conditions - Condo Owner","Got asked to join a similar startup. Wants to dissolve our company and have us join their team + equity.","Dad passed with no will--what to do with car loan? Texas","State turned my driveway into a road - who is responsible for upkeep?","Signed a new renting 1 year lease in Vancouver, BC with signature and even paid the security deposit. Leaser now wants to back out.","Giant ceiling A/C unit fell and injured me at the grocery store [Ohio]","Question about filing an Answer late","Lawyer needed or no lawyer?","New York City Apartment has no gas since May","(Un)Common Law Marriage","Attempting to draw from a \"defined benefit plan\" pension from the Laborers' Union early.","Some help understand wills &amp; such, please and thank you","Parking Ticket at Clemson University (SC, USA)","Advice please","I have ADHD and was selected to be on a jury. Is there any way I can be excused? (NYC)","Can a private investigator actually file criminal charges against someone? I'm being threatened with criminal charges for returning a car rental late. Thanks in advance.","Mentally disabled 18 year old child (NM and TX)","security deposit returned","I live in a college town and my housing company wants $1900 for a new paint job from inside the house","Need advice on paying speeding ticket fine","Now 3 months without a car under extended warranty","School Refusing To Help/Causing More Issues For Niece, What Ca We Do?","Verbal death threat from coworker (MN)","What is my responsibility for incorrect refunds [California]","Ashes taken out of an urn (LA)","Advice on possibly suing a scam company","Child Support Amendment","Family Issues","Recieved dismissal hearing notice (custody)","Please Help!! Fired","Reporting a local cult","Freelancer Agreement Paperwork","How to check if I have a ticket?","I live in Kentucky, U.S. what does it take to file a protection order against my narcissistic mom?","Where should I form my LLC?","[Oregon] Are arrest records mandatory public domain?","[California][21+] Legality of a city tour bus \"giving\" marijuana","Is this blackmail","Employer consistently late with payroll - do I have any options?","Am I legally obligated to perform?","People (company I found on yelp) lost my pet the day I returned from a trip","Can I contest these absurd charges from my paralegal?","A medical manufacturer is threatening me over an eBay listing","Previous employer threatening law suit over name usage on fb?","Security Deposit Rights in New Jersey","Is it legal for a parent to send a bugged device into their underage child's counseling session?","Trying to claim Smartphone damage on Travel Insurance","Purchased game after a free weekend, refuses to boot","They stopped paying me. Can I ignore my notice period? Non-compete?","Commercial landscaper breaks back truck window while mowing, apologizes and promises to fix....now crickets. Time for small claims?","I NEED LEGAL ADVICE ABOUT AUTO ACCIDENT.","(TN/GA) Ex-Employer Unauthorized Personal Email Access","Employer wants to fine me $400 for leaving the company? Can they do that?","Can I blow or put tree dropping back on neighbors property?","I believe I'm being punished unfairly by the Indiana County court system","Believe my BF was wrongfully terminated","Wells Fargo suing elderly father","My college closed down. What legal steps can I take to get money back now that my future is off track and I cannot finish my program of study?","[TN] Caretaker refusing to give up inheritance intended for someone else","A doctor denied me a referral for surgery that she was fully capable of writing because the surgery is related to gender transition. Is this discrimination in California?","Collections in SC?","Sister made a post about her ex assaulting one of her friends, now has received a cease and desist letter and is being threatened with a lawsuit.","I accidentally sent PHI to a doctor's unencrypted email. This is 100% a HIPAA violation. Will I go to jail?","Mail Insurance Fraud","Sexual assault in the family - speaking after all those years?","[NY] Wife moved out and took our child. How do I get my child back into the family home?","My girlfriend is being sued by Wal Mart. Please help!","Can I force my mom to get mental help? (US,GA)","Car broke down at a On-Ramp stoplight, used diamond lane to go around the broken car, then get a ticket a mile down the freeway. Do I have any legal justification for my actions? (WA State)","Found out my house that I purchased 2 years ago is 250 square feet smaller than it was listed at - Oregon","Upcoming Divorce","Encouraging vandalism on Youtube","Random Drug Screening in MN","Landlord refusing to fix AC (VA)","New Hampshire — previous employer/3rd party administrator revealed home address to estranged spouse","Do I legally have to have a month sticker on my car? UT","My job's tip ratio system seems awful and possibly illegal.","I think my husband put a tracking device on my car, what can I do if found?","Urgent Change in Power of Attorney, and Legal Hurdles Moving Forward [CA]","Re-renting Comparable Unit - Obligation to Pay Rent?","Handicapped Driving, Everyone has different opinions and I dont know what's true anymore.","CANADA: What happens to businesses when one of 2 partners passes away?","How do I find out what day I can get my license back in New York?","Can’t do job after surgery- temporary disability? (OR)","[PA] Need advice for evicting girlfriend from house I own","Buckle up for a real doozy...we need help!","Planning on using text books to make educational YouTube videos","Dog Bite","Question about letting in-laws stay at my apartment for a week and a half.","Speeding ticket 91mph in 55mph zone FL","How do I fight a parking ticket when I have proof that the car was someplace else? [California]","Roommates paying $100 less a month on apartment","Accused of sexual misconduct","What do I put for condition of premises on my lease?","Package went to pervious address. Was signed for and stolen. What step should be taken?","Sam’s club managers are forcing me to renew my forklift license. Are they allowed to do that?","Lawyer calls &lt;48 hours before court. Not sure if this is good, bad, or neither","Employee error while ringing in an invoice which was difficult to read. Is the employee obligated to pay the difference or the customer?","I think I’m owed a lot of OT pay over the past 4 years","someone keeps spitting on a colleague's car","NY Felony DUI","Mo mate along money?","BMW Dealer Issue","Tournament 'buy-in' fee - is it gambling?","Neighbors dogs are barking EVERY night (CA)","How does one find a good immigration lawyer for a K1 visa?","Does this qualify for sexual harassment and discrimination?","A friend is in danger of marriage fraud.","Pregnant from One Night Stand with Stranger","Remote Job question","I live in Arizona and my father who is disabled and has a really hard time leaving the house was served a summons for a credit card debt.","Roommate refuses to deal with cat.","[AR] Biological family making accusations about adoption.","Just curious","[CA] undocumented immigrant considering personal injury lawsuit","Served notice by my HOA's Attorney for \"noisy support animal\".","Can my mom stop an adoption?","My girlfriend is 16 and I’m 17","I paid a $250 deposit + $25/mo for a pet, and I was put in an apartment with someone who is allergic to cats.","Is there any way to get my dad out of our house? [CA]","[CA] Neighbor threatened sexual assault after we confronted him about frivolously reporting code violations","Front house tenant trying to kick out my girlfriend from the premises. I rent the back-house.","Did my dentist violate confidentiality?","NJ: Car insurance company reporting false information about me.","Accessing Chromebook after family member passed away","Oklahoma: Doctors are refusing to look at paperwork, denying cancer and other diagnosis.","I’m 16 years old and work at a Chickfila. Can customers record me?","CO: Mining company wants to buy our suburban home's mineral rights.","I was harassed and followed by police for supposedly matching the description of a suspect, was what the police officer did legal?","My soon to be ex is forwarding my mail and admits it. She shows no sign of stopping, I'd like to go the postal service, but I'm hesitant","Uber driver offering on the Side services, is this legal?","Can a Landlord Enter Apartment without consent?","Is my ex-employer legally bound to pay out the rest of my commission even after I quit?","[Netherlands] Parking ticket, 8 weeks for a permit?","Went to bootcamp but had to leave due to medical reasons, military wants me to payback about $300 they said they overpaid me.","Do I have to go? (CA)","Company taxing 401k and union problems","GPR in New York State","Sister in Law abandoned Brother during battle with brain cancer, cannot be contacted to settle estate.","A gig I worked has not paid yet","Didnt \"technically\" break my lease but landlord says i did. Then he reserved 2 days for another renter. Now wants me to vacate for 2 days and pay normal monthly rent amount.","Pulled over for Window Tint","Starting an online business as a teen.","[ON] Can someone help me interpret this","[CA] Sued by listed vexatious litigator - Options?","Neighbors damage fence for looks.","Question on funerals","Will a past conviction bar me from being a teacher?","My father had a Traumatic Brain Injury and cannot take care of his person. He did not leave a living will. Guardianship process seems to take a very long time. Is there an alternative solution?","I want to change the New York State flag cuz it looks outdated. I've been on Googling for a few days now and I can't find if Senators, congressmen, or committee deal with the changing of a state flag.","Injured in a store, caused by my kid, their insurance is calling me (PA)","Haven’t been paid in 3 weeks, employer not sure if I am going to be paid by the end of September","Do I have to raise my baby if his father won't, but won't consent to an adoption?","Moving into my old apartment, previous tenants damaged it.","Can my employer require me to download a mobile app? [FL, USA]","Is it legal to kiss a minor romantically? (OH)","Landlord died - what do I do with rent? (Location: Oregon)","Is it legal for public schools to auction parking spaces? (US - California)","Quebec- question about shady brother and inheritance","Should I challenge for my security deposit?","[WV] How do I know if I've been given a reckless driving charge?","Small Engine Repair Guy Trying to Steal $500","Is it legal to donate some of your pay back to your employer?","(US-HI) \"Target move-in addendum\" legality in lease; did we mess up?","Can an injured worker be required to used FMLA?","[CA] [renters advice needed] landlord owns two side by side buildings. I rent a rent controlled 2 bedrm in building A and a two car GARAGE in building B. The rent on the apt has increase by 3% every year w/no increase on the garage. They just sent a letter increasing the garage by 50%! Help please!","California Romeo and Juliet Laws?","Child Protective Services","Can I kick my cheating husband out?","Medicaid question (texas)","I got added to a large company's email chain, and now I have access to their unreleased stock valuation report","Labor law in Maine","Fixing s fix it ticket quickly [CA]","Do I have a case? Possible FMLA/disability discrimination","I'm doing a youtube sponsored video for $3,000. But they're not sending me a contract, is it safe to upload the video?","Apartment falsely advertised unit as furnished: can I do anything?","Can you make an online betting platform now that PASPA was repealed?","(KY) I owe money in a divorce that's not mine.","Received a caution for having weed in my bag. Have to have an interview with the police and my mum...","Screwed out of my security deposit for roommate’s unpaid rent","Helping my grandpa, county is putting in sidewalk, worried that he is liable","Disputing debt","Someone totaled my car, then stuck me with a repair bill!","Any help is appreciated! Possible identity theft?","My ex is threatening to come to my town and have the police let him into my apartment to get things he gave to me? Virginia","Design mark verses word mark? Trademark question.","Is \"False advertising\" a real thing?","No clue what to expect","Is it technically kidnapping?","Arizona ADA Violation?","[NC] Liquour store denied me service","Forced from 1 bedroom to 2 bedroom","Will I be arrested if i file a police report tomorrow?","Disintermediation: I'm a freelance photographer cutting out a marketing company to continue work with a client.","Could I sue for malpractice? (California, cancer patient)","Death threats to my girlfriend and her mother from father with a history of violence.","Landlords charging more for amenities than outlined in the lease?","[FL] [PR] Girlfriend has a child which was conceived in Puerto Rico. She lives in FL. He has never made a child support payment and she is struggling financially.","Haven't seen my son in over a year. Where do you even start? (Tampa, Florida)","Significant changes in lease the evening before move-in.","Employer told me I had to wear make-up to work.","Wife had a multi year affair, I want out but she refuses to sell the house, options?","WA/Seattle. AliExpress false advertising","Tried buying a car today and found out on a terrier watch list?","Strata - No Pets","Need advice around entering Canada with a misdemeanor","As I was pulling out of my parking spot at a grocery store a cart rolled into my car then careened off of my car into someone else's. Am I somehow at fault?","Can my boss cut my paid lunch from 1hr to 30min even though it's in my contract?","A trust was set-up in my name by one relative, the executor of that trust just died. What happens next?","What can I do about a debt collector violating my rights?","My dog ran into a neighbor’s sprinkler tonight and broke/damaged it. [CA, USA]","First time drug offences [Australia]","Will My In-School Suspension be on my record?","Copyright lawsuit over a photo","Concerned about a consent form that asks an unnecessary amount of private information","Can a minor hold a title to a boat in VA?","Steps to take for landlord harassment and tresspassing?","Dropping from my wife's employer insurance, special event?? (California)","Laws for renting out rooms/breaking a \"lease\" [WA, USA]","[MN] Daughter renting ground floor room with bad window locks","Email harassment?","How do I find name of firm/lawyer that represented defendant in a past lawsuit?","Help me help a friend","If a landlord fails to return a deposit and/or a list of deductions within the state (Alabama) maximum, can they deny a return based on damages cited after this date?","[PA] Can I drive someone else's car (whose insurance is currently lapsed) if my insurance is currently valid?","How to handle my dad wanting to take my mom to court","Disputing unfair charges after moving out of apartment","[TX] False advertising of apartment; do I have any grounds to fight for a rent reduction or even a lease termination?","(still) fearing for my mother’s life","(NE) Alcoholic \"paralegal\" is threatening to sue me for acting as an agent on behalf of my sister the landlord to evict him.","How long does someone have to contact you after you hit their parked car?","1 [NYC] Trying To Cancel A Contract / Waiver, Does It Hold Up?","Paid a famous artist for a feature. He came through. Now what","I am an Indian citizen who got married under California law in California. Where do I apply for a divorce? In California or in India?","[FL] Horse boarding and contracts. Stable owner threatening police.","Family business mess (revised).","In the state of California, i read that a first cell phone violation offense is not counted as a point against your insurance. As someone with a low income, is it worth requesting traffic school to get this first offense taken out of my record?","Pursuing a debt","Dealership Sold Us A Certified Pre Owned Car With Many Problems","Related to child labor laws","Arizona: Underage Driving with Liquor in Body","Medical Malpractice","My mom and her boyfriend are harassing me.","Request for deposition in regard to an incident at a previous job from 2014. What are my legal obligations?","Can my employer give extra break time to a certain group of employees even though we are all under the same contract.","Employee is embezzling money from our Painting Subcontracting business in Phoenix, AZ. What should our first course of action be?","I think I talked to a pervert","Lease Terms Question","Real Estate issue in Missouri","[MA, USA] Confusing landlord/tenant situation","[IL] can I kick roommate out if he stops paying rent","Condo corp bankruptcy (Alberta, Canada)","California: Cops came to house to question about a recently busted massage parlor. I answered questions and then they left. All clear?","So I work at an arcade.","VA Business Legality Questions (Investment Firm)","Unemployment Claims and Appeals - Help!? (MO)","Old apartment complex is trying to get me to pay for a new room.","Silver coins stolen, we know who stole them, S.O. does not want to file police report","[AZ] My mom wants to set up legal papers to give me custody of my brother and sister in case of her death. How do we go about this?","Neighbor urinating on my fence. What are my rights/what can I do?","[OH] Landlord making me pay with Military orders?","OWI- should take the plea or aim for suppression?","child support - levy - disabled vet about to be homeless","[MA] Defending against Small Claims inquiry","Quitting my job, I want to take my payroll files for IRS purposes, can I do that?","WestJet Printed the Wrong Boarding Pass","Employer didn't pay me last year for work, and I have proof.","Is it illegal for my job to not give a tip share?","Unfair Dismissal","My motorcycle was stolen and later recovered by police. Now what?","Landlord is charging my entire security deposit with complete lies. Says they had to clean the dishwasher when I didn't even have one.","My employer may be withholding access to shares promised in my contract","Municipal water included in rent, city has shut off water. Do I qualify for rent abatement/reduction?","FTC Telemarketing Sales Rule Violations","NY Underwriter who is also a Notary; Pecuniary Conflict of Interest?","My father is being sued in small claims by a gym owner.","Investigation necessary?","I was in a car accident this morning. The other driver switched seats with the passenger. Have some questions.","[NJ] I was assaulted and filed a formal complaint against the man who assaulted me. Now he's filing a complaint against me.","Accountant Step Mom won’t give me my 2016 tax return and I need it for school","Receiving works compensation after being fired, going bankrupt and may have to leave school because of expenses.","How do I go about legally selling my home roasted coffee beans?","Los Angeles - Car accident, not my fault, waiting on their insurance to fix my car - how long do I have to wait?","(IL) Illegal to drive with no hood?","Would I be breaking my lease agreement by owning a pet rat?","NYC Dog Bite","Need help...getting the engine replaced in my 2005 Subaru Legacy GT/Turbo. Approximately 2.5 months later and I still don't have my car back.","What tax liability am I in with a roommate that lives with me without a lease?","S-corp distributions/tax help for the love of all good and evil.","Might be emancipated/kicked out - what to do/know [MA]?","Insurance failed to submit proper forms after car accident resulting in towing and court fees, can I demand reimbursement?","Small Claims Court Question (CA)","Fraudulent traffic ticket in my name.","What do I do if I don’t want to sign a lease that was written up for me?","My Boss is continuously treating me poorly and I don't know how to act (NJ)","Can you mail prescription pills from Canada to US?","(CA) Placed on Paid Leave from a School","Need help finding a way to prove that three people rented from a house at one point","I know I need a lawyer, need help thinking of questions","[WI] What constitutes stalking in Wisconsin and what are the proper channels to stop it?","Landlord attempting to charge everyone for excess water usage","Wage issues with company owned by close relative(OR)","Personal Injury / Property Damage / Sherrifs department","[AZ] Employer may have broken the Federal Anti-Kickback Statute (AKS)","[CA] Is it legal for your employer to say you don't get a 15 minute break if it's scheduled for a specific time but work duties take you past said time?","Subpoenaed to court after being rear ended","Just backed into a car, what are my next steps? (US)","HOA Management Contract Woes","(virginia,usa) my employer signed my time card after i worked unapproved overtime.","TX-Subrogation claim for accident that didn’t happen","Old criminal record expungement possibilities [NC]","Considering the purchase of a home served by a privately owned community well. What could go wrong?","Apartment Got Sold To Another Company- Policy Change? (Washington)","[AR] Can a private practice doctor deny my spouse medical care when he owes a balance he doesnt actually owe?","Update to jail for contempt in family court (Mass)","Agreed upon compensation reduced after one month??","2nd week as college freshman and our dorm got raided by campus police.","Im scared im gonna go to jail","EDD UI Transfer to SDI","Possible Slander/Defamation?","Resisting arrest","Can a landlord force a political sign?","Red light violation while driving someone else's car","Partner was held involuntarily in a hospital ER for a mental health condition.","Optometrist charged me for an optomap retinal scan. Was he right to do this?","Will a sealed case come up on a background check?","Trying to retrieve my wallet.","Landlord and Roommate trying to kick me out 3 days early for new roommate to move in.","so this might not belong here, but here it goes. It's about divorce.","What does an NDA restrict me from saying in cover letters for new jobs?","[CA] Filing Insurance Claim for Past Incident That Was Never Reported","An out of state seller did not disclose a major issue with a vehicle","Filing for unemployment..."]