["Hi, I’m Forbes contributor Scott Mendelson. I've studied the film industry, both academically and informally, and with an emphasis in box office analysis, for 28 years. AMA!","Schindler’s List 25th anniversary re-release Poster","Alec Baldwin drops out of ‘Joker’","First Man - Official Trailer #2 [HD]","First Poster - Orson Welles’ 'The Other Side Of The Wind'","First Image from Paul Verhoeven’s Erotic Thriller 'Benedetta'","Rotten Tomatoes Announces Major Overhaul to Their Critics Review Process","Horror Is Having An Insanely Great Year","My Wife and I love 90's Movies...So we decided to recreate our favorite Posters for our Wedding","The Original 'Power Rangers' Movie Is a Glorious Tribute to '90s Excess","Dwayne Johnson to star in WB’s “Epic” Kamehameha directed by Robert Zemeckis","The Other Side of the Wind - Official Trailer | Netflix","‘Walking Dead’ Effects Specialist Greg Nicotero Joins ‘Spawn’ Movie","Silvano Campeggi, movie poster artist of Gone With The Wind, Casablanca, Singing In The Rain, and more, dies at 95","Wile E. Coyote Film Officially in Development at Warner Bros, Finds Its Writers","‘First Man’ Reviews Praise Damien Chazelle’s Revelatory, Gritty Space Drama","First Man Venice reviews hail Ryan Gosling's 'turbulently spectacular' Oscar hopeful biopic","‘Star Wars: Episode IX’ Casts Matt Smith in Key Role","'Schindler's List' will return to theaters for its 25th anniversary","Netflix Mulls Giving Alfonso Cuaron's 'Roma' an Exclusive Theatrical Run Before it Debuts on the Streaming Service","How many of you have stopped watching trailers?","Peter Dinklage talks Hervé Villechaize movie, addresses casting controversy","'A Quiet Place' Sequel Receives May 15, 2020 Release Date From Paramount","Original ‘Jurassic World’ Script Featured a Raptor Helicopter Jump &amp; Completely Different Characters","‘Suspiria’: Why Tilda Swinton and Luca Guadagnino Still Love Working Together After 19 Years","Top Gun: Maverick pushed back a year to June 2020","Judge Allows 'Spinal Tap' Creators to Move Forward on Fraud Claim, Seeking $400M in Damages","Guillermo del Toro Addresses Gender Disparity in the Film Industry: ‘It’s a Real Problem’","Not sure if this is the right place to post this but I'm in Paris for a few days so though I'd try to recreate the final scene from Jean-Luc Godard's \"A Bout De Souffle\"","Cronenberg &amp; retrospective coming LA for Beyond Fest","Netflix's Coen Brothers Western 'The Ballad of Buster Scruggs' Receives November 16, 2018 Release Date, Netflix Planning Awards Campaign","Can anyone recommend me some angsty teen movies?","NIANDER WALLACE 3D Portrait from Blade Runner 2049 by Pasquale Giacobelli","How \"The Thing\" Hijacks Your Brain to Scare You","[OC] I took the top 75 posts of the past year on /r/Horror and found the top 10 most mentioned horror films","New poster for birds of passage","Latest Luca Guadagnino's \"SUSPIRIA\" character poster","What's your favorite overused trope in cinema?","Damon Herriman cast as Charles Manson in Tarantino's 'Once Upon a Time in Hollywood'","Just rewatched Creed. Stallone was incredible.","Star Wars: The Last Plinkett Review","I Think We're Alone Now - Official Trailer","Jonathan Pryce on working with Glenn Close, playing Bond and Bradbury villains, and the many sides of Terry Gilliam","\"Operation Finale\" Grapples With the Banality of Evil: Chris Weitz’s new film stars Oscar Isaac as one of the agents who captured the Nazi war criminal Adolf Eichmann (played by Ben Kingsley) and transported him to stand trial in Israel","Michael Jackson's Thriller Is Coming to IMAX 3D","Every Best Cinematography Winner 1929-2018","Iconic scenes from Jurassic Park (1993) before and after Industrial Light &amp; Magic added it's digital effects","What relatively normal song is used in a super creepy way in a movie?","Can anyone recommend some wholesome feelgood movies?!","Thriller 3D coming to IMAX for limited release","John Cho On How ‘Searching’ Innovates The Traditional Thriller","Anyone know what happened to the Kung Pow: Enter the Fist sequel that was announce in 2015?","A Quiet Place sequel gets 2020 Release Date","Hereditary is bone chilling","[serious] Two questions. 1. Favorite horror movie no one talks about 2. The one horror movie you love but everyone hates","First Man, Oct 12, MetaScore [84], Hollywood Reporter: \"This sober, contemplative picture has emotional involvement, visceral tension, &amp; yes, even suspense, in addition to stunning technical craft.\"","Sonic Movie Release Date Moved To November 8th, 2019","Liam Neeson to make film about Tuam mother-and-baby home controversy","Deon Taylor to Direct Sony's Body-Cam Cop Thriller \"Exposure\"","'Top Gun 2' delayed one year, sequel moves to June 2020","What are some noticeable, reoccurring traits of your favorite director's films that you really love?","Who here saw 2001: A Space Odyssey in IMAX over the past week? Worth it?","Detective Pikachu Is Aiming for ‘Photorealistic’ Pokemon","Anyone know the name of a christmas movie (probably from the 90s) where a girl goes to live with her grandma, because her parents died while practicing an acrobatic stunt for the circus. She's depressed and not in the Christmas spirit because she blames herself for their death, and she starts...","An Interview with Minding the Gap Director Bing Liu","Micheal Jai White should be a major action star","Russian Ark. Feature length movie, single take. Amazing film bridging hundreds of years of Russian history filmed in the Hermitage museum.","What is the most unrealistic courtroom scene in a non-comedy movie ever?","I just got back from The Happytime Murders. Why is nobody talking about how many jokes they stole?","What Killed The Happytime Murders","When an innocent and sincere \"Brothers Together\" school photo reveals who your children will become when they grow up... OR IS THIS ACTUALLY THE TEASER POSTER FOR THE STEP BROTHERS PREQUEL?","In need of movie marathon ideas. Help me.","Steven Spielberg’s Multi-Oscar Winning Film ‘Schindler’s List’ To Receive 25th Anniversary Re-Release","‘Once Upon a Time in Hollywood’: Quentin Tarantino Finds His Charles Manson in Australian Actor Damon Herriman","Someone in Argentina looseley remade Rob Schneider's 2001 \"The Animal\"(ANIMAL Trailer oficial (2018))","Van Damme was the Predator. Why was he fired?","Bad Times at The El Royale - Trailer #3","What's everyone's top movies of 1988?","Horror Movies Coming To Shudder SEPTEMBER 2018 - All Horror","Keanu and Winona Ryder reunite in a romantic dramedy","What is the most interesting deleted scene/unused ending that you've read about, yet have seen no footage?","I love Ridley Scott's historical epics and I don't think we'll ever get one again","Need help remembering a thriller movie about a mirror dimension","What amazing movie had a terrible poster?","Your favourite cult movie","For those who haven’t seen this awesome movie. (or the fastest user)","Has anyone seen Girl Asleep?","What If Every Robot Was A Dalek? - Supercut","Sleeping Dogs is on the way with Donnie Yen set to star - Martial Arts Review","Akira Kurosawa's Cinema: A Film Festival at Home","'First Man' - Review Thread","Movie I can’t remember.","Are there any examples of old screenplays that have been used to produce modern films?","Ron Perlman's Crime Drama ‘Asher’ Receives December 7, 2018 Release Date","Similiar movies to Chungking Express and Fallen Angels?","Searching is far more important for Asian American representation than Crazy Rich Asians","Blade Runner 2049 made me realize why some people don't like Blade Runner","DOMAIN - Official Trailer","An intimate interview with Desiree Akhavan, film's most exciting outsider","Alec Baldwin cast as Thomas Wayne in ‘Joker’","'Fantastic Beasts,' 'Bohemian Rhapsody' voted Fandango's most anticipated 2018 fall movies","Deadpool 2 Blu Ray question","Interested in learning how to have a critical eye when watching movies/how movies a constructed. Any youtube channels good for that ?","Fellini Part 1: City of Women, Feminism and Cinema","‘It’s Enrico Pallazzo!’: The inside story of ‘The Naked Gun’ baseball game","The Princess Bride is a awesome movie.","Critically average movies that are actually pretty good.","I watched \"Everybody Wants Some!!\" again last night. This movie truy brings me so much happiness. [SPOILERS]","College students - what movies are on your syllabus this semester?","Schindler's List 25th Anniversary - Official Trailer - In Theaters Decem...","New Suspira Clip - \"Improvise Freely\"","Overlord poster","What scene in a motion picture genuinely made you smile out of joy?","Novelty Filmmaking in Searching: An Interview with Sev Ohanian","Which Director who does NOT have an Oscar is the most Shocking?","A Lonely Place to Die blew my expectations completely out of the water.","New poster for I'll Take Your Dead","Apparently, the letter from the FBI that was made famous in the film Straight Outta Compton is now enshrined in the Rock and Roll Hall of Fame.","What is the worst Bond movie and why?","'Schindler's List' 25th Anniversary - Official Trailer","‘Gravity Falls’ Creator Alex Hirsch Signs Netflix Deal, Includes New Movies and Shows","I'm Looking for films that feature one of the following tropes.","Suspiria Remake Gets UK Release Date And Distribution - 100 Cinemas from 16th November","\"What Christopher Nolan's First Film Teaches Us About How He Directs\"","An essay on Hurricane Katrina inspired films BAD LIEUTENANT and BIG CHARITY","Danny Strong, Sydney Sweeney join Quentin Tarantino's 'Once Upon a Time in Hollywood'. Polish actor Rafal Zawierucha has been cast as Roman Polanski","Dwayne Johnson's 'Big Trouble in Little China' Film Will Not Be A Remake, It Will Continue the Story","How long is an acceptable amount of time before re-adapting something?","‘Lost In Translation,’ 15 Years Later: Sofia Coppola on Ending the Film on Her Terms and the Year It Took to Cast Bill Murray","Johnny English Strikes Again - Official Trailer #2","Scarface Explained For Minimalists!","Halloween Movie Poster (2018)","Graham Humphreys' Ghost Stories limited edition poster","The ultimate genre defining movies that are also a parody","Why hasn't this gained more attention? Watched \"The Imaginarium of Dr. Parnassus\" recently.","Nettflix’s Latest Price Hike May Have Scared Away Low-Income Consumers","Del Toro's Scary Stories to Tell in the Dark begins shooting, reveals full cast","New poster for I Still See You starring Bella Thorne","A.I. Artificial Intelligence should be re-evaluated","Sour *New animation trailer","New still from Panos Cosmatos' \"MANDY\".","Fan Made Action Trailer for Fantastic Mr. Fox","The Big Lebowski is one of the best movies I have ever seen.","A side-by-side, shot-for-shot comparison between the 1976 film The Omen and its 2006 remake","Dead Man's Shoes. A hilarious, yet disturbing tale of vengeance.","A high school football movie I can’t remember the name of.","Rambo doesn't actually kill anyone in First Blood (1982), hockey mask Jason Voorhees doesn't appear in Friday the 13th (1980). What other common/iconic movie misconceptions are there?","If Bond 25 comes out in 2019, Daniel Craig will surpass Roger Moore's 12 years as James Bond and becomes the longest reigning actor to play arguably the most iconic movie character of all time. (2006-2019)","New Poster - Horror Thriller 'HELL FEST'","Is it a better experience to watch horror movies alone in your home, or at theaters?","First Teaser - Natalie Portman Is a Bowie-Esque Pop Star in Mysterious Vox Lux","A basic observation on Inglourious Basterds","Trench 11 - Official Trailer","'Capernaum' by Nadine Labaki","Have you ever watched a movie just to better appreciate a parody?","What Christopher Nolan's First Film Teaches Us About How He Directs | Following","Discussing Grave of the Fireflies (Isao Takahata Analysis)","Common question, but where do you personally rank the Bond actors?","Today is the 10th anniversary of the Imfmous movie Disaster Movie","Cary Fukunaga Left ‘It’ Because The Studio Thought They ‘Couldn’t Control’ Him","Favourite reactions/reaction shots by a character in a film?","'Crazy Rich Asians' is just called 'Crazy Rich' for the German cinema release","What film do you think deserved a sequel but didn’t get one?","Hot Toys’ JOHN WICK Is the First of Many New Keanu Reeves Figures","Francis Ford Coppola's notebook made during the production of The Godfather","BAYOU CAVIAR - Trailer | Cuba Gooding Jr., Famke Janssen, Richard Dreyfuss, Lia Marie Johnson, Katharine McPhee","Woody Allen is Taking a Break From Directing, First Time Since 80s","The 10 scariest haunted house movies ever made","BAYOU CAVIAR Trailer (2018) [HD] Cuba Gooding jr., Famke Janssen Movie","The Apartment (1960)","Is the music in The Truman Show for us or for the viewers in that world?","What is the relationship between violence in film and violence in the real world?","Can we stop assuming Once Upon a Time in Hollywood will be violent?","Nick Jonas Joins Kelly Clarkson, Pitbull in Animated 'UglyDolls' Movie","Terminal (2018) Discussion","Looking for a european movie about a woman who steals her boyfriends motorcycle and gets into all sorts of trouble in the city.","Venice Jury President Guillermo del Toro Calls For More Gender Equality During Venice Presser","Movies that change meaning from different points of a life","The Oscars Sell Out","Spike Lee Joints, Ranked","Just want to share some love for \"Pin Cushion\" (2018, dir Deborah Haywood)","The Cook, The Thief, His Wife, Her Lover Tribute- Brows Held High","Who remembers Animalympics?","Can someone help me remember the movie I'm thinking of","Romantic comedies are having a moment. Can it last?","The Man Who Feels No Pain | Trailer (2018)","Uwe Boll talks about his 10 favorite movies with Josh Olson and Joe Dante","The torture scene from Casino Royale combined with footage from Idiocracy.","Why do people remember Moana more than they do Zootopia?","A list of horror movies I've watched recently and they all are worth a watch","SHUT UP ABOUT PLOT HOLES","Box Office Week: Crazy Rich Asians has an incredible second weekend at #1 with $25M, a drop of just 5.7%. The Happytime Murders flops at #3 with $10M on a $40M budget. Global Road has another bomb with A.X.L. opening at #9 with $2.9M, the same week financiers took control of the company.","2001: A Space Odyssey (50 Years Later) vs Interstellar","Transformers (1986) is returning to theaters this September for one day","Sicario: Day of the Soldado composer Hildur Guðnadóttir to score DC’s Joker movie","Oscars: Japan Sends Hirokazu Kore-eda’s ‘Shoplifters’ Into Foreign-Language Race","Summer 2018 box office: what can we learn from the hits and misses?","Super Frequent Movie-Goers, what are some movies you refuse(d) to see this year?","[MASSIVE SPOILERS] A detail about the daughter in Hereditary made me feel uneasy. Wondering if anyone else felt this way...","I recently watched Drive (2011) and Nightcrawler (2014), any other movies about crazy stories that convey the atmosphere of a city like those did with L.A.?","Better Watch Out review","New image of Tilda Swinton in Luca Guadagnino's 'Suspiria'","Johnny English Strikes Again Trailer #2 [HD] 2018","New Poster - Eli Roth's 'The House with a Clock in Its Walls'﻿","Horror Movies Coming To Hulu SEPTEMBER 2018 - All Horror","New MPAA/CARA ratings and reasons for the week of Wednesday August 29, 2018","Has anyone seen Netflix's TAU?","The Making Of Goodfellas (26:00)","Question about the film Without (2012)","On this day in 1962, David Fincher was born. Filmscalpel compiled 7even video essays that dissect his method and madness","Okay please help me find the title of this movie.","Could Warner Bros. potentially set a new standard for movie trailers?","Johnny Depp Wins In Oral Contract Battle With Ex-Lawyers; Hollywood Jolted","'Suspiria' Director Luca Guadagnino Hopes Horror Remake \"Comes Across as Relentless\"","Looking for a science fiction movie made in the 90s (maybe)","Credit naming conventions","Recent “Competence Porn” movies?","Are The Universal Monsters Worth My Time?","‘Crazy Rich Asians’: A USC Student Reinvented Coldplay Song ‘Yellow’","Isle of Dogs put the subtitles underneath the picture (in the black border) Is this a new development? Why can't every movie do this?","Predominance of a specific movie genre in different periods of time?","Movies that emotionally destroyed you","Trench 11 (2018) Official Trailer HD","\"Four or five moments\" (Deadpool)... where do I know this from?","Failed Franchises.","Korean teaser for RAMPANT, a Joseon dynasty-set action zombie movie","How to make Moana better","What are your top favorite non-Apatow related straight-comedies of the last 10 years?","Are there any newer movies in the style of \"Watership Down\" or \"Felidae\" ?","'Galaxy Quest' And The Greatness Of Sigourney Weaver","What is the name of this movie","Any movies like Children of men where they show the life in a \"functional society\" after a big disaster?","What was the most notable film cancellation of all time?","Polarity Contest (The Big Picture)","Upgrade","MoviePass Poll: Customer Satisfaction Plummets, Nearly Half Consider Bolting","Eternal Sunshine of the Spotless Mind- Ending.","The killing gene was messed uap!","Global Road Film Studio Braces for Layoffs","My drawing of the best shot from a phenomenal movie, The Blackkklansman","Is it fair to say that an ode to Spike is the same as an ode to Chuck D, to Malcolm, to MLK...","THE MOST BEAUTIFUL COUPLE Trailer | TIFF 2018","2001: A Space Odyssey IMAX Rerelease","A movie that has a monster that is sunmoned when one thinks about it?","According To Disney CEO Bob Iger Their Streaming Service Will Be Called \"Disney Play\" - Iger says it will cost less than Netflix and be a \"suite\" of services.","Rewatched The Dark Knight in IMAX - still an amazing movie.","Please help me find the name of this horror movie!","Philip K. Dick is the prolific author behind your favorite science fiction.","A PRIVATE WAR Official Trailer (2018) Rosamund Pike, Drama Movie HD","Can Fall Box Office Break Records Despite Lack of New 'Star Wars' and Marvel Movies?","Amazon Is on the Prowl for Movies From Sony, Paramount","Jean - Trailer, starring Isabella Blake-Thomas and Lee Majors","Updates on Dwayne Johnson’s debut as Black Adam","Overwhelming Symbolism in Movies! (mother! discussed)","Johnny English Strikes Again - Official Trailer #2 [HD] - In Theaters October 26","I feel as if Steve Buscemi is one of the most under-appreciated and best actors of our time.","What year does ‘In Bruges’ take place??","\"Technology is Dangerous\"","Jimmy O. Yang is not in Juliet, Naked.","Movies that portray the devil/Satan as something other than a regular human?","Saturday Night Fever: I don't think it gets the recognition it deserves. Do you agree?","Extinction (2018) - Is it a prequel?","Best and Worst Accents or Impressions in Film.","Netflix's 'The Beyond' Discussion?","The Mission Impossible franchise and Tom Cruise are making each other better","If I could have directed a Mortal Kombat sequel (after the 1995 film). Long Read.","Planes, Paris, Masks and Mirrors: The VFX of MISSION: IMPOSSIBLE – FALLOUT","Don Logan - Rage and Resentment","Little Italy Review – Somehow, Hayden Christensen made a worse romance than Attack of the Clones","Rotten Tomatoes to allow more extraneous sources to include their reviews on the site","What’s your ranking of the Mission Impossible movies and why?","Box Office: Summer Revenue Booms While Attendance Still Lags","Opinion question about Tinker, Tailor, Soldier, Spy. (SPOILERS)","Depp's \"City of Lies\" Being Shopped To Buyers","Movies about silent, level-headed, stoic character who is very good at his job, preferably job in nature. Like Renner's character in Wind River who is hunter\\tracker","The Best Movies of 1998","Should you, a grown adult, go see Christopher Robin?","What’s that movie called?","After the Sharp Objects finale, I want Jean-Marc Vallee to direct a proper horror movie. His style is perfect for it.","What movie do you absolutely love but don’t feel the need to watch again?","I am so looking forward to the Train To Busan Sequel, Peninsula","Oprah, John Legend voice 'Madagascar' director's VR passion project","44 of Fall's Most Anticipated Movies in 2018 according to The Hollywood Reporter","I'm going on a Disney Marathon, watching (nearly) all their animated films and reviewing them!","Watchlist thread","Redbad - Official Trailer (2018)","What was your reaction to the ending of the original Planet of the Apes?","Regal Cinemas To Re-Release “Lord of the Rings” Trilogy in RPX","[SPOILERS] Quick question about the prison in Oldboy.","5 Minute Analysis of 80's Action Masterpiece: ROADHOUSE","Tarantino tribute video made before Django. Editing is spot on","Take a selfie with Friday the 13th Jason in Arizona Lake","Remembering the Comedic Genius of Phil Hartman","'Dirty Rotten Scoundrels' Remake Starring Anne Hathaway-Rebel Wilson Overturns R-Rating","New Poster for Eli Roth's Comedy-Mystery 'The House with a Clock in Its Walls' - Starring Jack Black, Cate Blanchett, Kyle MacLachlan and Owen Vaccaro","(SPOILERS) Anatomy of a Bad Movie, A 'Slender' Review","Celebrated Writer Neil Simon Dies at 91","GRÄNS - teaser","\"Suspiria\" Director Wants It To Be Relentless","Why Mission: Impossible is the Cure for the Common Green Screen","Charlie Hunnam: Leading Man or Character Actor?","Rottten Tomattoes Welcomes More Critics to Foster Diversity","Culturally appropriate casting question","1985 // Official Theatrical Trailer","How to prepare for Once Upon a Time in Hollywood","Does Hollywood ruin books? - Numberphile","Feels painful throwing DVD's Out","Rotten Tomatoes updates criteria to identify 200 new diverse critics to become Tomatometer-approved","A Simple Favor (2018) | Official Poster | Anna Kendrick, Blake Lively","(Serious)I don't like how movies are predominantly written/made in Hollywood","Sorry, Cannes: How Neetflix Is Invading the Fall Festival Circuit","Scenes that make you go \"Yes!\"","Christopher Robin European Premiere - London 2018 #pooh","Little Italy - Video Movie Review","Killing God Trailer","Max Winkler Helms ‘Jungleland:’ starring Charlie Hunnam, Jack O’Connell and Jessica Barden","The Killing of a Sacred Deer","MoviePass, Diversity and Good Films Led to Sizzling Summer Box Office","SPOILERS at the end of Casino what was the thing the guy in the car was hit with?","Screenwriter Dan O'Bannon had worked on Alien for many hard years. He felt unappreciated and frustrated for so long. Here he describes the day it finally opened in cinemas","Regurgitate Unpopular Opinions Here","Why Pokemon's First Live-action Movie Features Detective Pikachu Instead of Ash Ketchum","Are there any other movies like The East or Night Moves?","My (And Your!) Favourite Spielberg Movies","THE CRESCENT (2018) Official Trailer","\"Detective Pikachu\" Director On Ash's Absence","Crazy Rich Asians: Behind the soundtrack's multilingual covers of Madonna, Coldplay, and more","Psych-Out","How The Last Jedi should have gone (OC)","Freddy vs. Jason, what do I need to know?","Pixar's ‘Coco’ Wins Top Honors at Imagen Awards, Film’s Star Talks Sequel","15 Spike Lee Quotes Writers and Filmmakers Can Learn From","3 Million Netflix Subscribers Are Still Using DVD-Rental Plan, Compared to 130 Million Streaming Subscribers","Do you try to put yourself in the mood for films (e.g. horror)? If so, how?","What can you tell me about novelizations?","Memory sequences in movies.","Teaser trailer for Suspiria retroactively changed?","SAG Dates 2020 Award Show for Two Weeks Before Oscars","Just stumbled across this short film from Jeff Nichols starring Michael Shannon, Garrett Hedlund and Scoot McNairy. It's quite cool if you like Nichol's other stuff.","In “Blade Runner,” who are the androids and what do they dream of? -- In Ridley Scott’s sci-fi classic, humans may be the privileged class, but it’s the replicants who are truly alive","No Country For Old Men","Three Billboards","What Best Picture winners do you think people have re-watched the most?","Johnny Gruesome (2018) Official Trailer HD [Exclusive]","Deadpool 2 - great movie, lazy writing","Introduction to Foreign Cinema","What are the chances of Zac Efron being cast in the upcoming Broadway to film musical \"CATS\"?","I hate the rating system of Netfix.","A Quiet Place (&amp; ASL)","First Poster - Fantasy/Musical 'Tommy Battles the Silver Sea Dragon'","From \"First Blood\" to \"Rambo: First Blood Part II\": Why some films are best served when they don't get a sequel","Await Further Instructions (2018) Official Trailer HD","Have you ever had a bad theater experience like the one I had 6 years ago","Why is there no \"Move of the Week\" type deal going on with this sub?","Stromboli Final Scene","I need help with the title of an old movie, here is some info about the movie","Question about The Matrix (1999)","Five Fingers For Marseilles - Red Band Trailer","anybody else done with the saw series??","Michael B. Jordan’s ‘Just Mercy’ Adds Tim Blake Nelson","Does Starz direct subscription include Encore movies","You can't watch the end of Train to Busan without crying","Why is Once Upon A Time considered a good film?"]