["Don't forget to join our discord server. Enjoy some conversation and up to date cringe with fellow cringe anarchists.","Purposely misquoting someone to make it racist","OMG! German Fuckin' Nazis! I'm literally dead right now.","Science.","Let’s make it happen","Onision Uses a Contradiction in His Own Logic to Suggest He Isn't Proud of his Own Face","White people and their *shuffles deck, pulls card* healthy eating","Now that my ban is over I can post some non-political cringe","\"Women\"","They say contestants are still lining up.","Just when you thought getting fired over something YOU said 20 years ago was dumb","Only took .273849 seconds to get banned","Good luck countering this one boys 😎","This says a lot about our society.","White South African Farmers to be removed from their land","Bobbies know their priorities","Can't be more accurate","You either agree with me, or you're a bigot.","Daughter murdered? Time to virtue signal!","Smarty pants!","This week on “When Memes Become Reality”","Splash Mountain?","Wheres the hate","Giving taxpayers' money to criminals is sooo noble and progressive!","OK, now this is Epic!! 😁","r/bpt IRL","Big if true","There is a petition to remove Buzzfeed from the internet. Don't let your memes be dreams.","Yeah my daughter was raped and murdered, but have you tried the fiery habanero sauce?","\"If you point out I call everyone I don't like a Nazi then that only proves you're a Nazi! You Nazi!\"","The toughest job","The parole board of Canada","Just another glorious update on the buzzfeed petition 😂","Mentally disabled infertile person thinks they are going to replace white straight cis people. Apparently they don't know how sex works","This thing","*Shuffles deck* Damn white people and their *pulls card* HEALTHY FOOD!","TL;DR of what happened in Germany; Whitewashing migrant crimes, MSM blackout of the real events, accusing ordinary people of being neo nazis etc","White genocide advocate","CNN: \"Antifa is widely perceived as an African-American organization\"","There’s people alive who are grandchildren of the tenth president. See? It literally means nothing.","Diversity lowers voting participation, charitable donations, community projects, and in many cases, cuts neighborhood trust in half. BUT IT'S STILL OUR STRENGTH!","👇👇👇👇👇","Horn implants...","This is why you need to enlist in the meme war against buzzfeed","Had to do it original post by u/soldier_boldiya","Not sure that’s how rainbows work.....","Libtard has an official definition.","r/LSC sees through the lies","This is beautiful. One of my favorite Youtubers, Alternate History Hub/KnowledgeHub, makes a video about Stalin's rise to power and we get the biggest Marxist anthem poster getting salty. His tears are delicious.","This is what \"white\" looks like nowadays","This was posted unironically","This is really fucked up and sad and I feel sorry for this kid, but why in the world is a 9 year old kid COMING OUT, he's too young for this shit","I'm surprised they fit her on the cover.","\"there were “bodily fluids” on his couch\"","Ketchup and mustard cake","BREAKING: Judge Dismisses 11 Counts of Child Abuse Against 3 New Mexico Compound Jihadists","When you had a long day of purging communists and other undesirables, so you get home and just relax.","Comments filled with angry commies","SA architecture reveals a lot about their culture.","Intentionally conceiving a child with a disability. Thought this was an article about people adopting deaf children, which would be quite noble. Didn't realize it was VICE until I hit the stupid shit.","Genocide Denial","\"Allowed to\"","I fucking love Jezebel.","A black man murdered a white man during a mugging, completely chimps out in court when he's sentenced to life in prison","They really put fried chicken in the pyramid?","We’re done boys. (/r/comedycemetary)","Those are some dang awful tattoos, I tell ya hwat.","So...umm...well....yeah... Going to leave this and log off, I've seem enough today. K bye.","EU's Hierarchy of SHIT","LeBron's racist imagine that","Buzzfeed went too far","It's not gay if you say \"no homo\"","He's hard at work protecting the local buffet","HMMMMMMMMMMMMMMMMMMMMM","I... I don't... just no.","Crusade time","\"South Africa is just an altright conspiracy\"","AHS in a nutshell","Who gets a tattoo of theirself on their forearm?","You're only straight because the establishment tells you so! This commenter, based on other comments, was being genuine.","What a true philanthropist.","Orc Slavery Made Me Quit 'Middle-earth: Shadow of War'","This has everything, buttholes, nipples, and some kind of effort was involved.","Working in Berkeley today and I opened Bumble. Please help. Do I swipe?","This artist has so many jokes like this.","When your dad is a total cuck","Y'All Qaeda","Imagine writing this unironically","Trump tellin' it like it is as usual","Pretty sure I'll never be attracted to trans because I'm not into dudes with boobs. Society didn't need to tell me that","Literally shaking lol","Louis C.K. offends \"several women\" with his surprise set at the Comedy Cellar","These people are obsessed with trying to make Europe \"less white\"","Average Reddit user","Remember the Obamanation?","This sub in a nutshell","I wonder who else that applies to","Gotta start em off early","WTF?! I love China now!","We found another one boys","Leftists on Reddit openly celebrating charges being dropped on a child-murderer terrorist who was caught with plans to attack a hospital. Also pretending to care about the Constitution while supporting a ban on the 1st and 2nd Amendments.","Can yall name a better President than Obama.","That totally happened...","What happened to giving the job to the most qualified person?","Fuckin' Hambeast","Do you think anyone has informed Mr. Rashid that his religion was founded by a dude that married a 9 year old? Or that there have already been reports of horrific physical and sexual abuse against children by imams around the world? Glass houses...","My kind of states","Parent of Victim at Parkland Shooting Demonized for Wearing a Trump Shirt *HIS RESPONSE","Oh Gawd not fliers! Won't somebody do something!","Yeah! That'll teach 'em to stand","\"Killing children and planning to attack hospitals and schools is their culture, BIGOT, charges DROPPED!\" - Leftist Judge","I get that this is a problem, but this was on the Front Page and was the first thing I saw when I looked up breaking news.","Ban sticks!","Important poll. Please provide a response.","Hello guys. You seem to have a nice community here but it's problematic how much hate speech I see here. Something has to be done with it. You would not like to see the sub banned do you?","WTF I hate UC now","What the actual fuck","PETA is getting really desperate with this video that actually manages to an unintentional parody of the animal rights movement","cuckshed btw","Criticizing Islam is evil bigotry, but murdering people because you are a fragile Muslim pussy is fine - Leftists","Feminist on Twitter","I wonder why they lump those two together 🤔","Amazing reporting.","Dumb negro drives to rich white part of town to yell slurs at hispanic crossing guard and threaten to run her over and shoot her for working \"around white kids\" in pathetic false flag hate crime hoax attempt.","Are sjw's ever going to be happy","Muslims try to rape a German woman, are stopped but murder the Germans trying to stop them, 10,000 protest Muslim violence...yet the MSM claims it's a \"nazi march\" and says Muslim rapists and murderers are the true victims...leftist Reddit celebrates the lie","I'm suprised she didnt flirt with them all on her own.","Guys we live in a fascist country where insulting the government leads to jail time. You can't even insult dear leader or your family will be jailed 3 generations back! You can even go to jail for rude comments on the internet.","“Hello, fellow Comrades!”","NSFW The Jews brought these people into the West and now we pay the price. Never forget those who died because of multiculturalism and diversity.","Reddit basically","All White People Are Racist Debate","r/standupshots mod bans people who dare not like Trump hating posts","Speaking of potatoes that look like famous people, here's a fun new board game by Milton Bradley","When people ask me who my favorite president was...","???","Parents who taught their children to shoot up a school, and murdered a child gets all charges dismissed","Hummm","This group is protesting Ontario's sex ed curriculum for not including enough genders.","Whitesplainations","A very heartfelt birthday wish","right in the feels","Convicted wife killer sues state to pay for sex change operation","I Can Smell Them from Here (xpost r/awfuleverything)","The fact that leftist consider the land theft a “conspiracy” is even more horrifying.","So eating a lot and not working out is empowering nowadays?","Normal person: \"Don't monkey it up by voting for socialism.\" Racist FTARd: \"HE SAID MONKEY THAT MEANS BLACK PEOPLE.\"","This is what the genocide in South Africa looks like","Imagine my shock","Didn't know mr Kennedy wasn't white","Found this in a MLP forum. Don't ask how.","This cringemachine.","Man Who Took Down InfoWars Sets Sights on 4chan","iTs iN tHe nAmE sO iM RigHt","Sex with robots is rape!","Ouch, that had to hurt","Can someone help me understand what per-capita means?","Remember the GTA V \"Virtual Rape\" girl? She just got employed by Insomniac Games","Hitler was actually African!","We need moar gays in kartoons Electric Boogaloo","Damn white people and their *shuffles deck* attraction to us.","Jews getting nervous that all of Trump's Jewish \"friends\" turning on him is maybe making it a little too obvious for the goyim.","Safety and freedom for me, not for thee.","But who's the top? 🤔","Oops! Wrong game...","Fucking white people and their *shuffles deck* straight hair!","SJW cringe!!!","Why?","Why negros are more predisposed to violence","Orange man bad reeeeeeeee","Damn White people and their *shuffles deck* curly hair","No one cares about her anymore!","Sports are sexist","I may have uncovered a conspiracy to try and dox ppl who post here and who have non-leftist opinions. Let me know what you think.","The story of r/All and r/CringeAnarchy","Looks like Buzzfeed is improving its content","Some actual logic coming from black people twitter","This Marathon advertisement didn't catch the guy with his dong out","\"Wish we could turn back time, to the good old days When our momma sang us to sleep but now we’re stressed out\"","This amazing rant got 14 golds and over 20k upvotes and is still rising. Jontronawful.gif","Kek","Going too far","Feminism the ultimate oxymoron.","Press F to respect","Do not forget that these people want their kids broke, dead, raped, and brainwashed, and they think it's worth it because they like burritos","LOL owned","Too soon? Nope, perfect timing.","Nobody left to blame","Imagine unironically wearing a backpack in the current_year...","Zap those traps","He has had enough, Count Dankula!","Debate","If you haven't seen it this is the funniest thing ever. The Island (like survivor) men vs women season. Men and women are the same tho","Deleted this incel off my ig","Is this what they call a chimpout?","Regarding Louie CK’s latest comeback. The content creates itself.","Trump's face when Putin buys him a Nintendo Switch","These people hate you and want you dead.","All children are gay","Latestagecapitolisim’s absolutely cucked rules, basically, questioning their agenda in any way is a banable offense","Deport them all","Google says it all folks","How are they supposed to learn about the culture with a 2 parent home?!?!","You did not make me cum. REEEEEE","China","DOLAN DRUMPH THE DAMNIT! DOLL","oof","room temperature","Orange man bad haha","Giant infographic that destroys Liberal race myths like \"socio-economics.\" Must read.","Liberal Logic mired by hypocrisy","She looks like a meth addict...probably because she is","The Unfuckables","Haha so true","Thereason May dancing on the grave of White South Africans. Supports stealing White farmers' land and pledges £4bn in investments.","That time Obama got heckled over deportation of immigrants.","While we're at it, France shouls return it's land to the Gauls, Lithuania should return to it's medieval size... Conquest, they never heard of it before.","Guys, can we talk about Jamel Myles?","Leftist can't connect the dots between Obamacare forcing taxpayers to give money to private companies without receiving a product in exchange and sky high healthcare costs... blames \"capitalism\" instead.","How brave of them","The circus is in town! 🤡 🎪","Satire of r/latestagecapitalism from 1995","I Kissed a Duck and I Like It!","If you don’t fuck animals you’re a fascist","All White People Are Racist Debate Part 2","Mothers trying to figure out whether to blame video games or guns for the most recent shooting","I'm a 29 year old man who's going back to college. I saw this coming out of my math class. I can just imagine some 18 year old feeling really proud of himself","My first cringe! Literacy is white supremacy","This is BRAVERY!","Our way of thinking","Incel forum honors mass shooters as \"heros\"","Dan Schneider is that you","Now you're playing with power","For those of you too scared to view the image it's a photo of arms with the painting \"starry night\" carved into it [NSFL]","Arrests made after Facebook video shows young children smoking marijuana in Winston-Salem","I like republicans but this is painful","Islamic version of this subreddit","I don’t think Siri likes men very much...","Found on r/PoliticalHumor","When you're playing Madden but start losing.","Woman leaves fiancé to have sex with ghosts","The soft bigotry of low expectations","Let's write a new diary!","CNN: New Mexico jihadist compound just a hippy family struggling to live off the grid away from Islamophobia","\"You Walked Into The Wrong Neighborhood Buddy\"","See an agenda yet?","Top Croc","Forget crusades, how about a genocidal campaign based on what kinda things you tweet.","Canadian Journalist brutally beaten by gang of Indians after he commented negatively on their politicians local election bid on facebook. This corrupt feudal thuggery happens all the time in Pakistan and India, now Canada gets to be enriched with it too. DIVERSITY IS STRENGTH!","I’ll take ‘things that never happened’ for 500 please","Königstiger","What does America have that Iceland doesn't?","BUt sLAVErY WAs A LoNg TIme aGo","Imagine to have such a weak feminine ego that this trigger you....","I've compiled a large album of all the obnoxious, crazy, and insane claims made by Holocaust Survivors. Read it and judge for yourself!!","Commies can’t meme","\"Religion of Peace\"","Weird Santa","White farmers may be dead.. but look at those sweet moves!","Gobble gobble on googles cockadoodle","Net Neutrality would have stopped Google!","Germany is ruled by Zardoz wtf","If all blacks left the USA, we would have the same gun violence as Belgium.","We need moar gays in kartoons","Alec Baldwin to Play Donald Trump-Like Dad to Batman in Joker Spinoff Movie","Wheaties and anime teaties","A former classmate of mine posts stuff like this on facebook every single day","I'm not in favor of vandalism, but whoever did that is hilarious.","if this is common then I'm worried for the human condition","Leftists are Retards: Why \"Democratic\" Socialism Doesn't Work","Right?","White Privilege Explained FINALLY","I was a SJW. I got redpilled two years ago, (a month after Trump won), AMA","just the title","Why is that?","Diversity Of Hair Color","I found this comment in a video where an innocent black man was arrested by a police officer.","Got banned from r/fuckthealtright for calling out their nazi practices","CNN isn’t biased, reality is liberal.","Security camera footage of David Katz, suspected Jacksonville shooter.","we all need to grown don’t we?","Islamofile so eager to show his love of Islam he doesn’t properly read the first comment.","When Fake Cops Pull Over Real Cops","was banned from dankmemes for this","I have no words","The world we live in today. VICE Snapchat story","How many likes can we get for our boys in jew?","(Proof)","The London Police (state) released a video on how to avoid being attacked.","The Tolerant Left","Stop complaining about the lack of furry/nonpolitical cringe","He din du nuffin","Retards from this sub accuse the wrong person (/u/ravenchamps) of being the Jacksonville shooter","“Size privilege”","DiVErSiTy iN mOviE RevIEwS","Based","Females trying to be funny","Field workers","White Genocide Advocate","[Not Cringe] Germany: Crime rate drops, but fear rises","Imagine thinking people wearing backpacks is cringy enough to post to reddit","People with less power cant ba racist!","Remaining apolitical, believing their are two sides to every story, a stating that white people arent a monolith are just some of the building blocks of white supremacy.","WHAT IN THE GODDAMN","I need signatures lads","Used unironically by a vegan on Twitter","Time to ally ourselves with r/dankmemes","Little Caesars marketing","Super Duper Cringey Guys Totes Habbenin","gravity is a cruel mistress","The lefts really upset that white women aren't voting to be systematically shamed because they are white","Lol looks like they dont get the point or this sub","Fucking end me...","Translated for yall. Our objective is to make twitter a safe ambient where everyone is free to express himself. LMAO good job contradicting yourself twitter! GJ","Can't believe this was on r/sex!","My transgender pregnancy struggles","FISHMOUTH INTENSIFIES","Part &amp; Parcel","Is being an \"Incel\" trendy now on Reddit or something?","Pedo fakes injury after being caught taking pics of children","Found Jigglypuff on my Twitter feed","Presented without commentary","Judging people on what they like to do, what has this sub come to","Social media definitely isn’t biased. It’s not like we push liberal ads on people who barely use the website","HES BACK GUYS","Finally, a political ideology for me!","Go get em dad?","Actual Facebook profile pic of someone who mocked me for defending a police officer in a comment section.","The sanctity of marriage","They have surpassed us!","Wonder why Europe isn't thinking about its future? Because it's leaders have none.","Why white people?","Average /r/blackpeopletwitter user","True Love &lt;3","Unvaccinated people don't get cancer","Jacksonville shooter was a leftist sjw nutcase. Figures, since he got his feelings hurt over a fucking videogame. Rot in hell, faggot","Your children will never know what it's like to live in a country like this.","When you have a special set of skills","Not only is this dude into vore, he also got his channel taken down 3 times due to stealing artwork. (Proof in comments)","This didn't age well","Communist's Utopia","Fragile snowflake is afraid of people hearing the wrong thing. Attempts to censor the thing hurting his feels: The TV.","Damn white people and their *shuffles cards interior design","/r/CringeAnarchy_irl","Gun-fucking chuds jerking off to own a make-believe trans person","A war hero is a war hero....","A /r/latestagecapitalism user spotted in the wild","Getting it good!","With a face like that I mean would you even have it to begin with?","She didn't get the memo from the American media that this isn't happening.","So brave","Come Fly With She","Hiroshima can credit the diversity","TFW you overthrow a nation as a socialist dictator and nobody shows up to preform any assigned labor","Memphis: Beale Street Fight Turns Into Full-on Thug-Fest Riot","Yes,this ia real","On /r/Gaming with 2k upvotes","Therapy but akward","Vox believes the truth is irrelevant, just like their shit website.","CringeAnarchy mod spotted in public","We're going to crank it up","Clicking on the picture is bringing up a new tab on my phone","Drumpf didn't win LA And I still haven't figured out that they shouldn't tell the rest of the country what to do.","The Double Standard of the Left","Theresa May dancing on the graves of white farmers in South Africa","When the left call Osama Bin Laden a war hero...","Of course this was poorly received in other subs 🤔","But there is nothing wrong with it, if it is done by me.","Big think","100% I'd smash","Let's take a moment to appreciate white people","\"Persons of different nationalities\" is now the new PC term made by German media (translation in comments)","BREAKINGN NEWS: ISIS has considered ending their operations after this post","darn those lootboxes","When you don’t know the meaning of “too soon”","Typical Wednesday Night","Civility iz fo' whitey","Bad timing","How to guarantee Trump 2020","Oy Vey!","LE IPAD GIVEAWAY","Bon Appetite! :P","Western Millennials begging in China to fund their \"travels\"","WOW! EXTINCT MEME FOUND LIVING IN MINECRAFT SERVER! (REAL!!!)","uwu","I won't cry","I don't know what this is, but it made me cringe. (seen on r/4chan)","I'm going to have to repent after watching this","Muslim on Newborns","I believed in Santa Claus and picked my nose I was not thinking of my sexuality at 9 years old","r/rarepuppers on a nutshell","cnn got called out by former Governor John Sununu live on-air after an attempt to insert an anti-Trump slant into his John McCain memorial interview. The cringe belongs here...","Hey guys!","Don’t think he read the news","Under a post about Ajit Pai","party rockers in the hou","Kids drink PEE on Youtube! (WTF)","Hard to find any information about the stabbing death by refugees of a German and the demonstrations afterwards...","Fuck... we lost another Mod guys.","Rapeick and niggersmorty","The ambulance is a tool of Hortler's 69th Rike","removed from /r/WTF because \"no political posts\"","According to the New York Times, 24 is 10 times bigger than 15","Explains a lot...","One more reason to be cautious about hotel bed sheets.","...","It's funny how this always happens to Harvard grads off of camera","Awkward and Funny Moments 😂 CM#3","Everything is racist","When tacos are more important than your daughter's life.","Can't stop. Won't stop!","Twitter: Saying Dana Loesch’s Kids Need To Be Murdered Does Not Violate Rules","Whoa.....","Doggos are sexist now","Eww, so much cringe :-)","Liberals represented in Spongebob","I’m embarrassed that I’m related to this guy, who regularly posts things like this","Mister Metokur banned from youtube.","UK police help a seizing man while concerned doctors and scientists provide motivation","Haha white genocide amirite fellow verified Twitter users!?!?! xDD","Narconon Course Book Continued: Scientology Owns This Program","These are the people who masquerade as \"scientists\" and \"biologists.\" These are the people your college class cites in their books.","I never have never felt so much second hand embarrassment for someone.","\"Progress\"","\"Orange man bad!\"","Has Ben Garrison awoken to his roots?","Woman Disrespects Veteran at a Restaurant and He Goes OFF!","Mmm smells like equality","Spotted at a local playground.","SJW Warrior against the mighty facts 2018 ColorFried","A cringeanarchy mod in their spare time","Facts are racist!!!","Army buddy on facebook posted this xD","There is no god.","\"REEEE, racist toxic white male gun nuts killed again!\" -- Turns out Katz was actually a cowardly, neurotic jew and hated Trump.","I have no words...","This was uploaded 11 hours ago, its it #4 on trending in the uk with only 70K views","how to trigger a jew 101","Fucking biblical, mate.","Come on guys, you're better than this...","Hillary lost because of slavery. You can't make this shit up","\"The problem is the violence perpetrated by sexually frustrated white males\"","So men are the problem, not people who are here illegally?","\"If race realism is so scientific, how come all scientists oppose it? Where are all the race realist scientists? Hah, checkmate racist.\"","It annoys me that countless children and teens will google \"is racism scientific\" only to be directed to the official (((wikipedia page))) for \"scientific racism.\"","Doing God's work","Reposted from r/dankmemes Journalism is dead, vox contributed greatly to it.","Germans gearing up for round three vs. The World","A 'friendly reminder'","r/FuckTheAltRight Mod Promotes Tagging “Bad Actors” with Coloured Badges","I really hope this is satire","she's a super freak!","Now date me, you disgusting bigot!","Friendship Goals ♡","I guess we’ve had a mass shooting every single day this year, except for 6 days.","I'm raising my child gender-neutral, and what I've learned is: It's not enough.","You Can't Stop Progress","Not white = Illegal","Diversity = No white people","I saw it so now you have to as well","Furry convention...","/r/The_Donald has so many stupid fucks. These people literally think vaccines and physiatrics medication causes school shootings.","Black people claiming ‘racism’ are caught lying on bodycam footage (bonus: Shaun King/Talcum White backpedaling)","Banned from r/politicalhumor for saying that no black person is a slave in America. Ironically it was top comment on that post.","\"Black crime is a result of poverty, not genetics\"","Feminist propaganda The Vagina Monologues has a scene where they idealize and promote a pedophile getting a teen drunk and raping her.","The current state of the victimized alt-left in PoliticalHumor","Are you feeling strong, yet?","FuckTheAltRight accidentally lets it slip that the profile of an incel matches the profile of a socialist anti-Trump male feminist to a T.","Got Blocked From r/racism Simply By Showing Up To This Sub-Reddit, Even Though I Disagree With Almost Every Post You Guys Make and Argue With You Guys Constantly, LoL.","Swiftly deleted by whoever responsible, but I'm taking you to hell with me for laughing at this.","Buzzfeed producer caught saying the N word in old tweet, to be fair it's very clear he's joking around with a friend, but it'll be interesting to see how Buzzfeed reacts","Blaming White men for mass shootings? Hell yeah! Pointing out they were actually Jewish? Racist nazi scum!!!!","Rose McGowan Disavows Asia Argento in #MeToo Split - Argento had told McGowan’s romantic partner that Jimmy Bennett had sent Argento nude photographs of himself since he was 12 - She did nothing!","The very mentally-stable Jacksonville murderer had a message for the Drumpftards","The educated right in action","Alejandro having the time of his life","Its the gaming communitys fault","\"I wish I was never born\"","I caught my husband doing this omg!! Wtf","Can't Touch This!","American Flag Tiki Torches","CringeAnarchy mod has been sentenced to community service and no internet access","If you see people downvoting a comment... downvote it no matter what","The response from a LSC mod after saying it was petty and inhuman to celebrate McCain's death.","Germans have had enough of this 'enrichment'...","The left can't meme, so copy the right! :D","\"These are facts\"","Jewish mods are afraid","Civic nationalists be like","Just take a look there...","Day two outside my mother's basememt","and my family says i spend too much money on three wheelers","Prof Is Ashamed To Be White","Liberal so amazed black people can read, she takes a picture of it and wonders why it isnt going viral","ABsOluTelY TwIStED PsyCoPATH ex DEE","PPL THINK ORANJ MAN BAD *gets 21k upvotes*","Everyday we stray further from god","Feminisation of western man intensifies","Hmmm, a hidden Bias?","Remember Jesse Owens? The black guy who \"defeated Hitler\" at the 1936 Olympics? Well it turns out he loved Hitler and was best friends with an Aryan Nazi named Luz Long. Hitler not only waved at him but even shook his hand.","Furries","Yes because climate change definitely dosent effect men","How to pick up liberal women?","I need to get off this site.","Being racist to white people is fine","Every man is a rapist that can't accept \"no\"","Weird kid at my school does “24 hour challenge”, in his house, but pretends he’s in the sidemen house with KSI","On the Asia Argento case.","How long before the media and Reddit libtards pretend the Madden shooter was a conservative?","Well well well...","Karma in action","Lesbians sexually harassing gay men at NYU. Let this New Yorker article by Masha Gessen suck your soul dry.","EA were SJWs before BF5","In order to live on my campus you must learn how to be a sjw/left winger...","Video games make people violent /s","ACCEPT ME!","God damn that skinny chef","How true it is till this day!","They really love this guy","Peak Reddit","Racist dorm room","Wtf","I cri evertiem","It gets worse everyday","Priorities?","FuckTheAltRight still salty that steam doesn't capitulate to fragile children.","And now we wait for the r/politics, r/news and r/worldnews mods to purge every trace of this story","SJWs: \"We want more women attending college.\" OK. \"Yeah, but we don't want the student debt!\"","Spoiled brat shames wedding guests for not coughing up $1500 to attend wedding","InfoWars host Alex Jones 'caught looking at transgender porn' despite anti-trans rants","Eating their own kind.","An alt-right chode-chafing competition unfolds in real time; butthurt nazis bloat their diapers with rage when faced with actual facts","Air Conditioning Is Sexist","He thinks it means \"wholesome\"!","NSFL warning","Forbidden History","You just wanted to try some chocolate but your vagina got destroyed so now you gotta scream RAPE!.","Obama's manlet bitch so upset with Trump he doesn't want Trump impeached he wants his presidency made NULL AND VOID.","Youtubes Very Best Ksi Vs Logan During Fight Cringe","Communists flipping off a monument honoring over 100 million people that died","Joan Rivers knew it a long time ago, Michelle Obama is a man","They don't like our countries' present existence.","Well that's surprising","Police say children made up story about white man urinating on black child.","Neckbeard doesn't matter and wants to get sweet facebook points.","This makes me want to shoot a hole in a hard drive.","Another day another ban","A Tribute to R&amp;C Stats Bot","FuckTheAltRight getting upset that we're using the \"No media correction\" angle against them. Let's see how long it takes before we get them to demand lawsuits against people who don't correct stories.","Man with a Rubber Sword Attacks the President of the USA","New York City’s best cowboy/musician","Get Out was a documentary","Apartheid Israel PM Netanyahu Unaware of the Camera says \"America can easily be moved\"","Is It Cringe-Worthy How This 13-Year-Old Is Shamelessly Sexualized On This Website Geared Towards College-Aged Males?","StopAdvertising drops all the tendies when they realize Kats was one of their own.","Some non political cringe","I found one in the wild!","Open Borders","Please all of you go reduce your life span thanks for your attention","#Respect","Idiocy is as infectious as the common cold","autistic faggot","We now have a progressive voice in Islam, calling out the pedos","CNN sympathizing with Islamic terrorists that wanted to attack a hospital and commit school shootings","We live in a society that denounces Masculinity","\"Free Speech\" My Ass","Cant process","Why are all mods nigger faggots?","\"Slytherin Communist\"","A World Without Whites","Tsk , i forgot islam is a \" religion of peace \" that can do no wrong.","Sunday, August 26th, nevar forgit https://twitter.com/DmothafkinJones","Druids live among us","Back in my day","The Sexual Revolution","every journalist has an agenda","Cursed image","CBS Producer with Racist Tweets","I wonder how people would have reacted if they included ethnicity with those crime statistics. But im sure if they can ignore the hypocrisy that wont mean much to them either. This is truly a tragedy, its a shame it has to politicized at all. But thats exactly what they did with this.","Talcum X says no white farmers are being murdered for their skin color","This is the fucker that shot up Jacksonville.","Commie Grandpa, and His Indoctrinated Granddaughter.","Anat Cohen - Zionists are the new Nazis","Party of science","Retardation intensifies","See a pattern yet?","Absolutely impossible","Twitters extatic today. They get to do their favorite hobby hating white people.","Edinburgh SA will be handing out pronoun badges during freshers' week","Legitimate proof that BDSM is human cancer.","What did he mean by this?","Hello 911 what's your emergency? \"There's a person trying to break into my house.\" Is the person black sir? \" Yes he is.\" Please stay on the line sir an officer will be there to arrest you shortly","2k upvotes on this shit.","Jewish suspected gunman in Florida gamer tourney shooting described as loner, but his culture taught him he was the entitled Chosen, and could gun down goyim like in Israel. An outraged Katz opened fire at the tournament after having been eliminated earlier in the day","Come again?","I got banned from r/lgbt, apparently lgbt can’t discriminate against straight males “intrinsically.”","Sums it up","The world’s most awkward interview","50% OF AMERICA IS NEO NAZIS","Basically every protest at this point","Saw this awful movie while shopping at Walmart","Pride Paintings vandalized by hooligans","Leaked photo of POTUS Donald J. Trump talking to himself at the Whitehouse (C. 2018)","The less JPEG, the more shameless.","This makes me want to puke","The reaction to the Jacksonville shooting absolutely pisses me off (Rant)","Tariq Nasheed BLAMES Gamers For Madden SHOOTING",".","((Pavlovitz))","Yeah, you almost died, but I just HAVE to know what happened!!","Parkland school shooter's really lame confession thing","Sauna Treatment At Narconon Fresh Start: Take A Dangerous Amount Of Niacin, Then Make Other Drug Addicts Do It. Scientology Is Really Bad. People Die There.","Me irl","Civility is a tool of white supremacy","Political Humor is right guys. It’s only just 1 illegal immigrant causing crimes!","FuckTheAltRight unironically praising fake news. These people are that stone retarded.","Have things been getting worse lately?","Stefán didn’t die for this.","NASA Engineer Gets Cucked By The Furry Community","Auschwitz","They aren't even trying anymore","BURN THE HERETIC","Logging into INCELS.ME","Jewish video gamer angry about losing his precious shekels goes on a shooting rampage. We have to do something about these violent Jews with guns.","CringeAnarchy's worst nightmare","yep... it's gamer time.","Russian Baldi’s basic","When you rip your dick off in an echo chamber","News outlets once again rushing to get information without any bit of self-awareness","Ben Shapiro's Linguistic Prowess is God-like","I’m Sorry Humanity","FuckTheAltRight unironically thinks black people are still slaves.","M.E. \"Spike\" Bowman: The Jonathan Pollard Affair: what does it mean and what does it not mean?","US Government Hostage to Israel? | Interview with Mark Bruzonsky","Lmao","When did Canada grow a pair? Good for them","manlet","Like neurotic house cats","Fragile Jew tries to get facebook group banned because it promotes Jewish/Black relationships","Stupidity intensifies","Because if I SAY it should be free, that makes it free, right?","Usually this person is pretty cool but I guess I didn't know them well enough.","(CUE EARRAPE)","Some non political cringe, this video's comment section.","So this is the tolerance they've been talking about...","People need to get over themselves. Fuck.","\"There's no persecution of whites in SA\"","cursed but hilarious reply from learned scholar Tariq Nasheed","I never imagined just how powerful it would feel playing as a woman in Battlefield 5!","The Smirking Chimp, 9-11, and the Jewish Predicament (with video)","It was our privilege ladies.","Oy vey!","Sweet burn and a great point. Like a hot Ka-bar.","The Real Border Wall, Separating Detroit from Grosse Pointe","TIL Trump Supporter = Non-Civilized","The Beta male’s guide to picking up chicks","This fuckin' joke from Total Recall","To all the high schoolers going to school this year.","SEIZE THE DAY &amp; SEIZE THE DAY Y'ALL","Wow breaking news about drumpf Jr.","Ritual murder by you know who","Kinder produces a new cringeanarchy toyline!","Alright, which one of you is this?","Scary to think these are the people who want to use the same bathroom as our wives / daughters","CNN bull shit","Peak cringe right here! From someone who never experienced slavery first hand","Gay guys who don't like pussy are fucking weird.","The absolute state of all political SRs","about gods of egypt. i love how mad the SJW crowd get's over this movie.","Cringe alert Kids buying vbucks with parents money","“Concerted attempts to silence criticism of Israel in the U.S” Maria LaHood","In Detaining Peter Beinart, Apartheid Israel Has Declared it No Longer Represents Millions of Jews Overseas","/u/XHF, a liberal Muslim terrorist apologist, got himself gilded for a propaganda comment exonerating the New Mexico compound Muslims of all blame, and claiming they were never intending to commit terror attacks....meanwhile.....","Это Япония!","The Worst Thing about Donald Trump, Jordan Peterson Talks","Popular Youtube commie raked through the coals for suggesting his fellow socialists show a little tolerance towards whitey","Maybe feminism isn't all bad?","Socialism has failed in Venezuela because of the US.","A sub created to mock virtue signaling SJWs is now taken over by trannyloving virtue signalers.","Making fun of iFunny","The pettiness on r/facepalm","And BLM stands for being lazy matters.","Jealous Hillary","The vegan feminist","The saga continues","This time it WILL work","Currently on the front page of r/latestagecapitalism","White men hatred is going too far...","How the hell does this have over 1 billion views","Because Trans rights &gt; Human rights","This place has become an autistic shithole","These user reports.","DIEversity makes us stronger.","Here we go again","WE R ALL BOOTIFUL","average transgender","Found this on my Facebook feed and people are pissed lol","They now make cards to celebrate genital mutilation. Now you can truly support your friend becoming another future suicide statistic.","Planet Fitness","This immigrant family went through family separation and now are reduced to this. Sad stuff","Yeah you can’t have an opinion, if you don’t agree with me, ur a shitty person!","Imagine being scientifically illiterate, promoting something dangerous to your own children and those around you, and being proud of your dangerous ignorance. Now see it.","Found this gem in politicalhumor","Apparently this News worthy?","Pffffft","bullying kids for their political views is justified","I don’t know what I expected them to look like","This guy showing empathy","VICE never fails to deliver that QUALITY content 😩","I'm a *tiresome* person for being white and having opinion on a black person issue","I think I failed at existence if this appeared in my Recommended.","Pathetic","What a useless fuck","Trendsetter","Forget prior mental instability, It was violent games on the vidya screen that caused the Jacksonville shooting.","“People of size”","Libtards trolled le epic style","#BlackHogwarts","So amazed a black woman can fly a plane she had to document it.","I'm pretty sure white is a genetic phenotype not something that was invented.","ESLCS tweeting on the tragedy of Jacksonville","The shooting happened a couple of hours ago and already...","NASCAR Driver Loses Sponsorship Because His Father Said the N-Word 30 Years Ago","Doesn't matter if you're a saint, if you don't share my political views then I hate you","This Geek email is distasteful considering the news out of Florida today","rare agreement between BPT and CringeAnarchy, colourized","Jordan Peterson claiming that all his critics must have misunderstood his intricate writings, otherwise they would have loved it. Just like Carl Jung!","Good ol' Christian love","10 year old student punished for calling teacher ma'am","Hey you just got shot. Sorry lol. Can you call me for an interview?","BBC Presstitute expresses disappointment at lack of tributes to John McCain from the Russian press, ignores long history of McCain's call to genocide against Russian people","This.. thing","Today quote !!","It's OKAY to be WHITE!","Well would you look at that","Look after yourself","really makes you think 🤔","White republican = Racist","Fortnite dances class","Because it isn't fair that you are wealthier than she is.","Drumpf = Hitler","Turkmenistan run by a fellow autist?","Probably a repost.","r/funny supplying the quality again.","Milo's whiny Facebook post definitely belongs here","average cringeanarchy user on twitter","When you spend days calling trump a conspiracy theorist and the guy you're defending actually says he's right...","Diversity is so beautiful that you need a 10ft high bulletproof wall to protect your most famous landmark","She committed homicide, she can use \"stand your ground\" as a defense in court. Vox is so stupid they shouldn't even be a publication.","Crazy Twitter man thinks everything is white supremacists","Something about non-political cringe.","The less JPEG the more shameless","(((Me)))","Asking their followers to tweet them photos of the shooting.","Stay woke at home mothers","Liberals imagining things part. 9224","Leftists can’t grasp the idea that a woman can have an opinion that is different from her husband.","No it's not kidnapping","Borderline brutal 😈","Only one day since his passing","“The right has lost its civility”","The Tinder Trap | Pretend we are the comment section that is disabled on this video. Every upvote here = 1 down vote there.","[Lifehack] Get rid of a boner you do not want","Mao was just misunderstood.","How DARE that kid be respectful!","Philadelphia Police brawl with Antifa losers in Philadelphia as they tried to disrupt a #BlueLivesMatter march. 16 Antifa meth heads were arrested. [video]","Remember to hate white women on women's equality day","This screencap may've been posted before, but I find it interesting that sometimes people have to THEORIZE about something someone would say to get some dirt on them because they're running out of material to twist.","British Police Deploy Helicopter For Playing A Song","“They can do whatever they believe,” Interior Minister Matteo Salvini tweeted, shrugging off the development that migrants were refusing meals aboard the Italian coast guard vessel Diciotti","Anybody else get this ad on YouTube? I believe he goes by the name of Boomba Ja?","ew","\"Like OMG Shut Up! Lying About Rape Isn't Bad Jeez.\"","When Cucking goes wrong.","Hahahaha no","Statue of Polish King Jan the Third Sobieski, who was leading coalition forces against Turkish army in 1683 during the Battle of Vienna deemed to have \"anti-Turkish\" tone.","That's how you do it!","Can America become South Africa?","\"Humor\"","I just got aids","Women's suffrage was a mistake","2 nukes weren't enough","SCP-2721 The absolute state of the SCP wiki","Can we honestly stop with this shitty t_d stuff","Donald trump and his \"shuffles cards\" coloring with cancer kids","Salvini speaks his mind more than Trump... C'mon, Trump, SPEAK UP!","NBC McCain death coverage cuts to \"America's got talent\" dolphin roleplay.","\"Reddit Socialists\" in a nutshell.","Meanwhile in Saudi Arabia","The cringiest sh*t you will ever see \"What It Means To Be A Feminist\"","Reminder that LGBT support is for ZOGcels and this is the best solution for gays/lesbians/trannies/98percentface.","That's my Asian-American!","Banned from r/latestagecapitalism for no reason? Seems legit to me.","Thank you, Gatekeeper to all Presidential sympathies.","Not one but TWO exhaustingly overused nature-related memes combined together into one (DURR PLANT from I Hate Everything and the Overgrown Brinstar music from Super Metroid)","Milo Yiannopoulos is a cringe machine","“Friend” of mine posted this awhile ago. “They” also have an oc of a lamb in a diaper with a pacifier.","21 Pilots fan talks to Columbine victim's ghost","To a theater near you!","MS-13 are NOT animals!/s","Spiderman's not looking too good lately.","Just another day on the CringeAnarchy Discord server","He can’t be empathetic?","How to get free karma 101","Less than an hour after Sen. McCain’s death was announced, we need to be reminded that respect for the dead doesn’t count if you’re Republican.","Day one.","Russians hacked Vaccines, y'all.","This man's too spicy for me!","Remember the lacy rompers? Well slippery slope confirmed","Ed Sheeran","Image is removed, ironic.","When you uniroincally advocate for 1984","Weird facts","Found at my ciderhouse","This is an actual professor at my school who gets paid over $100k to write about being fat, what is this world coming to?","*Ahem* We have issued a correction to the previous story.","How dare Orang Man Drumpf call South Africa a shithole","Looks like the mods started a paint company","It’s about time to teach to immigrant to not rape and kill women, simple fix feminist /S","When you stir the nesquik","r/latestagecapitalism celebrating the death of a man they didn't agree with","LSC teaches to news of John Mccain","Does anyone buy this patronizing bullshit?","Oh so Trump is Cartman now... ok","According to my fone's newsfeed app, this is news-worthy","Orunge man is retard, see he paints flag wrong, russian bots, buzzwords, buzzwords, lawls","What kind of monster did this?","Times are changing","Normalizing unhealthy lifestyle choices is so important. Literally crying rn. 😭","Wow, almost as if the actors are... Acting?","Jesus fucking christ...","Guy on marvel subreddit takes these movies very seriously","So many inappropriate responses to what the kid could ask for if those are the rules. I almost wish I wasn't banned from the sub...","Woke niggy lays it down.","\"I hate white people but I can't resist white boys\"","You’re not wrong.","Duh drumpf supporters dumb","A Rare Example of an Italian Cuck","Peak Bug","If you strike me down, I shall become more powerful than you can possibly imagine","Hey height bigots","Kangz","average university anime club","Horrific...my heart bleeds","Some non-political cringe","You're not WHITE!","\"Michelle Obama DID NOTHING!\" Bill Burr Destroys Feminist on Talk Show","Srs is such a funny place","No title needed.","Who woulda thought it was vice","r / ENLIGHTENEDCENTRISM, supporting the black and white fallacy and communists everywhere","Why should we be pressured ?","⚠️⚠️⚠️WE NEED ANOTHER PLAGUE [NSFLAD]⚠️⚠️⚠️","\"Sharia Law is reasonable\" - The left's favorite Pussy Hat March organizer","Hot Anime Tiddies","When u use your kid to push an agenda but realize that it didn’t even happen","Roses are red, Tacos are enjoyable, Don't blame us because you broke our laws and are now deportable","Math is white","Mods are asleep, post inspirational quotes!","Oof","This is the most insane thing i've read","Remember to bring your inhalers and glasses!","The state of the UK, ladies and gentlemen.","Captain Sweden","First time I heard about this, Verizon accused of throttling unlimited data plan for Cali fire department during recent wildfires","So I just made a post here and in a matter of seconds I got banned from r/racism. Even though I didn't know a sub like that existed. Wtf?","The hospital staff later thanked him for sharing his culture so passionately.","#resist","When you're actually racist on Twitter and you get 76.5 likes","Someone literally created a fucking Elliot Rodger Wiki. What in the actual Fuck.","0/10","The state of political candidates these days.","Why are they so invested in trying to sweep this under the rug?","C and B","terrible smoking habits","Apparently women don’t have rights in America","Myth Busted: Being fat is not genetic.","She totally made a difference, right?","Get it, because the economy is doing well and unemployment is low. r/political humor really has it figured out.","\"Gutierrez worries that algebra and geometry perpetuate privilege because \"emphasizing terms like Pythagorean theorem and pi\" give the impression that math \"was largely developed by Greeks and other Europeans.\"\"","Here we go...","Got called a racist about 5 times and told it is not illegal to overstay a visa and cross the border illegally. What a world","Which one of you just shot up that game tournament?","This didn’t age well","Average hentai protag","You Wuz Not Kangz","What makes a person a boy?","Smugvini","William Shatner Singing Bob Dylan","...what","Based Italia is going all-in to FUCK EU! Eternal Bliss!~","Stomedy is at it again!","Nothing going on in SA fellow whites!","school shooter alert, watch out","Did she miss anything?","Damn white people and their * shuffles cards* wide faced racism.","How the fuck does anyone take Vice seriously","What NBC went to immediately after they announced the death of John McCain","Why do you feel you can tell others what they can and cannot say?","When a normie gets redpilled online. This is what Jews fear most and why they are cracking down on internet censorship.","Classic","r/politicalhumor has peaked with the 2012 memes","Ohhhh boy","I’d rather be black and considered low IQ, than be white and be perpetrating this bullsh*te.","Massive Disrespect from Salvini","“Thin privilege”","And now we wait for the feminine boys to ban me","Today for women's empowerment vagina nails","Shooting in Jacksonville Florida at Madden Tournament","HAHA Mainstream pop culture reference! Take that, DRUMPF!!!","Nonsensical incorrect use of the meme, but 26k upvotes because \"Fuck Trump Hurr Durr\"","\"You suck if you don't hate yourself for being white. That's my only argument.\"","The problem with \"Hey guys\"","Pardon?","[OC]","FuckTheAltRight having a hard time understanding that the other race besides whites that gets shit on in school/work pursuits (Asians) might be leaning right. Shocker!","Fuck off","President Trump coloring the flag wrong","Since r/thathappened doesn't allow political posts I think this is a perfect fit for it","Saying 'female genitalia' is worse than killing countless women","The person who said she wouldn't help white homeless people got suspended off of Twitter.","YouTube marking an Anti-Communist song as \"Inappropriate or offensive to some Audiences\"","the fusion of the forbidden ones","Rip John Mcain, a true American hero","KSI vs Logan ends in draw, the only losers are the ones who paid 10 bucks to watch","Trump honors McCain with a giant picture of himself","I mean, I would have fun doing the world a favor too...","Antifa pushes communism and trashes everyone who disagrees with them as fascists even though communism killed more people than fascism (don’t get me wrong, both systems suck)","My friends dad made a Facebook for his sex doll. He dresses it and takes it on adventures.","Let's get our favorite meme man the honor he deserves.","toll road ahead","Hmmmmmmmmmmmmmmmmmmm","Interesting porn on Alex Jone's phone","Fellas is alex jones a faggot 🤔🤔🤔","Oh salon","What is this a crossover episode?","Stop using Sexist memes REEEEEEEEEE","9gag is being redpilled by a right-wing website lmao","Rapid-onset gender dysphoria in adolescents and young adults may spread through groups of friends or online sources, and may be a harmful coping mechanism like drugs, alcohol or cutting, a new study suggests. More research is needed to determine whether it is temporary or likely to be long term.","California_irl","Alex Jones watches tranny porn, but the frogs are gay so it's to be expected.","The Virgin Peterson vs. The Golden Chad","Daddy Simulator","When talking about child marriage.","Logan Paul vs Ksi Cringe Battle","\"ANTIFA Violence For Peace... What!?!\" Golden parody of antifa by gay goth from the USA.","Even the Chinese know","r/Science removing comments on post about gender dysphoria study.","Oh no...",".... I don't even know","They’ll do anything to discredit him","Kinda gross","How does the left STILL not get how this meme works?","Facebook hates facts","Who is the Real \"Master Race\"?","A Brief History of the German \"Master Race\"","Father loses control of his son and watches as he becomes a faggot. Very sad. Just another day in Weimerica.","I love how the left reduces everything to a chant about how you're just scared.","Poor women :(","Alabama","Mother of the year.","White Jacksonville shooter who lost tournament, shoots black guy first. Is this White fragility?","I cringed","Allied soldier remembers what he's fighting for as he takes a moment to collect himself. (1944)","Comments from (unsurprisingly) r/LateStageCapitalism regarding the death of Senator John McCain.","\"Your opinions mean nothing to me because of your race/gender/sexual orientation.\"","Its the privilege bridge!","No words...","What the hell is r/politics?","Skank hoe scoffs during sentencing for false sexual assault reporting.","D:","would you let these people near your kids?"]