["Explain Like I'm Five is looking for moderators!","ELI5: How does defogging the windshield work?","ELI5:What happens in our body when we vomit , and how do we vomit?","ELI5 When using morse-code fast, how to know which symbol belongs to which letter?","ELI5: What is it about Maths that makes it the most commonly disliked subject in school?","ELI5: If you drink ocean water, you get more thirsty, but is there an amount of salt you can put in water so that they cancel out or something?","ELI5: What is the difference between diesel &amp; regular gasoline?","ELI5: how in the world do official tennis reviews work? And are they accurate?","ELI5: why does our sun appear yellow/orange, while distant stars appear whiteish / blue?","ELI5: The relationship between Diabetes and Alzheimer's?","ELI5: How is it easier to eat a crumbled up, rolled up piece of bread rather than eating it regularly? Is there any difference?","ELI5: How does high blood pressure increase the risk of blood clots forming in the vessels?","ELI5: Why does your head feel heavier when you are tired/sick?","ELI5: How do electromagnets actually work?","ELI5: How do we know that electrons are elementary particles, while proton and neutron are not?","ELI5: how do cellphone carriers limit video streaming to a certain quality for example 480p","ELI5: How can solar panels turn light rays into electricity ?","ELI5: IVT's (infinitely variable transmission)","ELI5: What is Dynamic/Static Light Scattering?","ELI5: How is the universe bigger than its age?","ELI5: odd time signatures: what are they, how they work?","ELI5: (MCA)Multiple Correspondence Analysis, Feature Selection","Eli5: does a fridge really consume less energy when full, and why ?","ELI5: Why does water make materials more abrasive?","ELI5: Why does fruit start to rot on room temperature, but can stay good for weeks in the fridge?","ELI5: NASA's Parker solar probe has radiators, how do these radiators radiate heat in a vacuum? thank you.","ELI5: If you can get a nuclear explosion by striking a Uranium 235 nucleus, why can't you get a nuclear explosion by striking any other element's nucleus?","ELI5: Someone explain the PRESS statistic to me please","ELI5: How does rabies induce hydrophobia (aversion/fear of water) into a victim? What is causing it?","ELI5 : Why does pinching a hose at its extremity make the water flow faster while pinching in the middle make the water flow weaker?","ELI5: Why does having chalk increase your grip while on something like monkey bars?","ELI5: how do lotions that you wash off immediately(in the shower or in the sink) work if they’re on your skin for such a short amount of time?","ELI5: why are the bottoms of our feet and hands always much lighter than our overall skin tone?","ELI5: Why are some electrical plugs so huge that they cover the outlets next to them? What is taking up all that space?","ELI5: what happens in your skin when you get calluses.","ELI5: How does our body diffuse drinks other than water to hydrate your body?","ELI5: Why does a Guitar note change depending on how tight or long the string is?","ELI5: Why is a sugary drink sticky when spilled, but an artificially sweetened one not?","ELI5: What's the difference between the voltage across a resistor, voltage drop, and voltage?","ELI5: The difference between currents and volts","ELI5: the difference between regular tissue and scar tissue","ELI5: Why does your body accept foreign objects (titanium) and reject others?","ELI5:What force causes supernova to explode?","ELI5: What makes the tectonic plates move?","ELI5: How does breathing in and out slowly help to calm our nerves?","ELI5: Why has the price of college tuition skyrocketed?","ELI5: What makes us emotionaly numb when we are depressed?","ELI5: What makes a knife’s blade sharp?","ELI5: How do image changing cards work?","ELI5: Why do touchscreens respond to my fingers but not, for example, to my gloves?","ELI5: Why is a lottery considered a tax on the poor?","ELI5: Why are we fascinated by things that glow?","ELI5: Why is the leaning tower of Pisa still standing?","ELI5: How to pronounce words which are already plural and have an apostrophe in the end?","ELI5 How does the Aurora Borealis move and change colors.","ELI5: How does a computer cooler works and why shouldn't I just leave my computer open and point a fan at it?","ELI5: What causes lcd screens to “burn in”","ELI5: What makes gems (diamonds, in particular) so valuable?","ELI5: What happens when pavement changes from black to grey?","ELI5: How come electric car batteries, aren't recharged by the keneitc energy of the wheels moving?","ELI5: How does computer/phone/radio hardware recognize and differentiate between wireless signals?","ELI5: Why are supermarket brands much cheaper?","ELI5 Why does private college cost so much?","ELI5: Difference between pyelonephritis and glomerulonephritis","ELI5 Corporate Tax Cuts","ELI5: How does a computer recognize sound and convert it to text (eg. Google Assistant)?","ELI5: Why are words like “and”, “of” and “the” left out of acronyms?","ELI5: Why do old songs have a crackling sound?","ELI5: Unit Of Account in Economics","ELI5: When exhaling underwater, why does the air go up in loads of smaller bubbles rather than one big bubble?","ELI5 Eczema tendency.","ELI5: Why do plastic earring backs start off soft and malleable, and over a period of time become hard and inflexible?","ELI5: what is meant by unhackable/unbreachable, and is anything truly that?","ELI5: Why the starts shine?","ELI5: Why is gravity now not considered a force, but a space-time curvature?","ELI5: Why do computers become slower in higher temperatures?","ELI5: Why is sparkling water slowly and constistently loosing its carbon dioxide? Why not all an once?","ELI5: What is \"octane\" in octane rating of petrol, and how it came into being?","ELI5: How does electricity work?","ELI5: How does radio wave retain its frequency and other modulated properties over such great distances?","ELI5: If the Universe is infinite, why is there doubt that there are other lifeforms?","ELI5: what makes our bellies rumble?","ELI5:Why does milk become spoiled when left in the heat but not when heated?","ELI5: What is the sound one hears when moving one's eyeballs?","ELI5 why on my children’s bottles there is a clear difference between UK -FL OZ and US- FL OZ. Example in comments","ELI5: What is/are the akashic records?","ELI5: How do carnivals/fairs operate smoothly and make money?","ELI5: How come there can be many patents for the same thing?","ELI5: why doesn’t red light affect night vision?","ELI5: when using alcohol beverages in soups and sauces why is the product not alcoholic?","ELI5: Why is it bad to starve if we have fat reserves?","ELI5: Yield curves to begin with, what a flattened or inverted yield curve is, and how it portends recession.","ELI5: how do boat anchors work at sea?","ELI5: Why does the sound quality seem to drop significantly when say a phone is hooked up through an auxiliary cord and the phone volume is changed to the maximum setting versus just one notch down?","ELI5: Why rainbows are arched and what factors decide their dimensions?","ELI5: Why do vinyl music records sound notably higher in pitch than online videos and recordings?","ELI5: How Does A Plasma Ball Work?","ELI5: Why does water have its anomalous properties?","ELI5: Why did in the past using the phone disconnect you from the internet? How did we get past this problem today?","ELI5: If recessions are a normal part of the business cycle/economy, why are governments not prepared for them?","ELI5: What are cosmic strings?","ELI5: Why does every company want me to enroll in auto-pay?","ELI5: How did early scientists measure the wavelengths of the colours of light?","ELI5: How does eating high fibre food prevent us from getting constipation?","ELI5: How do movie studios make money from box office sales?","ELI5: why do propane tanks get really cold when they’ve been used for a long time?","ELI5: How do engineers plan and build bridges?","ELI5: How does the FDA decide if a product/drug/hormonal treatment/etc. is fit to be a treatment/cure for an ailment?","ELI5: How air conditioning and refrigerators cool the air.","ELI5:Why is water able to stick to surfaces like ceilings without all just falling off at once?","ELI5: What's the difference between black body radiation and atomic spectra?","ELI5: How do diseases and viruses originate?","ELI5: How does culling in videogames save resources","ELI5: How does Strict NAT and UPNP affect online connectivity while gaming?","ELI5: How does the EAS (Emergency Alert System) work?","ELI5: How does smoking alcohol work exactly?","ELI5: Why do most animals move in smooth motions but birds more in quick jerk like movements?","ELI5: Tax evasion versus tax avoidance","ELI5: How does the internet work so insanely fast?","ELI5: Why does getting hit in the testicles produce a unique pain not felt when hurt in other areas?","ELI5: For a disease that cause sores (chicken pox, HFM etc), what determines where the sores pop up?","ELI5: In machine learning, how do adversarial examples cause a model to produce an incorrect output?","ELI5:How chess is evaluated on an engine level","ELI5 why loaves and French and Italian bread mold after a couple days but a loaf of sliced bread lasts weeks without molding?","ELI5: How do chemists predict what will happen in a reaction?","ELI5: how do truss rods in guitars work?","ELI5: Toxoplasma gondii lifecycle","ELI5: The Efficient Market Hypothesis","ELI5: How does pressing down on the accelerator make a car move forward?","ELI5:How do water taps work?","[ELI5] Why does ground coffee not coagulate like other powders?","ELI5: If, physically speaking, colors are lightwaves that are reflected by the things we see, how does color mixing (as seen in ink, for example) work? What changes in order to create a new tone? Also, why do some colors, when mixed, result in more distinct colors than others?","ELI5: Why does your ear ache when your tooth/teeth are in pain?","ELI5: How do tuning companies perform ECU tunes on cars, in order to gain added performance (e.g. increased horsepower)?","ELI5: how to find arithmetic modulo?","ELI5: Why do diet soda syrups go straight in water, but sugared soda syrups have to be poured down the side of a bottle?","ELI5: The 5th, 6th, and 7th Dimensions","ELI5: How does chemotherapy work to treat cancer?","ELI5: How does an electric current produce a magnetic field?","ELI5: How are modern day CPU's or GPU's designed?","ELI5: Bizarre Sound Question","ELI5: Why do objects reflected in nearby mirrors appear blurry to nearsighted people?","ELI5: How do we know that the gas giant planets in our solar system are actually gas giants?","ELI5: why is it that things like ribbons curl up when dragged up against a sharp object like a scissors?","ELI5: What is TRAP sequence/ arcadiac twinning and how does it occur?","ELI5: How are the raw images sent back from space probes processed in such a way to give a vibrant and colourful image?","ELI5: How does a network switch know to which recipient it has to send incoming packets?","ELI5: Carnivorous plants.","ELI5: How is it possible that a pair (male and female) of an animal species can populate an entire territory?","ELI5 How does a gyroscopic stabilizer keep a boat stabilized?","ELI5: Why does scum form when preparing jams and jellies?","ELI5: How do human populations end up having nearly 50/50 male-female ratio?","ELI5 What determines which body part gains more weight ?","[ELI5] How do crop factors on DSLRs work ?","ELI5: What is Geofencing?","ELI5: Dactylic Hexameter","ELI5 How do planes fly upside down if the wings have one side for high pressure and one side for low pressure?","ELI5: What is the adjoint representation?","ELI5:How do you measure nutrients in food? And how do those nutrients change if you cook/freeze/boil the food?","ELI5: How are translucent things actually see through? Like a translucent frog or fish.","ELI5 How does salt raise the freezing and boiling temperatures of water?","ELI5: If a person on TV is talking to someone across the country/world why does it take seconds for the other person to respond when seamless video chat over internet has been a thing for year?","ELI5 how a Octopus or Squid tentacle moves, how does the muscles work, why does the tentacle just not contract instead of curling...","ELI5: Why does some produce seem to lose flavor when refrigerated?","ELI5: How efficient are cars at using fuel?","ELI5: After seeing a cross section of tree rings, I’m wondering how trees produce new layers outward from the center?","ELI5 : Why bleach and products containing oxygen (like h2o2) have the power to whitening things?","ELI5 how did the Big Bang create the elements of our universe?","ELI5: What is identity crisis?","ELI5: How do they come up with thousands of puzzles for puzzle games?","ELI5:How are Sawzall blades so hard, yet so flexible?","ELI5: Why are industrial power generators 3-phased? Why not 1 or 2 phases, what's so special about it?","ELI5:. How does a magnet float over a super cooled electromagnet?","ELI5: Why do scientists think the Universe is flat, if we can travel in any direction?","ELI5: how does signing something with PGP confirm the authenticity","ELIF: How come when you have gas pains/indigestion drinking hot tea or water makes it feel better?","ELI5: What is the difference between the curved glass of a car versus the curved glass of eyeglasses?","ELI5: Face-blindness","ELI5: How does color-blindness work?","ELI5: Why do buildings always seem to fall apart faster when no one is in them for a while?","ELI5: Why do you only get brightly coloured beautiful birds in warmer areas the planet?","ELI5: Why does the sun appear yellow/orange in our sky but the moon appears white?","ELI5: Why are cans more recyclable than plastic bottles?","ELI5: How do some games look great at high and have a high FPS, but with the same specs you get a blurry, and choppy experience, at low, with a more demanding game?","ELI5: Difference between bolt release and charging handle (for M4)?","ELI5, How do glow sticks work?","ELI5: If the Mt. Tambora eruption occurred in Spring 1815, why did it take over a year for the effects to be felt globally (\"Year Without a Summer\": 1816)?","ELI5 Why do video games lag while in cutscenes?","ELI5: why would a company owner/ CEO want to have a board of directors?","ELI5 how do sleeping pills make you tired?","ELI5 how a refrigerator works in regards to thermodynamic equilibrium","ELI5: What is insomnia and why can't our brains shut off when we're excessively tired","ELI5: What is the difference between norepinephrine and epinephrine?","ELI5: Why does the moon sometimes appear to be silver, and other times it appears to be orange?","ELI5: What is earth voltage tester and where it is used?","ELI5: What is happening in our vocal cords/throat when we lose our voice","ELI5: Whats the Impact of Free trade vs Fair trade polices in the real world and what are the benefits and disadvantages of both","ELI5:How can scientists judge a planet's composition from across the galaxy?","ELI5: why are lightnings so \"scribbled\" and have so many ramifications instead of just being a straight line?","ELI5: How do the calorie counters work on things like treadmills? Are they accurate?","ELI5: Please explain to me the difference between Linear Light and Perceptual Gamma sRGB in simpler terms","ELI5: How does microfibre cloth work and why is it better to clean glass with than other cloths?","ELI5: Can a child look nothing like either of their parents but look exactly like their grandparent(s)?","ELI5: The difference between a brain aneurysm and a stroke","ELI5: How do oil powered engines actually work?","ELI5: Laplace Operator. Its concept and its uses in real world.","ELI5: Why does yellow food coloring look red when it's concentrated?","ELI5: How can it be possible that Mercury gets to be around negative 200-300 at night when it is so close to the sun?","ELI5: Why do EFTs only work on business days?","ELI5: How do calculator batteries never run out?","ELI5: What exactly is Lo-fi?","ELI5 Why does some lightning not strike the ground?","ELI5: Why can't/don't we measure smaller than a Plank Length?","ELI5: How do we know how old Earth is?","ELI5: When not on a channel, why do radios make static noise instead of it being just silence?","ELI5: Why does turning down the heat while cooking give off more steam?","ELI5: ELI5: If our skin cells are constantly shedding and being replaced, then how do we get wrinkles as we age?","ELI5:Why do Ants of the same species come in different sizes unlike Bees who are usually all the same size?","ELI5: What prevents infections settling in cuts?","ELI5: What makes soap (bar or liquid) a disinfecting agent? Is there a difference in efficacy?","ELI5: Why is methanol so much more toxic than ethanol, despite being in the same homologous series?","ELI5: How do antipsychotics work to treat bipolar and schizophrenia?","ELI5: How did Hurricane Lane weaken so quickly?","ELI5: Why does sound \"Travel further\" at night?","ELI5: Why do people get a knot in their stomach when something bad has happened or they are anxious?","ELI5: Why would “the tide” speed up or slow down a ships journey?","ELI5: Why is plasma sometimes considered the fourth state of matter?","ELI5: Would the Earth be any different if the moon wasn't reflective?","ELI5: How chewing gum calories work","ELI5: Why do private small planes crash more often than bigger commercial ones? What's the difference?","ELI5: Gram positive and gram negative bacteria.","ELI5: Corporate stock buyback and how that's affecting stock prices?","ELI5: how a DJ set with multiple DJs work","ELI5: Why do airplanes get shaky when passing through clouds?","ELI5: Keys in music","ELIF: Those round circles that you see in the ground right before you reach an intersection look like they influence the intersections lights, but how does that system work in general?","ELI5: Why do gases get colder instead of hotter the faster they move?","ELI5: how are purchases correctly identified as fraudulent by credit card companies when there is nothing “unusual” about them?","ELI5: Why does a guitar get out of tune?","ELI5: How prescription transition lens work.","ELI5: Why do American and European cities default to using the direct metropolitan city for population whilst Australian Cities default to using the metro population","ELI5: What is Catastrophe Theory, and what does it tell us?","ELI5: What does non polarized phone display mean?","ELI5: How is lightning and thunder formed?","ELI5: Is eye-rolling involuntary and is it also universal like smiling?","ELI5: why fine-grained sand doesn’t come off from your feet even when they’re already dry?","ELI5: How come cars don't use a smaller-sized battery nowadays?","ELI5: Why do muscle and tendon injuries hurt more than fractures?","ELIF: How do those laser light thermometers work?","ELI5: Why do some letters have a completely different character when written in uppercase (A/a, R/r, E/e, etc), whereas others simply have a larger version of themselves (S/s, P/p, W/w, etc)?","ELI5: How are sensory inputs converted to short- and long-term memories in our brains?","ELIF: How does the moon cause tides?","ELI5: How does the film in an instant Polaroid camera work?","ELI5: How exactly does a caterpillar turn into a butterfly?","ELI5: What is RIP (routing information protocol), how does it work, how is it beneficial?","ELI5: Why is cancer so hard to cure?","ELI5: What happens to IP rights/licenses when a company goes under?","ELI5: A commonly touted problem with the Hyperloop is that the expansion/contraction of metal with temperature would make pressurisation impossible. How do conventional railways deal with this problem?","ELI5: how come we lose the ability to see objects as 3d as we increase distance?","ELI5: Nitrogen Decompression Sickness (DCS), more commonly known as 'the bends'.","ELI5: How can violet plants exist? Don‘t they contain chlorophyll?","ELI5: Why do muscles hurt for days after going to the gym but not during the exercises?","ELI5: How does water resistant sun cream not come off in water and does it come off as you sweat?","ELI5: All flagship phone makers claims they have a AI chip on their phones - what makes a AI chip different from the regular CPU?","ELI5: How does dri-fit clothing work when completely submerged underwater?","ELI5: How do electronics keep track of time (for their clocks) and why aren't they very accurate?","Eli5: Does gravity have a big impact on heart rate?","ELI5: Why do things look blurry when they are out of focus?","ELI5: What's the process that drug companies use to develop new flu treatments every year?","ELI5: What is a kidney stone?","ELI5 why does low blood sugar cause stomach sickness/ nausea","ELI5: Why should we add salt and pepper to a dish toward the end of a recipe?","ELI5: How do lizards and such animals eat spiders without getting harmed by the venom?","ELI5: Light is an electromagnetic wave, so does it have any electric or magnetic effects?","ELI5: How lightning finds the fastest route to the Earth","ELI5: How could different human species reproduce to make fertile young?","ELI5: How does the hand boiler toy work?","ELI5: Ovulation, and it’s relation to conception","ELI5: why are some medications adjusted based on weight and some are the same dosage for all adults?","ELI5: How it possible to knock over a line of dominoes increasing in size if the amount of energy imparted on the smallest domino is not enough to directly knock over the largest one?","ELI5: why do “overweight” people tend to snore more than average weighted people?","ELI5 How does a bong or a hookah work?","ELI5: Why does sound travel faster through helium?","ELI5: Why does paper stand up on its edge better when it is curved?","ELI5:What are these 12 letters or number you often found alongside their username in online forum? Something like 24DAFA:DA4FEA.","ELI5: what is the rattling in paint markers or spray cans, and what is it doing? Is it just braking up paint or is it building pressure?","ELI5: if water goes in a cycle, how are we running out?","ELI5: Why do some big headphones need batteries and some don‘t?","ELI5: how does UV light affect your skin, and how long does your skin take to recover to it's maximum defence after exposure? If you're only exposed for a few minutes, is the recovery time quicker?","ELI5: How are movies that are recorded in 1080p upgraded to and marketed as 4k resolution the same way movies actually recorded in 4k are?","ELI5: Why do computers come with a (ex): \"2.5ghz - Can Overclock to 3.1ghz\" but you shouldn't overclock?","ELI5:Why ISS don't perform a constant movement to create G Force so astronauts can avoid bad results of the Zero G environment?","ELI5: How did ancient Egyptian currency work?","ELI5: Has the Titanic ever moved from its original location underwater?","ELI5: How does patent work?","ELI5: Why is it so difficult to accurately determine height in the unidentified deceased?","ELI5: How is water digested?","ELI5: Why exactly does the toilet bowl get dirty over time (like the ring around the water)","ELI5: Curve Shortening Flow","ELI5: What is the science behind fainting?","ELI5: Why is water called \"Aqua\" in the ingredients of many products?","ELI5: how do traffic intersections know what light to turn green when emergency vehicles are passing though?","ELI5: Why does restarting your phone solve connection issues and/or make it faster?","ELI5: How can light have momentum if it doesn't have mass?","ELI5: What exactly does -1 to 1 correlation mean and how is the correlation determined?","ELI5: How does traveling faster on a bike make you more stable?","ELI5: How does \"getting your teeth done\" work?","ELI5: The Geoid"]