["August 2018 [REQUEST] Megathread. Post info, requests and questions here, help people out.","Journey To The Edge Of The Universe (2008) the first accurate non-stop voyage from Earth to the edge of the Universe using a single, unbroken shot through the use of spectacular CGI technology [1:33:20]","The Cola Wars (1993) The story behind the intense cola war between Coca-Cola and Pepsi in their quest to dominate the soft drink market. [44:21]","Spin (1995) - \"A film by Brian Springer composed of raw satellite feeds featuring politicians' pre-appearance planning using behind-the-scenes manoeuvrings of politicians and newscasters in the early 1990s.","Six-Day War (1967) - Third Arab–Israeli War DOCUMENTARY [15:58]","TPB AFK- The Pirate Bay Away From Keyboard (2013) The story of the world’s largest file sharing site's co-founders prior to their trial, facing a $13 million damage claim in copyright infringement brought on by Hollywood. [1:22:07] (CC)","People learn their water was poisoned for nearly 40 years and unload on EPA [Excerpt] - GenX: a Chemical Cocktail (2019)","Shanghai - life in the megacity (2018) -- A documentation about Shanghai from an European perspective [25:55]","Norway - The Happiest Country of the World (2013) (Documentary from the series \"I Love Democracy\")","CHARM CITY (2018) | Official Trailer - Filmed during three of the deadliest years in Baltimore. This made me cry.","USA Airport Border Security Customs (2017)","Note By Note (2007) documentary that follows the creation of a Steinway concert grand — #L1037 — from forest floor to concert hall.","BBC - The Sikhs of Smethwick (2016)","Exorcism: The Battle for Young Minds (2018) - A documentary I produced about an Exorcist in Argentina thats just been picked up by the BBC. [00:43]","What's Really in Your Meat? | Consumer Reports (2018) - USDA denying their own data of unapproved drugs remaining in grocery meats","All the Queen's Horses (2017). The Rita Crundwell story. On Netflix. Details how she embezzled 53 million over 20 years from Dixon, IL as Comptroller. Link to trailer.","The Choice is Ours (2016) The series shows an optimistic vision of the world if we apply science &amp; technology for the benefit of all people and the environment. [1:37:20]","Serial Killer - Belle Gunness \"Only Belle\" (2014)","Wooden boatbuilding - Faber Navalis (2016) A film by Maurizio Borriello","Haruki MURAKAMI: In SEARCH of this elusive WRITER (2010)","What Caused the Irish War of Independence? (2018) \"A short documentary exploring the origins of the Irish War of Independence\" (0:16:43)","The Reindeer People (2014) Erika Larsen Nat Geo Live","GoPro Cause: Forever Securing World Food Supply with Crop Trust (2017)","Secrets in Plain Sight (2011) - \"Why do so many ancient structures/pictures contain similar symbolism?\"","Fractals: Hunting the Hidden Dimension (2008) A look at fractal geometry, how it’s found just about everywhere in everything, and how the mathematics of fractals can be used to model and measure such things as mountains, coastlines, telephone line noise and heart rhythm. [53:13]","Gubben i stugan/The Old Man in the Cottage (1996)In this documentary you can follow one year in the life of Ragnar, who lives in Kestina, in the forests of Dalecarlia in Sweden. The film portrays the everyday life of the retired forest worker, without any narration or interviews.","Japanese War Crimes: Murder Under the Sun (2006) [48:43]","Living the utopia - 28 old anarchists remember their experience during the revolution that changed their lives during the Spanish Civil War 1936-39. (1997)","War of Jenkins' Ear, Smuggling, Crusoe, and Slavery (2012) Little Known Time in American History","America in Color: The 1920s (2017) [1080p]","Lost Children of The Empire (1989) Lost Children of the Empire is a remarkable overview of Britain’s child migration scheme, where orphans, “street kids,” and other children were packed off to colonial destinations, all with government assistance or blessing","Mars: Making the New Earth (2009) [1080p]","Rhinos: Killing &amp; Corruption (2018) | BBC News [23:16]","The Secret Rules of Modern Living: Algorithms (2015) Professor Marcus du Sautoy demystifies the hidden world of algorithms and reveals where these 2,000-year-old problem solvers came from, how they work, and what they have achieved. [58:33]","Plagues &amp; Pleasures on the Salton Sea (2004) Explores the economic, political and environmental issues that face the Salton Sea, a one-time vacation destination for the rich and famous. (1:01:00)","America’s Youngest Sex Offenders (2015) The story of two teenagers living in a correctional facility specializing in the treatment of young sex offenders and the states’ effort to rehabilitate them. [44:11]","The Condemned (2013) In the heart of Russia, in a forest larger than Germany, where winter temperatures drop to -40 degrees, 7 hours from the nearest city, lies a prison home to 260 men, responsible for nearly 800 murders, Penal Colony 56 is unique: a prison exclusively for killers [1:18:49]","This Is What Winning Looks Like (Part 1/3) (2013)","Modern Marvels - High Tech Sex (2002) [CC] (48:28) S9E52","Exorcism, the battle for young minds (2018) Journalist Andrew Gold visits an internationally renowned exorcist in Argentina, who claims to cure the sick of their demons and battle against evil. [41:56]","The Brewers Story - Episode One - Wavelength Brewing Co (2018) 'Short films about beer and the people who brew it' [16:12]","The Mandelbrot Set (2016) - An interesting look into fractals","Rediscovering Mystery (2017) - Noclip documentary about mysteries in Video Games [39:00]","What It Takes To Become The World's Best Whistler (2018) -- In 2012, Ien decided to compete in an international whistling competition along with people from different countries, backgrounds, and experience levels.","The Power of Meditation - BBC (2016) (56:10)","The Children of Leningradsky (2005) A look at Russian homeless children living in Leningradsky train station. It captures the sobering reality of post-Soviet Russia, as kids are left behind, get booted out of their homes, turn into prostitutes, are abused, and run away.[33:47]","Thieves by Law (2010) A look at a phenomenon called “Thieves by Law”, the rise of Russian organized crime in the wake of the fall of the Soviet Union. Several noted crime figures are interviewed, a number of which are currently wanted by Interpol [1:30:49] (CC)","The Battle of Los Angeles (2018) - \"On a cloudless night in early 1942 the skies above Los Angeles erupted like a volcano when antiaircraft batteries unsuccessfully tried to shoot down one or more unidentified flying objects. The incident has since become a staple of UFO mythology\"","Inside the Ku Klux Klan - Meeting The Imperial Wizard (2018)","Carts of Darkness (2008) This documentary follows a group of homeless men who have combined bottle picking with the extreme sport of racing shopping carts down the steep hills of North Vancouver [59:13]","This Woman Opened Her Home to Victims of Gang Violence (2018)","\"Ami Horowitz Is Going Postal\" (2018) - Great look at how Chinese sellers can offer free shipping to the US","9/11 Suspects: The Dancing Israelis (2016) - We now have thousands of pages of FBI, CIA and DOJ documents about mysterious groups of Israeli Mossad agents that were arrested on 9/11 setting up tripods to record the attacks and celebrating when they happened","Death By Fire (2010)The controversial case of a man put to death for the arson-murder of his three little girls. But was he guilty? Was having Iron Maiden posters proof he was a devil worshipper? How can state put a man to death when all fire experts agree it was not arson but an accident [1:21:16]","Modern Marvels - Failed Inventions (2002) [360p]","The Vanishing of Madison Scott (2013) a comprehensive awareness film to aid in the on-going police investigation into the disappearance of missing Vanderhoof girl, 20-year old Madison Scott.","C***sucker Blues (1972) Unreleased Rolling Stones documentary, the Stones and their hangers-on at their most honest… and quite possibly, in some cases, their absolute worst. Probably the most honest picture about rock and roll ever made. [93min] (Need to sing in to confirm age)","Everything is a Remix Remastered (2015) - About creativity , \"intelectual property\" and social evolution. [37:29]","Love in the Grave (2012) - Czech documentary movie shot over the course of 2 years shows the life of two homeless lovers living in an abandoned graveyard tomb in Prague. [1:18:55] [Eng. subtitles]","Oxyana (2013) The 'Hillbilly Heroin' epidemic slowly rotting the soul of rural America. How the collapse of the mining trade in Oceana, West Virginia led to widespread poverty and drug addiction, hampering any attempts at rebuilding the town, and bringing it to its current lowly condition [1:18:05]","The Carter (2009) - The Carter documents Lil Wayne in the period before and shortly after the release of Tha Carter III, which achieved platinum status in one week. It is a real-time account of Wayne becoming the biggest star in the world while also falling into addiction to prescription cough syrup","Craft Beer: A Hopumentary (2013) explores the craft beer explosion in America with interviews from one of the founders of Lagunitas, a home brewer, craft beer store, and various pubs. Great watch with a beer in hand! [14:30]","Right Between Your Ears (2016) - A False Prophet convinced many believers that May 11, 2011 would be the end of the world. This film explores how people turn beliefs into certainties, and mistake them for the truth. Neuroscience explores how we can become convinced we're right, even when we're wrong","Shanghai - life in the megacity | DW Documentary (2018)","Four Corners: Bringing down the Turnbull government (2018) - A documentary on how the Australian Prime Minister was thrown out of office by his own party last week. [57:42]","Facing the Fat (2016). A severely overweight man goes through a 55 day doctor supervised fast [1:28:30]","The Defectors (2014) - Escapees From North Korea's Prison Camps [22:49]","Bringing down the Turnbull government - ABC News Australia (2018)","A Crime of Insanity (2002) After a paranoid schizophrenic was arrested for hosting a classroom hostage, he was thrown to jail with the general prisoner population without proper psychiatric care. The incident prompted controversy what is legally and what is morally correct [1:04:07]","Cryptocurrency: Virtual money, real power, and the fight for a small town's future (2018) [20:54]","Demon At the Door Heroin in Seattle (2017) A 90's style documentary produced in HD at 60fps","God Speed You! Black Emperor (1976) Fascinating look at Japanese biker gangs in the 1970s, and why they choose to act out in a culture that so strongly emphasizes fitting in. [1:30:25] (CC)","KEATING ECONOMICS: John McCain &amp; The Making of a Financial Crisis - 13 min documentary (2008)","Ex Libris - The New York Public Library (2018) - A heads up: today, director Frederick Wiseman is taking questions on WGBH's Facebook Live at 12:30 p.m. ET about his documentary on the NYPL. I'm working on the production and you can leave questions for Wiseman here or on the WGBH FB post!","Blues Story (2003) \"The Story of the Blues told through the eyes of the artists who lived it. featuring: BB King, Charles Brown, Koko Taylor, Buddy Guy, Hubert Sumlin, Robert Lockwood, and more. Assigned by my Jazz Appreciation Professor, very interesting, just thought i'd share\"","Why are Millions of Kids Parenting themselves in the poorest regions of China (2018)[14:33]","Economic Miracle of Japan - Full Documentary (2017)","FULLSTERKUR (2018) - The third documentary in a collection of films produced by Rogue Fitness, exploring strength culture around the world, connected specifically by the ancient tradition of stone lifting [1:27:15]","Invention of the Transistor (1998)","Hated: GG Allin and the Murder Junkies (1993) A punk rock musician infamous for extreme behavior (violence, obscenity, drug abuse), and his confrontational stage shows involving indecent exposure, onstage defecation and coprophagia, physical assault, and obscene language. [53:38]","Made in China (2018) An intimate portrait of peasant-turned oil painters transitioning from simply making copies of iconic Western paintings to creating their own authentic works of art, emblematic of the journey that China is going through, from ‘Made in China’ to ‘Created in China’.[23:27](CC)","Dig! (2004) Follows the highs and lows of two bands -The Brian Jonestown Massacre and The Dandy Warhols- over the course of seven years as their love-hate relationship unfolds in front of the camera. [1:46:42]","The Lobotomist (2008) The gripping tale of Dr. Walter Freeman, who in 1936 began performing lobotomies as a cure for everything from psychosis to misbehavior in children. The once hailed by the Nobel Comittee as a hero of modern medicine would ultimately be labeled a moral monster. [53:53]","The Magic Pill (2017) (1:29:58)","F is for Fake (1973) Orson Welles' documentary about a dissembling art forger - Elmyr de Hory-, fraud and fakery. With a focus on the fakery behind talking about a subject, more than about the subject itself. [1:28:45]","Land of the Strays (2018) - National Geographic documentary about a dog sanctuary in Costa Rica","The Last Houses in Downtown Calgary - A Canadian city continues to develop and densify its core, house are starting to disappear from downtown. This video documents the last houses in Downtown Calgary, and explores a bit of their history. [length 5:45] (2018)","First Do No Harm (1997) (1:34:10)","Inside a Cursed Appalachian Mining Town (2018) In the late 1800s, traveling preacher Robert Sheffey cursed the town of Ivanhoe, Virginia. Today, Ivanhoe is even plagued by sinkholes—multiple houses have disappeared entirely into the earth.","NYC Central Park's youngest Drummer. A 2 year old Busker (2018)","\"Warm Heart of Africa\" (2018) - A short documentary I shot, about an orphaned and homeless preteen girl.","The Battle of Los Angeles (2018) [00:19]","What Caused the Lucky Dragon to Close only a Year after Opening? (2018) - This Video talks about what caused the Las Vegas Strip’s Newest Resort to Close only a Year after Opening","Gimme Shelter (1970) A harrowing documentary of the Stones' 1969 tour, with much of the focus on the tragic concert at Altamont. [1:31:44]","'Rome : The War Machine (1992)' - Full Documentary","Ants: Nature's secret power (2016) An inside look into the world of the ants. A world more wonderful and bizarre than any science fiction. \"Ants\" will reveal this alien world for the first time, in the company of a true authority and enthusiast. [1:08:56]","The Men Who Built America (2012), total run time [8:00] hours, History Channel, how industrial innovations and business empires revolutionized modern society, links to all episodes in comments","Guys and Dolls (2002) a BBC documentary that examines “real doll” collecting and relationships.","The Plague and How it Scarred Our Myths and Culture (2018) [00:33]","Living Without Laws: Slab City, USA (2012) This bizarre, lawless land in the California desert is inhabited by drug addicts, eccentrics, army vets, hippies and just plain old weirdos. Slab City is referred to by its residents as \"the last free place in America.\" [20:44]","Szpital / Hospital (1977), Krzysztof Kieślowski, 1080p HD [EN sub]","China Desperately Grapples With Its Plastic Waste Crisis (2018) - Tipping Point: Since declaring that it will no longer import rubbish from the rest of the world to process, China has turned its attention to its own plastic waste crisis. [28:50]","Raanachi Pakhara - A Doc about The Siddi people in India,A group with direct African ancestry that came to the Indian subcontinent though the Arab and European slave trade(2014)","Napoleonic Wars: Jena 1806 (2018) - [16:14]","Surviving Execution (2015). A Year In The Death Of Richard Glossip","Kashmir: Born To Fight - (2018) - The most militarised zone in the world isn't in Iraq or Syria. It's in Indian-administered Kashmir, a region wracked by a separatist insurgency for almost 30 years.","Lost Worlds: Hitler's Supercity (2006)","Checkpoint (2003) - fly on the wall depiction of the subjugation of ordinary Palestinians at Israeli checkpoints","Häxan: Witchcraft Through the Ages (1922) Original Swedish 1922, English Version Narrated by William S. Burroughs 1968","(2018) Inside America's First Video Game Addiction Rehab","Inside Hong Kong’s Cage Homes: What Fans of 'Crazy Rich Asians' Missed (2018)","Mahul, Mumbai's Rehabilitation Hellhole(2018)","No Justice For Khalil (2017) - 2 year old beaten to death, killer never arrested","Burn (2012) - In depth look at Detroit's bravest. (Trailer)(CC)(00:02:20)","Grey Gardens (1975) An old mother and her middle-aged daughter, the aunt and cousin of Jacqueline Kennedy, live their eccentric lives in a filthy, decaying mansion in East Hampton. [2:24:35]","Super Elements (2017) Rare Earth Metals. [42:29]","A Vigilante Pact To Kill The Town Bully - Ken McElroy Short Documentary(2018)[CC](9:50)","The Disappearance of Crystal Rogers (2018) An on going mini series about the unsolved mystery of a missing women in a small Town in Kentucky. [1:30:00]","Silk worm farming in India: how your silk is made (2017) - A short look into silk worm farming in India.","Stealing Paradise (2016) - Al Jazeera Investigations","What plants talk about (2013) Riveting documentary examining how plants behave, revealing a world where plants are as busy, responsive and complex as we are. [52:57]","The History Guy: (2018) The First Air Commando Group's combat helicopter rescue [11:19].","For All Mindkind (1989) Cut together entirely of footage shot from space, “For All Mankind” is not about the science of space travel, but about how the astronauts feel, seeing our little blue marble from a perch few of us will ever sit on. [1:19:51]","Kashmir: Born To Fight - 101 East (2017)","Rhodesia 1976 (1976)","The Great Ecstasy of Woodcarver Steiner (1974) Werner Herzog's touching documentary about Walter Steiner, a world-class Olympic ski-jumpe who makes his living working as a carpenter. It’s about the rewards of competing not for endorsements or medals but for personal achievement. [43:55] (CC)","Modern Marvels - Beach Technology (2002) [CC] (44:10) S9E27","Instock (2018) A Dutch Restaurant Turns Rescued Food into Delicious Meals (by a Sustainable Web-Magazine, Earthackers)","Titicut Follies (1967) A look inside the Massachusetts Correctional Institution Bridgewater for the criminally insane, where people stay trapped in their madness. [1:23:59]","HyperNormalisation (2016) by Adam Curtis - \"A different experience of reality\" [2:46:31]","'The War of 1812 (2011)' A.K.A - The Second War for Independence. Full Documentary.","Inside America's Meddling Machine: The US Funded Group that Interferes in Elections Around the Globe (2018) - Max Blumenthal attends a Capitol Hill gathering of the National Endowment for Democracy and explores the group's destabilizing global campaign to meddle in other countries' affairs [22:42]","Munich- The real assassins (2018) Mossads revenge. Operation wrath of god.","Borneo Story- Dayak People (1958)","Christmas In Vegas (2017) A small-time buttrock band from Arkansas tours across America and everything goes to (non-self-aware) hell [1h56m]","F for Fake (1973) Orson Welles' final film documents the lives of infamous fakers Elmyr de Hory and Clifford Irving. De Hory made his name by selling forged works of art by painters like Picasso and Matisse. Irving was infamous for writing a fake autobiography of Howard Hughes. [01:35]","BBC Doc - Desperately Hungry Housewives (2009)","Power of Grayskull (2018) - The Definitive History of He-Man and the Masters of the Universe / Trailer","[Trailer] The Creepy Line (2018)","FARMLANDS(2018) What is going on in South Africa?","Meeting People Is Easy (1998). A chaotic look sans-narration of Radiohead's frighteningly dense OK Computer world tour.","Segregated America: A School in the South (2018) Documentary series following life at a high school in South Carolina, USA.","1971 - Citizens' Commission to Investigate the FBI (2015) - On March 8, 1971, a group of citizens broke into a small FBI office and took every file, and shared them with the public. Their actions exposed FBI's illegal surveillance of law-abiding Americans including people like Martin Luther King","Hurricane Lane Emergency (2018) Update","Against the Grain (2018) — While preparing to screen an exclusive 70 millimeter print of “2001: A Space Odyssey,” staff members of an arthouse cinema contemplate the past and future of film projection—and of their own personal and professional lives.","An Honest Death (2018) - Masahiro Tanaka was a palliative care doctor and Buddhist priest who was diagnosed with terminal cancer. He was an end-of-life specialist who helped thousands of patients die peacefully. Now he had to face his own impending death.","Won't You Be My Neighbor? (2018) - An examination of the life and legacy of Fred Rogers. [01:34:27]","It Will Be Chaos (2018) An intimate glimpse into the human outcomes of the refugee crisis across the Mediterranean. [1:33:54]","Motherhood and Meth (2018) (13:35)","Dr. Strangelove or: How I Learned to Stop Worrying and Love the Paradox (2018) - A video essay discussing the through-line and theme of 'Paradox' in Stanley Kubrick's \"Dr. Strangelove...\" (37:29)","Bizarre Foods - Worlds Best Markets (2018) a look at traditional foods from markets around the world","Palikari ― Louis Tikas and the Ludlow massacre (2014)","Dig! (2004) - The Story of Two American Rock Bands","Star Trek: The Next Generation DVD/Blu-Ray (2013) Season 6 Character/Actor Perspectives [29:59]","Discovery Channel: Vulcans, Victors, and Cuba (2003) A nice look at Britain's V force during the Cuban Missile Crisis","Sweden: The good vs the bad (2018) - \"Beware the simple narrative\"","Freeing Willy: The Whale Who Would Not Be Freed (2013) - The tragic story of Keiko, the whale who starred in \"Free Willy\"","EUROPA - The Last Battle (2017) - Communism was not created by the masses to overthrow the bankers, Communism was created by the bankers to overthrow and enslave the masses.","How Advertisers Silenced A UK Political Reporter.(2018) ‘A Conspiracy Of Silence’ – HSBC, The UK Press And The Defrauded British Public","Inequality: How Wealth Becomes Power (2018)","World''s Biggest Shredder (2008) [47:27]","The foreign legion : men without a past (2018) Jean-Baptiste Gallot followed these elite soldiers who have come from all over the world to serve France.He filmed these recruits during training in Djibouti, in Guyana and also during the violent operations in the Ivory Coast. [1:11:02]","The Real Secrets Hidden in Antarctica... Revealed (2017) [44:33]","My Dead Dad's Porno Tapes (2018) - A short documentary of a filmmaker discovering who his father was through the things he left behind (Atlantic Op-Doc)","Slavery Routes: From Sugar to Rebellion (2018)","The Bristol Brabazon. (1987) Amazing airplane I'd never heard","Kekistan: Trolling For Freedom (2018)","Foul Play: Paid In Mississippi (2018) - A look into how messed up the NCAA student athlete recruiting process really is (1:48:18)","Do You Trust This Computer? (2018) - Documentary about AI and technology in the 21st century","The Doomed Cleveland Balloonfest of '86 (2018) - a short documentary about a seemingly harmless fundraising public stunt in Cleveland, Ohio and its aftereffects","The Vegan Ironman Diet of Cro-Mags’ John Joseph (2015)","Handmade in America: Sam Maloof (1983) - interview with &amp; process of an incredibly influential wood furniture designer (21:32)","The Grey Zone (2018) - The story of the last land dispute between the U.S. and Canada","Enfield Poltergeist (2007)","Waterlog (2018) - a short documentary which tells the story of writer Joe Minihane and his battle with anxiety","Fault Lines: The Prison Factory (2017) - Prisoners are striking across the US today to protest forced labor. Here's doc that used smuggled cellphones in Alabama state prisons to see what life in solitary is like for leaders of the largest prison strike in US history.","Lynyrd Skynyrd: If I Leave Here Tomorrow(2018)","World Without Sun (1964) - \"Jacques Cousteau's academy award winning documentary about the first manned undersea colony (1:32:21)\"","The Fifth Estate: E-Cigarettes : Welcome Back, Big Tobacco (2016) [1080p]","Minding the Gap (2018) (Hulu) - Three young men bond together through skateboarding to escape volatile families in their Rust Belt hometown.","The Facts of Life: The Lost Girls (2006) Compilation from 6 sources. [26:48]","The Incredible Story of The PayPal \"Mafia\" (2018)","Size matters - Surfing the 100ft swell at Nazare | 60 Minutes Australia (2018) [15m]","Inequality: How wealth becomes power. DW Documentary (2018) (41:50)","Soldier Girls (1981) - Glimpse into the life in women's basic training at Fort Gordon, Georgia. This was filmed shortly after women were fully integrated into the US military. Dir. by Nick Broomfield [1:23:11]","Foul Play: Paid in Mississippi (2018) four-part series diving into the NCAA football team Ole Miss investigation and a look inside the corruption of college football.","The Finest Cacao in the World: A Film by William Sheedy (2018)","Good Times (2000) A look back at the ground breaking and popular 70's sitcom about a black family in Chicago 42:00","The Toilet: An Unspoken History (2012)","BBC Documentary on the Buteyko Method (1998) (28:51)","The Nubian Caravans of Sudan (2014)","The True Story of Che Guevara - Marxist revolutionary allied with Fidel Castro. (2007).","A History Of Flight -Narrated by Tom Baker (2003)","Sex in a Cold Climate (1998). Interviews with survivors of the Irish Magdalene Laundries, two years after the last one had closed.","The Panama Deception (1992) The film is critical of the actions of the U.S. military during the 1989 invasion of Panama, covering the conflicting reasons for the invasion. It also highlighted media bias within the United States, showing events that were unreported or systematically misreported...","Women on a Bergman screen (2018) - Sight and Sound","Batman Unmasked The Psychology of The Dark Knight (2008) TV Documentary airing on the History Channel","Stormrider: Tornado (2017)","Voynich Code - The Worlds Most Mysterious Manuscript (2014) - A book, written by an unknown author, illustrated with pictures that are as bizarre as they are puzzling -- and written in a language that even the best cryptographers have been unable to decode.","Ross Kemp's Britain: S01E03 -- Alcohol Abuse (2016) [360p]","Bobby Fischer Against The World (2011)","The Skyjacker That Got Away (2009) - History channel documentary on the unsolved mystery of D. B. Cooper who in 1971, hijacked a Boeing 727 aircraft in the airspace between Portland, Oregon, and Seattle, Washington.","Inequality - how wealth becomes power (2018) - Germany is one of the world’s richest countries, but inequality is on the rise. The wealthy are pulling ahead, while the poor are falling behind.","Skanderbeg: Origins of George Kastrioti (2018)","The Rise and Fall of SimCity - The History of the SimCity Franchise (2017)","Inside a Cursed Appalachian Mining Town (2018) [25:19]","(2018);Made in China Artist In China Makes Van Gogh Replicas For A Living. Paints Around 700 Paintings A Month; Artist Zhao Xiaoyong Has Sold More Than 90,000 Van Gogh Reproductions. (2018)","Our Vinyl Weighs a Ton: This Is Stones Throw Records (2013)","Seven Knots of Suffering - A \"Sailing\" Documentary (2018) In May 2018, with no cruising permits and collectively little experience, three oufs from the Ottawa Valley sailed from Florida to Canada. They motored 80% of the time. Are they sailors? You decide! [10:09]","As Niagara Falls (2017) - A Ryerson university Student Documentary about the wide divide between tourism and the rest of Niagara Falls. The President of Ryerson University was forced to apologize to the Mayor of Niagara Falls due to this film.","Voynich Manuscript Revealed (2018) - The Worlds Most Mysterious Manuscript has finally been decoded.","Money, happiness and eternal life - Greed (director's cut) (2017) - \"An interesting documentary about greed, happiness, Buddhism, and eternal life\" [1:31:11]","The RuneScape Documentary - 15 Years of Adventure (2017) [1:23:03]","Hikikomori Loveless: What causes young Japanese hermits to give up on real life (2018)","The Year of Pluto - New Horizons Documentary Brings Humanity Closer to the Edge of the Solar System (2015)","Josef Mengele: Hunting a Nazi Criminal (2017) (0:52)","1:36 The War You Don't see (2010) A look at modern propaganda in western media","Decoding the Antikythera Mechanism (2015) - The 2000 Year-Old Analog Computer made by Archimedes.","The Turpin 13, Family Secrets Exposed (2018) - In Depth look at David and Louise Turpin, the couple that imprisoned and tortured their 13 children in their own home(s) for several years. [43:24]","HOW IT'S MADE: Old Hershey's Chocolate (1976) - A relaxing but informative vintage documentary about the entire chocolate-making process.","Enron The Smartest Guys In The Room (2005) is a 2005 American documentary film based on one of the largest business scandals in American history.","I Have a Message for You (2018) - On the train to Auschwitz, a young woman is faced with a life-shattering choice [13:43] [CC]","Illеgally Entering North Korea (2018)","When the Most Significant Men in Modern History Lived in the Same City (2018)","Cicada 3301: An Internet Mystery (2018) - A documentary about an anonymous \"group\" only known as Cicada 3301 that has posted 3 elaborate puzzles online to possibly recruit codebreakers/linguists from the public.","The Making of Pretty Lights' Album, A Color Map of the Sun (2013)","ZEITGEIST: ADDENDUM (2008) - A documentary showing the astonishing corrupt nature of the profit motive as well as the current global economic system and how we need to switch to a resource based economy","Kentucky Teenage Vampires (1998) Rod Ferrell the leader of a vampire cult in the bible town of Murray Kentucky drove to Florida where he brutally murdered his ex-girlfriend's parents.","Megafactories - Coca-Cola (2012) how coca cola is manufactured and where it began.","20 minutes documentary about Kabah cloth (2018)","(2007)(51:48)Highway in my Viens(HIV): Indian Truckers","(2003) Comic Book Superheroes Unmasked","93Queen (2018) - Hasidic Women Fighting to Become EMT's in the Communities","Building Sea City (Engineering Documentary) | Spark (2005) documentary about building sea land in kuwait back in the 1990s","Modern Marvels - Traps (2007) [CC] (44:48) S14E40","Dilveen (2018) CBC TV - How an 11-Year-Old Girl Escaped after being Kidnapped by ISIS","Channel 4 - 50 Greatest Documentaries - The 50 Greatest Documentaries was a Channel 4 television programme which was broadcast on 9 October 2005 and was narrated by British actress, Zoë Wanamaker. The list was compiled based on the nominations submitted to Channel 4 (2005)","Seven up (1964) - is a documentary film that has followed the lives of fourteen British children since 1964, when they were seven years old. So far the documentary has had eight episodes spanning 49 years (one episode every seven years.)","Yemen: the world looks away (2018) | DW Documentary [42:25]","People's Century - 26 Episodes series documenting the history of the twentieth century through the testimony of those who lived through it. (1997)","Trophy kids (2013)- A look at parents that excessively push their children in sports","The Search for General Tso (2014) - Exploring the origins and ubiquity of Chinese-American food through the story of an iconic sweet and spicy chicken dish","Shy Boys IRL (2011) - 'a documentary about incels, loneliness, and PUA'","RELEASED TODAY! \"Cool Deserts\" (2018) (11:23) [CC] - Brand new documentary on these cold and parched areas of Earth, featuring extensive HD footage of the American West, Atamaca and Gobi Deserts and how they got that way","Dolphin Man (2018)","The Secret World of Gold HD (2013) - \"Get In-Depth into the Mysterious World of GOLD\"","The Mysterious Disappearance Of Américo Sebastião (2018)","Noam Chomsky- Manufacturing consent (1992)","Inside Antarctica's Bizarre International Research Town (2017) [720p]","Against the Elements (2018) - Tham Luang Cave Rescue","BULLWHIP: A Documentary (2018)- A short documentary on bullwhips","Psychosis | BEDLAM (2018)","Story of James Clerk Maxwell(2018) Short documentary (5:25)","Inside the Asian Crip Gangs of Long Beach (2017)","Mossadegh Trial (2015): In 1953, Iran’s democratically-elected Prime Minister Dr. Mohammad Mosaddeq is overthrown in an American-British coup, aided by internal pro-Shah elements. Mosaddeq is then put on trial [42:29]","The Dark Side Of Britain: Spice (2018) [25:11]","Testament: The Bible And History (1988) John Romer","Influence of The Occult on Nazi ideology (1991). 4 Part Documentary. Full playlist in the comments.","Live Forever: The Rise And Fall of Brit Pop (2003)","Kylie Minogue at 50 (2018)","The Hollow (1975) Early in the 19th Century two families, the Allens and Kathans, settled in the Southern Adirondack Mountains of New York State. By the end of the century, the Allens and the Kathans had intermarried: all the residents in the Hollow were related. [01:04]","Zion (2018) Netflix","21st Century Hackers - (2018)","Inside London's Gang Violence (2018) | Sky News - Short 15 minute video on London's gang culture","Sleeping Rough (2017) | Girls Living On The Streets Of Brighton","What Trees Talk About: A revealing look at the secret life of trees. 44:18 (2018)","Chasing The Cumbrian Killer (2010) About Derek Bird who shot 12 people in Cumbria.","The Life of Adam (2015) What Do We Know about the Sandy Hook School Shooter?","The $1,000,000,000 North Korean Bank Heist (2018)","Tangerine Reef - The Audiovisual Album By Animal Collective &amp; Coral Morphologic (2018) [1 Hour]","Your Inner Fish ep 1 (2014)- “An evolutionary history of human anatomy” [00:55]","Pervert Park (2014)| Pervert Park follows the everyday lives of the sex offenders in the park as they struggle to reintegrate into society.","The Weather Underground (2002) - \" From peaceful anti war activists to militant revolutionaries determined to overthrow the US Gov, this documentary tells you all you need to know about The Weather Underground\" [1:30:25]","Canada's Original Vigilante Pedophile Hunter(2017)-[51:54]","A Brief History of Fat (2018) - Fat is a complex organ, as essential as the heart or liver. Why do we hate it?","The Technocratic Global Government of the Future Is Here (2018) The Space Kingdom of Asgardia","PanamaPapers – The Shady World of Offshore Companies | Das Erste | NDR (2016)","Calving Season: Life and Death on a Montana Cattle Ranch - Op-Docs (2018)","Minding the Gap (2018) - Devastatingly beautiful Sundance winner about three young skateboarders bonding together to escape their volatile family lives in their Rust Belt hometown. Just got put up on Hulu","The Caspian Sea Monster (1998)| CH4 Equinox 13-12 Ekranoplan -","The Tables (2018) Short documentary about the people playing at a pair of outdoor ping pong tables in the heart of New York City [15:03]","Zero Hour - E04 Terror in Tokyo (2004)","Zero Hour - E09 Capturing Saddam (2006)","Under water tour of the river Wensum. (2018) (09:08)","History and Sewage: The Great Stink of 1858 (2018) - London sewers considered one of the seven wonders of the industrial world","Antoni Gaudí (1984) - The straight line belongs to men, the curved one to God. Barcelona's and God's architect.","Mo Farah: Why I Run documentary (2018)","The Devil and Daniel Johnson (2005) The life of Daniel Johnston, depressed shipyard singer, composer and actress from childhood to date. [2:02:32]","Nancy Wake: Gestapo's Most Wanted (French Resistance Documentary) | Timeline (2018)","(2014) The Story of Aaron Swartz (reddit co-founder) Full Documentary","Weekend in Havana with Geoffrey Baer (2017) Join Geoffrey Baer as he travels to Havana, where dancers, musicians, architects and writers invite him into their lives to experience the color, culture and history of a beautiful and seductive city only recently re-opened to Americans","The Rise and Fall Of Orion Pictures (2018) - Studio powerhouse known for Caddyshack, Robocop and Silence of the Lamb, at one point making hit after hit, until their demise [8:23]","Dr. Banting's Miracle Drug (2018)","Normal Guy quits job to farm (2017) - more of a docu-short since it's 23 minutes.","Empire Of Dust (2013) [1:17:22] \"A raw documentary showing Chinese Presence in Africa\"","Coal mining in America's heartland | DW Documentary - (2018)","The power of the credit rating agencies - Docu - (2012)","Sapience(2018) - no funding to finish. this is the opening sequence.","The International Space Station (2015) - This explains each interior pressurized module, crew living quarters, and scientific equipment.","Grindadráp!(2018): \"A documentary on whaling in the Faroe Islands. Filmed and edited by two hitchhikers with a tent, a couple of cameras and the right instincts. Contains graphic scenes\"","L.A County Jail Documentary (2013)","The Nazi Pedophile Apocalypse Cult (2018) - [CC] [11:19]","The Toilet: An Unspoken History (2012) [720p]","Exile in Buyukada (2000) — Fascinating account of Leon Trotskys exiled years living in Istanbul. The narration by Vanessa Redgrave lends accessibility to this inflammatory historical figure's life, while the cinematography fills the screen with beautiful, epic-minded imagery.","PUMPED DRY: The Global Crisis of Vanishing Groundwater (2018)","9/11: Explosive Evidence - Experts Speak Out (2012) Over 1,700 engineers and architects explain the unsettling theory that scientific forensic evidence points to explosive controlled demolition of the three World Trade Center skyscrapers on 9/11 and how WTC 7 is the ''smoking gun''","Jackpot (Hardcore Bingo Documentary) - Real Stories (2018)","Vitamania: The Sense and Nonsense of Vitamins (2018) Almost one billion of us take a regular dietary supplement, mainly vitamin tablets. Vitamins are enthusiastically endorsed by celebrities, and vitamin-fortified foods line our supermarket shelves. But how safe are these products?","Manben: Junji Ito (2016) - A look into the famed horror manga artist, hosted by Naoki Urasawa (Monster, 20th Century Boys, Pluto).","The Tax Free Tour - documentary - (2013)","Freight Train Hopping America (2018) Couple of friends on a journey to hop trains from LA to NYC in one month","S.A.D. (2013) Follows the everyday struggles of a 24-year-old woman with Social Anxiety Disorder [8:32]","‘Young carers: looking after mum’ (2007) A harrowing look into families where children are carers to their parents. Warning; some scenes of child neglect.","Life After 40 Years in Prison (2018) - \"After serving 40 years in prison he has some stories to tell and having to adjust back into the world\"","I am Paul Walker (2018) Documentary examining the life of the late actor.","Inside Hong Kong's cage homes (2018)","Al-Nakba: The Palestinian Catastrophe (2013) - Episode 1 of 4. \"If the Nakba signifies the expulsion of the Palestinian citizen from his land and the seizure of his land--then the Nakba began decades before 1948.\"","DW - German public broadcaster has trove of high quality documentaries for free (2018)","The Elder Scrolls: A Promise Unfulfilled (2018) [1440p] [78:13] | Complete Elder Scrolls Documentary, History and Analysis","Hitler's drug is invading Europe again (2018)","YEOOO!! 72 Hours in Belfast's Holylands (2018) - documentary looking at unwelcome St Patrick's celebration in Belfast (22mIn)","What Caused the Black Plague: Secrets in the Bones (2014) - Hunting the DNA of the pathogen that caused history's most deadly plague","The Lost World of Mitchell &amp; Kenyon. (2004) The discovery of a cache of films from pioneering filmakers reveals the lives of British people in the earliest years of the twentieth century","Peter Frankopan - The silk roads - VPRO documentary (2017) \" \"The power is shifting from West to East. Until today, the world history was a western-centered enterprise - based on the belief that everyone should be like us, or at least should want to be.\"","African migration from Europe to China (2013)","Watch One Family's Journey Through A Life-Changing Face Transplant (2018) [22m:52s]","Pizzagate and Beyond - The Big Picture - Renegade Films (2017) [1:00:27]","Black market tobacco floods Australian market - The Feed (2016)","Star Trek: The Next Generation DVD/Blu-Ray (2013) Season 5 Character/Actor Perspectives [28:59]","An Inconvenient Goof: A Joe Matarese Documentary (2018) - An in-depth exploration into the tortured mind and troll-infused breakdown of stand-up comedian Joe Matarese [50:04]","The Drug Whisperer (2017) - How you can be arrested for DUI even if you're sober","Feeling Speed (2018) - How the group 'Deaf NASCAR Fans' experiences racing","Sex and Fame: The Mary Millington Story (1996) - The life and tragic end of England's first Pornstar celebrity.","Scrapper (2014) Outlaws and survivalists scavenge an active military bombing range near the Mexican border.","Special Operations India : Myanmar (2017) (720p). A recreation of a cross-border anti-insurgency raid in Myanmar by Indian Special Forces (Para SF) named \"Hot Pursuit\".","The Exclusive Brethren (2003) - [360p] [50min] | A BBC programme that looks at life inside a closed Christian group. Contains interviews with priests from the group as well as its ex-members.","Testing Tolerance (2018) - Swedes are saying ''enough'' to immigrants, unstoppable crime, no-go zones, Sharia law and gang rapes by Muslim refugees","Walking In A Sacred Manner (1982) An oratory anthology,philosophy, and life of the Native Americans Great Plains [28:07]","Digilante (2017) - A filmmaker confronts the real-world damage he caused when he uploaded a viral shaming video that resulted in two jail terms [28:43] [CC]","Eden Prince - Watch This Space (2018)... A short doc I shot with musician Eden Prince in Ibiza, used a Panasonic EVA1, DJI Mavic and Sony minidv cam. Was pretty stoked with how the edit came out, especially the color and sound work which I'm not an expert at","Our Man in Tehran (2018)- ~4 hours split into two episodes \"...offers surprising encounters inside the closed society of Iran, as (Thomas) Erdbrink gets Iranians to reveal the intricacies of their private worlds and the challenges of living under theocratic leaders\" [CC]","Furries | Down the Rabbit Hole (2018) - Traces the origins of the subculture from its roots in underground 70's zines to the infamous fandom that it as known as today [2018]","Dear Zachary: A Letter to a Son About His Father (2008)","Breaking2 (2017) | Nat Geo Documentary Special about Nike endeavors to crack the Two-Hour Marathon (55:00)","African Americans in Vietnam - Bloods of Nam/ PBS Frontline (1989)","Lost World Of Pompeii (Ancient Rome Documentary) | Timeline (2016)","Adventure in Cairo, Egypt (2018) I documented my trip in Cairo, Check it out!","Anonymous - The Story of Aaron Swartz - This film follows the story of programming prodigy and information activist Aaron Swartz. From Swartz's help in the development of the basic internet protocol RSS to his co-founding of Reddit, his fingerprints are all over the internet. (2014) [1:44:59]","Train Surfing Wars: A Matter Of Life &amp; Death (2018)","Singapore - The Lion City (1957) - An old travel film on Singapore before independence, showcasing Singapore lifestyle as it was. [15:36]","Mountain In The Hallway (2018) Two men attempt to beat cancer and embrace life by climbing the Grand Teton 00:26","John McCrae’s War - (1998) The life and service of Lt Col John McCrae, Medical Officer and Poet of “In Flander’s Fields” [46:13] [CC]","Computer predicts the end of civilisation (1973) - Australia's largest computer predicts the end of civilization by 2040-2050 [10:27]","A Battle of Lies - Fake News in the Great War (2018) - A documentary about the use of propaganda on both sides in the Great War and how it influenced the development of propaganda throughout the 20th Century","Toiling in paradise: seasonal work in Santorini (2018) - Seasonal workers toil under substandard conditions.","Operation Ghost Stories: The Secret FBI Mission to Catch Russia's Hidden Spies in America (2018) [11:27]","I Am Paul Walker (2018) - A documentary of the life of the movie star Paul Walker, who passed away in 2013.","Experimental Compound MER 17 (Frenquel) and LSD-25 (1955)","For A Deaf Son (1994): Heartbreaking Doc about parents deciding between sign language and oralism for their deaf son. (57 min)","The Battle of Lewisham (2018) \"A contemporary awakening of the events of The Battle of Lewisham, which took place in the streets of New Cross, South East London on August 13th 1977. \"","Operation Chrome Dome and the Palomares Incident (2018) - US Air Force Nuclear accident","Pickpocket King Bob Arno (2012) - Las Vegas stage swindler travels to Italy in search for the best pickpockets.","Furries | Down the Rabbit Hole (2018) - \"Who are they, and where did they come from?\"","Joe Matarese: An Inconvenient Goof (2018) (50:03)","The Saturn V Story (2018)","A Whale of a Tale|Trailer (2018) A response to 2009's doc \"The Cove\". Told through a wide range of characters including local fishermen &amp; international activists, this film unearths a divide in eastern and western thought about nature,wildlife and cultural sensitivity in the face of activism.","Vitamania (2018) - investigation of vitamin science and history from molecules to marketing, from colds to chemotherapy (1:30) [CC]","The Greatest Tomb on Earth: Secrets of Ancient China (2016) - Discoveries at the Mausoleum of the First Qin Emperor, a mighty tomb guarded by the Terracotta Warriors. The site itself is 200 times larger than Egypt’s Valley of the Kings and the final resting place of China’s first emperor.","The Taxing Question of Land (2013)","How to Start a Sex Cult (2018)","Norfolk Uncovered: The North Walsham &amp;amp; Dilham Canal (2014) \"A documentary about the history, abandonment and attempts at restoration of The North Walsham &amp; Dilham Canal\" (24:22)","(2018) Seven Knots of Suffering - A \"Sailing\" Documentary (PART 2/3)","Hospital Series - Terror attack victims (2018) repost from r/videos-The BBC was about to film a documentary about a London hospital when the Westminster bridge terrorist attacks happened. It is an unprecedented view behind the scenes of a mass casualty incident.","Bill Cosby: Fall of an American Icon - BBC Documentary (2018)","Lawyer Lin (2018) - short documentary of a human rights lawyer inside China that got its creator David Missal expelled from the country [9:24]","Chilling out (2012) - Visiting the coldest town in the world | 60 Minutes Australia","Introducing Roy Buchanan (1971) Doc about the Best Unknown Guitarist in the World. Also known as \"the Man Who Turned the Rolling Stones Down.\"","Bush Babes (2009): Far away from the bustle of modern life, this family have found the ultimate alternative life.","70 Acres in Chicago (2014) - documentary about the renowned Cabrini Green housing project in Chicago, and how something that showed so much promise ultimately failed [54:56]","Grey Space (2016) - \"Short Documentary about the struggle of one beekeeper an urban environment.\"","Murder in Paradise (2018) - The Murder case of two British backpackers, Hannah Witheridge and David Miller.","IN THE REALMS OF THE UNREAL (2004) A documentary on Henry Darger, visionary artist, janitor, and novelist.","Investigation in Gori – The death of Stan Storimans (2009) \"An investigation into the murder of Dutch cameraman Stan Storimans during Russian bombing of the Georgian city of Gori during the war in Georgia\"","Art of Shame (2016) - Exploring the tattoo culture of Japan and the stigma surrounding it [23:16]","My Dad, the Facebook Addict (2018)","Hallucinogen Honey Hunters (2013) - \"Hunting mad honey\"","Carts of Darkness (2008) Murray Siple follows a group of homeless men who race shopping carts down the steep hills of North Vancouver.","Tyke: Elephant Outlaw (2015) - A circus elephant rampages through Honolulu, exposing the abuse she and other elephants endured","Saving the ocean by retrieving golf balls (2018)","The World According To Philip K. Dick [42:27] (2018)","Can China Dump Its Waste Addiction? | Foreign Correspondent (2018)","Bengali Backlash (1997) - Racism faced by youth of Bangladeshi origin in central London","STORY OF SIR ISAAC NEWTON(2018)BIOGRAPHY,DISCOVERIES","Vulnhub Walkthrough(2018) - \"Covfefe\"","Painters Painting: The New York Art Scene (1972) Doc covers American art movements from abstract expressionism to pop art through conversations with artists in their studios.","9/11 Alchemy - Facing Reality (2018) [2:58:24]","I'm a Stranger Here Myself (1974) Hollywood improvisational director-turned-teacher Nicholas Ray offers his views on filmmaking in general and the creative process in particular.","Sphere of Influence: Russia's Foreign Policy [25:53] (2016)","Documenting Hate (2018): the rise of white supremacists groups one year since Charlottesville | FRONTLINE","(2017) Leonora Carrington: The Lost Surrealist [57:46]","Fugazi - Instrument (2001) [2:18:17]","It's About Time (2015) Documentary about Film Director Nicolas Roeg","Story Of Bill Gates(2018)Biography,Interview","Mark Kermodes Secrets of Cinema (2018) Ep1. Film critic Mark Kermode presents a fresh and very personal look at the art of cinema by examining the techniques and conventions behind some classic genres: romcoms, heist movies, coming-of-age stories, science fiction and horror","Story of Leonardo da Vinci(2018) - Facts &amp; Summary(13:22)","Song from the Forest (2013) Louis Sarno spends 25 years recording over 1,000 hours BaAka music. When he returns to the United States with his pygmy son, he realizes he is not part of the globalized world anymore.","\"Riot on the Dance Floor\" Film Trailer (2011) - The story of City Gardens and the bands that played there. [6:43] [Trailer]","The Hidden Nature of Korea (2018) - A BBC documentary on Earth's hidden wilderness. [58:01]","What it’s like to live with Dissociative Identity Disorder (2018) (1 hour)","How Juul made nicotine go viral (2018) - How Cigarettes are making a comeback by advertising to Generation Z [5:56]","\"Inside The American Mob\" (2013): A Great Series About The Rise And Fall Of The American Mafia. Explains How Much Power They Had, The Life, The Social Hierarchy, How The FBI Infiltrated Them And Dismantled Them. Very Fascinating For Godfather, Scorsese, Soprano Fans!","Black Lives: Struggle (2018) America’s racial divide remains a troubling national problem that has been brought back into focus in recent years. We start exploring the racial profiling issue in the black suburbs of St. Louis, where activism has gathered pace since the Ferguson unrest of 2014.","Bhutto (2010) - Chronicles the life of one of the most complex and fascinating characters of our time, Benazir Bhutto [1:51:11]","Snowing In June (2018) - The Eastern Cottonwood Tree on Presque Isle [2:56] - [OC version available in description]","Found-Hema-Trema (B-Side Version) (English Subtitles) (Feature Film) (84') (2018)","Scott Storch - Producer behind many famous songs including Dr Dre, 50 Cents, Beyonce and many more (2018) (19:58)","Man and Fire (2015) smelting steel from iron sand with a charcoal fire","Mob on the Run (1987) - \"An extensive overview of organized crime operations and infiltration of the Las Vegas casino and gaming industry, covering the years 1931-1987, and a major source for Martin Scorsese's Casino\"","The History of Computer Animation (2018) a look at the development of CGI between the years 1964 and 1982 [10:04]","World War A - When Aliens Attack (2016)","PARIS CATACOMBES (2014) - As life goes on in the streets of Paris, 20 metres beneath among 6 million bones \"Cataphiles\" explore, create and party among the catacombs of Paris.","Frontline - Documenting Hate (2018) [1 Hour]","Among the Believers (2015): A look at the continuing struggle between secularism and fundamentalism in Pakistan. Focused on the controversial Red Mosque (Laal Masjid) in the heart of Pakistan's capital, and some good citizens doing their part. [01:25:00]","POOLJUMPERS documentary trailer (2008)","Cry of a River (2017) - Documentary about the troubles with India's toilets and drinking water [25:13]","Story of Rosalind Franklin British chemist(2018) - Biography for kids.(7:36)","Tales Of The Gun - The AK-47 (1998) [CC] (45:56)","Why We Cube | A Speedcubing Documentary , how the Rubik's Cube has affected people's lives. (2018) [CC] [43:05]","Causing a Catastrophe (2018) - a levee breaks, one of thousands during the Great Flood of 93. Was it an act of God? Or could it have been one man?","Crime Free Orania (2018) -- South African crime free \"White Ethnostate\"? [25:24]","The world according to Philip K. Dick | DW Documentary (2018) 42:26","Story of Scientist Antoine Lavoisier(2018) - Biography for everyone.(5:32)","Children for Sale (2009) - Brutally frank look into the sexual enslavement of young girls in modern Cambodia [NSFW]","Mexican Mafia Turn Their Victims Into Stew (2017) - The ruthless way of hiding people in mexico","The Rise of UK Afro -\"?\" (2017) - A documentary on the rise of African influenced music dominating the UK urban scene [0:15]","‘It's The Sun Wot Won It’:(2018) Propaganda Filters of Western Media, Ownership","The Gun Markets of Pakistan (2011)","US Air Force Tragedy at Texas Tower 4 (2018) The History Guy","The Story of Donald Trump's Immigrant Ancestors (2018) [4:06]","National geographic: The Curse of the Hope Diamond (2010)","Interview With A Starseed (2018) - Amateur documentary on individuals who believe they are reincarnated from different planets and star systems.","Vreugdevuur Scheveningen (2018) [excerpt/trailer] - A neighborhood's fight to build the largest bonfire in the world [04:05]","Tractor Hacking: The Farmers Breaking Big Tech's Repair Monopoly (2018)","A Swedish Elephant (2018) (English subtitles) - \"Have you wondered what happens Last Night In Sweden? This documentary covers what happened after the refugee crisis 2015 in Sweden, who received the second highest number of refugees in the whole EU, until today.\"","Sapience(2018)","A Look Behind The Curtain At Gaming Culture (2018)","Inside North Korea (2011)","Burglar confessions (2015) - of a man who burgled hundreds of homes in Texas for over 20 years (43:03)","Romania's last orphanages (2018) Over 100,000 children were abandoned in Romania's orphanages during the communist dictatorship of Nicolae Ceausescu. Nearly 30 years on Romania, like most other countries, is closing down the last of them. [08:20]","NOVA: Arctic Ghost Ship (2015): preview. In 1845, two British ships sailed with 129 men intent on finding the northwest passage. Also avail at Netflix.","One Year After Charlottesville, The Alt-Right Is In Shambles(2018) - A look at what happened to the people behind Charlottesville a year later","The 33 Day War (2015) How Hezbollah Defeated Israel [22:02]","Documentary of Mussolini (1996)","Chefchaoune\"شفشاون\" The blue City of Morocco (2018)","Pepcon Explosion (1988) - On 4 May 1988 about 4,250 short tons (3,860 metric tons) of ammonium perchlorate (NH4ClO4) caught fire and set off explosions near Henderson, Nevada. A natural gas pipeline ruptured under the stored ammonium perchlorate and added fuel to the later, larger explosions.","Mount Athos (2011) A Visit To The Holy Mountain, an 1,800 year old Autonomous Monastic State located in Modern Greece, CBS 60 Minutes [30:25]","Floating On Trash (2017) - An environmentalist has created an entire island floating on trash. This man lives on an island paradise.","\"On South\" (English Subtitles) A Film by Chris Lévy (2006) (27')","Moon Shot (1994) the inside story of the Mercury, Gemini, and Apollo NASA Programs which led to the first humans walking on another celestial body, the MOON.[3hrs]","EU's population explained as if it were just 100 people (2018)","Modern Marvels - Firefighting!: Extreme Conditions (2005) [CC] (44:32) S12E09","Living in a Parallel Universe (2011) - Parallel universes have haunted science fiction for decades, but a surprising number of top scientists believe they are real and now in the labs and minds of theoretical physicists they are being explored as never before.","I Am Unhealthy - A Docu-Series (2018) this is the 3rd episode in my series where I explore that getting healthier only gets harder the longer you’re on the journey","Why were Alexander the Great’s Body and Tomb So Important? (2018) - Political games, intrigue, and mystery around the body of Alexander the Great. [11:43]","Best Kitchen Gadgets That Makes Lifer Easier You Should Try (2018)","Lost Generation (2015) - Short documentary about three young people living in Bosnia-Herzegovina 20 years after the war","First Firearms (1998) [43:29]","Life in the Spincycle (2011)","Most Advanced Student Gadgets We Really Need To Know (2018)","BBC The King of Communism: Nicolae Ceausescu (2016) [56:03]","Documenting Hate: Charlottesville (2018) Last night release work from Frontline and ProPublica is a must watch.","The Devil and Father Amarth (Trailer) (2018) - the director from the movie The Exorcist meets with the official exorcist of Rome to document an actual exorcism","Fahernheit 11/9 (Trailer) (2018)","Paedophile Hunters - Working Outside the Law (2018) - A documentary about the fast raise in paedophile hunting groups in the UK.","Flanders and Swann - BBC (1994) - released to commemorate the death of Swann.","Secrets of the Castle: Why Build A Castle? | Episode 1 (2014) Historian Ruth Goodman and archaeologists Peter Ginn and Tom Pinfold turn the clock back to learn the skills of medieval castle builders in this 5 episode series.","The decline of Hong Kong's iconic neon glow (2018)","Apollo 13 : The Real Story (2012)","The Disordered Mind: Psychotic Conditions: Paranoid Schizophrenia (1963) - A man with Paranoid Schizophrenia is interviewed, as well as his mother, friends and employer who describe his deterioration and recovery (26:40)","The Battle of Adrianople 378 AD (2018)","Keeping Britain Alive: The NHS in a Day - Episode 5 - Deep Brain Simulation (2013). A Small BBC doc following my neurosurgeon who saved my life, Professor Ludvic Zrinzo, looking into his work on Parkinsons and DBS.","CineMassacre 200: a filmmakers beginnings (2008) - A short documentary on the early films of James Rolfe(AVGN,Board James) and the challenges faced in his early film career up to the creation of the Angry Video Game Nerd (23:04)","The Truth About Jeffree Star (2018)","Ted Bundy (2002) - Ted Bundy was one of Americas most prolific serial killers who assaulted and murdered many young women and girls during the 1970s, possibly even earlier. The docu also includes interviews with several women who were lucky enough to survive attacks from Bundy.","The Boy Who Sees Without Eyes - Only Human (2007)","In Defense of Columbus: An Exaggerated Evil (2018) - Columbus is a controversial historical figure who is widely viewed as terrible. But as with most stories, his bad deeds have been exaggerated to make him fit the role of a villain. (30:00)","Popeye: The Jailhouse Interviews Pt. 2 (2018) - Series of interviews with the last surviving member of the Medellin cartel.","Yasen-M (2018) - The Yasen-M submarine is equipped with a new array of electronic weaponry and state-of-the-art missiles that can take out any warship in one strike.","Malcolm Douglas Across the top (1968) a look at northern Australia places, rituals and traditional aboriginal life and some exciting educational stuff this man is a legend.","Documenting Hate: Charlottesville | FRONTLINE (2018) - \"FRONTLINE and ProPublica investigate how the violent and infamous rally in Charlottesville in 2017 became a watershed moment for the white supremacist movement\"[55:02][CC]","Immortal Egypt: Invasion (2016) Joann Fletcher discovers how Egypt's enemies exploited a country weakened by internal strife, ultimately leading to its destruction.","Manchester The Night of The Bomb (2018) - Tells the story of that night in forensic detail, through the eyes of teenage girls who survived the attack and key members of the emergency services. It features unseen mobile phone video and unheard audio recordings.","The Explosion of Bullshit Jobs (2017)","\"The Yard\" EP 30 (2018) A man's journey to reunite with his long lost sister.","(1996) (BBC) The Princess and the Playboy - The incredibly interesting story of the first female Muslim prime minister Benazir Bhutto, her marriage and eventual removal from power","Niccolo Machiavelli BBC (2014)","BBC: The Mystery of The Voynich Manuscript (2017) - “Imagine a book which no one can read. A manuscript in a language no one can speak. It is both priceless &amp; worthless. It came from the Old World &amp; lives in the New World.” [01hr:38min]","Documenting Hate Charlottesville (2018)","Substitutes (2018) - Senji Nakajima is a 62-year-old man from Japan, who found love with his silicone sex doll he named Saori. She is more than silicone and plastic to Nakajima, who treats her as a real girlfriend and lives separately from his wife.","Base 60: Babylonian Decimals (2000)BC","Battle of the Bulge 1944 DOCUMENTARY (2018)","The Hidden History of Humanity (2017) | Monadic Media | Based upon the Secret Doctrine, Mahabarata, focuses on the evolution of consciousness over millions of years while revealing the secret chronology of human history, while following the natural cyclic deluges between races.","Radio Bikini (1988)","Avatar: Spirits (2013) - For all you avatar fans out there","Mega Tornado (2004) - Tornado documentary perfectly predicts the 2013 Moore OK Tornado, including children in schools being vulnerable.","Hottest kitchen Accessories every home cook needs in (2018)","World's Biggest Cave Discovered in Vietnam(2018)","The Punk Singer (2013)","Imam Hussain Museum - Karbala, Iraq (2015)","Islam’s Non-Believers – ITV Documentary (2016) – Discover the next civil rights movement: the ExMuslim movement","The Collapse of The American Dream Explained in Animation (2011) [1080p]","What's Your Beef? Let's end the Cowspiracy (2018) (37:51)","Vickers Viscount.The First Turbo Prop Plane in the world (2015) - BBC Date but it uses segments from 50's and 60's film.","A rescue service in need of rescue? (2016)","Saxon Gold New Secrets Revealed (2011) British metal detecting enthusiast Terry Herbert struck gold when he uncovered over 3,500 Saxon artefacts in a field in 2009. Examine the latest theories and marvel at the craftsmanship, ingenuity and sophistication of Anglo-Saxon ancestors.","The Passionate Eye: Saudi Arabia Uncovered (2017) - A look into the secret underbelly of Saudi Arabia (46:33)","Lost in Manboo (2015) - A four-square-metre box with a screen and computer. This is what Japanese cyber-cafes offer, around the clock. Most customers just spend an hour or two here. But there are thousands who spend their lives in them.","The Disturbing Case Of Billy Milligan (2018) - \"Billy Milligan was a victim of multiple personalities. However, in his case he had 24 different personalities, his alter egos would encourage him to do crimes.\"(12:03)","What Owning A Ramen Restaurant In Japan Is Like (2016)","Japanology Plus - Roadside Stations (2018) What is a Japanese rest stop/pit stop like?","Resurrect Dead: The Mystery of the Toynbee Tiles (2011) - \"Toynbee Tiles are of unknown origin found in the asphalt of streets in 24 major cities in the United States &amp; four South American capitals; since the 1980s, several hundred tiles have been discovered.\" (01hr 17min)","BBC - Norway's Silent Scandal (2018) A look at Norway's Child Protection Agency and it's top expert who is now convicted of downloading and sharing large amounts of child pornography over the past 20 years. (24:29)","Crisis in Black America(1986) An exploration of the beginning of the epidemic of single mother hood in the black community and their views on welfare 1:31","The Redemption of General Butt Naked (2011) - a disturbing look at the life of a mass-murdering, cannibalistic Liberian warlord, who converted to Christianity and has become a preacher. The film explores whether someone who has committed such evil acts can, or should, ever truly be forgiven. [01:26]","Apocalypse - Stalin (2015) - comprehensive in-depth French documentary about Stalin's life, rise to power, and crucially his role during World War II, with a trove of recently colored rare footage from key moments.","I Was There When House Took Over the World (2017) - How social unrest and Chicago's underground gay clubs led to a global dance movement","Iran: From Theocracy to Regional Superpower? (2018)","History Of The AFL - American Football League Documentary (1996)(57:01)","Modern Marvels - Insulation (2006) [CC] (44:17)","In Defense of Plants: Dunes (2018) short documentary about the plant community in the dunes of Lake Michigan.","BBC David Hockneys Secret Knowledge (2003) The Artist who originally detected the use of optics in old masters, and replicated their use.","The Smallest People in the World - Only Human (2017) An eye opening documentary about the daily lives of those with Primordial Dwarfism, the rarest out of the over 200 kinds of Dwarfism.","Pigeon Kings of Brooklyn (2015) - An endearing short doc about pigeon keepers in New York City [08:03]","Traveling Iran by train (2017)","Stoked: The Rise and Fall of Gator (2002) - A documentary exploring the rise and fall of 80s skateboard legend Mark \"Gator\" Rogowski.","The Internet was a mistake (2018) - How access to more information makes people complacent","Bloodland (2018) - The reasons why Australia may offer asylum to white South African farmers [28:49]","This Is What The Life Of An Incel Looks Like (2018)","Boot Camp: Making a Sailor - Episode 1 (of 6) (2018)","Tim's Vermeer (2014): An inventor obsesses over how Vermeer painted so realistically. Decides to figure it out and recreate a Vermeer painting without any prior experience. Narrated by Penn Jillette.","The Putin Interviews - Oliver Stone part 1 of 4. (2017)","Space Shuttle Columbia Investigation - Last Flight of Spaceshuttle Columbia - BBC (2009)","Fear and Loading: Meet the NRA's Most Wanted Customer (2018)","How water for millions was silently contaminated across the US - [Trailer] GenX: a Chemical Cocktail (2019)","I Am a Killer (2018) - True crime documentary series that looks at the stories of prisoners currently on death row in America awaiting their fate. With extraordinary access, each prisoner is interviewed to discover their motivations and how they now view the crime","The Crusades: An Arab Perspective (2016) - An ambitious four-part documentary produced by Al Jazeera, The Crusades: An Arab Perspective features handsome production values, convincing historical reenactments and a wealth of revealing information on this much dissected period of world history.","Bangladesh - dawn of Islamism | DW Documentary (2018)","The Man Who Made the Supergun (1991). The story of Gerald Bull, the Canadian scientist who co-created modern ballistics, and was murdered by the Mossad in 1990.","*Amazon Deforestation &amp; Slavery* (2011). A video about the ongoing, unstoppable, rapidly increasing destruction of the \"Green Lungs of the Earth\" for cattle grazing profits - and the murders of those who try to stop it.","History of Russia (2016) - An engaging history of Russia from ~2500BC to the 20th century (46:59)","Genghis Khan, Rise of Mongol Empire (2012) - BBC","The Imposter (2012) - A documentary centered on a young man in Spain who claims to a grieving Texas family that he is their 16-year-old son who has been missing for 3 years.","Speed Machines: Cutty Sark and the Great Clippers (2003) [49:03]","The Dubious Friends of Donald Trump (2017) All parts in one","Life Inside Bali's Infamous Kerobokan Prison | Foreign Correspondent (2017)","The Betrayed (1995) - Documentary on the First Chechen War and the mothers search for their captured sons. (1:19:46)","The Problem with Mario’s Hair (2018) - a troubling in-depth look at Nintendo’s artwork over the decades by Nick Robinson, featuring Maya Mathur and SupperMarioBroth - [24:35]","Little Pyongyang (2018) A former soldier in North Korea, lives today with his wife and children in a sleepy London suburb, home to Europe's biggest North Korean population. (24:02)","The End of the Road (2018) - \"The community of Lund, B.C. became the home of American hippies, free spirits and anti-Vietnam war types who arrived fleeing the politics of late 60s America.\" - CBC [CC]","Battle Of Targoviste (2018) Dracula's night attack [18:12]","The Fake Van Goghs (1997)","The Most Dangerous Town on the Internet - Where Cybercrime Goes to Hide (2016) A Movie about bulletproof hosting","Cities: Skylines, Astergea (2017) - Yuttho visits New York City to explore its urban development and history, and apply it to a city of his own design","Do Communists Have Better Sex? (2007) [51:20]","A small-town couple left behind a stolen painting worth over $100 million — and a big mystery (2018)","Defunctland: The War for Disney's America (2018)(37:32)","Andy Warhol - The Complete Picture (2001) mini series about the life of the artist [3hrs]","The Kidnapping Of Marie McDonald (2018) - Famed Hollywood Actress is kidnapped in her home one evening, and the LAPD’s investigation into the crime leads into a bizarre web. [12:12]","The Rise of Hitler (2017)","The Colonel's Chicken: Inside KFC, The Billion Dollar Chicken Shop (2016)- A doc that looks at both sides- inside the stores and UK operations, and its impact on communities, and locals' response to the brand's proliferation.","Plastic China (2017) - the ugly side of our out-of-sight out-of-mind recycling 27min","My child is dying of Krabbe disease: A day in the life (2018)-[23:46]","Should It Be Legal to Sell Your Organs? (2018) - \"How organ trafficking works and potential solutions.\" [CC] (8:33)","I Have a Message for You (2018) - \"Escaping Auschwitz.\" (12:45)","documentary (2018) A hindu worship place and rituals in temple INDIA","Why Hong Kong’s Buildings Are Full of Holes: How Feng Shui Shaped Hong Kong's Skyline (2018)","The 21 Faces of God (2018) An exploration of the esoteric meaning of the Tarot (2:48:04)","Wild Animals Journeys - Part 1 : Orang Utans in The Wild - Julia Roberts Journeys (1998)","Waziristan. Hard Homecoming (2018)- Pakistan's Military helps resettle returning refugees in the Northwest Tribal Regions bordering Afghanistan after operations against the Taliban(27:12)","The Early Years: Bob Dylan's First Album (2018)","The Disturbances (2016)-\"Missionaries saving lives in Nigeria during the 1966 tribal genocide\"(1:14:31)","Wilderness Walks with Cameron McNeish - David Craig (1997) Cameron is joined by poet David Craig for a walk through Knowdart as they talk about the Highland Clearances. Last of the series.","The Cult of Silicon Valley (2018)","Documentary (2019), Golden triangle india, Delhi, Jaipur and Agra... a spot from Jaipur","Never Give Up... (The story of Dongfeng Race Team's triumph in the Volvo Ocean Race) (2018)","Cash Slaves (2015) - Inside the dystopian fetish of financial domination (15:52)","PBS FRONTLINE | Separated: Children at the Border (2018) | The inside story of what happened to immigrant children separated from their parents at the border.(55:23)","Guided democracy: The Illusion of Choice.(2018). The government controls elections so that the people can exercise all their rights without truly changing public policy.","PModern Marvels - Desert Tech (2005) [CC] (44:16) S12E10","Microdosing: People who take LSD with breakfast - BBC News (2017)","The Future of Seafood (2017) - \"Overview of Offshore Aquaculture\" [27:17] [CC]","Carts of Darkness (2015)[59:31] | \"Murray Siple's feature-length documentary follows a group of homeless men who have combined bottle picking with the extreme sport of racing shopping carts down the steep hills of North Vancouver.\"","The Sweatbox (2002) - A documentary about the hectic production of the unfinished Disney movie \"Kingdom of the Sun\" and how it became \"The Emperor's New Groove\"","The Station (2013) - The survivors, rescue workers, and investigators of one of America's worst nightclub fires tell their stories [50:42]","The spiders web: Britain's second empire (2018) - how Britain transformed from a colonial power into a global financial power. (1:18:00)"]