["Profile Review - Week of August 28, 2018","Story Time - Week of August 27, 2018","Cleaning up tinder","Inspired by the AskReddit jokes thread the other day","Bio said, \"make your best wheelchair joke\"","Cute Pet Names 😍😩","Super Like Me","Swiped on that positive attitude","Always open with a name pun. Girls love it","Still no response. She must be out cold.","Shot my shot","Cant Believe She Unmatched with Me Cause I Told Her I Was Sick","Probably the best bio I've ever come up with...","The most common line from my two week holiday.","The third paragraph really made me chuckle","I don't see any red flags. Do you?","Felt like this belonged here","Sometimes it just falls into your lap","His bio said “I like food and the beach”","From /r/ik_ihe","This sub has taught me well","I super liked instantly.","Right when I was just about to give up Tinder","Her only photo","Character defining questions matter","An interesting proposition","When you think it cannot get much worse in 4 words","Am I doing this right?","I’d say this went pretty well for my friend","Wife material","Her bio said she was a lawyer","Does this go here?","Home run!","Her bio said hmu with cool date ideas !!","Dad for hire","Her bio said teach me something I don’t know","Jesus, Betty!","I hope this good boy gets home safe!","Still works","I may have peaked","Looking for a man to raise my kid.","Oops","Oof","Over the summer I forgot how forward people are in college towns","Well as long as you have permission...","Her bio said she makes bad life choices and I said that I could be one. I’m in boys","I really want her job / I really need to find out what exactly it is.","I Imagine This is Going Well","Finally found a decent contender.","Cause you had a bad day...","That quickly went downhill!","When you match for the 3rd time on Tinder.","Lol I thought this was a legit couple looking for a threesome. I swiped right","Every girl on Tinder (UK edition)","Successes can &amp; do happen. 💟","First time on Tinder; I think it’s going well.","Crack at Cracking my Walnuts","Seems like an awesome guy!","Clearly they weren’t looking for class.","I thought it was a valid question","Sometimes Weird Works","Straight and to the point, thank you!","My name is Ian.","Her bio said “The price is wrong, b****”","Not looking that good for her age","Sometimes self-deprecation as humor just backfires","Love at first swipe","furryirl","Slug Gurls need love too","That's...aggressive.","Oofft","Memers on tinder","Sign me up coach!","Happy Hump Day","I do poetry on the side","The best worst pick up line","I look like Jesus, any more advice on puns?","*Furiously swipes right*","A very diverse set of talents","Pretty sure she’s running regardless","Came across this gem today","Pennies for Jenny","Her bio said she was an Animal Management Student. At least now I know.","I'm in love.","Her bio said that she loves Netflix, so I went straight for the chill!!","She said she loved trees...","It is Wednesday my dudes","Welp that's gotta be the weirdest pick-up line I've ever heard","Doubt.","Her bio said she's double majoring in physics and astronomy","What a good boy!","Such determination !","No problem here..","Tried to make a joke and well... It escalated","Satire?","You get more than just honestly with this girl","Need a good joke","An interesting title","Everything for my queen!","FBI is watching her now","Tinder should add a \"last online\" function.","When you don't check for a couple of days...","Tinder is starting to seem extremely sketchy to me","The sacrifices you make for Pizza","Am I doing it right?","I tried being funny","And i wonder why im single","If you could make a PSA to Tinder users, what would it be?","Wish me luck gentlemen","This worked surprisingly well...","Her profile said she was 6’5”","Welp this just happened with a girl I matched with when I gave her my number.","Turn out KKK`s just a chinese conspiracy","Well that didn’t work","Bet she's a fun duck","I...uh... What?","How to get unmatched 101","What is you range and age difference set too?","Need advice- Scam or no?","My brain’s on fire","Anybody else getting this Screen? I don’t want tinder to have my phone number.","I like to travel","Googling tinder pickup lines works fast","My neck still hurts","His anthem was Ocean Man","What would make you unmatch right away?","Can someone tell me what I’m doing wrong? I’ve been on the app for more than 2 weeks and haven’t gotten a single match... it’s depressing as fuck I’m at the point of deleting the stupid thing.","How to date a bisexual couple","Cam girl scam? Seeing a lot of profiles like this popping up and when messaged, they’ll ask you to sign up for a cam girl website. Anyone else seen anything like this?","I took AP Bio and now I think I’m hot shit (yes I know it’s old, sue me)","She was looking for a \"Sober Raver\"","A true magician never reveals their secrets","100% factual, no B.S.","He promptly ghosted me after this but it was fun while it lasted","Need a good response to guessing game.","I'm proud of this one","Instagram Updates","i tried","He Would Give Me the Runs...","From somebody I follow","Leaving this to y’all?","Facebook recommendations","I'm sure he thought he was texting someone with a name that doesn't exist but is also almost identical to mine","My bio said \"looking for someone who can provide for my pantsuit purchases\"","Has anyone else's Tinder gone totally cold after using passport?","She’s younger than me, my anthem is by Kygo...now we wait.","I stumbled upon Kate McKinnon but swiped left as she was trying to tell me her name was Stephanie. Shame","Just made a tinder. Any tips/feedback for my bio would be appreciated","The sun sets and somethimg else rises.","Dewey","Usually you pay double for that kind of action Cotton","I got tired of Ligma.","Why won't Tinder let me rematch with chicks I regret unmatching?","So thats where it went","Account blocked (Error 40303) for no logical reason. What to do next?","What does fire beside name signify","I was told girls like dog pics","...","Got This Idea from You Guys, How Did I Do?","The perfect approach","Looking down","I don’t know how to read it need help.","She said she’d been celibate for 18months...","Ghosted snd stoodup but still not unmatched.","Her bio said she wanted book suggestions. This has also been the most risky thing I ever said","My dog is in pic 5","post and expose,lads","\"Likes it animal style\"","Drunk me is the best me","Rush hour 4?","Ahhh, Tinder.","His bio said he wasn’t looking for anything serious..","Geology is kinky","Why do I match with people due to \"Boost\"?","Nothing worse than getting virtually blue-balled","Saw her name and had to check her profile, best I’ve ever seen","I just couldn’t pass up the pun.","Banned without reason?","I was NOT expecting this","I don’t play Fortnite but I guess I could give it a try","I dont even know","Need help with a pick up line for the name Louisa","Not allowing me to change order of pictures?","Thank you Reddit!","I’ve never seen a more fake profile.","Tragedy at the altar","[Hinge] Never heard back.","I tried my best but I always seem to fail","Simultaneously the greatest and most problematic compliment I've ever received","Wasn’t even that clever","A Most Unfortuitous Match","You best believe I get no matches.","Absolutely outrageous 😂","I too like warm coors light","Took a chance","His profile said he loved sushi... (Sorry it’s old.. newish to Reddit)","Breakfast is the most important meal of the day","He just scared the shit outta me","God Damn it Megan!","It’s our first year together, creating something cute for her (memory book of everything I’ve kept over the year relating to us)","Idk what I'm doing","Kinda proud of this one","I NEED HELP!","Not a good look","She said she knew how to suck d!ck...","Bangable","Winter is coming","A super like put to good use","Her bio said tell me the worst pick up line you know.","Her bio said she was Christian....","Question for UK Tinder Users and anyone familiar with UK Laws.","Can we get a Super-Dislike button?","Can we get Tinder Social back?","I'm sorry, what?","Tips on keep talking till we met","Rate my profile!","had to #doitforthevine","Good thing I need help with my math","[21M] I have Tinder Gold but nobody is liking my profile.","I have two accounts and use the same number to be verified and now I'm locked out","No matches still! Women wont even talk to me for charity😂","We have so much in common","I got banned again....... still don’t know why","Reddit I need something clever to say","For some reason she looks familiar ...","Anyone else having trouble?","Ashely has a lot to learn about masturbation","What’s your best “I need to cancel our date” reason?","When you've gone through all the people around you and you still have 0 matches","My first name pun. I think it went pretty well 😅","Now we wait for a confession.","I like to dabble in the art of witts","When there's a really hot girl in one of the group pics, but she only has group pics","Didn’t even get a full at bat.","Still not sure if it's a legit account, but I saw a opening and I took my shot.","Well that was easy","What has been your success rate on Tinder?","That’s a good letter of invitation","Smash bros, then smash hoes","He’s actually dead","Seems like this is one river I will not be crossing...","Why do people put their Snapchat/instagram in their bio?","im deleting my account","Ay-ay-eyebrows!","Ooh..?","It's pronounced Eef-ah","YesYesYesYesNo? I think so","Yo, can someone decipher this? Am I being bullied","She didn’t appreciate some Rocky wisdom","Why are Normal people on here?","Bi girl problems","Things my friend receives","What if I said I loved the taste of them ?","Drake, I found her bud.","How to tell a girl your broke?","Having a whale of a time.","Good at this 😅","We're in boys.. or shes oblivious.","Funniest bio I’ve seen in awhile","This guy knows how to live, I rate it👍🏽","Normally I hate when Christmas stuff is out in August, but glad to know he's alive and well..","How can you not want immediate sex?","Where did I go wrong here?","Unfortunate name","Turns out the 3 day rule is too long","He implied that I'm autistic 2 minutes into the conversation but apparently I'm the one who can't take a joke lol","This one stung a little...","Inspiration hit me and I came up with this, you'll probably think it's shit but I like it","I'd like to inspecto his patronus.","Why do girls even use this?","Gotta take that advice from mom","There was a typo but the message is still clear.","My successes and failures of 2 years on Tinder (x-post from /r/dataisbeautiful)","I've peaked.","I had to tell her the truth","This squirrel is looking for NUT.","Plenty of shellfish in the sea","Tinder bingo","Maybe I should start lying?","Anyone else feel like they have to drive the whole conversation??","Does swiping right to everyone sometimes make your profile get showed less?","Would you pass their test? Their standards seem pretty high....","Tried not to beat around the bush","Anyone having a bug with the phone number registration (uk)","It’s hard to be a Christian man on tinder","Blurry Pics","She's cute, but I think her doggo would blast me with his lasers if I swiped right.","Her profile said \"Just an April looking for her Andy\"","Do Boosts Carry Over to the Next Month on Plus?","I’m giving it 10 minutes until I get unmatched","boof chick finally looks into the mirror","Can someone explain what \"paperbagging\" means?","The only time I want to be called daddy","Her bio said “no one night stands”","I love myself a well-mannered lady!","Profile pic. He has a neko atsume tattoo.","Back at it again","I can't believe this worked","I'm a sucker for treasure","So, I've got a problem. This Tinder thing from last year won't go away when I try to unmatch. Any suggestions?","Ladies and Gentlemen, we got’em","Tinder girls of reddit who want hookups. What's the conversation like that precedes your meet? What else do you look for?","Name puns are the way to a women’s heart","lol","V for vendetta?","Well that's a first","What a catch!","How to unlink IG account from deleted Tinder account?","Swiping in the UK","How am I supposed to use tinder?","Dating when you live with your parents.","The trick is not giving a fuck about whether they think you’re gross or if they’re into it","When you make plans...then booty call the day after you blow her off","Opening messages, alternatives to \"hey\"","for the love of god, the daily isn't any help and I'm desperate for answers-- what can I do to improve my tinder account? or at the very least, what the hell is wrong with it?","I think I'm starting to get the hang of it...","Knock knock!","did i fuck up my account reset?","Does tinder just not work for hours at a time?","90 days on Tinder--visualized through a flow chart [OC]","[help] Tinder verification loop","Fuck the brown out of me","New tinder matches appear in feed but not in messenger list.","Need advice for dating when you're poor and don't have a lot of free time","What are the dimensions for full pictures in the swiping deck?","I matched with a Soviet tank.","Only responding in bitmojis now sorry","My friend just matched with someone dressed as a cop in their profile","And now we wait","“Hey” is for Horses indeed","What results should I be looking for on Photofeeler?","Scottish People Tinder","My friend sent me this, thought y'all might appreciate","Did i do it right lads","Hit her with the long ball","I guess he didn’t scroll up to read our messages from January","Identical couples profile has much more success as a woman than as a man?","Girl cancells date an hour before we meet, then deleted me on instagram","Too edgy?","Help, it actually worked","Still shot my shot though!","People like steals right?","First successful pickup pun...","Almost didn't see the first word","Shit Japanese Tinder Girls Say","Andddd that’s a super like","My friend sent me her Tinder experience and I'm in tears","I was a fool to almost think I was making a mistake","Never thought it would work","Know your worth, gentlemen","We're in","I really hope this is a joke... But I don't think it is","The Messiah has returned","Let’s get horny baby","Well, didn't expect that. What now?","God Bless","Non binary parents","I think I’ve hit my peak","Literally the worst gif I could’ve sent...","Me too Stacy, me too.","M’lady","How the hell did this over saturated line work..","I hate Monday’s","Does swiping less reduce your matches?","I tried again. I don’t think she’ll appreciate my repeated efforts","This fucking boss fight...","My flatmate decided to try Tinder. First guy went straight for the \"Tinder in a nutshell\".","This app is nothing but missouri","Update: Matching w Ex on Tinder","All my lurking has finally paid off!","A great first photo","Im not very clever.","Expectation versus reality (left vs. right). That got dark...","Must be fake lol","Tinder fact number one:","I think she likes me","This doesn’t add up Erica.","It worked?","Uncanny","Probably a catfish, super liked to be sure... For science","\"If you've been with a redhead, raise your glass. If not raise your standards\"","Her bio said \"sarcasm is my specialty\"","New support group for adult male virgins: truecels.org","Can someone please explain this to me","Squatt perfection","Honesty is the best policy","Nursing","Gluten glutton","Does anyone else see the riddle? I’m missing it...","Am I doing this right","Made an attempt to make my bio like every other average dude’s","I see your crazy and raise you.....","Not a typical post but I'm actually happy.","Scottish people Tinder",".gitignore","Jackpot.","Whaa...Oh","I’m at a loss for words..","Her interests included Shrek ans her anthem was All Star.","Happy Ending","Let's see how well this works.","It's a trap!","Impatience yowza","There goes today’s superlike","I have no tits","After meeting on Tinder, I proposed to my girlfriend of a year and 8 months!","Is this a common problem for men of color?","Need Urgent help with Tinder recovery.","my profile mentioned I like birds...","Swiped right so I could unmatch them","Went on a wholesome journey, then we traded some wholesome memes over Snapchat","Of course I super liked.","Vulnerable","Survival isn’t an option","Could have gone better, could have gone worse?","Another deja vu related post","Tinder Pro Tip: actually responding with a few sentences when a match asks \"how's it going\"~ got her number and now we are chatting 😊","Anyone from tinder support here?","Swiping right on your SO like...","I get a threesome if I’m a serial killer.","Tinder not working(Portugal)","SWIPE RIGHT HAHAHA LOL","Holly, Molly... Easy mistake","When she doesn’t know what she wants 🤔","When you thirsty....","I literally doubled my matches just by squinting my eyes in my first pic","What is going on? Will the matches come back?","I give the best advice","How could I not swipe right?","Ma'am","Ladies love a Tesla","Well, yes she does...","My proudest Tinder moment","Neymar Tries Tinder","I thought it was a good one lol..","Uhh, this feels like a trap...","On the same page","Fortnite","A Brief Lesson in Linguistics","\"Fuckin Elle\" round 2 didn't go as expected...","Me too Michael. Me too.","Dab840's heel","This was about pineapple on Pizza","I have no words","No one else believes this, right? Good. Glad we’re on the same page.","First contact?!?","*furiously presses superlike *","desperate times, etc","Will update when she unmatches","I started enjoying the chat...","*Swipes right immediately*","No reply","Welp what do now","Thought this belonged here","Your average tinder user","Tried a name pun, worked!","Gnarly Carl","Girls with snapchat in their bio","It’s been 30 minutes. Nice backpedal","I'm detecting a couple of red flags here...","On one hand it was a good comment, but on the other hand it was a bad comment. Either way = unmatched","Super Likable Losers Lost?","I got banned and I don't know why...","Tinder is evil how can you make a man choose","Saw someone else do this a while back on here. Thought it was a good idea, so I stole it.","is this a glitch never had so many likes. only ever had 1 queued. have had app for 2 months","Does this shit actually work?","Just when I didn’t think it could get any hotter...","Take that as a no then?","Thought id shar-e this with you","Is tinder less effective than it used to be? Perhaps trying to get us to buy tinder gold?","Date tomorrow","Just the response I was looking for","Cheap name pun","Alex pun","Well that took a turn.","When rules 1&amp;2 don't come naturally","i cant believe it got a response at all","I thought girls never messaged first on tinder, third one today.","Insert Shrek Joke","Maybe there is a god?","Decided to just be straightforward. Worked better than I thought","If you ain't making it rain stay tf outta her lane...","Is it Shark Week? 🦈🦈🦈","An interesting approach..","This conversation kept going after this initial exchange... it deteriorated quickly. What a b....","Another swing and a miss.","Tinder is dead","When you’re an English major on a dating app","See ya later, virgins.","The perfect bio to attract car guys.","You get what you deserve.","I fucking love cops.","Hope she made it to work safe","Her bio said “don’t add a couple inches to your height”","Where’s the “Hell no” button","Who’s gonna tell her?","Apparently she seriously doesnt like jokes....","Her name, IT inspired me 😅","She was actually a great conversationalist","Saw my Ex and I did it for Reddit","New territory","I got catfished with an average photo... huh?","Here bio said “who wants to come over and scream in my backyard for like three hours”","well at least he’s straight to the point","60% of the time, it works every time","A lap dance Macarena","The new craigslist?","Uh....what?","Conversation takes interesting turn upon finding his criminal past...","Venmo","F*ck effort","Na mean?","How's my bio?","Tinder Gold: do you *really* have matches waiting? Or is it just a marketing ploy/scam?","This should be here","I was not a Shaq","Found one... Gonna now keep ordering Ubers until she's my driver","Can any women please give some feedback on my tinder profile? Thanks!","Her bio said she loved cats, wine, and a good time","How do you feel about losing virginity on tinder?","Spooky Indeed","WHAT!","Just waiting to tell her now","So much aggression","I'm a guilty pleasure","What constitutes being cute?","Spank me sugar daddy.","Oh Tinder..","she loves me","Had to swipe left because I am not famous...","I'm new to this. Am I doing this right?","Why do I feel like she's about to tell me \"You're Welcome\"","Honestly pretty proud of this one","Can't we just date each other?","Tinder appreciation","But wait there’s more!","what's 2x0?","I'm in boys.","Swiping on a friend","Need a good comeback, she says she likes Dark Humour and is a Grammar nazi.","Any suggestions for my profile? I think it's solid, but have only been at this a couple days","Avocado Facts","At first you don't succeed..","Eric Andre taught me you gotta get 'em with the shock humor.","Tinder pictures?","Works every time.","I have several questions","She tried","Apparently I am banned from tinder, when I never used the app","The truth hurts sometimes","I don’t want to know what happened to the last guy","The set up was too good","I like to think I’m pretty good with Tinder","Nah, I'm funnier than him","Did I win?","Why do some profiles seem to pop up over and over again despite me swiping left every time?","Is there a way to filter transexual people on Tinder?","Wish we could turn back time.","Winner winner, microwave dinner!","Tinder Picks - why do none of these girls show up in my normal stack?","Advice for a dude","Pluto is such a 🐓block!","My kind of girl","Inspiration for an artist","I don’t know why she unmatched.","I knew she was fake but I figured I'd give it a shot!","Alpine mustache on point","Set them up for it","How is this different from normal","This girl was about as far away from me as a person can get...","I don’t know what to think here","Does it belong here?","The pope is in Ireland","Actually found a girl with a shred of personality for once.","Asymptote","She has her priorities in order","I have standards.","Unable to Create an Account. Can't get past \"My Best Pic is\" Screen.","This went much better than I expected","Her profile said she wanted “an appetizer while [she’s] still deciding on [her] main course”","She may not be an opioid, but . . .","Interesting proposal","Came across this gold.. Just looking for someone to assemble her Flatpack..","I have so many questions","Ouch.. That’s what we get for imposing liberalism","Please explain how this is supposed to work","Profile had a picture of Hamilton, so I decided on taking my shot","Is it just me or is this too much?","Any tips to improve my profile?","Didnt expect an answer","I swiped right just because of this cleverness.","I was not expecting such a dark response","First attempt was a success","I am rude?","She wins a superlike","As fun as that sounds...","Wtf is this, arnt you supposed to be putting out that fire 😂 not taking a selfie in front of it","So would Tinder gold show people that have previously like me before the upgrade or not?","Errrr. Run that past me again?","and they say romance is dead","Profile was named “Passion” and wanted to talk about fruit.","May the Nugs be with you","Sounds pleasant","My new profile. Let’s see how it works.","Not helping the Stereotypes","She seems fun.","she said she didn't get any name puns","Good Answer.","They Came Together","Mission failed we’ll get them next time.","Decided to shave my head on Friday and use this as my profile pic. Should I change it or get a better photo?","My prayer for him to unmatch me was answered","I'm in, boys","Jealous boys?","me_irl","Creeps of tinder pt. 1","Creeps of tinder pt. 2","Saving Spongebob memes one thot at a time.","He shoots...","Got schooled on astrological signs, now she wants something else...","Maybe she didn’t hear me","All of these are almost a week old with no reply. And guys say not enough girls message first.","I don't read much","I’m going to go with Portuguese","Her bio \"I missed my flight to Zurich... someone to hangout?\"","When you spot your ex on Tinder","Straight to the point.","Might’ve found my next hookup!","My best pickup line yet... wasted","Cutting to the chase","Enjoy","Massage?","No extra cream, thanks.","My dick is 50 inches","If 3’s a crowd, what’s a few hundred?","Come back","Am I doing this right? The only thing I blurred out is the name of my group for privacy reasons. Most profiles I see from girls have nothing, but at least I give them something to go off of. I get matches and dates but not much luck yet.","Thicc 🌮","The helicopter of my dreams","Just my type","If I swipe left on someone that swiped right on me do the tinder gold icons stay in the match tab ?","“I’m not a slut”","What does the maybe mean? 😂😂","Calm urself","Her bio said “don’t”.","If someone superlikes you, do you always like them back?","Stage 5 clinger","She got a kick out of this","Just having fun trolling people on tinder 💅","How to hook up?","Found this one when I was in moscow 🤣","I’ll give you 3 guesses to what my name is","This worked well","I just wanted to make the pun.","Tinder on pc has a \"office mode\" to hide the app at work","20/20 chance she will never come in contact with me again","Uptick in matches since Tinder U?","Did I ruin my \"elo?\"","I have the mind of a child.","Super liked","not sure if","likes busted?","Well ok then...","When your anthem is Tik Tok","Her sense of humor isn't under wraps","He unmatched me. I don’t blame him.","I reported her but still wtf is she doing on tinder?","Looking through my 2am drunk tinder convos","Question about linking Instagram account to profile","Um, thanks?","why didn’t she respond???","Found out she was a normie :/","Clueless and Punless","Fuck which one is she?","Matches who dont like me","My account got banned?","Wonder what of favourite website it","This is why I don't have any gym badges","\"You already own this product.\" 🤷🏽‍♂️","My buddy has a pretty great sense of humour...","When the sexual innuendo actually works...","She actually turned out to be a nice girl.","I'm still waiting on that guess","Honestly the most attractive profile I’ve seen. Instant super like","“Become my gym partner. I have a good face so you’d get a hot chick at fat chick prices”","Dodged a bullet there","She has seen through the ruse","This may be my best work","Can i feed you?","Always trust Coles to come thru","date me pls","Life in a small town","He called me a c*nt then unmatched me 🤷‍♀️","Bestest friends evvvvvva!","He asked me if I loved Trump","Banned on Tinder For No Reason","So tired of seeing this","Wrapped in plastic, it's fantastic!","Well... good luck finding someone who will","wHAT DO THEY MEAN?","Once I Super-Like I’ll finally know the truth...","🎶To a plaaaaaace, I beloooooong🎶","[Visible Confusion]","Swiped Left or Right?","I like a girl that cuts to the chase..","Her bio said she likes to pain and talk about painting","Her bio said “I don’t know how this app works”","\"Hey ****, can I call you babycakes?\", And the ever-successful way to get a number.","Some of us are braver than others.","Holy Booty","F e e l s b a d m a n","Hello I don’t know if this is right place for this picture but I have come to this very moment in my life. I deleted my Tinder account...","DC Tinder Connections for African Americans?","What do you think about this for a bio?","So that was Arren","Dog’s plan","Got banned on tinder, probably for making new accounts","An interesting bio","This is so sad, alexa play despacito.","Finally think I figured out the whole profile thing","Uhh, well this is a first","G E T O U T O F M Y S W A M P","am i doing this right","I'm a very serious person","What the actual fuck is happening in these messages","A:40303 error. Not fun.","Smooth as butter","Sometimes it justs works","I told her my dog was better","Please don’t feed the workers","If You Aren't Using Photofeeler For Tinder - You're Missing Out","White Privileges","Seems promising","Needless to say he didn't respond","When you match a fellow Redditor","Met someone with some issues. Not proud of that message on top but she insulted me first. Just remember people love you and want to see you happy","Are there teens not 18+ on tinder? Do you think that’s okay?","Florida 2018 in a nutshell","Sorry I hate small talk haha","smooth","Yikes....","Dunno if I should be creeped out or impressed...","Just a normal human interaction","I’m hugging a cat in one of my photos &amp; everyone thinks they’re original w/ their pussy jokes","It's like a genie created this - every gold digging wish come true","There is a right way, and there is a wrong way.","Nibbles","She seems like such an adventurous person with a lot of personality","Which should I use for my first photo? What's the best order","I think we found a cool kid here","Hopped off the bus in Scranton PA another cloudy afternoon...","Press F to pay respects","Still waiting on a response","When they say they’re looking for friends but they swiped left cuz ur ugly","She eventually replied and I got her number","Rules 1 and 2 were not followed","I just love when girls are into esports.","he got me there 🧐","Ez cash","Left or right?","So, what do you do for a living?","Sometimes it’s just worth it.","Instant superlike","Flash flood warning!","I think she might be looking for some sausage..","A gentle lover","Marriage material","Chock me.exe","Ron is about to get his ass busted","Ah finally, a nice girl to bring home to momma and poppa","This guy takes his tinder date out and switches mid way with his twin brother","She gave me her snap on here next reply","So I always swipe right on profiles of non people. Never matched until now!","Unspeakably bad","I’m known as the Man of 1,004 Pickup Lines","I also like kangaroos","Brooklyn is really predictable","Men on tinder","My bio says: Seduce me with your literary knowledge.","I tried, bois.","This seems slightly problematic","Worrying","So many choices in Tinder, left or right?","Lads i did it","Does asking to meet her after the convo goes stale ever work for you ?","Will take but won't give -__-","I thought my lines were pretty decent","Chandler really is not handling the breakup very well!","Go for gold!","Oh boy.","Why wait?","We matched at 2AM","I bet he's a Tree-my guy.","Rhyme time","The Perfect Crime"]