["[Spoilers] Arrow Season 7 Comic Con Trailer","[Multiverse]Check out /r/BatwomanTV for discussion of the upcoming Batwoman TV Show","[Non-spoiler] This would be a good reddit post.","[Season 4] Guggenheim's writer's room","[Actor Fluff/ Potential spoilers] Arrow's Stephen Amell Earned Less Than His Co-Stars for Years!","[Spoilers] Just two characters that deserved better","[Future spoilers] ______ won't appear in the Arrow episode of the crossover but will appear in the Flash and Supergirl episodes","[Spoilers]Extended promo for superheroes fight back","[Spoilers] Arrow’s New Showrunner Says Season 7 Has A Very Specific Theme","[Appreciation] The OG Canaries","[Shitpost][4x09] Fun isn't something one considers when balancing the quality of the show. But this, hehe, does put a smile on my face.","[Discussion] Which one-off villains did you love? Which would you like to see return?","[General Discussion] What is one line you hope a character says before the show finishes?","[Spoiler] someone was about to fulfill our wish, but I like how this looks","[New Promo] New Suit Up Promo! Has some new shots!","[S7] Who are the potential villains we can hope to see return in the prison scenes?","[Season 1] [Ep22] What Oliver did?","[Spoiler] Who else is frustrated that William’s name isn’t Connor Hawke???","[Arrow] I want Oliver to be appreciated atleast once during his prison time.","[News] Lois Lane to be a recurring character","[actor fluff] ALL IN! Amell makes a great heel: \"The whole golden age of comic tv? I did that\"","[S1/2] Just rewatched the first two seasons, here's some assorted thoughts","[Season 1] I actually thought Oliver would miss..","[Arrowverse Spoilers]What is the lore reason for ________","[no spoiler] Green Aragorn","[Shitpost] 'Better' being the keyword.","[Semi-O.T.] Actresses who suffer in media silence (including several Arrowverse actresses)","[Actor fluff] Stephen's interview with Michael Rosenbaum is up","[Minor Spoilers] [TumblrTrash] Oliciters are delusional, incase you didn’t already know","[Question] Earth 1 throwing star killer/ Prometheus Vs Earth X Prometheus","[Shitpost] Just a picture of Queen Fefe on her throne.","[maybe spoilers S1-6] something that bothers me.","[S3E19][Discussion]","[S7] This fall, Green Is The New Black.","[Discussion] How does the Timeline Work?","[Question] What were all the different types of arrows and which were your favourite/ most useful?","[Discussion] Season 6 Action","[Fan theory] Was Felicity affected by a Flashpoint?","[shitpost] rewatched s5. Is Prometheus' mom's neighborhood downloading every existing infomercial on the internet?","[No Spoilers] Watching season 1 for the first time. Do the writers know what an IT department actually does?","[S4 Question] I'm going to start watching arrow again, stopped around the beginning of season 4 cause it was getting bad. I hear season 4 is really bad is there any part of season 4 I should watch or should I just skip right to season 5?","[thoughts] first time watching","[No Spoilers] Is it just me","[Discussion] What are your favorite quotes and dialogue from the show? And what are your most cringeworthy quotes and dialogue from the show?","[Misc] I hurt myself today","[Rant] How Slade failed as an antagonist","[No Spoilers] [Question] Anyone Know Where I Can Purchase This Black Driver Hat?","[Spoilers] Director for 7x05 revealed","[Spoilers] I just watched Crisis on Earth X","[shitpost] year when the show was actually fucking great. CW, you done fucked it up","[Discussion] Anyone else think the sub has been pretty dead this off season?","[Misc] I was inspired by the person who posted the Oliciter on twitter and decided to venture there myself.","[Multiverse] The CW Seed's CONSTANTINE: THE LEGEND CONTINUES to Air on The CW October 15h","[Fan Content]Found a cool artwork of S7 suit someone made","[Fan Art] Season 7 Green Arrow","[Rant Video] Arrow Hates Laurel Lance","[question] Almost finished Season 2 (this is my first rewatch) how did Sebastian Blood manage to steal the Mirakuru Cure?","[Shitpost/ Spoilers] Upcoming Arrowverse crossover: What fans want vs. What fans will probably get!","[Discussion] What is the Best Scenario/Worst Scenario/and Most Realistic Scenarios that will happen to each of these characters next season.","[No Spoilers]Did The Writers Intend To Pick Up On The Pregnant Woman Thread?","[Question] what causes savage to get weaker in legends season 1?","[S5E23] Remember this Beautiful &amp; Emotional Scene Before the Dark Times of S6?","[No spoilers] Oh.","[Art] In the spirit of yesterdays events, Here's Black Canary by Otto Schmidt 😍","[Arrow] Quentin is such an unlucky father.","[NoSpoilers] Anyone else think Diaz isn’t big bad material?","[FANWORK] Oliver and Laurel (Season 1 and early S2)","[No Spoilers] Arrow: The Complete Sixth Season (BD) at 7% off today.","[Discussion] What's your unpopular opinion about the show?","[S3E15][Discussion]","[Future spoilers] _______ confirms appearance in three Season 7 episodes","[Spoiler] Basically.","[No Spoilers] Everyday we stray further from God...","[No Spoilers] Thought this belongs over here","[no spoilers] Ok, unpopular opinion time 😤","[No Spoilers] Why?","[Organic] Something dumb about Diaz and Laurel...","[Hosspost] Possible reference to Rene in S2:E3?","[Arrow S7 Light Spoilers] Changes ahead for some TA members","[No Spoilers] Discussion","[Spoilers][Discussion] A small thing that had a fairly big impact on the show...","[Spoilers] What's that Dinah?","[Fan Art] Oliver 🌳 Barry 🌆 Snart ❄","[Shitpost] Junk Food Vs Vegetables","[comics] so much material wasted by guggie","[Serious question] Could you actually assemble a real team Arrow and take on Vigilantism?","[Fan Video] Dinah Laurel Lance [E1] | Survivor","[discussion] What character you instantly were drawn to","[Game] I need your help.","[Discussion] Season 6 is the only season without a clear narrative or thematic focus...","[No Spoiler] Fic","[shitpost] I’m not hating on Felicity or anything but when people make these, it just makes me laugh and that people love her too much","[Season 6 spoilers] Something that was a big part of season 6 that is yet to be addressed.","[SPOILERS] What character did you dislike when they were first introduced but like now?","[Spoilers][Discussion] Why do they make Nyssa seem so weak?","[Discussion] Rewatching Season 1, I forgot how independent Oliver used to be","[Season 6 Spoilers] Honestly think Oliver might be...","[Announcement] Constantine - full Liveaction show - is available to watch for free for a week on CW Seed","[discussion] Trying to catch up for Season 7","[No spoilers] Finally started watching S6","[Spoilers] Arrow's Black Canary Pushing To Bring A Piece of Comics Continuity to TV in S7","[Fan Content] Vote Melissa Benoist against Felicity for TV's Top Leading Lady 2018.","[Fan Content] DC's Birds of Prey Season 1 Concept Intro FAN-MADE","[discussion] will Connor hawk aka John diggle jr ever appear in Arrow?","[Spoilers] What did Felicity study again?","[Arrow] Does anyone feel Dinah's leather jacket costume was much better than the season 6 costume?","[Crisis On Earth X Spoilers] We Know This Better Than Anyone","[Shitpost] A museum is full of outdated things, things of the past, things that aren't needed anymore.","[Season 5 Spoilers] What happened to Vigilante?","[news] Katrina Law will be at Cincinnati comic con Sept 14-16","[Nostalgia] Rewatching season 1 &amp; 2","[Discussion] Who Do u think in s7 is going to die","[Possible Spoilers] Crossover Mystery Character","[Spoiler] Whose the Bigger loser?","[No Spoilers] My face when I read/watch any Arrow related stuff since season 3.5","[Spoilers] ‘Arrow’ Season 7 to Introduce Felicity’s _______!","[Spoilers] Politics in Arrow","[Spoilers] Where on earth was there even a fingernail of chemistry between Oliver and Felicity?","[Discussion] Can someone fix these stupid ass costumes","[Spoilers] Arrow - Episode 7.04 - Title Revealed","[Spoiler] Man he should have kept this one for 6x22 ..","[Multiverse] Arrowverse Crossover to Feature Superman and Introduce Lois Lane","[Discussion] [Controversial] The birth of the flash and the subsequent crossovers that followed ruined Arrow","[Actor Fluff] #JusticeforVince himself portrayed everyone's favorite Resident Evil character in live-action...","[Actor Fluff] Manu Bennett is currently in Vancouver. Let's start the theories.","[SPOILERS] How can he still be alive?","[Spoilers] Cassandra Jean for Lois Lane?","[Shitpost][1x22] This kinda reminds me of another infamous kissing scene from another show that features a lot of couples drama.","[Nostalgia] Oliver finds out who The Canary is","[NEWS] Arrow Supermax Story Described As Putting Batman in Prison with the Joker","[Actor Fluff]Arrowverse Pop Quiz: 'Arrow,' 'Flash,' 'Legends' Casts Face Off! | TVLine","[s6e14] Catching up late. Thoughts on this season so far.","[No Spoiler] Crossover will probably take place on Supermans earth because Batgirl is there. Can we expect a Batgirl show after this?","[Arroverse New Season Promo] Superhero Subway Sizzle","[Crossover Spoilers] My theory on the crossover","[actor fluff] Amell prepares for his match at ALL IN","[Actor Fluff] Arrow, Legends and Flash stars having fun off-set","[shitpost] our night isnt special","[Shitpost] “Olicity was always endgame” - Marc Guggenheim","[Question] What character was able to locate the Arrowcave based on the time it took for the Arrow to arrive at each crime scene?","[Minor Spoilers] [Discussion] Black Siren as a love interest for Oliver","[spoilers] Why all the hate on season 4?","[Spoilers] How Edward Fyers would have saved this show.","[News] Crossover dates","[Nostalgia] Oliver goes to see Laurel and Ends up Saving her Life","[S7 Discussion, S6E23 Spoilers] Who would you like to see in...","[No Spoilers] Katie Cassidy - taylor Swift - Blank Space - Dance","[DCU] Brendan Fraser joins 'Doom Patrol' cast as Robotman","[Minor Spoilers] [Discussion] A friend sent me this post about 'Olicity' and it's absolutely pathetic...","[No Spoiler] Arrowverse viewing order?","[Spoiler] [Discussion] Feelings for one person don't die at the stroke of a pen","[Season 7/Actor Fluff] Looks like Laurel and Felicity have a scene together!","[No Spoilers] New Season 7 Poster","[S3 SPOILERS] One thing about Laurel that always bugged me","[S5E3] Anyone Else Wish this was a Flashpointed Deadshot?","[Discussion] having lies and secrets as plot points is not the issue, the problem is with the narrative inconsistencies.","[discussion] question","[Discussion] Why does it seem Oliver loses many fist fights he should win?","[NO SPOILERS]","[actor fluff] \"You're not Grant Gustin, so maybe pump the brakes on all the bragging\"","[S3E2][Discussion]","[S7] Katrina Law appearance’s","[Meta] What happened to the other subreddit of Arrow? Can't find it..","[NoSpoilers] What are you most and least interested in/ excited for in season 7?","[Spoilers] “I love you sis. Always and forever.”","[Discussion] do barry and kara know about Oilver's kills?","[Discussion]Would you want Amell to play Oliver in a Green Arrow movie?","[Shitpost] Excuse me what the fuck?","[spoiler] The team is too big","[discussion] just a question basically what im asking is is it one of those things where you have to start out as a kid first or is it something that you could take even if your a 27 year old male just wondering ?","[S5] Gonna Start My First Rewatch of Season 5. Love the Amp Up E1 had","[4-23] Just finished season 4","[NO SPOILERS] a moment of silence for our comrade","[No Spoilers] Green Arrow Art","[unpopular opinion] season 2","Arrow: The Complete Fifth Season [Blu-ray] is 36% off","[THE REVERSE GREEN ARROW] OH I’M NOT LIKE THE GREEN ARROW AT ALL, SOME WOULD SAY I’M THE REVERSE","[Shitpost theory] About Diaz","[Discussion] Kill Me Please!!!","[Discussion] [No Spoilers] Is there any actor or actress you're dying to see on Arrow?","[Spoiler i think] Took the beginning of s6 for my friend to realise how bad the show and felicity became","[news] this is interesting","[Actor Fluff] Katie Cassidy gets off stage to meet a hard of hearing boy during H&amp;VFF London 2018","[Actor Fluff] Guess NTA are the only Guggie fans left on the cast - first Juliana, now Rick. Will Echo be next?!","[spoilers] ___________, you have failed this city","[COMICS] On another earth...","[Season6] Questions And Opinions.","[Shitpost] Eh Close Enough","[discussion] no spoilers","[No SPOILERS] S1 Arrow is the best Jeremy Jahns review ever.","[S3E1][Discussion]","[Comics] Deathstroke The Terminator Fanfiction","[comic] re-reading Morrison's Batman and look what I found","[Spoiler/Speculation] Can _____ be alive?","[shitpost] Amell every off season...","[Discussion] Curtis brings the show quality down","[no spoilers] I finished part one of the flash/arrow crossover books yesterday and now I’m on this one! I loved the last one and excited about reading this one!","[Spoilers] Do you guys think that this is the episode where Oliver gets out of prison because that’s what I’m thinking especially with agent Watson appearing in episode 3","[Actor Fluff] Stephen Amell's Goatee is coming along great! He's looking a lot like comic book Oliver Queen.","[Just Talking] S1 E5 Ollie and Laurel","[Shitpost] She feels real SORRY, guys!","[No Spoilers] Found under Stephen Amells beard tweet :/","[discussion]","[No spoilers] The Women Of Arrowverse Get Honest About Pushing For Inclusion In The Industry And In The Fandom","[Meeting a Show Runner] I’m at a convention about to meet Marc Guggenheim","[Actor Fluff] Detective Lance? (Star Wars Battlefront 2)","[Self]Just bought my PAX South 2019 Tickets. This is me as The Green Arrow last year! Gonna improve it for this year.","[Discussion] The perfect role for Justin Hartley is he ever appears in the Arrowverse...","[Spoiler] Arrow's Upcoming Season So Gritty That CW's Censors Had To Be Called In","[discussion] what are your opinions on Oliver’s identity being public?","[Spoilers] Next Arrowverse Crossover Will Be Smaller - Stephen Amell says to expect the crossover to be a more character-based story this season","[no spoilers] Who gives a flying f*** about ‘this city’?","[Discussion] don't flame me but is anyone else not excited for the new season at all?","[Flash S4 Finale Spoiler] She's the Felicity that r/Arrow deserves but more importantly, the one it needed 3 years ago. Oliver: Barry, I need your help. Or maybe your daughter Nora. Whoever is responsible for the timeline fuckery, nowadays.","[No Spoiler] What kind of bow does Oliver Queen use in season 2?","[discussion] What’s one (or more) thing(s) we will never get that would have been realistic and great?","[Shitpost] You have failed this city - repeatedly!","[No Spoilers]","[Actor Fluff] Walter Steele, Zod, and now a cop","[Spoilers] Top 10 Episodes of Arrow: Unthinkable #1","[News] Arrow 7x04 episode title is __________!","[Shitpost] Congrats to mr. Ricardo Diaz for winning the UEFA Super Cup last night!","[S6E06] Don't worry, Dig. I got you covered.","[discussion] just saying","[Characters]Swapping characters from shows","[SHITPOST] I Found This Rare Picture Of Oliver And Roy.","[Spoilers] Arrow 7x04","[Meta] Just imagine if we had an episode like this on Arrow","[No Spoilers] Interesting Way To Incorporate Onomatopoeia Without Being Cheesy?","[Shitpost] Wishlist for Arrow Season 7","[Spoilers] What would Arrow have been like if they never kept Felicity?","[No Spoilers] What if they brought in Nekron as a crossover villain?","[Spoilers for 4x5] favorite moment","[Season 6 spoilers] I left in the middle of season 6, can someone give me a reason to come back?","[discussion] just curious","[S7] Let's face it, this is the S7 suit we want deep down","[Shitpost] After quitting Arrow and binging Teen Titans Go.","[shitpost] I saw this ad today, no comment needed","[Spoilers] Stephen teased S7","[Theory] How I would create a strong Arrow villain","[Shitpost] It took him 4 years, but Stephen finally listened to my advice","[Just imagine] What if Thea became a speedster?","[S03] Why I have a soft spot for Season 3 of 'Arrow'","[Potential spoilers] Stephen Amell Instagram story posted between Arrow scenes","[Actor fluff] Emily Bett Rickard's film 'Funny Story' wins sixth festival award!","[spoilers] Artemis and Talia?!","[Funny] How I think Oliver will break out of prison prison","[Season 7] Is there an actual S7 suit reveal?","[Comics] Green Arrow and related Sale on Comixology!","[S6 Spoilers And S7 Stuff] A thought I had","[Shitpost] Say what you will about Oliver’s suit, but this is the suit we need","[Shitpost] old shitpost but a relevant shitpost","[Discussion] Oliver in jail","[Potential spoilers] Toxic Fandom: How Fans Are Turning Into Villains","[Funny] Perfectly balanced","[No spoilers] Lady Gaga Reportedly Turned Down The 'Birds Of Prey' Movie","[No Spoilers] Vote for Least Favorite Character of Season 6","[no spoilers][Off Topic] Look who I found on the left! (Startrek: First Contact | 1996)","[Potential spoilers] Who do you think he talks about?","[No Spoilers] Neal McDonough cast in the live-action Sonic the Hedgehog movie","[S6E8] Holocaust Felicity from Crisis on Earth X is not realistic and takes the viewer out of the show","[Discussion] What would you want to see in the 150th episode?","[Shitpost] The real S7 suit.","[Shitpost] Modified an image from r/funny","[No spoilers] Warner Bros. Reportedly Wants to Cast Biracial Black Canary for ‘Birds of Prey’","[Discussion] Arrow in the original timeline","[S6E10 Spoilers] Onomatopoeia and Huntress","[Discussion] Is Black Siren a bi-sexual?.","[shitpost] Unpopular opinion","[Spoilers] Better look at Oliver's Season 7 suit","[Actor Fluff/Potential spoilers] Ruby Rose quits Twitter after fans condemnation","[Question] So in Season 5 episode 22 when Oliver and Malcolm were fighting the argus agents, did they say \"We are compromised, take the prisoner out\" as in kill him or what?","[No Spoilers] Just started watching Arrow","[S6E20] Anyone else have a problem with Oliver’s fight with Diaz?","[Shitpost] Oliver has a message for Star City!","[Comics] Kirk Avacedo will be among the 150 contributors for a book that supports the hurricane relief effort in Puerto Rico","[S6E19] Why did Siren have that short, black wig?.","[No Spoilers] Volunteers Wanted: A Study Into How Characters' Sexual Orientations are Portrayed on Arrow","[Discussion] How would you feel if Arrow adapted Batman's Dark knight returns","[S5 Spoilers] Whatever happened to...","[No Spoilers] Mosaic of Queen Fefe made up of actual trash","[S6 Spoilers][kinda]Sooo.... about Ragman.","[NO SPOILERS] This sub when you dare to praise old seasons.","[Question] Should I watch season 6?","[Poll] Does anybody care what Curtis' arc is in S7?","[Shitpost] Screw it","[S1 SPOILERS] Remember when Oliver had clever sense of humor?","[Poll/ Discussion] Which of the NTA character's arcs are you interested in for S7?","[Shitpost] Every post on this sub:","[HossBot] HossBot will make his return Monday, October 15th at 8 p.m. ET","[Actor Fluff] Stephen Amell welcomes Ruby Rose to the Arrowverse","[No spoilers] Does everyone like the fact that we call the CW universe \"The Arrowverse\"?","[No Spoilers] Probably nothing at all but is the train station in Gotham?","[Discussion] Unpopular opinion: If you don't have a problem with Laurel murdering people you should not have a problem with Felicity nuking a town which she had no control over.","[Shitpost] This is for you Arrow and FTWD fans... I'm sorry.","[No spoilers] There is no blooper/ gag reel for Arrow S6","[Shitpost] 5 Storylines No One Asked For","[spoilers] Arrow circlejerk","[No Spoilers] Should I continue?","[no spoilers] the problem with crossovers","[Shitpost] I found next town that will get nuked by Felicity. Havenrock was just the beginning...","[Discussion] Damien Wayne doesn't exist in the Arrowverse","[Actor Fluff] Sydelle Noelle takes part in photo shoot to promote healthy lifestyles and all types of bodies. 😍😍","[no spoilers] Not gonna lie i got confused for a second when i saw this book cover","[Discussion] Nearly two years later, it still annoys me who we got as the recruits","[Spoilers]Shado Theory","[Shitpost] When he mentally tortures you and all your friends and family","[S4E1] Damien Darhk's Character","[No spoilers] Arrow S6 gag reel","[Fan Art] Graphic Tee Design of Green Arrow and Black Canary by bigoso91 on DeviantArt","[Spoiler] why did diggle cry?","[No Spoilers] Writters could had easily give Earth 1 Laurel her powers more comic book accurately","[might be spoilers in comments]","[News] Cyborg cast in Berlanti's DC Universe","[NoSpoilers] Axe Tuna Fake","[Discussion] - Re-watching Young Justice","[No spoiler] Malcolm Merlyn my favourite character on the show","[Discussion] Genuinely curious: What do some people have against the arrowverse?","[spoiler] Alena the hacker wearing an adventure time (marceline x bubblegum) inspired tshirt? (S6E13)","[Fan Art] Black Canary (Katie) by AnubisDHL","[Spoilers] ______ back filming for Arrow 7x03","[NEWS] SuperSeason teaser 🏹","[Question] I'm interested in the demographic: How old are you now and when did you start watching?","[Shitpost Spoilers s7] I predict that Oliver will...","[No spoilers] Director and writers revealed for 7x04","[No Spoilers] Arrow Showrunner Says \"Nope\" to an Olicity Baby in Season 7","[Shitpost] Shoutout to our favourite hacker girl on the CW","[question and possible spoilers] why can't arrow be in the same level of darkness and maturity as the 100?","[S2E20] My Heart Hurts","[Shitpost] Idk why everyone's complaining about Ruby Rose. I mean, she's got the pale skin, the Red/Black outfit thing and perfectly willing to work with and contrast grumpy Ollie","[BATWOMAN]Ruby Rose cast as The CW's Batwoman","[Shitpost] Christopher Daniels confirmed to be Diaz irl","[Fan-Art] Ruby Rose as Batwoman by Sethtember","[Spoilers] Which Arrow Scenes/Quotes Have Made You Cry?","[Question] New Suit for S7?","[NO SPOILERS] Malcolm merlyn's true identity!! (About 6 people will get this)","[No Spoilers] Now that they're making Supergirl and Flash movies, what the hell's stopping them from making a Green Arrow one?","[Discussion] [Arrow Season 5 Finale Spoilers] Is anyone else disappointed that we didn't get ______","[Spoilers] I thought that's what I wanted but...","[BatWoman Casting]What I think is more important than religion and sexuality for the role","[No big spoilers] Top 10 Best Arrow Episodes","[Shitpost] [Meme] Ricardo Diaz be like..","[No Spoilers] Watching Young Justice Season 1 and heard Wild Dog's favourite words uttered by Aqualad to Red Arrow (Speedy)","[spoilers] Guggie why is Oliver a terrible person for lying to Felicity, but completely fair for Felicity to lie to billy?Guggie:","[Discussion] Why didn't Sara return to Star City and rejoin Team Arrow?","[News] The CW has no plans to end 'Arrow', wants 6 DC shows next season, possibly on Saturdays","[No Spoilers] The budget difference from earlier seasons to now is huge","[spoilers] From an ask reddit about couples in TV or movies that weren’t meant to be","[Comics] Green Arrow is a Social Justice Warrior","[actor fluff] Amell next wrestling match","[Spoilers] The CW: \"Batman exists in Arrowverse, but no plans for him to appear yet\"","[Shitpost] Spotted some merch for our beloved main character in a local store","[Spoiler] Beth Schwartz shares episode 7x03’s title","[No Spoilers] Stephen Amell has officially booked his first 1-on-1 professional wrestling match, to air September 1st against former Ring of Honor World Champion Christopher Daniels on the All-In pay-per view. Here's his first promo for the match.","[r/Reddit CULTURE]: I feel there need to be change &amp; further education in this community!!","[Actor Fluff] Stephen Amell attending Vancouver Pride Weekend.","[OST] Arrow Season 6","[question] is Oliver queen mentally ill","[Actor Fluff] Emily Bett Rickards attending Vancouver Pride Weekend","[s4] Can Damien Darhk get sick?","[Spoilers] Partial dialogue for a scene - Arrow 7x03","[shitpost]When your favorite show","[Actor Fluff] Another classic photo of Amell at Vancouver pride!","[Discussion]Oliver's obsession with the city was his downfall. Do you think he's too obsessed with SC?","[Discussion]Canary jacket passing on","[arrow discussion] beth Schwartz and black siren","[spoilers] when you dont kill chase when you had the chance earlier in the season so you can give him the chance to trap your friends on an island and blow it up.","[No Spoilers] Anyone remember this obscure character who helped Oliver a few times in S1 and never came back?","[Actor Fluff] Funny Story wins another film award - 5 and counting","[Spoilers] ‘Arrow’ EP Teases That Black Siren Is Out For Revenge In Season 7","[NO SPOILERS] Good description","[POSSIBLE SPOILERS] What were some of the scariest scenes in arrow (in ur opinion)?","[Discussion &amp; Spoilers] Thoughts on Arrow Season 6","[S2E16] Did Anyone Else Feel Bad About His Death?","[COSPLAY] Felicity who???","[Fan Cosplay] I’m The Justice You Can’t Run From","[Question] will Oliver still be a vigilante in season 7","[Arrow] Oliver is a reckless father and an irresponsible husband and for once I agreed with William/Felicity.","[cosplay] found Barry, too!","[Comics] Silly Ollie is the best Ollie [Green Arrow/Black Canary #7)","[Comics Spoiler] This week's Green Arrow #43 reminded me of a certain episode in season 1","[SPOILERS] What are some little things u would like to see in season 7?","[Time Travel Impact] I chuckle every time I imagine Ollie celebrating Beebo Day","[SPOILERS] Who would be the funniest arrow replacement while Oliver is in the prison? (doesnt have to make any sense)","[Discussion] Thea is probably my favorite character.","[Idea] Do you want to see a \"Tower of Babel/Justice League: Doom\" storyline with Oliver/Batwoman taking Batman's role","[Question] [spoilers] flashbacks ranking and present rankings","[Fan Video] All Scenes Black Canary","[Meta] Can we make a stickied post for the daily amount of users who come here asking if \"should I need to finish the series\"?","[character fluff] Oliver Queen change of personality","[Actor Fluff] 6 years ago today filming for a certain character started on Arrow - and the rest is history!","[No spoilers] Birds Of Prey Actress Wish List according to sources at Warner Bros","[ACTOR FLUFF] Michael Rowe (Deadshot) responding to an Olicity fan on Twitter","[Fans Reactions/Shitpost] “Will Oliver and Felicity have a child this year?” “No.”","[Discussion] How I think they write Oliver into the crossover?","[Actor Fluff] Some autograph critique for Stephen Amell!","[Actor Fluff] Arrow actor Kirk Acevedo claims he was discriminated against at Vancouver Coach store","[Poll] When do you think Oliver will be released from prison in S7?","[No Spoiler] I think this is Rene, am i right?","[Actor Fluff] Juliana Harkavy psyched about S7-in particular about something that she can't reveal yet!🤔","[Discussion] What is the Best Season of the Arrowverse? (POLL)","[spoilers season 6] Call me a negative nancy, but I still think that was the worst way to end the season IMO.","[Season 3] A rant on Season 3","[S7] 🤢🤢🤮","[Arts and Crafts] Check Out This Sick Artwork of Blake Lively as Black Canary","[Spoiler] How long do you think it will take before Oliver gets out of prison?","[Spoilers] She's back in S7","[Actor Fluff] Stephen Being Amazing","[Season 7 Discussion ]","[S3] In defence of Season 3.","[Discussion] Why the writing on what supposed to be CW's top show is so bad?","[Roy Harper S7 theory]","[Question][4X08]","[Shitpost] When you're gone for a week and your friends have been screwing together a house.","[shitpost] We should call Black Siren \"Yanny\" to distinguish between her and Laurel","[Discussion] Does Anyone Belive that Oliver Doesnt Actually Deserve to be in Prison?","[DISCUSSION] One thing that the new seasons don’t have that the first two did","[Characters fluff]Sara Lance has quite a journey that matches Oliver Queen's","We had a security incident. Here's what you need to know.","[S7] The Season 7 Trailer is now the fourth most-viewed Arrow trailer!","[DISCUSSION] Black Panther and Arrow","[Spoilers]Title for 7x03 revealed","[No Spoilers] Just a quick follow up from my post yesterday. It's just fan art but still. Credits: https://twitter.com/Bosslogic/status/1024290091336753152?s=19","[S6E15] catching up on season 6, is this an unpopular opinion?","[Discussion]Favorite fight scene from Arrow? Any season?","[S6E13] I've been working to catch up on Season 6 and tbh I may stop now that Cayden James is dead","[Spoilers] Legends of Tomorrow will address what happened in Arrow S6 finale","[Spoilers] Arrrow cast and crew tals Batwoman","[S5E10] Suit??","[Compost] If Zod from Krypton came over to Arrow...","[Speculation] With this new Green Arrow murdering people...","[No Spoilers] The Green Whisker","[Spoilers season 5] The reason I stopped watching after 5","[shitpost] This is my all time favourite video now! Summarises olicity and whole arrow universe! I loved the ending!","[No Spoilers] When are we getting a Season 6 gag reel?.","[Discussion] Rewatching The earlier seasons, I really don’t care for Felicity or her humor even then.","[No Spoilers] Question about Darhk and Magic","[Spoilers] This is what went wrong with Arrow...","[Spoilers] Arrow Season 6 Potential Episodes","[Actor Fluff] Stephen Amell and Colton Haynes discuss set life and working together on Arrow","[No spoilers] Arrow Star comes out as Trans Non-Binary","[No Spoilers] FANDOM Article - 5 Villains Who Must Appear in the Arrowverse","[No Spoilers] The Flash crossover we deserve","[Discussion]Why the constant pitting against each other themes","[No spoilers] Why was Oliver arrested and Barry wasn't?","[Shitpost] Just a reminder this character existed","[Discussion]League of assassins spin off","[shitpost] Who would win?","[Shitpost] The current state of the sub","[Potential spoilers] Beth Schwartz response to a comment from an 'interviewer' who said they were 'bothered' when the show took a \"soapy direction\"","[Spoilers] So what happened?","[Shitpost] Reminder - This city existed.","[No Spoiler] Flash Season 3 Vs Arrow Season 4","[Shitpost] The most horrifying thing to ever disgrace Reddit.","[Discussion/Spoilers] Would you mind if Felicity became a masked superhero with fighting skills in season 7?","[Reminder] We have failed this sub","[Shitpost] The New Season 7 Suit","[Spoilers] Something I've learned from Arrowverse","[Spoilers] Arrow Season 7: Could fewer spoilers be better for the show?","[s7] What are the things you would like to see in season7?","[Reminder] Reminder, this character exsisted","[No Spoilers] Would Diaz have been better in Legends Of Tomorrow?.","[Actor fluff] Interview with Emily Bett Rickards","[No Spoilers] Watching OITNB S6 and our favorite DA appears!","[Shitpost] saw this on Twitter and had a good laugh","[Remind] Reminder, this character existed","[Shitpost] What has this sub turned into?","[Discussion]It made more sense for Slade to kidnap Sara in the end","[no spoilers] I️ was scrolling through google images for a haircut and found someone else, something else.","[Spoilers] A family that deserved better","[No spoilers] Ok, unpopular opinion time 😤","[Discussion] What is The Best Episode of Arrow? (POLL)","[S2] If you didn’t know, this is Sin’s dad. He crashed on Lian Yu :( (posted this because I didn’t catch it my first watch through)","[Small Spoiler] Discussion: My Top 5 Hopes for Season 7","[no spoiler] Arrow season 7 scene","[question] Should I watch it?","[Multiverse] Which Is Better","[Discussion] What real life city do you want Gotham based on?","[Discussion] [No Spoilers] Maybe it's just me, but wouldn't it have been cool if Prometheus unlike Diaz were still alive and part of another Big Bad arc?","[Question] Who was your least favourite Villain and why?","[Shitpost] r/arrow after the S7 comic con trailer","[NO SPOILERS] Imagine if Prometheus didn't have any murders on his conscience...","[Discussion] Just occurred to me that ALL the major deaths are of Season 1 characters...","[No Spoilers] Interesting shirt, Willa.","[MRW] I check the sub for Arrow news only to find that there is none...","[No Spoilers] He is 10 steps Ahead and They Don't Even Know How much Popcorn He is Making","[Meme] Don't try to be a tough guy...","[HappyPost] Just a quick gif from me to all of you, from the bottom of my heart, I hope this brightens all of your days &lt;3","[Shitpost] Reminder - This character ALSO existed","[S2E4]It's Moments Like These That Are Missing From Arrow Right Now","[Compost] When you finally watch Season 4","[no spoilers] Is this an Atom reference?","[No Spoiler] Re-watching Arrow with my sister who is watching for the first time, should I skip the second half of S3?","[Shitpost/Discussion] This sounds a lot like someone we know...","[Discussion] - Sara shouldn't have existed? - Laurel was doomed from day 1?","[Discussion] Do you think Oliver would've treated Superman differently from Kara...","[S5E22] Watching for the first time","[S6] For all of Season 6's faults, there's one thing I want to give it props for","[This Sub] Every time Diaz appears on screen... L","[Shitpost] Leaked Season 7 image from Planet Grodd","[no spoiler] Season 4/ Should I watch","[Discussion] Who is the Best Villain In The Arrowverse? (Poll)","[Shitpost] Reminder - This character existed","[Shitpost/Discussion] I noticed something while rewatching S1","[Discussion] Batwoman will be from Earth-38 (Supergirl's Earth)","[Discussion] Don’t murder me but...","[No Spoilers][Shitpost]Adrian Chase is a guard in a women's prison on another Earth","[NO SPOILERS] Just realized that 6x23 final fight soundtrack is the same as the music of season 7 trailer... Anyone have the soundtrack??","[no spoilers] so my grandma loves knitting so I set her a challenge, how did she do(considering she has never watched arrow )","[s7 discussion/spoilers?] How will Oliver get out of...","[Shitpost] Beth Schwartz promised us that S7 would be like S1","[Question] dark archer comic","[No spoilers] What Batman Villain Could Make Their Big-Screen Debut in 'Birds of Prey'?","[MRW] People say Arrow season 7 doesn’t look amazing...","[S3] I was thinking back to season 3 when I remembered something that could affect season 7...","[no spoilers] they really got the stubble down on this Arrow figure","[Discussion] What is your favourite scene/ moment for each season of Arrow?","[Shitpost] Beebo had given us the solution to Civil Bore all along!","[Shitpost] Its true","[Season 1] Did Moira know Malcom Merlyn planned to kill Robert?","[Potential spoilers] The time-jump between seasons will be a lot shorter on Flash than on Arrow!","[Shitpost] Season 4 Is Fantastic","[Shitpost] As for the identity of this unknown assailant, this is someone new.","[Shitpost] New Team Arrow member for S7!","[S5 finale spoilers] Malcolm Merlyn return in S7?","[No Spoilers] Stopped watching after s4 but now want to continue to see s5 which is considered great and need a rundown","[META] mfw I finally get out of prison for being the Green Arrow and everyone on my favorite subreddit wants Diaz to kill my son","[QUESTION] What episodes should I watch from S5 and S6?","[S1 Spoilers] This Makes No Sense...","[Shitpost] OTA if they were actually bandicoots","[spoiler] who kinda misses the old voice changer?","[spoiler] Summary of last season for people who didn't want to watch it.","[S7] The SDCC trailer has ALREADY reached a million views!","[Discussion] Any word on if David Nykl (Anatoly) will be in season 7?","[No Spoilers] This Subreddit XD","[Shitpost] Views speak for themselves","[No Spoilers] What cannot happen in Prison Plot","[Discussion] Best Non Arrowverse/Marvel Superhero show you've seen.","[Shitpost] As for the identity of this unknown assailant... this is someone new.","[Horror post/shitpost] Uncle Guggie V Jon Peters Dawn of Organicness","[Spoiler for Season 4] Unpopular opinion","[Hopepost/MinorSpoilers] So Beth wrote Home invasion","[Shitpost] What is Felicity Smoak's favorite food?","[DCTV] Gotham 4x22/season 4 finale ending","[Shitpost] David Ramsey reveals a huge spoiler about Arrow S7!","[No Spoilers] Anyone know why Stephen Amell has been scrubbed from the Heroes and Villains Fan Fest page?","[Discussion] Roy’s Mirakuru Problem vs Heroin Addiction","[Spoiler][Future spoiler] Question about a character in S7 trailer!","[Spoilers/Discussion] Could _____________ be introduced in season 7?","[Comics] I'm glad Oliver's and Roy's relationship was never *this* bad","[Discussion] Should crossover be from Batwoman's perspective?","[Actor Fluff] Katie Cassidy fighting stunts","[Shitpost] My name is...","[Hope-post] Beth Schwartz said they're going back to the roots of Season 1. The last time the writers said that, we got Season 5. There's hope.","[Discussion/Spoiler] I don't think _________ is Roy Harper","[Possible Spoilers] Season 3, midseason","[SPOILERS] What Katie Cassidy's Black Siren Will Be Doing When Arrow Season 7 Begins","[Shitpost/Spoilers] What if they","[Spoilers] I Find it Odd","[Interview] James Bamford has said that there’s a scene and sequence on this season of arrow that they haven’t done before and he and Beth had to talk to their censors about putting it in, they’re pushing the dark and grittiness to it’s limits, go to 1:35 of video","[Question] Should I pick up Fatal Legacies?","[Discussion] What Do You Think Villains Do In Their Spare Time?","[Spoilers] Ideas for Arrow season 7","[Discussion] Guest starring / Special Guest Star / Special Appearance By - how many guest stars are semi-regular/ recurring characters?","[NO SPOILERS] Central and Star City","[Shitpost] Now that it has been revealed Felicity is going to take up the leadership role","[Potential Spoilers] Where are the rumors of Diaz killing William coming from?","[NO SPOILERS] Oh how the tables have turned...","[No Spoilers] Stephen Amell meets Sarah again at Comic-Con!","[Josh Segarra] I don't think that anyone's posted that our boy Josh is gonna be in Season 6 of OINTB","[No spoilers] Progressiveness of the Arrowverse","[Question] light magic","[Showerthought] Anyone else bothered by Arrowverse overachievers?","[S6] Why do people not like Ricardo Diaz?","[Shitpost] Guggie vanity plate in Alberta","[No Spoilers] When will season 6 be on Netflix?","[No spoilers] The team-up we've all been waiting for!","[Potential spoilers] Does this mean that _____ will be back in S7?!","[NO SPOILERS] Happy Birthday Emily Bett Rickards!","[Spoilers] Spoilers for 7x02 scene","[No Spoiler] Should I Even Watch Season 6?","[shitpost] Oliver can hack, what the hell is this bad at maths bull","[Discussion] Why Curtis Holt is the perfect example of how not to write minorities in TV","[spoilers] Arrow Cast talk season 7 with TV line at SDCC","[No Spoilers] POLL: What are the Best Live-Action DC and Marvel TV Shows Since 2000?","[Discussion]E1 Laurel Canary Cry","[spoilers] anyone else hope Ragman returns in Season 7?","[Discussion] [Possible Spoilers] What were the original storyline plans for Oliver and Laurel?","[S4E21] Why was Ljubljana chosen as the city that gets nuked?","[No Spoilers] [Discussion] What if Connor Hawke was the Big Bad of a future season? Would you be on board?","[Shitpost] How I’m counting down the days till S7.","[Shitpost]Is it just me..","[No Spoilers] Top 10 Lowest Rated Episodes of Arrow (According to IMDB)","[Spoilers] the resemblance is uncanny","[Discussion] What if Oliver was in Central city...","[shitpost] If these two don't help Oliver escape prison, what's the point of all this","[No Spoilers] A friend was given these from one of the actors. They were a cast gift she didn’t want. Curious as to how much y’all think they are worth.. the box has the actor’s name on it too.","[Spoilers] I feel like this needs more attention, dude is ripped af","[Question] [spoilers] How was Al sa him able to help flash and vice versa","[NO SPOILERS]:I made a poster for The Emerald Archer!","[Discussion] Olive not wanting the world to know he’s GA","[No Spoilers] Holy shit the trailer looked amazing!","[Discussion] Does anybody remember this moment?","[shit post] I want an apology","[Possible Spoilers] Kirk is enthusiastic af about his role and I love it","[No spoilers] We've come a long way. Taken from the 1x13 discussion archive","[S7 SPOILERS] I hope Oliver won't kill anyone in prison...","[S7 Discussion] Vote who you think the mystery archer is.","[Spoilers] Regarding a potential death in season premiere","[Help] Still don't know where to watch S6 in Australia","[No Spoilers] Arrow Cast Answers: Who Would You Most Like To Face in a Water Balloon Fight","[Shitpost] Well you don’t have to be a bitch about it.","[S7 Trailer] My hope for the mystery archer","[Comics] Comic Primers: Trick Arrows","[No Spoilers] From this shot of the trailer Oliver looks intimidating asf, I think he just got done beating the shit out of someone","[S07 Spoilers] No, that would not be cool lmao","[No Spoilers] Ranking the Live Action Arrowverse shows","[Spoilers] Why am I not surprised?","[Spoilers] State of S6?","[Shitpost] just a picture of our favourite archer","[Shitpost] I don’t see any difference🤔","[Spoilers] Are fans ok with ...","[Speculation] So I guess Thea and Nyssa are still looking to destroy the Lazarus Pits while Roy has decided to return to Star City","[Art] A Tribute to Arrow Villains who made the show better","[No Spoilers] Should I finish Season 6?","[No Spoilers] Arrow's 6th Season is by far my favourite and here's why","[Discussion] We should take a moment to thank who ever made the S7 trailer.","[season 1] Underrated scene from S1, my favorite and it really hit me","[Speculation] The Count of Monte Cristo in the S7 Trailer","[S7] About the person in the GA suit.","[No spoilers] Reasons Season 4 sucks?","[No Spoilers] So, are we not worried Guggenheim's stepping down means he's working on Batwoman?","[Spoiler] after a Year we finally get a shot of the burnt tattoo","[SDCC Discussion] Katie Cassidy absence.","[No Spoilers] Stephen Amell gets his necklace back of the little girl he gave it to last year and in return she gets his season one bow he stole from set. What a hero.","[S6] Why is arrow season 6 going to be ma15+ in australlia.","[Discussion] Arrow is the only series in the Arrowverse that interests me this year","[No spoilers] Emily Bett Rickards confirms she received blowback regarding her comments regarding the sexual harassment culture at the CW and calling out Guggenheim specifically after he tweeted about 'reverse sexism'","[No Spoilers] Question about Black Siren","[Discussion] Anyone else disappointed we didn’t get much backstory on Lian Yu itself?","[Fluff] Dread it. Run from it. Arrow still arrives.","[Spoiler] What was Oliver counting by making those tally marks in the jail cell?","[QUESTIONS] Have someone gone to the ComicCon??","[Shitpost] I think Family Guy accidentally posted a picture of the Arrow Comic-Con Trailer","[Shitpost] When Hoss got Hoss’d...","[s3/possible spoilers] comic book easter eggs which made the season tolerable for me","[Possible Spoilers] Out of 10 how hyped are you for Season 7? What are some of your predictions?","[no spoilers] alright i'm just gonna say it","[Season 7 Spoilers] question about Oliver and Felicity having a kid gets answered by Beth at SDCC...","[Spoiler] The secret villan for Arrow season 7","[Questions][Spoilers] pre 2017-2018 seasons rankings of arrowverse","[Possible Spoilers] How would you rank the new arrowverse trailers?","[Question] correct order?","[Spoilers] Was this character named after Colton Haynes' dad?","[Discussion] Longbow Hunters Revealed","[Idk] Funny thing I noticed...","[Spoiler] Katie Cassidy is alive again and now the mayor of Star City?","[S7 Spoilers] Casting for the Longbow Hunters announced","[Potential Spoilers] BEth Schwartz reveals the theme for S7!🤔","[Discussion] S7 is probably not the final season","[Spoilers] Spoilers from Arrow panel at SDCC - Part 1","[Spoilers] Really hyped that we're getting her in S7. I always thought she was badass","[Discussion] So something struck me as strange in Season 2 Episode 5.","[Hypepost] Season 7 Comic-Con Trailer is being released today. Time to get HYPED!","[Spoilers] Spoilers from Arrow panel at SDCC - Part 2","[SDCC News] Not confirmed yet but looking likely that Katie Cassidy won't be attending for Arrow SDCC panel later today due to family emergency","[S7] HYPE!!!","[Potential spoilers] Spoilers from Arrow's press room interviews at SDCC","[Shitpost] MFW I'm hitting F5 on New Posts and don't see a link to the Season 7 Trailer","[Discussion] Anyone else feel like Oliver needs some friends?","[Misc.] First Look at the Shazam! Trailer (2019)","[Spoiler] Season 6 Finale","[Appreciate] Rewatching series 1 and I saw this awesome parkour scene and I'm wondering why we never get something this good anymore","[No Spoilers] You think she was referencing something?","[NO SPOILERS] Is there any shows (not necessarily Arrowverse) related to Arrow/Flash or somewhat similar to them?","[No Spoilers] Does anyone at SDCC this year know if there was any follow-up to this?","[Potential spoilers] More spoilers from SDCC - including 2 for season premiere","[Predict] Now that we have seen the trailer for series 7","[SHITPOST] Fuck Green Arrow.","[ComicCon]Stephen Amell Interview","[The Ray Spoilers] I don't know if anyone here has seen it but Freedom Fighters - The Ray season 2 created some huge continuity issues for the Arrowverse","[Actor Fluff] More Arrowverse cast pics from SDCC","[Season 7 Spoilers] Leaks say Oliver will be in","[Potential spoilers] Spoilers from Arrow press room interviews at SDCC including a big Felicity spoiler!","[Spoiler] The Flash and Roy taking over while Oliver is in jail? If only haha","[Discussion] Felicity and friends","[No spoilers] Right now, Oliver is in jail.. What do you think is he doing..??","[Actor Fluff] Arrow cast hanging out at SDCC","[ComicCon]Arrow Interview","[LegendsPost] The greatest moment in the entire Arrowverse","[Actor Fluff] More Arrow cast photos","[No Spoilers] Essential S6 eps?","[Discussion] Justice League Dark animated film is part of the Arrowverse?","[Spoilers] Welp, There goes Season 7","[SPOILERS] Do you think any seasons are skippable?","[Discussion] Are there any Arrowverse Seasons that are Better Than Daredevil Season 1 and 2?","[ComicCon] Aquaman- Official Trailer.","[Canary Post] Laurel Lance becoming Black Canary","[Actor Fluff] Arrowverse actresses Emily Bett Rickards, Danielle Panabaker and Candice Patton trending at SDCC 2018","[SHITPOST] Found this on Pinterest. With Oliver being in prison, is this how next season is gonna go?","[ComicCon]EBR and EK Interview","[Discussion] The next Arrowverse show's setting","[No Spoilers]Countdown to Season 7: Episode S1:11-20 Discussion!","[Discussion] Unpopular opinions about Season 5","[Off Topic] Young Justice Outsiders Trailer #1","[Discussion] Arrow season 7 leaks","[Shitpost] Felicity walks away from Oliver- Indian Soap Opera edit","[S7 SPOILERS] TVGUIDE ARROW SDCC","[shitpost] so this happened...","[Discussion] Unpopular opinions about Season 6","[Discussion] Unpopular opinions about Season 4","[Discussion]I stopped watching these shows after Arrow S2 and Flash S1, should I pick them back up again?","[Discussion] Unpopular opinions about Season 3","[Discussion] Unpopular opinions about Season 2","[Spoilers] GATV round table discussion","[Discussion] Unpopular opinions about Season 1","[s3, s4, s5, s6] Walter Steele","[Spoilers] Just finished S6..","[Spoilers] Hope this is true, hopefully get some decent h2h fight scenes","[SHITPOST] The Best Ship and Couple In The Arrowverse.","[Spoilers] What do you think about Robin...","[SPOILERS] Teen Titans","[Discussion] [X-post from r/BatwomanTV] How would you like to see these questions addressed in the crossover?","[DC Universe] 'Stargirl' Live-Action Series Confirmed for DC Universe.","[Off-Topic] TITANS - Official Trailer - DC Universe","[Throwback] - My favorite Laurel scene of all time!","[Compost] Marc Guggenheim planning out season 4 of Arrow (colorized)","[Theory/Wishful thinking] Batwoman will be from Earth X?","[no spoiler] post season in the 2 writers room","[S1E23] Open your eyes Tommy...","[Image] Kirk Acevedo on the wall of season regulars, is Diaz gonna be important this season as well?!","[Potential Spoilers ]Arrow S7 poster at SDCC","[Shitpost] This just in...the comics have hurt arrow","[Appreciate] A season 4 Appreciation","[Spoilers] Top 10 Episodes of Arrow: Lian Yu #5","[Funny] I guess enduring 5 seasons of Olicity was just too much","[Rumour] Batwoman is a recurring character in Arrow this season","[Potential Spoilers] Possible returning guest for prison scenes","[Discussion/spoiler] A certain fight scene?","[Shitpost] I aM qUiRkY!","[Possible Spoilers for 6x22] \"The Ties That Bind\"","[Meme] John Spartan","Introducing r/BatwomanTV for our newest CW Show!","[Misc] Join us at r/BatwomanTV","[Spoilers] Details on Batwoman and the crossover","[Misc] Fill this chart in with different Arrow characters that you think fit the description.","[S6] Does team arrow kill or not?","[Discussion] I would love to see League of Assassins spin off","[Spoilers]Stephen finished filming the premiere","[Shitpost] Of all the packaged seasons you could sell....","[shitpost] not really sure of a title","[Discussion] Legends of Tomorrow to not feature in Yearly crossover","[Discussion] Batwoman Series in Development at CW","[Discussion] Future of Arrow","[Discussion] as batwoman is in development, could that mean the end for arrow?","[Potential Spoilers] Crossover to include Arrow, Flash and Supergirl but not LoT","[SHITPOST] I notice they completely glanced over this major plothole in Season 6.","[No spoilers] Are Felicity's hacking skills realistic?","[Shitpost] Felicity Smoak as Batwoman show intro","[News] Batwoman casting has started","[Sladepost]","[No spoilers] Top 10 Most Watched CW Shows","[Rank] This list only got 1 thing right, arrow season 4 is the worst","[Discussion] What does everyone find most annoying on this sub?","[No Spoilers] I’ve Just Found Some Things On Twitter","[Discussion] Top 5 Dumbest arrow verse heroes","[Shitpost] Say what you want about her character, but man, was she hot in that red dress!","[Shitpost] Does Oliver sleep at all?","[No Spoilers] Hope Batwoman is not SJW fieldfest, not looking good initially!","[Spoilers] Looks like _______ is set to reprise his role in 7x01!","[s3 and 4/potential spoilers] guggie and co could've easily saved the show and retcon their organic asses even without flashpoint","[Possible Spoilers] Make Arrow Great Again","[Discussion] Black Canary, Huntress to appear alongside Margot Robbie's Harley and Cassandra Cain in Birds of Prey","[Spoilers] Just finished S2, so here are some random thoughts....","[No spoilers] when you’re to invested and forcing yourself to see it through to the end.","[No Spoilers] When you hack your first timeline","[Discussion] I fell into this dark hole that is Arrow's Twitter fandom...","[Discussion] With David Ramsey directing an episode in Arrow S7 and now Danielle Panabaker directing an episode in Flash S5, which other Arrowverse actor would like to see directing an episode and why do you think they would do a good job?","[Painpost] Reading the text below will cause you great pain","[No Spoilers] THIS IS NOT A GAS MASK!","[Discussion] MY BODY IS READY","[Beth Schwartz]These are the things she needs to do for the female characters in order to believe her she really cares for female characters' portrayal","[DCEU spoiler] Birds of Prey","[SPOILERS] At this point, how do you see the series ending?","[S1-6](#s \"Potential spoilers for anyone not caught up.\" ) How to take Arrow villains and make the show less Batman-y.","[Discussion] Pick your dream Arrowverse Birds of Prey team (4 Memebers)","[Discussion] IF S7 is the last season of Arrow, would you like to see it picked up by the DC streaming service for an R-Rated S8?","[Shitpost] Could s4 Oliver even fight right?","[No Spoilers] Arrow abandoning Oliver and Laurel is like Friends ditching Ross and Rachel after season 2","[Fan Content] Black Siren | Who Are You","[Fan votes] Vote for anything that's not Olicity","[Shitpost] Arrow Season 6 is the best season....","[Misc] I’ve been rewatching arrow season 1 and I just noticed something that I’m sure has been mentioned here.","[Season 5 Spoiler] When did you realize [Spoiler] was Prometheus?","[No Spoilers] Is Black Siren a sympathetic character?.","[Spoilers] Interview with Beth Schwartz discussing how things will start off in S7","[shitpost] TIL Diaz has a book containing his biography","[Discussion] Am i nuts for thinking Oliver would beat Kara/supergirl if he had time to prepare?","[Season 6] Why the hell was Oliver under investigation anyways?","[No Spoilers] Can we get a scene like this with Oliver in prison?.","[Spoilers] In which episode does...?","[No Spoilers] I stopped watching S3 midseason finale. Is it worth it to get back into it? I know the show had some issues and lost some people in S4 and S5","[No Spoilers] Was Diaz clairvoyant?","[Spoilers] 7x02 title","[No spoilers] Tagline for Arrow S7 revealed?!","[Shitpost] Leaked Season 7 Footage","[No Spoilers] Watch Guide?","[Fan Content] Arrowverse cinematic theme song I created.","[Potential spoilers] Looking back when did you realise:","[Confusion] Why does this sub confuse a beard with a goatee?","[Discussion] With some of the Arrow cast attending SDCC San Diego next Saturday, if you could ask one cast member a single question who would you would you ask and what would be your question?","[Spoilers]S7 premiere teased by Stephen","[Appearently you must have a spoilerwarning for some reason]Is this wilddog?","[Meta] Little did Hoss and Rags know what's coming to them....","[Discussion]Man season 4 felicity was awful","[No Spoilers] Oliver vs Diaz","[No Spoilers]Countdown to Season 7: Episodes S1:1-10 discussion!","[No Spoilers] Arrow episodes worth re-watching?","[SDCC] Green filter level: critical","[Meta] I realized that I have seen some of the Arrowverse way before, back when they starred in horror movies and I didn't know who they were at the time.","[S1 and S2] Even though I have watched these seasons multiple times I still hope things will go differently in the flasbacks.","[Actor Fluff] Siren and Dinah seem to be getting along better after their initial beef.","[Comics] Sonic Arrows, courtesy of Green Arrow! They're delivering an ultra-high frequency sound wave that's disabling your martian powers!","[Actor Fluff] I'd bet Jensen is regretting this now - or at least asking for a gift receipt!","[Spoilers] 6 Ups &amp; 3 Downs From The Arrowverse In 2018 (So Far)","[Petition] Petition for an arrowverse crossover where all the characters are wasted the whole time","[NO SPOILERS] Happy 30th Birthday Colton Haynes!","[Discussion] Green Arrow on TV vs. Green Arrow in the Comics?","[No spoilers] just started watching, on season 1 episode 13, something really bugging me...","[Artist Fan Art?] Green Arrow and Black Canary by Stjepan Šejić","[Discussion] Unpopular Opinions Thread.","[QUESTION]How many girls did Oliver slept with in the whole series ? And who were they ?","[No spoiler] How does the Arrow (Tv Show one) finance his vigilante operations 🤔😮😮","[No Spoilers] Why do people have a problem with Oliver losing hand to hand fights?.","[S2 Spoilers] I wish this had happened..."]